TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:34 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{623E3695-F231-449A-908B-500F977B1BA7} PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                        PC v16.9.4.LTS *
       3                    ;* Date/Time created: Sat Nov 18 18:46:32 2017                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../Application/api_mac.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v16.9.4.LTS Copyright (c) 1996-20
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Kevin\workspace_v7\sensor_cc1310lp\sensor_cc1310lp"
      13                    
      14                    $C$DW$1 .dwtag  DW_TAG_subprogram

   11007                            .dwattr $C$DW$827, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
   11008                            .dwattr $C$DW$827, DW_AT_decl_line(0x5e)
   11009                            .dwattr $C$DW$827, DW_AT_decl_column(0x03)
   11010                    
   11011                    $C$DW$828       .dwtag  DW_TAG_enumerator
   11012                            .dwattr $C$DW$828, DW_AT_name("MAC_FH_GET_REQ")
   11013                            .dwattr $C$DW$828, DW_AT_const_value(0xf5)
   11014                            .dwattr $C$DW$828, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
   11015                            .dwattr $C$DW$828, DW_AT_decl_line(0x5f)
   11016                            .dwattr $C$DW$828, DW_AT_decl_column(0x03)
   11017                    
   11018                    $C$DW$829       .dwtag  DW_TAG_enumerator
   11019                            .dwattr $C$DW$829, DW_AT_name("MAC_MLME_WS_ASYNC_REQ")
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:34 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{623E3695-F231-449A-908B-500F977B1BA7} PAGE  202

   11020                            .dwattr $C$DW$829, DW_AT_const_value(0xf6)
   11021                            .dwattr $C$DW$829, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
   11022                            .dwattr $C$DW$829, DW_AT_decl_line(0x60)
   11023                            .dwattr $C$DW$829, DW_AT_decl_column(0x03)
   11024                    
   11025                    $C$DW$830       .dwtag  DW_TAG_enumerator
   11026                            .dwattr $C$DW$830, DW_AT_name("MAC_SEC_ADD_DEVICE")
   11027                            .dwattr $C$DW$830, DW_AT_const_value(0xf7)
   11028                            .dwattr $C$DW$830, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
   11029                            .dwattr $C$DW$830, DW_AT_decl_line(0x61)
   11030                            .dwattr $C$DW$830, DW_AT_decl_column(0x03)
   11031                    
   11032                    $C$DW$831       .dwtag  DW_TAG_enumerator
   11033                            .dwattr $C$DW$831, DW_AT_name("MAC_SEC_DEL_DEVICE")
   11034                            .dwattr $C$DW$831, DW_AT_const_value(0xf8)
   11035                            .dwattr $C$DW$831, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
   11036                            .dwattr $C$DW$831, DW_AT_decl_line(0x62)
   11037                            .dwattr $C$DW$831, DW_AT_decl_column(0x03)
   11038                    
   11039                    $C$DW$832       .dwtag  DW_TAG_enumerator
   11040                            .dwattr $C$DW$832, DW_AT_name("MAC_SEC_DEL_KEY_AND_DEVICES")
   11041                            .dwattr $C$DW$832, DW_AT_const_value(0xf9)
   11042                            .dwattr $C$DW$832, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
   11043                            .dwattr $C$DW$832, DW_AT_decl_line(0x63)
   11044                            .dwattr $C$DW$832, DW_AT_decl_column(0x03)
   11045                    
   11046                    $C$DW$833       .dwtag  DW_TAG_enumerator
   11047                            .dwattr $C$DW$833, DW_AT_name("MAC_SEC_DEL_ALL_DEVICES")
   11048                            .dwattr $C$DW$833, DW_AT_const_value(0xfa)
   11049                            .dwattr $C$DW$833, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
   11050                            .dwattr $C$DW$833, DW_AT_decl_line(0x64)
   11051                            .dwattr $C$DW$833, DW_AT_decl_column(0x03)
   11052                    
   11053                    $C$DW$834       .dwtag  DW_TAG_enumerator
   11054                            .dwattr $C$DW$834, DW_AT_name("MAC_SEC_GET_DEFAULT_SOURCE_KEY")
   11055                            .dwattr $C$DW$834, DW_AT_const_value(0xfb)
   11056                            .dwattr $C$DW$834, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
   11057                            .dwattr $C$DW$834, DW_AT_decl_line(0x65)
   11058                            .dwattr $C$DW$834, DW_AT_decl_column(0x03)
   11059                    
   11060                    $C$DW$835       .dwtag  DW_TAG_enumerator
   11061                            .dwattr $C$DW$835, DW_AT_name("MAC_SEC_ADD_KEY_INIT_FC")
   11062                            .dwattr $C$DW$835, DW_AT_const_value(0xfc)
   11063                            .dwattr $C$DW$835, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
   11064                            .dwattr $C$DW$835, DW_AT_decl_line(0x66)
   11065                            .dwattr $C$DW$835, DW_AT_decl_column(0x03)
   11066                    
   11067                            .dwattr $C$DW$T$718, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154st
   11068                            .dwattr $C$DW$T$718, DW_AT_decl_line(0x39)
   11069                            .dwattr $C$DW$T$718, DW_AT_decl_column(0x01)
   11070                            .dwendtag $C$DW$T$718
   11071                    
   11072                    
   11073                    $C$DW$T$21      .dwtag  DW_TAG_structure_type
   11074                            .dwattr $C$DW$T$21, DW_AT_byte_size(0x0a)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:34 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{623E3695-F231-449A-908B-500F977B1BA7} PAGE  203

   11075                    $C$DW$836       .dwtag  DW_TAG_member
   11076                            .dwattr $C$DW$836, DW_AT_type(*$C$DW$T$180)
   11077                            .dwattr $C$DW$836, DW_AT_name("addr")
   11078                            .dwattr $C$DW$836, DW_AT_TI_symbol_name("addr")
   11079                            .dwattr $C$DW$836, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11080                            .dwattr $C$DW$836, DW_AT_accessibility(DW_ACCESS_public)
   11081                            .dwattr $C$DW$836, DW_AT_decl_file("..\Application\api_mac.h")
   11082                            .dwattr $C$DW$836, DW_AT_decl_line(0x4a7)
   11083                            .dwattr $C$DW$836, DW_AT_decl_column(0x07)
   11084                    
   11085                    $C$DW$837       .dwtag  DW_TAG_member
   11086                            .dwattr $C$DW$837, DW_AT_type(*$C$DW$T$20)
   11087                            .dwattr $C$DW$837, DW_AT_name("addrMode")
   11088                            .dwattr $C$DW$837, DW_AT_TI_symbol_name("addrMode")
   11089                            .dwattr $C$DW$837, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   11090                            .dwattr $C$DW$837, DW_AT_accessibility(DW_ACCESS_public)
   11091                            .dwattr $C$DW$837, DW_AT_decl_file("..\Application\api_mac.h")
   11092                            .dwattr $C$DW$837, DW_AT_decl_line(0x4aa)
   11093                            .dwattr $C$DW$837, DW_AT_decl_column(0x17)
   11094                    
   11095                            .dwattr $C$DW$T$21, DW_AT_decl_file("..\Application\api_mac.h")
   11096                            .dwattr $C$DW$T$21, DW_AT_decl_line(0x49c)
   11097                            .dwattr $C$DW$T$21, DW_AT_decl_column(0x01)
   11098                            .dwendtag $C$DW$T$21
   11099                    
   11100                    $C$DW$T$379     .dwtag  DW_TAG_typedef
   11101                            .dwattr $C$DW$T$379, DW_AT_name("ApiMac_sAddr_t")
   11102                            .dwattr $C$DW$T$379, DW_AT_type(*$C$DW$T$21)
   11103                            .dwattr $C$DW$T$379, DW_AT_language(DW_LANG_C)
   11104                            .dwattr $C$DW$T$379, DW_AT_decl_file("..\Application\api_mac.h")
   11105                            .dwattr $C$DW$T$379, DW_AT_decl_line(0x4ab)
   11106                            .dwattr $C$DW$T$379, DW_AT_decl_column(0x03)
   11107                    
   11108                    $C$DW$T$719     .dwtag  DW_TAG_pointer_type
   11109                            .dwattr $C$DW$T$719, DW_AT_type(*$C$DW$T$379)
   11110                            .dwattr $C$DW$T$719, DW_AT_address_class(0x20)
   11111                    
   11112                    $C$DW$T$720     .dwtag  DW_TAG_const_type
   11113                            .dwattr $C$DW$T$720, DW_AT_type(*$C$DW$T$719)
   11114                    
   11115                    
   11116                    $C$DW$T$26      .dwtag  DW_TAG_structure_type
   11117                            .dwattr $C$DW$T$26, DW_AT_byte_size(0x40)
   11118                    $C$DW$838       .dwtag  DW_TAG_member
   11119                            .dwattr $C$DW$838, DW_AT_type(*$C$DW$T$23)
   11120                            .dwattr $C$DW$838, DW_AT_name("beaconType")
   11121                            .dwattr $C$DW$838, DW_AT_TI_symbol_name("beaconType")
   11122                            .dwattr $C$DW$838, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11123                            .dwattr $C$DW$838, DW_AT_accessibility(DW_ACCESS_public)
   11124                            .dwattr $C$DW$838, DW_AT_decl_file("..\Application\api_mac.h")
   11125                            .dwattr $C$DW$838, DW_AT_decl_line(0x848)
   11126                            .dwattr $C$DW$838, DW_AT_decl_column(0x19)
   11127                    
   11128                    $C$DW$839       .dwtag  DW_TAG_member
   11129                            .dwattr $C$DW$839, DW_AT_type(*$C$DW$T$24)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:34 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{623E3695-F231-449A-908B-500F977B1BA7} PAGE  204

   11130                            .dwattr $C$DW$839, DW_AT_name("bsn")
   11131                            .dwattr $C$DW$839, DW_AT_TI_symbol_name("bsn")
   11132                            .dwattr $C$DW$839, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   11133                            .dwattr $C$DW$839, DW_AT_accessibility(DW_ACCESS_public)
   11134                            .dwattr $C$DW$839, DW_AT_decl_file("..\Application\api_mac.h")
   11135                            .dwattr $C$DW$839, DW_AT_decl_line(0x84a)
   11136                            .dwattr $C$DW$839, DW_AT_decl_column(0x0d)
   11137                    
   11138                    $C$DW$840       .dwtag  DW_TAG_member
   11139                            .dwattr $C$DW$840, DW_AT_type(*$C$DW$T$25)
   11140                            .dwattr $C$DW$840, DW_AT_name("panDesc")
   11141                            .dwattr $C$DW$840, DW_AT_TI_symbol_name("panDesc")
   11142                            .dwattr $C$DW$840, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   11143                            .dwattr $C$DW$840, DW_AT_accessibility(DW_ACCESS_public)
   11144                            .dwattr $C$DW$840, DW_AT_decl_file("..\Application\api_mac.h")
   11145                            .dwattr $C$DW$840, DW_AT_decl_line(0x84c)
   11146                            .dwattr $C$DW$840, DW_AT_decl_column(0x16)
   11147                    
   11148                    $C$DW$841       .dwtag  DW_TAG_member
   11149                            .dwattr $C$DW$841, DW_AT_type(*$C$DW$T$183)
   11150                            .dwattr $C$DW$841, DW_AT_name("beaconData")
   11151                            .dwattr $C$DW$841, DW_AT_TI_symbol_name("beaconData")
   11152                            .dwattr $C$DW$841, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
   11153                            .dwattr $C$DW$841, DW_AT_accessibility(DW_ACCESS_public)
   11154                            .dwattr $C$DW$841, DW_AT_decl_file("..\Application\api_mac.h")
   11155                            .dwattr $C$DW$841, DW_AT_decl_line(0x857)
   11156                            .dwattr $C$DW$841, DW_AT_decl_column(0x07)
   11157                    
   11158                            .dwattr $C$DW$T$26, DW_AT_decl_file("..\Application\api_mac.h")
   11159                            .dwattr $C$DW$T$26, DW_AT_decl_line(0x846)
   11160                            .dwattr $C$DW$T$26, DW_AT_decl_column(0x01)
   11161                            .dwendtag $C$DW$T$26
   11162                    
   11163                    $C$DW$T$293     .dwtag  DW_TAG_typedef
   11164                            .dwattr $C$DW$T$293, DW_AT_name("ApiMac_mlmeBeaconNotifyInd_t")
   11165                            .dwattr $C$DW$T$293, DW_AT_type(*$C$DW$T$26)
   11166                            .dwattr $C$DW$T$293, DW_AT_language(DW_LANG_C)
   11167                            .dwattr $C$DW$T$293, DW_AT_decl_file("..\Application\api_mac.h")
   11168                            .dwattr $C$DW$T$293, DW_AT_decl_line(0x858)
   11169                            .dwattr $C$DW$T$293, DW_AT_decl_column(0x03)
   11170                    
   11171                    $C$DW$T$294     .dwtag  DW_TAG_pointer_type
   11172                            .dwattr $C$DW$T$294, DW_AT_type(*$C$DW$T$293)
   11173                            .dwattr $C$DW$T$294, DW_AT_address_class(0x20)
   11174                    
   11175                    
   11176                    $C$DW$T$28      .dwtag  DW_TAG_structure_type
   11177                            .dwattr $C$DW$T$28, DW_AT_byte_size(0x02)
   11178                    $C$DW$842       .dwtag  DW_TAG_member
   11179                            .dwattr $C$DW$842, DW_AT_type(*$C$DW$T$27)
   11180                            .dwattr $C$DW$842, DW_AT_name("event")
   11181                            .dwattr $C$DW$842, DW_AT_TI_symbol_name("event")
   11182                            .dwattr $C$DW$842, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11183                            .dwattr $C$DW$842, DW_AT_accessibility(DW_ACCESS_public)
   11184                            .dwattr $C$DW$842, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:34 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{623E3695-F231-449A-908B-500F977B1BA7} PAGE  205

   11185                            .dwattr $C$DW$842, DW_AT_decl_line(0x2a6)
   11186                            .dwattr $C$DW$842, DW_AT_decl_column(0x0b)
   11187                    
   11188                    $C$DW$843       .dwtag  DW_TAG_member
   11189                            .dwattr $C$DW$843, DW_AT_type(*$C$DW$T$27)
   11190                            .dwattr $C$DW$843, DW_AT_name("status")
   11191                            .dwattr $C$DW$843, DW_AT_TI_symbol_name("status")
   11192                            .dwattr $C$DW$843, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   11193                            .dwattr $C$DW$843, DW_AT_accessibility(DW_ACCESS_public)
   11194                            .dwattr $C$DW$843, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
   11195                            .dwattr $C$DW$843, DW_AT_decl_line(0x2a7)
   11196                            .dwattr $C$DW$843, DW_AT_decl_column(0x0b)
   11197                    
   11198                            .dwattr $C$DW$T$28, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/M
   11199                            .dwattr $C$DW$T$28, DW_AT_decl_line(0x2a5)
   11200                            .dwattr $C$DW$T$28, DW_AT_decl_column(0x01)
   11201                            .dwendtag $C$DW$T$28
   11202                    
   11203                    $C$DW$T$29      .dwtag  DW_TAG_typedef
   11204                            .dwattr $C$DW$T$29, DW_AT_name("macEventHdr_t")
   11205                            .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$28)
   11206                            .dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
   11207                            .dwattr $C$DW$T$29, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/M
   11208                            .dwattr $C$DW$T$29, DW_AT_decl_line(0x2a8)
   11209                            .dwattr $C$DW$T$29, DW_AT_decl_column(0x03)
   11210                    
   11211                    $C$DW$T$725     .dwtag  DW_TAG_pointer_type
   11212                            .dwattr $C$DW$T$725, DW_AT_type(*$C$DW$T$29)
   11213                            .dwattr $C$DW$T$725, DW_AT_address_class(0x20)
   11214                    
   11215                    
   11216                    $C$DW$T$33      .dwtag  DW_TAG_structure_type
   11217                            .dwattr $C$DW$T$33, DW_AT_byte_size(0x16)
   11218                    $C$DW$844       .dwtag  DW_TAG_member
   11219                            .dwattr $C$DW$844, DW_AT_type(*$C$DW$T$29)
   11220                            .dwattr $C$DW$844, DW_AT_name("hdr")
   11221                            .dwattr $C$DW$844, DW_AT_TI_symbol_name("hdr")
   11222                            .dwattr $C$DW$844, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11223                            .dwattr $C$DW$844, DW_AT_accessibility(DW_ACCESS_public)
   11224                            .dwattr $C$DW$844, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
   11225                            .dwattr $C$DW$844, DW_AT_decl_line(0x46a)
   11226                            .dwattr $C$DW$844, DW_AT_decl_column(0x17)
   11227                    
   11228                    $C$DW$845       .dwtag  DW_TAG_member
   11229                            .dwattr $C$DW$845, DW_AT_type(*$C$DW$T$31)
   11230                            .dwattr $C$DW$845, DW_AT_name("deviceAddress")
   11231                            .dwattr $C$DW$845, DW_AT_TI_symbol_name("deviceAddress")
   11232                            .dwattr $C$DW$845, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   11233                            .dwattr $C$DW$845, DW_AT_accessibility(DW_ACCESS_public)
   11234                            .dwattr $C$DW$845, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
   11235                            .dwattr $C$DW$845, DW_AT_decl_line(0x46b)
   11236                            .dwattr $C$DW$845, DW_AT_decl_column(0x17)
   11237                    
   11238                    $C$DW$846       .dwtag  DW_TAG_member
   11239                            .dwattr $C$DW$846, DW_AT_type(*$C$DW$T$27)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:34 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{623E3695-F231-449A-908B-500F977B1BA7} PAGE  206

   11240                            .dwattr $C$DW$846, DW_AT_name("capabilityInformation")
   11241                            .dwattr $C$DW$846, DW_AT_TI_symbol_name("capabilityInformation")
   11242                            .dwattr $C$DW$846, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   11243                            .dwattr $C$DW$846, DW_AT_accessibility(DW_ACCESS_public)
   11244                            .dwattr $C$DW$846, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
   11245                            .dwattr $C$DW$846, DW_AT_decl_line(0x46c)
   11246                            .dwattr $C$DW$846, DW_AT_decl_column(0x17)
   11247                    
   11248                    $C$DW$847       .dwtag  DW_TAG_member
   11249                            .dwattr $C$DW$847, DW_AT_type(*$C$DW$T$32)
   11250                            .dwattr $C$DW$847, DW_AT_name("sec")
   11251                            .dwattr $C$DW$847, DW_AT_TI_symbol_name("sec")
   11252                            .dwattr $C$DW$847, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
   11253                            .dwattr $C$DW$847, DW_AT_accessibility(DW_ACCESS_public)
   11254                            .dwattr $C$DW$847, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
   11255                            .dwattr $C$DW$847, DW_AT_decl_line(0x46d)
   11256                            .dwattr $C$DW$847, DW_AT_decl_column(0x17)
   11257                    
   11258                            .dwattr $C$DW$T$33, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/M
   11259                            .dwattr $C$DW$T$33, DW_AT_decl_line(0x469)
   11260                            .dwattr $C$DW$T$33, DW_AT_decl_column(0x01)
   11261                            .dwendtag $C$DW$T$33
   11262                    
   11263                    $C$DW$T$195     .dwtag  DW_TAG_typedef
   11264                            .dwattr $C$DW$T$195, DW_AT_name("macMlmeAssociateInd_t")
   11265                            .dwattr $C$DW$T$195, DW_AT_type(*$C$DW$T$33)
   11266                            .dwattr $C$DW$T$195, DW_AT_language(DW_LANG_C)
   11267                            .dwattr $C$DW$T$195, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/
   11268                            .dwattr $C$DW$T$195, DW_AT_decl_line(0x46e)
   11269                            .dwattr $C$DW$T$195, DW_AT_decl_column(0x03)
   11270                    
   11271                    
   11272                    $C$DW$T$35      .dwtag  DW_TAG_structure_type
   11273                            .dwattr $C$DW$T$35, DW_AT_byte_size(0x10)
   11274                    $C$DW$848       .dwtag  DW_TAG_member
   11275                            .dwattr $C$DW$848, DW_AT_type(*$C$DW$T$29)
   11276                            .dwattr $C$DW$848, DW_AT_name("hdr")
   11277                            .dwattr $C$DW$848, DW_AT_TI_symbol_name("hdr")
   11278                            .dwattr $C$DW$848, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11279                            .dwattr $C$DW$848, DW_AT_accessibility(DW_ACCESS_public)
   11280                            .dwattr $C$DW$848, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
   11281                            .dwattr $C$DW$848, DW_AT_decl_line(0x473)
   11282                            .dwattr $C$DW$848, DW_AT_decl_column(0x17)
   11283                    
   11284                    $C$DW$849       .dwtag  DW_TAG_member
   11285                            .dwattr $C$DW$849, DW_AT_type(*$C$DW$T$34)
   11286                            .dwattr $C$DW$849, DW_AT_name("assocShortAddress")
   11287                            .dwattr $C$DW$849, DW_AT_TI_symbol_name("assocShortAddress")
   11288                            .dwattr $C$DW$849, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   11289                            .dwattr $C$DW$849, DW_AT_accessibility(DW_ACCESS_public)
   11290                            .dwattr $C$DW$849, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
   11291                            .dwattr $C$DW$849, DW_AT_decl_line(0x474)
   11292                            .dwattr $C$DW$849, DW_AT_decl_column(0x17)
   11293                    
   11294                    $C$DW$850       .dwtag  DW_TAG_member
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:34 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{623E3695-F231-449A-908B-500F977B1BA7} PAGE  207

   11295                            .dwattr $C$DW$850, DW_AT_type(*$C$DW$T$32)
   11296                            .dwattr $C$DW$850, DW_AT_name("sec")
   11297                            .dwattr $C$DW$850, DW_AT_TI_symbol_name("sec")
   11298                            .dwattr $C$DW$850, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   11299                            .dwattr $C$DW$850, DW_AT_accessibility(DW_ACCESS_public)
   11300                            .dwattr $C$DW$850, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
   11301                            .dwattr $C$DW$850, DW_AT_decl_line(0x475)
   11302                            .dwattr $C$DW$850, DW_AT_decl_column(0x17)
   11303                    
   11304                            .dwattr $C$DW$T$35, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/M
   11305                            .dwattr $C$DW$T$35, DW_AT_decl_line(0x472)
   11306                            .dwattr $C$DW$T$35, DW_AT_decl_column(0x01)
   11307                            .dwendtag $C$DW$T$35
   11308                    
   11309                    $C$DW$T$196     .dwtag  DW_TAG_typedef
   11310                            .dwattr $C$DW$T$196, DW_AT_name("macMlmeAssociateCnf_t")
   11311                            .dwattr $C$DW$T$196, DW_AT_type(*$C$DW$T$35)
   11312                            .dwattr $C$DW$T$196, DW_AT_language(DW_LANG_C)
   11313                            .dwattr $C$DW$T$196, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/
   11314                            .dwattr $C$DW$T$196, DW_AT_decl_line(0x476)
   11315                            .dwattr $C$DW$T$196, DW_AT_decl_column(0x03)
   11316                    
   11317                    
   11318                    $C$DW$T$36      .dwtag  DW_TAG_structure_type
   11319                            .dwattr $C$DW$T$36, DW_AT_byte_size(0x16)
   11320                    $C$DW$851       .dwtag  DW_TAG_member
   11321                            .dwattr $C$DW$851, DW_AT_type(*$C$DW$T$29)
   11322                            .dwattr $C$DW$851, DW_AT_name("hdr")
   11323                            .dwattr $C$DW$851, DW_AT_TI_symbol_name("hdr")
   11324                            .dwattr $C$DW$851, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11325                            .dwattr $C$DW$851, DW_AT_accessibility(DW_ACCESS_public)
   11326                            .dwattr $C$DW$851, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
   11327                            .dwattr $C$DW$851, DW_AT_decl_line(0x47b)
   11328                            .dwattr $C$DW$851, DW_AT_decl_column(0x17)
   11329                    
   11330                    $C$DW$852       .dwtag  DW_TAG_member
   11331                            .dwattr $C$DW$852, DW_AT_type(*$C$DW$T$31)
   11332                            .dwattr $C$DW$852, DW_AT_name("deviceAddress")
   11333                            .dwattr $C$DW$852, DW_AT_TI_symbol_name("deviceAddress")
   11334                            .dwattr $C$DW$852, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   11335                            .dwattr $C$DW$852, DW_AT_accessibility(DW_ACCESS_public)
   11336                            .dwattr $C$DW$852, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
   11337                            .dwattr $C$DW$852, DW_AT_decl_line(0x47c)
   11338                            .dwattr $C$DW$852, DW_AT_decl_column(0x17)
   11339                    
   11340                    $C$DW$853       .dwtag  DW_TAG_member
   11341                            .dwattr $C$DW$853, DW_AT_type(*$C$DW$T$27)
   11342                            .dwattr $C$DW$853, DW_AT_name("disassociateReason")
   11343                            .dwattr $C$DW$853, DW_AT_TI_symbol_name("disassociateReason")
   11344                            .dwattr $C$DW$853, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   11345                            .dwattr $C$DW$853, DW_AT_accessibility(DW_ACCESS_public)
   11346                            .dwattr $C$DW$853, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
   11347                            .dwattr $C$DW$853, DW_AT_decl_line(0x47d)
   11348                            .dwattr $C$DW$853, DW_AT_decl_column(0x17)
   11349                    
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:34 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{623E3695-F231-449A-908B-500F977B1BA7} PAGE  208

   11350                    $C$DW$854       .dwtag  DW_TAG_member
   11351                            .dwattr $C$DW$854, DW_AT_type(*$C$DW$T$32)
   11352                            .dwattr $C$DW$854, DW_AT_name("sec")
   11353                            .dwattr $C$DW$854, DW_AT_TI_symbol_name("sec")
   11354                            .dwattr $C$DW$854, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
   11355                            .dwattr $C$DW$854, DW_AT_accessibility(DW_ACCESS_public)
   11356                            .dwattr $C$DW$854, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
   11357                            .dwattr $C$DW$854, DW_AT_decl_line(0x47e)
   11358                            .dwattr $C$DW$854, DW_AT_decl_column(0x17)
   11359                    
   11360                            .dwattr $C$DW$T$36, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/M
   11361                            .dwattr $C$DW$T$36, DW_AT_decl_line(0x47a)
   11362                            .dwattr $C$DW$T$36, DW_AT_decl_column(0x01)
   11363                            .dwendtag $C$DW$T$36
   11364                    
   11365                    $C$DW$T$197     .dwtag  DW_TAG_typedef
   11366                            .dwattr $C$DW$T$197, DW_AT_name("macMlmeDisassociateInd_t")
   11367                            .dwattr $C$DW$T$197, DW_AT_type(*$C$DW$T$36)
   11368                            .dwattr $C$DW$T$197, DW_AT_language(DW_LANG_C)
   11369                            .dwattr $C$DW$T$197, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/
   11370                            .dwattr $C$DW$T$197, DW_AT_decl_line(0x47f)
   11371                            .dwattr $C$DW$T$197, DW_AT_decl_column(0x03)
   11372                    
   11373                    
   11374                    $C$DW$T$37      .dwtag  DW_TAG_structure_type
   11375                            .dwattr $C$DW$T$37, DW_AT_byte_size(0x0a)
   11376                    $C$DW$855       .dwtag  DW_TAG_member
   11377                            .dwattr $C$DW$855, DW_AT_type(*$C$DW$T$187)
   11378                            .dwattr $C$DW$855, DW_AT_name("addr")
   11379                            .dwattr $C$DW$855, DW_AT_TI_symbol_name("addr")
   11380                            .dwattr $C$DW$855, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11381                            .dwattr $C$DW$855, DW_AT_accessibility(DW_ACCESS_public)
   11382                            .dwattr $C$DW$855, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/Se
   11383                            .dwattr $C$DW$855, DW_AT_decl_line(0x52)
   11384                            .dwattr $C$DW$855, DW_AT_decl_column(0x05)
   11385                    
   11386                    $C$DW$856       .dwtag  DW_TAG_member
   11387                            .dwattr $C$DW$856, DW_AT_type(*$C$DW$T$27)
   11388                            .dwattr $C$DW$856, DW_AT_name("addrMode")
   11389                            .dwattr $C$DW$856, DW_AT_TI_symbol_name("addrMode")
   11390                            .dwattr $C$DW$856, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   11391                            .dwattr $C$DW$856, DW_AT_accessibility(DW_ACCESS_public)
   11392                            .dwattr $C$DW$856, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/Se
   11393                            .dwattr $C$DW$856, DW_AT_decl_line(0x53)
   11394                            .dwattr $C$DW$856, DW_AT_decl_column(0x11)
   11395                    
   11396                            .dwattr $C$DW$T$37, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/S
   11397                            .dwattr $C$DW$T$37, DW_AT_decl_line(0x4d)
   11398                            .dwattr $C$DW$T$37, DW_AT_decl_column(0x01)
   11399                            .dwendtag $C$DW$T$37
   11400                    
   11401                    $C$DW$T$38      .dwtag  DW_TAG_typedef
   11402                            .dwattr $C$DW$T$38, DW_AT_name("sAddr_t")
   11403                            .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$37)
   11404                            .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:34 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{623E3695-F231-449A-908B-500F977B1BA7} PAGE  209

   11405                            .dwattr $C$DW$T$38, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/S
   11406                            .dwattr $C$DW$T$38, DW_AT_decl_line(0x54)
   11407                            .dwattr $C$DW$T$38, DW_AT_decl_column(0x03)
   11408                    
   11409                    $C$DW$T$135     .dwtag  DW_TAG_pointer_type
   11410                            .dwattr $C$DW$T$135, DW_AT_type(*$C$DW$T$38)
   11411                            .dwattr $C$DW$T$135, DW_AT_address_class(0x20)
   11412                    
   11413                    $C$DW$T$728     .dwtag  DW_TAG_const_type
   11414                            .dwattr $C$DW$T$728, DW_AT_type(*$C$DW$T$135)
   11415                    
   11416                    
   11417                    $C$DW$T$39      .dwtag  DW_TAG_structure_type
   11418                            .dwattr $C$DW$T$39, DW_AT_byte_size(0x0e)
   11419                    $C$DW$857       .dwtag  DW_TAG_member
   11420                            .dwattr $C$DW$857, DW_AT_type(*$C$DW$T$29)
   11421                            .dwattr $C$DW$857, DW_AT_name("hdr")
   11422                            .dwattr $C$DW$857, DW_AT_TI_symbol_name("hdr")
   11423                            .dwattr $C$DW$857, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11424                            .dwattr $C$DW$857, DW_AT_accessibility(DW_ACCESS_public)
   11425                            .dwattr $C$DW$857, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
   11426                            .dwattr $C$DW$857, DW_AT_decl_line(0x484)
   11427                            .dwattr $C$DW$857, DW_AT_decl_column(0x13)
   11428                    
   11429                    $C$DW$858       .dwtag  DW_TAG_member
   11430                            .dwattr $C$DW$858, DW_AT_type(*$C$DW$T$38)
   11431                            .dwattr $C$DW$858, DW_AT_name("deviceAddress")
   11432                            .dwattr $C$DW$858, DW_AT_TI_symbol_name("deviceAddress")
   11433                            .dwattr $C$DW$858, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   11434                            .dwattr $C$DW$858, DW_AT_accessibility(DW_ACCESS_public)
   11435                            .dwattr $C$DW$858, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
   11436                            .dwattr $C$DW$858, DW_AT_decl_line(0x485)
   11437                            .dwattr $C$DW$858, DW_AT_decl_column(0x13)
   11438                    
   11439                    $C$DW$859       .dwtag  DW_TAG_member
   11440                            .dwattr $C$DW$859, DW_AT_type(*$C$DW$T$34)
   11441                            .dwattr $C$DW$859, DW_AT_name("panId")
   11442                            .dwattr $C$DW$859, DW_AT_TI_symbol_name("panId")
   11443                            .dwattr $C$DW$859, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   11444                            .dwattr $C$DW$859, DW_AT_accessibility(DW_ACCESS_public)
   11445                            .dwattr $C$DW$859, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
   11446                            .dwattr $C$DW$859, DW_AT_decl_line(0x487)
   11447                            .dwattr $C$DW$859, DW_AT_decl_column(0x13)
   11448                    
   11449                            .dwattr $C$DW$T$39, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/M
   11450                            .dwattr $C$DW$T$39, DW_AT_decl_line(0x483)
   11451                            .dwattr $C$DW$T$39, DW_AT_decl_column(0x01)
   11452                            .dwendtag $C$DW$T$39
   11453                    
   11454                    $C$DW$T$198     .dwtag  DW_TAG_typedef
   11455                            .dwattr $C$DW$T$198, DW_AT_name("macMlmeDisassociateCnf_t")
   11456                            .dwattr $C$DW$T$198, DW_AT_type(*$C$DW$T$39)
   11457                            .dwattr $C$DW$T$198, DW_AT_language(DW_LANG_C)
   11458                            .dwattr $C$DW$T$198, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/
   11459                            .dwattr $C$DW$T$198, DW_AT_decl_line(0x489)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:34 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{623E3695-F231-449A-908B-500F977B1BA7} PAGE  210

   11460                            .dwattr $C$DW$T$198, DW_AT_decl_column(0x03)
   11461                    
   11462                    
   11463                    $C$DW$T$42      .dwtag  DW_TAG_structure_type
   11464                            .dwattr $C$DW$T$42, DW_AT_byte_size(0x24)
   11465                    $C$DW$860       .dwtag  DW_TAG_member
   11466                            .dwattr $C$DW$860, DW_AT_type(*$C$DW$T$38)
   11467                            .dwattr $C$DW$860, DW_AT_name("coordAddress")
   11468                            .dwattr $C$DW$860, DW_AT_TI_symbol_name("coordAddress")
   11469                            .dwattr $C$DW$860, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11470                            .dwattr $C$DW$860, DW_AT_accessibility(DW_ACCESS_public)
   11471                            .dwattr $C$DW$860, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
   11472                            .dwattr $C$DW$860, DW_AT_decl_line(0x3cb)
   11473                            .dwattr $C$DW$860, DW_AT_decl_column(0x11)
   11474                    
   11475                    $C$DW$861       .dwtag  DW_TAG_member
   11476                            .dwattr $C$DW$861, DW_AT_type(*$C$DW$T$34)
   11477                            .dwattr $C$DW$861, DW_AT_name("coordPanId")
   11478                            .dwattr $C$DW$861, DW_AT_TI_symbol_name("coordPanId")
   11479                            .dwattr $C$DW$861, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   11480                            .dwattr $C$DW$861, DW_AT_accessibility(DW_ACCESS_public)
   11481                            .dwattr $C$DW$861, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
   11482                            .dwattr $C$DW$861, DW_AT_decl_line(0x3cc)
   11483                            .dwattr $C$DW$861, DW_AT_decl_column(0x11)
   11484                    
   11485                    $C$DW$862       .dwtag  DW_TAG_member
   11486                            .dwattr $C$DW$862, DW_AT_type(*$C$DW$T$34)
   11487                            .dwattr $C$DW$862, DW_AT_name("superframeSpec")
   11488                            .dwattr $C$DW$862, DW_AT_TI_symbol_name("superframeSpec")
   11489                            .dwattr $C$DW$862, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   11490                            .dwattr $C$DW$862, DW_AT_accessibility(DW_ACCESS_public)
   11491                            .dwattr $C$DW$862, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
   11492                            .dwattr $C$DW$862, DW_AT_decl_line(0x3cd)
   11493                            .dwattr $C$DW$862, DW_AT_decl_column(0x11)
   11494                    
   11495                    $C$DW$863       .dwtag  DW_TAG_member
   11496                            .dwattr $C$DW$863, DW_AT_type(*$C$DW$T$27)
   11497                            .dwattr $C$DW$863, DW_AT_name("logicalChannel")
   11498                            .dwattr $C$DW$863, DW_AT_TI_symbol_name("logicalChannel")
   11499                            .dwattr $C$DW$863, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   11500                            .dwattr $C$DW$863, DW_AT_accessibility(DW_ACCESS_public)
   11501                            .dwattr $C$DW$863, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
   11502                            .dwattr $C$DW$863, DW_AT_decl_line(0x3ce)
   11503                            .dwattr $C$DW$863, DW_AT_decl_column(0x11)
   11504                    
   11505                    $C$DW$864       .dwtag  DW_TAG_member
   11506                            .dwattr $C$DW$864, DW_AT_type(*$C$DW$T$27)
   11507                            .dwattr $C$DW$864, DW_AT_name("channelPage")
   11508                            .dwattr $C$DW$864, DW_AT_TI_symbol_name("channelPage")
   11509                            .dwattr $C$DW$864, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
   11510                            .dwattr $C$DW$864, DW_AT_accessibility(DW_ACCESS_public)
   11511                            .dwattr $C$DW$864, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
   11512                            .dwattr $C$DW$864, DW_AT_decl_line(0x3cf)
   11513                            .dwattr $C$DW$864, DW_AT_decl_column(0x11)
   11514                    
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:34 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{623E3695-F231-449A-908B-500F977B1BA7} PAGE  211

   11515                    $C$DW$865       .dwtag  DW_TAG_member
   11516                            .dwattr $C$DW$865, DW_AT_type(*$C$DW$T$40)
   11517                            .dwattr $C$DW$865, DW_AT_name("gtsPermit")
   11518                            .dwattr $C$DW$865, DW_AT_TI_symbol_name("gtsPermit")
   11519                            .dwattr $C$DW$865, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   11520                            .dwattr $C$DW$865, DW_AT_accessibility(DW_ACCESS_public)
   11521                            .dwattr $C$DW$865, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
   11522                            .dwattr $C$DW$865, DW_AT_decl_line(0x3d0)
   11523                            .dwattr $C$DW$865, DW_AT_decl_column(0x11)
   11524                    
   11525                    $C$DW$866       .dwtag  DW_TAG_member
   11526                            .dwattr $C$DW$866, DW_AT_type(*$C$DW$T$27)
   11527                            .dwattr $C$DW$866, DW_AT_name("linkQuality")
   11528                            .dwattr $C$DW$866, DW_AT_TI_symbol_name("linkQuality")
   11529                            .dwattr $C$DW$866, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
   11530                            .dwattr $C$DW$866, DW_AT_accessibility(DW_ACCESS_public)
   11531                            .dwattr $C$DW$866, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
   11532                            .dwattr $C$DW$866, DW_AT_decl_line(0x3d1)
   11533                            .dwattr $C$DW$866, DW_AT_decl_column(0x11)
   11534                    
   11535                    $C$DW$867       .dwtag  DW_TAG_member
   11536                            .dwattr $C$DW$867, DW_AT_type(*$C$DW$T$41)
   11537                            .dwattr $C$DW$867, DW_AT_name("timestamp")
   11538                            .dwattr $C$DW$867, DW_AT_TI_symbol_name("timestamp")
   11539                            .dwattr $C$DW$867, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
   11540                            .dwattr $C$DW$867, DW_AT_accessibility(DW_ACCESS_public)
   11541                            .dwattr $C$DW$867, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
   11542                            .dwattr $C$DW$867, DW_AT_decl_line(0x3d2)
   11543                            .dwattr $C$DW$867, DW_AT_decl_column(0x11)
   11544                    
   11545                    $C$DW$868       .dwtag  DW_TAG_member
   11546                            .dwattr $C$DW$868, DW_AT_type(*$C$DW$T$40)
   11547                            .dwattr $C$DW$868, DW_AT_name("securityFailure")
   11548                            .dwattr $C$DW$868, DW_AT_TI_symbol_name("securityFailure")
   11549                            .dwattr $C$DW$868, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
   11550                            .dwattr $C$DW$868, DW_AT_accessibility(DW_ACCESS_public)
   11551                            .dwattr $C$DW$868, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
   11552                            .dwattr $C$DW$868, DW_AT_decl_line(0x3d3)
   11553                            .dwattr $C$DW$868, DW_AT_decl_column(0x11)
   11554                    
   11555                    $C$DW$869       .dwtag  DW_TAG_member
   11556                            .dwattr $C$DW$869, DW_AT_type(*$C$DW$T$32)
   11557                            .dwattr $C$DW$869, DW_AT_name("sec")
   11558                            .dwattr $C$DW$869, DW_AT_TI_symbol_name("sec")
   11559                            .dwattr $C$DW$869, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
   11560                            .dwattr $C$DW$869, DW_AT_accessibility(DW_ACCESS_public)
   11561                            .dwattr $C$DW$869, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
   11562                            .dwattr $C$DW$869, DW_AT_decl_line(0x3d4)
   11563                            .dwattr $C$DW$869, DW_AT_decl_column(0x11)
   11564                    
   11565                            .dwattr $C$DW$T$42, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/M
   11566                            .dwattr $C$DW$T$42, DW_AT_decl_line(0x3ca)
   11567                            .dwattr $C$DW$T$42, DW_AT_decl_column(0x01)
   11568                            .dwendtag $C$DW$T$42
   11569                    
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:34 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{623E3695-F231-449A-908B-500F977B1BA7} PAGE  212

   11570                    $C$DW$T$43      .dwtag  DW_TAG_typedef
   11571                            .dwattr $C$DW$T$43, DW_AT_name("macPanDesc_t")
   11572                            .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$42)
   11573                            .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
   11574                            .dwattr $C$DW$T$43, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/M
   11575                            .dwattr $C$DW$T$43, DW_AT_decl_line(0x3d5)
   11576                            .dwattr $C$DW$T$43, DW_AT_decl_column(0x03)
   11577                    
   11578                    $C$DW$T$44      .dwtag  DW_TAG_pointer_type
   11579                            .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$43)
   11580                            .dwattr $C$DW$T$44, DW_AT_address_class(0x20)
   11581                    
   11582                    $C$DW$T$732     .dwtag  DW_TAG_const_type
   11583                            .dwattr $C$DW$T$732, DW_AT_type(*$C$DW$T$44)
   11584                    
   11585                    
   11586                    $C$DW$T$46      .dwtag  DW_TAG_structure_type
   11587                            .dwattr $C$DW$T$46, DW_AT_byte_size(0x14)
   11588                    $C$DW$870       .dwtag  DW_TAG_member
   11589                            .dwattr $C$DW$870, DW_AT_type(*$C$DW$T$44)
   11590                            .dwattr $C$DW$870, DW_AT_name("pPanDesc")
   11591                            .dwattr $C$DW$870, DW_AT_TI_symbol_name("pPanDesc")
   11592                            .dwattr $C$DW$870, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11593                            .dwattr $C$DW$870, DW_AT_accessibility(DW_ACCESS_public)
   11594                            .dwattr $C$DW$870, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
   11595                            .dwattr $C$DW$870, DW_AT_decl_line(0x48e)
   11596                            .dwattr $C$DW$870, DW_AT_decl_column(0x13)
   11597                    
   11598                    $C$DW$871       .dwtag  DW_TAG_member
   11599                            .dwattr $C$DW$871, DW_AT_type(*$C$DW$T$27)
   11600                            .dwattr $C$DW$871, DW_AT_name("pendAddrSpec")
   11601                            .dwattr $C$DW$871, DW_AT_TI_symbol_name("pendAddrSpec")
   11602                            .dwattr $C$DW$871, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   11603                            .dwattr $C$DW$871, DW_AT_accessibility(DW_ACCESS_public)
   11604                            .dwattr $C$DW$871, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
   11605                            .dwattr $C$DW$871, DW_AT_decl_line(0x48f)
   11606                            .dwattr $C$DW$871, DW_AT_decl_column(0x12)
   11607                    
   11608                    $C$DW$872       .dwtag  DW_TAG_member
   11609                            .dwattr $C$DW$872, DW_AT_type(*$C$DW$T$45)
   11610                            .dwattr $C$DW$872, DW_AT_name("pAddrList")
   11611                            .dwattr $C$DW$872, DW_AT_TI_symbol_name("pAddrList")
   11612                            .dwattr $C$DW$872, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   11613                            .dwattr $C$DW$872, DW_AT_accessibility(DW_ACCESS_public)
   11614                            .dwattr $C$DW$872, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
   11615                            .dwattr $C$DW$872, DW_AT_decl_line(0x490)
   11616                            .dwattr $C$DW$872, DW_AT_decl_column(0x13)
   11617                    
   11618                    $C$DW$873       .dwtag  DW_TAG_member
   11619                            .dwattr $C$DW$873, DW_AT_type(*$C$DW$T$27)
   11620                            .dwattr $C$DW$873, DW_AT_name("sduLength")
   11621                            .dwattr $C$DW$873, DW_AT_TI_symbol_name("sduLength")
   11622                            .dwattr $C$DW$873, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   11623                            .dwattr $C$DW$873, DW_AT_accessibility(DW_ACCESS_public)
   11624                            .dwattr $C$DW$873, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:34 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{623E3695-F231-449A-908B-500F977B1BA7} PAGE  213

   11625                            .dwattr $C$DW$873, DW_AT_decl_line(0x491)
   11626                            .dwattr $C$DW$873, DW_AT_decl_column(0x12)
   11627                    
   11628                    $C$DW$874       .dwtag  DW_TAG_member
   11629                            .dwattr $C$DW$874, DW_AT_type(*$C$DW$T$45)
   11630                            .dwattr $C$DW$874, DW_AT_name("pSdu")
   11631                            .dwattr $C$DW$874, DW_AT_TI_symbol_name("pSdu")
   11632                            .dwattr $C$DW$874, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   11633                            .dwattr $C$DW$874, DW_AT_accessibility(DW_ACCESS_public)
   11634                            .dwattr $C$DW$874, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
   11635                            .dwattr $C$DW$874, DW_AT_decl_line(0x492)
   11636                            .dwattr $C$DW$874, DW_AT_decl_column(0x13)
   11637                    
   11638                            .dwattr $C$DW$T$46, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/M
   11639                            .dwattr $C$DW$T$46, DW_AT_decl_line(0x48d)
   11640                            .dwattr $C$DW$T$46, DW_AT_decl_column(0x01)
   11641                            .dwendtag $C$DW$T$46
   11642                    
   11643                    $C$DW$T$188     .dwtag  DW_TAG_typedef
   11644                            .dwattr $C$DW$T$188, DW_AT_name("macBeaconData_t")
   11645                            .dwattr $C$DW$T$188, DW_AT_type(*$C$DW$T$46)
   11646                            .dwattr $C$DW$T$188, DW_AT_language(DW_LANG_C)
   11647                            .dwattr $C$DW$T$188, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/
   11648                            .dwattr $C$DW$T$188, DW_AT_decl_line(0x493)
   11649                            .dwattr $C$DW$T$188, DW_AT_decl_column(0x03)
   11650                    
   11651                    
   11652                    $C$DW$T$47      .dwtag  DW_TAG_structure_type
   11653                            .dwattr $C$DW$T$47, DW_AT_byte_size(0x08)
   11654                    $C$DW$875       .dwtag  DW_TAG_member
   11655                            .dwattr $C$DW$875, DW_AT_type(*$C$DW$T$27)
   11656                            .dwattr $C$DW$875, DW_AT_name("beaconOrder")
   11657                            .dwattr $C$DW$875, DW_AT_TI_symbol_name("beaconOrder")
   11658                            .dwattr $C$DW$875, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11659                            .dwattr $C$DW$875, DW_AT_accessibility(DW_ACCESS_public)
   11660                            .dwattr $C$DW$875, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
   11661                            .dwattr $C$DW$875, DW_AT_decl_line(0x498)
   11662                            .dwattr $C$DW$875, DW_AT_decl_column(0x11)
   11663                    
   11664                    $C$DW$876       .dwtag  DW_TAG_member
   11665                            .dwattr $C$DW$876, DW_AT_type(*$C$DW$T$27)
   11666                            .dwattr $C$DW$876, DW_AT_name("superFrameOrder")
   11667                            .dwattr $C$DW$876, DW_AT_TI_symbol_name("superFrameOrder")
   11668                            .dwattr $C$DW$876, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   11669                            .dwattr $C$DW$876, DW_AT_accessibility(DW_ACCESS_public)
   11670                            .dwattr $C$DW$876, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
   11671                            .dwattr $C$DW$876, DW_AT_decl_line(0x499)
   11672                            .dwattr $C$DW$876, DW_AT_decl_column(0x11)
   11673                    
   11674                    $C$DW$877       .dwtag  DW_TAG_member
   11675                            .dwattr $C$DW$877, DW_AT_type(*$C$DW$T$27)
   11676                            .dwattr $C$DW$877, DW_AT_name("finalCapSlot")
   11677                            .dwattr $C$DW$877, DW_AT_TI_symbol_name("finalCapSlot")
   11678                            .dwattr $C$DW$877, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   11679                            .dwattr $C$DW$877, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:34 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{623E3695-F231-449A-908B-500F977B1BA7} PAGE  214

   11680                            .dwattr $C$DW$877, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
   11681                            .dwattr $C$DW$877, DW_AT_decl_line(0x49b)
   11682                            .dwattr $C$DW$877, DW_AT_decl_column(0x11)
   11683                    
   11684                    $C$DW$878       .dwtag  DW_TAG_member
   11685                            .dwattr $C$DW$878, DW_AT_type(*$C$DW$T$27)
   11686                            .dwattr $C$DW$878, DW_AT_name("eBeaconOrder")
   11687                            .dwattr $C$DW$878, DW_AT_TI_symbol_name("eBeaconOrder")
   11688                            .dwattr $C$DW$878, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   11689                            .dwattr $C$DW$878, DW_AT_accessibility(DW_ACCESS_public)
   11690                            .dwattr $C$DW$878, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
   11691                            .dwattr $C$DW$878, DW_AT_decl_line(0x49c)
   11692                            .dwattr $C$DW$878, DW_AT_decl_column(0x11)
   11693                    
   11694                    $C$DW$879       .dwtag  DW_TAG_member
   11695                            .dwattr $C$DW$879, DW_AT_type(*$C$DW$T$27)
   11696                            .dwattr $C$DW$879, DW_AT_name("offsetTimeSlot")
   11697                            .dwattr $C$DW$879, DW_AT_TI_symbol_name("offsetTimeSlot")
   11698                            .dwattr $C$DW$879, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   11699                            .dwattr $C$DW$879, DW_AT_accessibility(DW_ACCESS_public)
   11700                            .dwattr $C$DW$879, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
   11701                            .dwattr $C$DW$879, DW_AT_decl_line(0x49e)
   11702                            .dwattr $C$DW$879, DW_AT_decl_column(0x11)
   11703                    
   11704                    $C$DW$880       .dwtag  DW_TAG_member
   11705                            .dwattr $C$DW$880, DW_AT_type(*$C$DW$T$27)
   11706                            .dwattr $C$DW$880, DW_AT_name("capBackOff")
   11707                            .dwattr $C$DW$880, DW_AT_TI_symbol_name("capBackOff")
   11708                            .dwattr $C$DW$880, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   11709                            .dwattr $C$DW$880, DW_AT_accessibility(DW_ACCESS_public)
   11710                            .dwattr $C$DW$880, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
   11711                            .dwattr $C$DW$880, DW_AT_decl_line(0x49f)
   11712                            .dwattr $C$DW$880, DW_AT_decl_column(0x11)
   11713                    
   11714                    $C$DW$881       .dwtag  DW_TAG_member
   11715                            .dwattr $C$DW$881, DW_AT_type(*$C$DW$T$34)
   11716                            .dwattr $C$DW$881, DW_AT_name("eBeaconOrderNBPAN")
   11717                            .dwattr $C$DW$881, DW_AT_TI_symbol_name("eBeaconOrderNBPAN")
   11718                            .dwattr $C$DW$881, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   11719                            .dwattr $C$DW$881, DW_AT_accessibility(DW_ACCESS_public)
   11720                            .dwattr $C$DW$881, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
   11721                            .dwattr $C$DW$881, DW_AT_decl_line(0x4a1)
   11722                            .dwattr $C$DW$881, DW_AT_decl_column(0x11)
   11723                    
   11724                            .dwattr $C$DW$T$47, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/M
   11725                            .dwattr $C$DW$T$47, DW_AT_decl_line(0x497)
   11726                            .dwattr $C$DW$T$47, DW_AT_decl_column(0x01)
   11727                            .dwendtag $C$DW$T$47
   11728                    
   11729                    $C$DW$T$48      .dwtag  DW_TAG_typedef
   11730                            .dwattr $C$DW$T$48, DW_AT_name("macCoexist_t")
   11731                            .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$47)
   11732                            .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
   11733                            .dwattr $C$DW$T$48, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/M
   11734                            .dwattr $C$DW$T$48, DW_AT_decl_line(0x4a3)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:34 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{623E3695-F231-449A-908B-500F977B1BA7} PAGE  215

   11735                            .dwattr $C$DW$T$48, DW_AT_decl_column(0x03)
   11736                    
   11737                    
   11738                    $C$DW$T$49      .dwtag  DW_TAG_structure_type
   11739                            .dwattr $C$DW$T$49, DW_AT_byte_size(0x0c)
   11740                    $C$DW$882       .dwtag  DW_TAG_member
   11741                            .dwattr $C$DW$882, DW_AT_type(*$C$DW$T$44)
   11742                            .dwattr $C$DW$882, DW_AT_name("pPanDesc")
   11743                            .dwattr $C$DW$882, DW_AT_TI_symbol_name("pPanDesc")
   11744                            .dwattr $C$DW$882, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11745                            .dwattr $C$DW$882, DW_AT_accessibility(DW_ACCESS_public)
   11746                            .dwattr $C$DW$882, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
   11747                            .dwattr $C$DW$882, DW_AT_decl_line(0x4a8)
   11748                            .dwattr $C$DW$882, DW_AT_decl_column(0x13)
   11749                    
   11750                    $C$DW$883       .dwtag  DW_TAG_member
   11751                            .dwattr $C$DW$883, DW_AT_type(*$C$DW$T$48)
   11752                            .dwattr $C$DW$883, DW_AT_name("coexist")
   11753                            .dwattr $C$DW$883, DW_AT_TI_symbol_name("coexist")
   11754                            .dwattr $C$DW$883, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   11755                            .dwattr $C$DW$883, DW_AT_accessibility(DW_ACCESS_public)
   11756                            .dwattr $C$DW$883, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
   11757                            .dwattr $C$DW$883, DW_AT_decl_line(0x4a9)
   11758                            .dwattr $C$DW$883, DW_AT_decl_column(0x12)
   11759                    
   11760                            .dwattr $C$DW$T$49, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/M
   11761                            .dwattr $C$DW$T$49, DW_AT_decl_line(0x4a7)
   11762                            .dwattr $C$DW$T$49, DW_AT_decl_column(0x01)
   11763                            .dwendtag $C$DW$T$49
   11764                    
   11765                    $C$DW$T$189     .dwtag  DW_TAG_typedef
   11766                            .dwattr $C$DW$T$189, DW_AT_name("macEBeaconData_t")
   11767                            .dwattr $C$DW$T$189, DW_AT_type(*$C$DW$T$49)
   11768                            .dwattr $C$DW$T$189, DW_AT_language(DW_LANG_C)
   11769                            .dwattr $C$DW$T$189, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/
   11770                            .dwattr $C$DW$T$189, DW_AT_decl_line(0x4ab)
   11771                            .dwattr $C$DW$T$189, DW_AT_decl_column(0x03)
   11772                    
   11773                    
   11774                    $C$DW$T$50      .dwtag  DW_TAG_structure_type
   11775                            .dwattr $C$DW$T$50, DW_AT_byte_size(0x18)
   11776                    $C$DW$884       .dwtag  DW_TAG_member
   11777                            .dwattr $C$DW$884, DW_AT_type(*$C$DW$T$29)
   11778                            .dwattr $C$DW$884, DW_AT_name("hdr")
   11779                            .dwattr $C$DW$884, DW_AT_TI_symbol_name("hdr")
   11780                            .dwattr $C$DW$884, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11781                            .dwattr $C$DW$884, DW_AT_accessibility(DW_ACCESS_public)
   11782                            .dwattr $C$DW$884, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
   11783                            .dwattr $C$DW$884, DW_AT_decl_line(0x4b0)
   11784                            .dwattr $C$DW$884, DW_AT_decl_column(0x12)
   11785                    
   11786                    $C$DW$885       .dwtag  DW_TAG_member
   11787                            .dwattr $C$DW$885, DW_AT_type(*$C$DW$T$27)
   11788                            .dwattr $C$DW$885, DW_AT_name("beaconType")
   11789                            .dwattr $C$DW$885, DW_AT_TI_symbol_name("beaconType")
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:34 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{623E3695-F231-449A-908B-500F977B1BA7} PAGE  216

   11790                            .dwattr $C$DW$885, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   11791                            .dwattr $C$DW$885, DW_AT_accessibility(DW_ACCESS_public)
   11792                            .dwattr $C$DW$885, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
   11793                            .dwattr $C$DW$885, DW_AT_decl_line(0x4b1)
   11794                            .dwattr $C$DW$885, DW_AT_decl_column(0x12)
   11795                    
   11796                    $C$DW$886       .dwtag  DW_TAG_member
   11797                            .dwattr $C$DW$886, DW_AT_type(*$C$DW$T$27)
   11798                            .dwattr $C$DW$886, DW_AT_name("bsn")
   11799                            .dwattr $C$DW$886, DW_AT_TI_symbol_name("bsn")
   11800                            .dwattr $C$DW$886, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   11801                            .dwattr $C$DW$886, DW_AT_accessibility(DW_ACCESS_public)
   11802                            .dwattr $C$DW$886, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
   11803                            .dwattr $C$DW$886, DW_AT_decl_line(0x4b2)
   11804                            .dwattr $C$DW$886, DW_AT_decl_column(0x12)
   11805                    
   11806                    $C$DW$887       .dwtag  DW_TAG_member
   11807                            .dwattr $C$DW$887, DW_AT_type(*$C$DW$T$190)
   11808                            .dwattr $C$DW$887, DW_AT_name("info")
   11809                            .dwattr $C$DW$887, DW_AT_TI_symbol_name("info")
   11810                            .dwattr $C$DW$887, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   11811                            .dwattr $C$DW$887, DW_AT_accessibility(DW_ACCESS_public)
   11812                            .dwattr $C$DW$887, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
   11813                            .dwattr $C$DW$887, DW_AT_decl_line(0x4b7)
   11814                            .dwattr $C$DW$887, DW_AT_decl_column(0x05)
   11815                    
   11816                            .dwattr $C$DW$T$50, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/M
   11817                            .dwattr $C$DW$T$50, DW_AT_decl_line(0x4af)
   11818                            .dwattr $C$DW$T$50, DW_AT_decl_column(0x01)
   11819                            .dwendtag $C$DW$T$50
   11820                    
   11821                    $C$DW$T$199     .dwtag  DW_TAG_typedef
   11822                            .dwattr $C$DW$T$199, DW_AT_name("macMlmeBeaconNotifyInd_t")
   11823                            .dwattr $C$DW$T$199, DW_AT_type(*$C$DW$T$50)
   11824                            .dwattr $C$DW$T$199, DW_AT_language(DW_LANG_C)
   11825                            .dwattr $C$DW$T$199, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/
   11826                            .dwattr $C$DW$T$199, DW_AT_decl_line(0x4b8)
   11827                            .dwattr $C$DW$T$199, DW_AT_decl_column(0x03)
   11828                    
   11829                    $C$DW$T$738     .dwtag  DW_TAG_pointer_type
   11830                            .dwattr $C$DW$T$738, DW_AT_type(*$C$DW$T$199)
   11831                            .dwattr $C$DW$T$738, DW_AT_address_class(0x20)
   11832                    
   11833                    $C$DW$T$739     .dwtag  DW_TAG_const_type
   11834                            .dwattr $C$DW$T$739, DW_AT_type(*$C$DW$T$738)
   11835                    
   11836                    
   11837                    $C$DW$T$51      .dwtag  DW_TAG_structure_type
   11838                            .dwattr $C$DW$T$51, DW_AT_byte_size(0x15)
   11839                    $C$DW$888       .dwtag  DW_TAG_member
   11840                            .dwattr $C$DW$888, DW_AT_type(*$C$DW$T$29)
   11841                            .dwattr $C$DW$888, DW_AT_name("hdr")
   11842                            .dwattr $C$DW$888, DW_AT_TI_symbol_name("hdr")
   11843                            .dwattr $C$DW$888, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11844                            .dwattr $C$DW$888, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:34 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{623E3695-F231-449A-908B-500F977B1BA7} PAGE  217

   11845                            .dwattr $C$DW$888, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
   11846                            .dwattr $C$DW$888, DW_AT_decl_line(0x4be)
   11847                            .dwattr $C$DW$888, DW_AT_decl_column(0x17)
   11848                    
   11849                    $C$DW$889       .dwtag  DW_TAG_member
   11850                            .dwattr $C$DW$889, DW_AT_type(*$C$DW$T$31)
   11851                            .dwattr $C$DW$889, DW_AT_name("orphanAddress")
   11852                            .dwattr $C$DW$889, DW_AT_TI_symbol_name("orphanAddress")
   11853                            .dwattr $C$DW$889, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   11854                            .dwattr $C$DW$889, DW_AT_accessibility(DW_ACCESS_public)
   11855                            .dwattr $C$DW$889, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
   11856                            .dwattr $C$DW$889, DW_AT_decl_line(0x4bf)
   11857                            .dwattr $C$DW$889, DW_AT_decl_column(0x17)
   11858                    
   11859                    $C$DW$890       .dwtag  DW_TAG_member
   11860                            .dwattr $C$DW$890, DW_AT_type(*$C$DW$T$32)
   11861                            .dwattr $C$DW$890, DW_AT_name("sec")
   11862                            .dwattr $C$DW$890, DW_AT_TI_symbol_name("sec")
   11863                            .dwattr $C$DW$890, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   11864                            .dwattr $C$DW$890, DW_AT_accessibility(DW_ACCESS_public)
   11865                            .dwattr $C$DW$890, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
   11866                            .dwattr $C$DW$890, DW_AT_decl_line(0x4c0)
   11867                            .dwattr $C$DW$890, DW_AT_decl_column(0x17)
   11868                    
   11869                            .dwattr $C$DW$T$51, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/M
   11870                            .dwattr $C$DW$T$51, DW_AT_decl_line(0x4bd)
   11871                            .dwattr $C$DW$T$51, DW_AT_decl_column(0x01)
   11872                            .dwendtag $C$DW$T$51
   11873                    
   11874                    $C$DW$T$200     .dwtag  DW_TAG_typedef
   11875                            .dwattr $C$DW$T$200, DW_AT_name("macMlmeOrphanInd_t")
   11876                            .dwattr $C$DW$T$200, DW_AT_type(*$C$DW$T$51)
   11877                            .dwattr $C$DW$T$200, DW_AT_language(DW_LANG_C)
   11878                            .dwattr $C$DW$T$200, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/
   11879                            .dwattr $C$DW$T$200, DW_AT_decl_line(0x4c1)
   11880                            .dwattr $C$DW$T$200, DW_AT_decl_column(0x03)
   11881                    
   11882                    
   11883                    $C$DW$T$53      .dwtag  DW_TAG_structure_type
   11884                            .dwattr $C$DW$T$53, DW_AT_byte_size(0x1c)
   11885                    $C$DW$891       .dwtag  DW_TAG_member
   11886                            .dwattr $C$DW$891, DW_AT_type(*$C$DW$T$29)
   11887                            .dwattr $C$DW$891, DW_AT_name("hdr")
   11888                            .dwattr $C$DW$891, DW_AT_TI_symbol_name("hdr")
   11889                            .dwattr $C$DW$891, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11890                            .dwattr $C$DW$891, DW_AT_accessibility(DW_ACCESS_public)
   11891                            .dwattr $C$DW$891, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
   11892                            .dwattr $C$DW$891, DW_AT_decl_line(0x4c6)
   11893                            .dwattr $C$DW$891, DW_AT_decl_column(0x13)
   11894                    
   11895                    $C$DW$892       .dwtag  DW_TAG_member
   11896                            .dwattr $C$DW$892, DW_AT_type(*$C$DW$T$27)
   11897                            .dwattr $C$DW$892, DW_AT_name("scanType")
   11898                            .dwattr $C$DW$892, DW_AT_TI_symbol_name("scanType")
   11899                            .dwattr $C$DW$892, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:34 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{623E3695-F231-449A-908B-500F977B1BA7} PAGE  218

   11900                            .dwattr $C$DW$892, DW_AT_accessibility(DW_ACCESS_public)
   11901                            .dwattr $C$DW$892, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
   11902                            .dwattr $C$DW$892, DW_AT_decl_line(0x4c7)
   11903                            .dwattr $C$DW$892, DW_AT_decl_column(0x13)
   11904                    
   11905                    $C$DW$893       .dwtag  DW_TAG_member
   11906                            .dwattr $C$DW$893, DW_AT_type(*$C$DW$T$27)
   11907                            .dwattr $C$DW$893, DW_AT_name("channelPage")
   11908                            .dwattr $C$DW$893, DW_AT_TI_symbol_name("channelPage")
   11909                            .dwattr $C$DW$893, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   11910                            .dwattr $C$DW$893, DW_AT_accessibility(DW_ACCESS_public)
   11911                            .dwattr $C$DW$893, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
   11912                            .dwattr $C$DW$893, DW_AT_decl_line(0x4c8)
   11913                            .dwattr $C$DW$893, DW_AT_decl_column(0x13)
   11914                    
   11915                    $C$DW$894       .dwtag  DW_TAG_member
   11916                            .dwattr $C$DW$894, DW_AT_type(*$C$DW$T$27)
   11917                            .dwattr $C$DW$894, DW_AT_name("phyID")
   11918                            .dwattr $C$DW$894, DW_AT_TI_symbol_name("phyID")
   11919                            .dwattr $C$DW$894, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   11920                            .dwattr $C$DW$894, DW_AT_accessibility(DW_ACCESS_public)
   11921                            .dwattr $C$DW$894, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
   11922                            .dwattr $C$DW$894, DW_AT_decl_line(0x4c9)
   11923                            .dwattr $C$DW$894, DW_AT_decl_column(0x13)
   11924                    
   11925                    $C$DW$895       .dwtag  DW_TAG_member
   11926                            .dwattr $C$DW$895, DW_AT_type(*$C$DW$T$52)
   11927                            .dwattr $C$DW$895, DW_AT_name("unscannedChannels")
   11928                            .dwattr $C$DW$895, DW_AT_TI_symbol_name("unscannedChannels")
   11929                            .dwattr $C$DW$895, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   11930                            .dwattr $C$DW$895, DW_AT_accessibility(DW_ACCESS_public)
   11931                            .dwattr $C$DW$895, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
   11932                            .dwattr $C$DW$895, DW_AT_decl_line(0x4ca)
   11933                            .dwattr $C$DW$895, DW_AT_decl_column(0x13)
   11934                    
   11935                    $C$DW$896       .dwtag  DW_TAG_member
   11936                            .dwattr $C$DW$896, DW_AT_type(*$C$DW$T$27)
   11937                            .dwattr $C$DW$896, DW_AT_name("resultListSize")
   11938                            .dwattr $C$DW$896, DW_AT_TI_symbol_name("resultListSize")
   11939                            .dwattr $C$DW$896, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
   11940                            .dwattr $C$DW$896, DW_AT_accessibility(DW_ACCESS_public)
   11941                            .dwattr $C$DW$896, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
   11942                            .dwattr $C$DW$896, DW_AT_decl_line(0x4cb)
   11943                            .dwattr $C$DW$896, DW_AT_decl_column(0x13)
   11944                    
   11945                    $C$DW$897       .dwtag  DW_TAG_member
   11946                            .dwattr $C$DW$897, DW_AT_type(*$C$DW$T$191)
   11947                            .dwattr $C$DW$897, DW_AT_name("result")
   11948                            .dwattr $C$DW$897, DW_AT_TI_symbol_name("result")
   11949                            .dwattr $C$DW$897, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
   11950                            .dwattr $C$DW$897, DW_AT_accessibility(DW_ACCESS_public)
   11951                            .dwattr $C$DW$897, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
   11952                            .dwattr $C$DW$897, DW_AT_decl_line(0x4d0)
   11953                            .dwattr $C$DW$897, DW_AT_decl_column(0x05)
   11954                    
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:34 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{623E3695-F231-449A-908B-500F977B1BA7} PAGE  219

   11955                            .dwattr $C$DW$T$53, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/M
   11956                            .dwattr $C$DW$T$53, DW_AT_decl_line(0x4c5)
   11957                            .dwattr $C$DW$T$53, DW_AT_decl_column(0x01)
   11958                            .dwendtag $C$DW$T$53
   11959                    
   11960                    $C$DW$T$201     .dwtag  DW_TAG_typedef
   11961                            .dwattr $C$DW$T$201, DW_AT_name("macMlmeScanCnf_t")
   11962                            .dwattr $C$DW$T$201, DW_AT_type(*$C$DW$T$53)
   11963                            .dwattr $C$DW$T$201, DW_AT_language(DW_LANG_C)
   11964                            .dwattr $C$DW$T$201, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/
   11965                            .dwattr $C$DW$T$201, DW_AT_decl_line(0x4d1)
   11966                            .dwattr $C$DW$T$201, DW_AT_decl_column(0x03)
   11967                    
   11968                    $C$DW$T$742     .dwtag  DW_TAG_pointer_type
   11969                            .dwattr $C$DW$T$742, DW_AT_type(*$C$DW$T$201)
   11970                            .dwattr $C$DW$T$742, DW_AT_address_class(0x20)
   11971                    
   11972                    $C$DW$T$743     .dwtag  DW_TAG_const_type
   11973                            .dwattr $C$DW$T$743, DW_AT_type(*$C$DW$T$742)
   11974                    
   11975                    
   11976                    $C$DW$T$54      .dwtag  DW_TAG_structure_type
   11977                            .dwattr $C$DW$T$54, DW_AT_byte_size(0x02)
   11978                    $C$DW$898       .dwtag  DW_TAG_member
   11979                            .dwattr $C$DW$898, DW_AT_type(*$C$DW$T$29)
   11980                            .dwattr $C$DW$898, DW_AT_name("hdr")
   11981                            .dwattr $C$DW$898, DW_AT_TI_symbol_name("hdr")
   11982                            .dwattr $C$DW$898, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11983                            .dwattr $C$DW$898, DW_AT_accessibility(DW_ACCESS_public)
   11984                            .dwattr $C$DW$898, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
   11985                            .dwattr $C$DW$898, DW_AT_decl_line(0x4d6)
   11986                            .dwattr $C$DW$898, DW_AT_decl_column(0x13)
   11987                    
   11988                            .dwattr $C$DW$T$54, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/M
   11989                            .dwattr $C$DW$T$54, DW_AT_decl_line(0x4d5)
   11990                            .dwattr $C$DW$T$54, DW_AT_decl_column(0x01)
   11991                            .dwendtag $C$DW$T$54
   11992                    
   11993                    $C$DW$T$202     .dwtag  DW_TAG_typedef
   11994                            .dwattr $C$DW$T$202, DW_AT_name("macMlmeStartCnf_t")
   11995                            .dwattr $C$DW$T$202, DW_AT_type(*$C$DW$T$54)
   11996                            .dwattr $C$DW$T$202, DW_AT_language(DW_LANG_C)
   11997                            .dwattr $C$DW$T$202, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/
   11998                            .dwattr $C$DW$T$202, DW_AT_decl_line(0x4d7)
   11999                            .dwattr $C$DW$T$202, DW_AT_decl_column(0x03)
   12000                    
   12001                    
   12002                    $C$DW$T$55      .dwtag  DW_TAG_structure_type
   12003                            .dwattr $C$DW$T$55, DW_AT_byte_size(0x12)
   12004                    $C$DW$899       .dwtag  DW_TAG_member
   12005                            .dwattr $C$DW$899, DW_AT_type(*$C$DW$T$29)
   12006                            .dwattr $C$DW$899, DW_AT_name("hdr")
   12007                            .dwattr $C$DW$899, DW_AT_TI_symbol_name("hdr")
   12008                            .dwattr $C$DW$899, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   12009                            .dwattr $C$DW$899, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:34 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{623E3695-F231-449A-908B-500F977B1BA7} PAGE  220

   12010                            .dwattr $C$DW$899, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
   12011                            .dwattr $C$DW$899, DW_AT_decl_line(0x4dc)
   12012                            .dwattr $C$DW$899, DW_AT_decl_column(0x13)
   12013                    
   12014                    $C$DW$900       .dwtag  DW_TAG_member
   12015                            .dwattr $C$DW$900, DW_AT_type(*$C$DW$T$34)
   12016                            .dwattr $C$DW$900, DW_AT_name("panId")
   12017                            .dwattr $C$DW$900, DW_AT_TI_symbol_name("panId")
   12018                            .dwattr $C$DW$900, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   12019                            .dwattr $C$DW$900, DW_AT_accessibility(DW_ACCESS_public)
   12020                            .dwattr $C$DW$900, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
   12021                            .dwattr $C$DW$900, DW_AT_decl_line(0x4dd)
   12022                            .dwattr $C$DW$900, DW_AT_decl_column(0x13)
   12023                    
   12024                    $C$DW$901       .dwtag  DW_TAG_member
   12025                            .dwattr $C$DW$901, DW_AT_type(*$C$DW$T$27)
   12026                            .dwattr $C$DW$901, DW_AT_name("logicalChannel")
   12027                            .dwattr $C$DW$901, DW_AT_TI_symbol_name("logicalChannel")
   12028                            .dwattr $C$DW$901, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   12029                            .dwattr $C$DW$901, DW_AT_accessibility(DW_ACCESS_public)
   12030                            .dwattr $C$DW$901, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
   12031                            .dwattr $C$DW$901, DW_AT_decl_line(0x4de)
   12032                            .dwattr $C$DW$901, DW_AT_decl_column(0x13)
   12033                    
   12034                    $C$DW$902       .dwtag  DW_TAG_member
   12035                            .dwattr $C$DW$902, DW_AT_type(*$C$DW$T$27)
   12036                            .dwattr $C$DW$902, DW_AT_name("channelPage")
   12037                            .dwattr $C$DW$902, DW_AT_TI_symbol_name("channelPage")
   12038                            .dwattr $C$DW$902, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   12039                            .dwattr $C$DW$902, DW_AT_accessibility(DW_ACCESS_public)
   12040                            .dwattr $C$DW$902, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
   12041                            .dwattr $C$DW$902, DW_AT_decl_line(0x4df)
   12042                            .dwattr $C$DW$902, DW_AT_decl_column(0x13)
   12043                    
   12044                    $C$DW$903       .dwtag  DW_TAG_member
   12045                            .dwattr $C$DW$903, DW_AT_type(*$C$DW$T$27)
   12046                            .dwattr $C$DW$903, DW_AT_name("phyID")
   12047                            .dwattr $C$DW$903, DW_AT_TI_symbol_name("phyID")
   12048                            .dwattr $C$DW$903, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   12049                            .dwattr $C$DW$903, DW_AT_accessibility(DW_ACCESS_public)
   12050                            .dwattr $C$DW$903, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
   12051                            .dwattr $C$DW$903, DW_AT_decl_line(0x4e0)
   12052                            .dwattr $C$DW$903, DW_AT_decl_column(0x13)
   12053                    
   12054                    $C$DW$904       .dwtag  DW_TAG_member
   12055                            .dwattr $C$DW$904, DW_AT_type(*$C$DW$T$32)
   12056                            .dwattr $C$DW$904, DW_AT_name("sec")
   12057                            .dwattr $C$DW$904, DW_AT_TI_symbol_name("sec")
   12058                            .dwattr $C$DW$904, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   12059                            .dwattr $C$DW$904, DW_AT_accessibility(DW_ACCESS_public)
   12060                            .dwattr $C$DW$904, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
   12061                            .dwattr $C$DW$904, DW_AT_decl_line(0x4e1)
   12062                            .dwattr $C$DW$904, DW_AT_decl_column(0x13)
   12063                    
   12064                            .dwattr $C$DW$T$55, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/M
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:34 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{623E3695-F231-449A-908B-500F977B1BA7} PAGE  221

   12065                            .dwattr $C$DW$T$55, DW_AT_decl_line(0x4db)
   12066                            .dwattr $C$DW$T$55, DW_AT_decl_column(0x01)
   12067                            .dwendtag $C$DW$T$55
   12068                    
   12069                    $C$DW$T$203     .dwtag  DW_TAG_typedef
   12070                            .dwattr $C$DW$T$203, DW_AT_name("macMlmeSyncLossInd_t")
   12071                            .dwattr $C$DW$T$203, DW_AT_type(*$C$DW$T$55)
   12072                            .dwattr $C$DW$T$203, DW_AT_language(DW_LANG_C)
   12073                            .dwattr $C$DW$T$203, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/
   12074                            .dwattr $C$DW$T$203, DW_AT_decl_line(0x4e2)
   12075                            .dwattr $C$DW$T$203, DW_AT_decl_column(0x03)
   12076                    
   12077                    
   12078                    $C$DW$T$56      .dwtag  DW_TAG_structure_type
   12079                            .dwattr $C$DW$T$56, DW_AT_byte_size(0x03)
   12080                    $C$DW$905       .dwtag  DW_TAG_member
   12081                            .dwattr $C$DW$905, DW_AT_type(*$C$DW$T$29)
   12082                            .dwattr $C$DW$905, DW_AT_name("hdr")
   12083                            .dwattr $C$DW$905, DW_AT_TI_symbol_name("hdr")
   12084                            .dwattr $C$DW$905, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   12085                            .dwattr $C$DW$905, DW_AT_accessibility(DW_ACCESS_public)
   12086                            .dwattr $C$DW$905, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
   12087                            .dwattr $C$DW$905, DW_AT_decl_line(0x4e7)
   12088                            .dwattr $C$DW$905, DW_AT_decl_column(0x13)
   12089                    
   12090                    $C$DW$906       .dwtag  DW_TAG_member
   12091                            .dwattr $C$DW$906, DW_AT_type(*$C$DW$T$27)
   12092                            .dwattr $C$DW$906, DW_AT_name("framePending")
   12093                            .dwattr $C$DW$906, DW_AT_TI_symbol_name("framePending")
   12094                            .dwattr $C$DW$906, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   12095                            .dwattr $C$DW$906, DW_AT_accessibility(DW_ACCESS_public)
   12096                            .dwattr $C$DW$906, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
   12097                            .dwattr $C$DW$906, DW_AT_decl_line(0x4e8)
   12098                            .dwattr $C$DW$906, DW_AT_decl_column(0x13)
   12099                    
   12100                            .dwattr $C$DW$T$56, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/M
   12101                            .dwattr $C$DW$T$56, DW_AT_decl_line(0x4e6)
   12102                            .dwattr $C$DW$T$56, DW_AT_decl_column(0x01)
   12103                            .dwendtag $C$DW$T$56
   12104                    
   12105                    $C$DW$T$204     .dwtag  DW_TAG_typedef
   12106                            .dwattr $C$DW$T$204, DW_AT_name("macMlmePollCnf_t")
   12107                            .dwattr $C$DW$T$204, DW_AT_type(*$C$DW$T$56)
   12108                            .dwattr $C$DW$T$204, DW_AT_language(DW_LANG_C)
   12109                            .dwattr $C$DW$T$204, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/
   12110                            .dwattr $C$DW$T$204, DW_AT_decl_line(0x4e9)
   12111                            .dwattr $C$DW$T$204, DW_AT_decl_column(0x03)
   12112                    
   12113                    
   12114                    $C$DW$T$57      .dwtag  DW_TAG_structure_type
   12115                            .dwattr $C$DW$T$57, DW_AT_byte_size(0x24)
   12116                    $C$DW$907       .dwtag  DW_TAG_member
   12117                            .dwattr $C$DW$907, DW_AT_type(*$C$DW$T$29)
   12118                            .dwattr $C$DW$907, DW_AT_name("hdr")
   12119                            .dwattr $C$DW$907, DW_AT_TI_symbol_name("hdr")
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:34 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{623E3695-F231-449A-908B-500F977B1BA7} PAGE  222

   12120                            .dwattr $C$DW$907, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   12121                            .dwattr $C$DW$907, DW_AT_accessibility(DW_ACCESS_public)
   12122                            .dwattr $C$DW$907, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
   12123                            .dwattr $C$DW$907, DW_AT_decl_line(0x4ee)
   12124                            .dwattr $C$DW$907, DW_AT_decl_column(0x13)
   12125                    
   12126                    $C$DW$908       .dwtag  DW_TAG_member
   12127                            .dwattr $C$DW$908, DW_AT_type(*$C$DW$T$38)
   12128                            .dwattr $C$DW$908, DW_AT_name("srcAddr")
   12129                            .dwattr $C$DW$908, DW_AT_TI_symbol_name("srcAddr")
   12130                            .dwattr $C$DW$908, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   12131                            .dwattr $C$DW$908, DW_AT_accessibility(DW_ACCESS_public)
   12132                            .dwattr $C$DW$908, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
   12133                            .dwattr $C$DW$908, DW_AT_decl_line(0x4ef)
   12134                            .dwattr $C$DW$908, DW_AT_decl_column(0x13)
   12135                    
   12136                    $C$DW$909       .dwtag  DW_TAG_member
   12137                            .dwattr $C$DW$909, DW_AT_type(*$C$DW$T$38)
   12138                            .dwattr $C$DW$909, DW_AT_name("dstAddr")
   12139                            .dwattr $C$DW$909, DW_AT_TI_symbol_name("dstAddr")
   12140                            .dwattr $C$DW$909, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   12141                            .dwattr $C$DW$909, DW_AT_accessibility(DW_ACCESS_public)
   12142                            .dwattr $C$DW$909, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
   12143                            .dwattr $C$DW$909, DW_AT_decl_line(0x4f0)
   12144                            .dwattr $C$DW$909, DW_AT_decl_column(0x13)
   12145                    
   12146                    $C$DW$910       .dwtag  DW_TAG_member
   12147                            .dwattr $C$DW$910, DW_AT_type(*$C$DW$T$34)
   12148                            .dwattr $C$DW$910, DW_AT_name("panId")
   12149                            .dwattr $C$DW$910, DW_AT_TI_symbol_name("panId")
   12150                            .dwattr $C$DW$910, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
   12151                            .dwattr $C$DW$910, DW_AT_accessibility(DW_ACCESS_public)
   12152                            .dwattr $C$DW$910, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
   12153                            .dwattr $C$DW$910, DW_AT_decl_line(0x4f1)
   12154                            .dwattr $C$DW$910, DW_AT_decl_column(0x13)
   12155                    
   12156                    $C$DW$911       .dwtag  DW_TAG_member
   12157                            .dwattr $C$DW$911, DW_AT_type(*$C$DW$T$27)
   12158                            .dwattr $C$DW$911, DW_AT_name("reason")
   12159                            .dwattr $C$DW$911, DW_AT_TI_symbol_name("reason")
   12160                            .dwattr $C$DW$911, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
   12161                            .dwattr $C$DW$911, DW_AT_accessibility(DW_ACCESS_public)
   12162                            .dwattr $C$DW$911, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
   12163                            .dwattr $C$DW$911, DW_AT_decl_line(0x4f2)
   12164                            .dwattr $C$DW$911, DW_AT_decl_column(0x13)
   12165                    
   12166                    $C$DW$912       .dwtag  DW_TAG_member
   12167                            .dwattr $C$DW$912, DW_AT_type(*$C$DW$T$32)
   12168                            .dwattr $C$DW$912, DW_AT_name("sec")
   12169                            .dwattr $C$DW$912, DW_AT_TI_symbol_name("sec")
   12170                            .dwattr $C$DW$912, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
   12171                            .dwattr $C$DW$912, DW_AT_accessibility(DW_ACCESS_public)
   12172                            .dwattr $C$DW$912, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
   12173                            .dwattr $C$DW$912, DW_AT_decl_line(0x4f3)
   12174                            .dwattr $C$DW$912, DW_AT_decl_column(0x13)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:34 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{623E3695-F231-449A-908B-500F977B1BA7} PAGE  223

   12175                    
   12176                            .dwattr $C$DW$T$57, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/M
   12177                            .dwattr $C$DW$T$57, DW_AT_decl_line(0x4ed)
   12178                            .dwattr $C$DW$T$57, DW_AT_decl_column(0x01)
   12179                            .dwendtag $C$DW$T$57
   12180                    
   12181                    $C$DW$T$205     .dwtag  DW_TAG_typedef
   12182                            .dwattr $C$DW$T$205, DW_AT_name("macMlmeCommStatusInd_t")
   12183                            .dwattr $C$DW$T$205, DW_AT_type(*$C$DW$T$57)
   12184                            .dwattr $C$DW$T$205, DW_AT_language(DW_LANG_C)
   12185                            .dwattr $C$DW$T$205, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/
   12186                            .dwattr $C$DW$T$205, DW_AT_decl_line(0x4f4)
   12187                            .dwattr $C$DW$T$205, DW_AT_decl_column(0x03)
   12188                    
   12189                    
   12190                    $C$DW$T$58      .dwtag  DW_TAG_structure_type
