TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:20 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{660A6764-99DA-4793-9BD5-2319D66F92D2} PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                        PC v16.9.4.LTS *
       3                    ;* Date/Time created: Sat Nov 18 18:46:20 2017                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../Application/LaunchPad/board_led.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v16.9.4.LTS Copyright (c) 1996-20
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Kevin\workspace_v7\sensor_cc1310lp\sensor_cc1310lp"
      13                    
      14                    $C$DW$1 .dwtag  DW_TAG_subprogram

TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:20 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{660A6764-99DA-4793-9BD5-2319D66F92D2} PAGE   66

    3572                            .dwattr $C$DW$T$814, DW_AT_type(*$C$DW$T$813)
    3573                            .dwattr $C$DW$T$814, DW_AT_language(DW_LANG_C)
    3574                            .dwattr $C$DW$T$814, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/
    3575                            .dwattr $C$DW$T$814, DW_AT_decl_line(0x43d)
    3576                            .dwattr $C$DW$T$814, DW_AT_decl_column(0x03)
    3577                    
    3578                    
    3579                    $C$DW$T$815     .dwtag  DW_TAG_enumeration_type
    3580                            .dwattr $C$DW$T$815, DW_AT_byte_size(0x01)
    3581                    $C$DW$338       .dwtag  DW_TAG_enumerator
    3582                            .dwattr $C$DW$338, DW_AT_name("ApiMac_wisunSubIE_USIE")
    3583                            .dwattr $C$DW$338, DW_AT_const_value(0x01)
    3584                            .dwattr $C$DW$338, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/ap
    3585                            .dwattr $C$DW$338, DW_AT_decl_line(0x443)
    3586                            .dwattr $C$DW$338, DW_AT_decl_column(0x05)
    3587                    
    3588                    $C$DW$339       .dwtag  DW_TAG_enumerator
    3589                            .dwattr $C$DW$339, DW_AT_name("ApiMac_wisunSubIE_BSIE")
    3590                            .dwattr $C$DW$339, DW_AT_const_value(0x02)
    3591                            .dwattr $C$DW$339, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/ap
    3592                            .dwattr $C$DW$339, DW_AT_decl_line(0x445)
    3593                            .dwattr $C$DW$339, DW_AT_decl_column(0x05)
    3594                    
    3595                    $C$DW$340       .dwtag  DW_TAG_enumerator
    3596                            .dwattr $C$DW$340, DW_AT_name("ApiMac_wisunSubIE_PANIE")
    3597                            .dwattr $C$DW$340, DW_AT_const_value(0x04)
    3598                            .dwattr $C$DW$340, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/ap
    3599                            .dwattr $C$DW$340, DW_AT_decl_line(0x447)
    3600                            .dwattr $C$DW$340, DW_AT_decl_column(0x05)
    3601                    
    3602                    $C$DW$341       .dwtag  DW_TAG_enumerator
    3603                            .dwattr $C$DW$341, DW_AT_name("ApiMac_wisunSubIE_netNameIE")
    3604                            .dwattr $C$DW$341, DW_AT_const_value(0x05)
    3605                            .dwattr $C$DW$341, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/ap
    3606                            .dwattr $C$DW$341, DW_AT_decl_line(0x449)
    3607                            .dwattr $C$DW$341, DW_AT_decl_column(0x05)
    3608                    
    3609                    $C$DW$342       .dwtag  DW_TAG_enumerator
    3610                            .dwattr $C$DW$342, DW_AT_name("ApiMac_wisunSubIE_PANVersionIE")
    3611                            .dwattr $C$DW$342, DW_AT_const_value(0x06)
    3612                            .dwattr $C$DW$342, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/ap
    3613                            .dwattr $C$DW$342, DW_AT_decl_line(0x44b)
    3614                            .dwattr $C$DW$342, DW_AT_decl_column(0x05)
    3615                    
    3616                    $C$DW$343       .dwtag  DW_TAG_enumerator
    3617                            .dwattr $C$DW$343, DW_AT_name("ApiMac_wisunSubIE_GTKHashIE")
    3618                            .dwattr $C$DW$343, DW_AT_const_value(0x07)
    3619                            .dwattr $C$DW$343, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/ap
    3620                            .dwattr $C$DW$343, DW_AT_decl_line(0x44d)
    3621                            .dwattr $C$DW$343, DW_AT_decl_column(0x05)
    3622                    
    3623                            .dwattr $C$DW$T$815, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/
    3624                            .dwattr $C$DW$T$815, DW_AT_decl_line(0x441)
    3625                            .dwattr $C$DW$T$815, DW_AT_decl_column(0x01)
    3626                            .dwendtag $C$DW$T$815
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:20 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{660A6764-99DA-4793-9BD5-2319D66F92D2} PAGE   67

    3627                    
    3628                    $C$DW$T$816     .dwtag  DW_TAG_typedef
    3629                            .dwattr $C$DW$T$816, DW_AT_name("ApiMac_wisunSubIE_t")
    3630                            .dwattr $C$DW$T$816, DW_AT_type(*$C$DW$T$815)
    3631                            .dwattr $C$DW$T$816, DW_AT_language(DW_LANG_C)
    3632                            .dwattr $C$DW$T$816, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/
    3633                            .dwattr $C$DW$T$816, DW_AT_decl_line(0x44e)
    3634                            .dwattr $C$DW$T$816, DW_AT_decl_column(0x03)
    3635                    
    3636                    
    3637                    $C$DW$T$141     .dwtag  DW_TAG_structure_type
    3638                            .dwattr $C$DW$T$141, DW_AT_byte_size(0x02)
    3639                    $C$DW$344       .dwtag  DW_TAG_member
    3640                            .dwattr $C$DW$344, DW_AT_type(*$C$DW$T$138)
    3641                            .dwattr $C$DW$344, DW_AT_name("state")
    3642                            .dwattr $C$DW$344, DW_AT_TI_symbol_name("state")
    3643                            .dwattr $C$DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3644                            .dwattr $C$DW$344, DW_AT_accessibility(DW_ACCESS_public)
    3645                            .dwattr $C$DW$344, DW_AT_decl_file("../Application/LaunchPad/board_led.c")
    3646                            .dwattr $C$DW$344, DW_AT_decl_line(0x52)
    3647                            .dwattr $C$DW$344, DW_AT_decl_column(0x15)
    3648                    
    3649                    $C$DW$345       .dwtag  DW_TAG_member
    3650                            .dwattr $C$DW$345, DW_AT_type(*$C$DW$T$140)
    3651                            .dwattr $C$DW$345, DW_AT_name("status")
    3652                            .dwattr $C$DW$345, DW_AT_TI_symbol_name("status")
    3653                            .dwattr $C$DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3654                            .dwattr $C$DW$345, DW_AT_accessibility(DW_ACCESS_public)
    3655                            .dwattr $C$DW$345, DW_AT_decl_file("../Application/LaunchPad/board_led.c")
    3656                            .dwattr $C$DW$345, DW_AT_decl_line(0x53)
    3657                            .dwattr $C$DW$345, DW_AT_decl_column(0x11)
    3658                    
    3659                            .dwattr $C$DW$T$141, DW_AT_decl_file("../Application/LaunchPad/board_led.c")
    3660                            .dwattr $C$DW$T$141, DW_AT_decl_line(0x51)
    3661                            .dwattr $C$DW$T$141, DW_AT_decl_column(0x01)
    3662                            .dwendtag $C$DW$T$141
    3663                    
    3664                    
    3665                    $C$DW$T$226     .dwtag  DW_TAG_array_type
    3666                            .dwattr $C$DW$T$226, DW_AT_type(*$C$DW$T$141)
    3667                            .dwattr $C$DW$T$226, DW_AT_language(DW_LANG_C)
    3668                            .dwattr $C$DW$T$226, DW_AT_byte_size(0x08)
    3669                    $C$DW$346       .dwtag  DW_TAG_subrange_type
    3670                            .dwattr $C$DW$346, DW_AT_upper_bound(0x03)
    3671                    
    3672                            .dwendtag $C$DW$T$226
    3673                    
    3674                    $C$DW$T$819     .dwtag  DW_TAG_typedef
    3675                            .dwattr $C$DW$T$819, DW_AT_name("board_led_status_t")
    3676                            .dwattr $C$DW$T$819, DW_AT_type(*$C$DW$T$141)
    3677                            .dwattr $C$DW$T$819, DW_AT_language(DW_LANG_C)
    3678                            .dwattr $C$DW$T$819, DW_AT_decl_file("../Application/LaunchPad/board_led.c")
    3679                            .dwattr $C$DW$T$819, DW_AT_decl_line(0x54)
    3680                            .dwattr $C$DW$T$819, DW_AT_decl_column(0x03)
    3681                    
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:20 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{660A6764-99DA-4793-9BD5-2319D66F92D2} PAGE   68

    3682                    
    3683                    $C$DW$T$820     .dwtag  DW_TAG_array_type
    3684                            .dwattr $C$DW$T$820, DW_AT_type(*$C$DW$T$819)
    3685                            .dwattr $C$DW$T$820, DW_AT_language(DW_LANG_C)
    3686                            .dwattr $C$DW$T$820, DW_AT_byte_size(0x08)
    3687                    $C$DW$347       .dwtag  DW_TAG_subrange_type
    3688                            .dwattr $C$DW$347, DW_AT_upper_bound(0x03)
    3689                    
    3690                            .dwendtag $C$DW$T$820
    3691                    
    3692                    
    3693                    $C$DW$T$142     .dwtag  DW_TAG_structure_type
    3694                            .dwattr $C$DW$T$142, DW_AT_byte_size(0x08)
    3695                    $C$DW$348       .dwtag  DW_TAG_member
    3696                            .dwattr $C$DW$348, DW_AT_type(*$C$DW$T$10)
    3697                            .dwattr $C$DW$348, DW_AT_name("quot")
    3698                            .dwattr $C$DW$348, DW_AT_TI_symbol_name("quot")
    3699                            .dwattr $C$DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3700                            .dwattr $C$DW$348, DW_AT_accessibility(DW_ACCESS_public)
    3701                            .dwattr $C$DW$348, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/s
    3702                            .dwattr $C$DW$348, DW_AT_decl_line(0x5c)
    3703                            .dwattr $C$DW$348, DW_AT_decl_column(0x16)
    3704                    
    3705                    $C$DW$349       .dwtag  DW_TAG_member
    3706                            .dwattr $C$DW$349, DW_AT_type(*$C$DW$T$10)
    3707                            .dwattr $C$DW$349, DW_AT_name("rem")
    3708                            .dwattr $C$DW$349, DW_AT_TI_symbol_name("rem")
    3709                            .dwattr $C$DW$349, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3710                            .dwattr $C$DW$349, DW_AT_accessibility(DW_ACCESS_public)
    3711                            .dwattr $C$DW$349, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/s
    3712                            .dwattr $C$DW$349, DW_AT_decl_line(0x5c)
    3713                            .dwattr $C$DW$349, DW_AT_decl_column(0x1c)
    3714                    
    3715                            .dwattr $C$DW$T$142, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include
    3716                            .dwattr $C$DW$T$142, DW_AT_decl_line(0x5c)
    3717                            .dwattr $C$DW$T$142, DW_AT_decl_column(0x10)
    3718                            .dwendtag $C$DW$T$142
    3719                    
    3720                    $C$DW$T$821     .dwtag  DW_TAG_typedef
    3721                            .dwattr $C$DW$T$821, DW_AT_name("div_t")
    3722                            .dwattr $C$DW$T$821, DW_AT_type(*$C$DW$T$142)
    3723                            .dwattr $C$DW$T$821, DW_AT_language(DW_LANG_C)
    3724                            .dwattr $C$DW$T$821, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include
    3725                            .dwattr $C$DW$T$821, DW_AT_decl_line(0x5c)
    3726                            .dwattr $C$DW$T$821, DW_AT_decl_column(0x23)
    3727                    
    3728                    
    3729                    $C$DW$T$143     .dwtag  DW_TAG_structure_type
    3730                            .dwattr $C$DW$T$143, DW_AT_byte_size(0x08)
    3731                    $C$DW$350       .dwtag  DW_TAG_member
    3732                            .dwattr $C$DW$350, DW_AT_type(*$C$DW$T$10)
    3733                            .dwattr $C$DW$350, DW_AT_name("quot")
    3734                            .dwattr $C$DW$350, DW_AT_TI_symbol_name("quot")
    3735                            .dwattr $C$DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3736                            .dwattr $C$DW$350, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:20 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{660A6764-99DA-4793-9BD5-2319D66F92D2} PAGE   69

    3737                            .dwattr $C$DW$350, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/s
    3738                            .dwattr $C$DW$350, DW_AT_decl_line(0x5e)
    3739                            .dwattr $C$DW$350, DW_AT_decl_column(0x16)
    3740                    
    3741                    $C$DW$351       .dwtag  DW_TAG_member
    3742                            .dwattr $C$DW$351, DW_AT_type(*$C$DW$T$10)
    3743                            .dwattr $C$DW$351, DW_AT_name("rem")
    3744                            .dwattr $C$DW$351, DW_AT_TI_symbol_name("rem")
    3745                            .dwattr $C$DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3746                            .dwattr $C$DW$351, DW_AT_accessibility(DW_ACCESS_public)
    3747                            .dwattr $C$DW$351, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/s
    3748                            .dwattr $C$DW$351, DW_AT_decl_line(0x5e)
    3749                            .dwattr $C$DW$351, DW_AT_decl_column(0x1c)
    3750                    
    3751                            .dwattr $C$DW$T$143, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include
    3752                            .dwattr $C$DW$T$143, DW_AT_decl_line(0x5e)
    3753                            .dwattr $C$DW$T$143, DW_AT_decl_column(0x10)
    3754                            .dwendtag $C$DW$T$143
    3755                    
    3756                    $C$DW$T$822     .dwtag  DW_TAG_typedef
    3757                            .dwattr $C$DW$T$822, DW_AT_name("ldiv_t")
    3758                            .dwattr $C$DW$T$822, DW_AT_type(*$C$DW$T$143)
    3759                            .dwattr $C$DW$T$822, DW_AT_language(DW_LANG_C)
    3760                            .dwattr $C$DW$T$822, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include
    3761                            .dwattr $C$DW$T$822, DW_AT_decl_line(0x5e)
    3762                            .dwattr $C$DW$T$822, DW_AT_decl_column(0x23)
    3763                    
    3764                    
    3765                    $C$DW$T$144     .dwtag  DW_TAG_structure_type
    3766                            .dwattr $C$DW$T$144, DW_AT_byte_size(0x10)
    3767                    $C$DW$352       .dwtag  DW_TAG_member
    3768                            .dwattr $C$DW$352, DW_AT_type(*$C$DW$T$14)
    3769                            .dwattr $C$DW$352, DW_AT_name("quot")
    3770                            .dwattr $C$DW$352, DW_AT_TI_symbol_name("quot")
    3771                            .dwattr $C$DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3772                            .dwattr $C$DW$352, DW_AT_accessibility(DW_ACCESS_public)
    3773                            .dwattr $C$DW$352, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/s
    3774                            .dwattr $C$DW$352, DW_AT_decl_line(0x61)
    3775                            .dwattr $C$DW$352, DW_AT_decl_column(0x1c)
    3776                    
    3777                    $C$DW$353       .dwtag  DW_TAG_member
    3778                            .dwattr $C$DW$353, DW_AT_type(*$C$DW$T$14)
    3779                            .dwattr $C$DW$353, DW_AT_name("rem")
    3780                            .dwattr $C$DW$353, DW_AT_TI_symbol_name("rem")
    3781                            .dwattr $C$DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3782                            .dwattr $C$DW$353, DW_AT_accessibility(DW_ACCESS_public)
    3783                            .dwattr $C$DW$353, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/s
    3784                            .dwattr $C$DW$353, DW_AT_decl_line(0x61)
    3785                            .dwattr $C$DW$353, DW_AT_decl_column(0x22)
    3786                    
    3787                            .dwattr $C$DW$T$144, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include
    3788                            .dwattr $C$DW$T$144, DW_AT_decl_line(0x61)
    3789                            .dwattr $C$DW$T$144, DW_AT_decl_column(0x10)
    3790                            .dwendtag $C$DW$T$144
    3791                    
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:20 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{660A6764-99DA-4793-9BD5-2319D66F92D2} PAGE   70

    3792                    $C$DW$T$823     .dwtag  DW_TAG_typedef
    3793                            .dwattr $C$DW$T$823, DW_AT_name("lldiv_t")
    3794                            .dwattr $C$DW$T$823, DW_AT_type(*$C$DW$T$144)
    3795                            .dwattr $C$DW$T$823, DW_AT_language(DW_LANG_C)
    3796                            .dwattr $C$DW$T$823, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include
    3797                            .dwattr $C$DW$T$823, DW_AT_decl_line(0x61)
    3798                            .dwattr $C$DW$T$823, DW_AT_decl_column(0x29)
    3799                    
    3800                    
    3801                    $C$DW$T$149     .dwtag  DW_TAG_structure_type
    3802                            .dwattr $C$DW$T$149, DW_AT_byte_size(0x08)
    3803                    $C$DW$354       .dwtag  DW_TAG_member
    3804                            .dwattr $C$DW$354, DW_AT_type(*$C$DW$T$147)
    3805                            .dwattr $C$DW$354, DW_AT_name("pointerStack")
    3806                            .dwattr $C$DW$354, DW_AT_TI_symbol_name("pointerStack")
    3807                            .dwattr $C$DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3808                            .dwattr $C$DW$354, DW_AT_accessibility(DW_ACCESS_public)
    3809                            .dwattr $C$DW$354, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    3810                            .dwattr $C$DW$354, DW_AT_decl_line(0x3f5)
    3811                            .dwattr $C$DW$354, DW_AT_decl_column(0x16)
    3812                    
    3813                    $C$DW$355       .dwtag  DW_TAG_member
    3814                            .dwattr $C$DW$355, DW_AT_type(*$C$DW$T$148)
    3815                            .dwattr $C$DW$355, DW_AT_name("directAPI")
    3816                            .dwattr $C$DW$355, DW_AT_TI_symbol_name("directAPI")
    3817                            .dwattr $C$DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3818                            .dwattr $C$DW$355, DW_AT_accessibility(DW_ACCESS_public)
    3819                            .dwattr $C$DW$355, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    3820                            .dwattr $C$DW$355, DW_AT_decl_line(0x3f6)
    3821                            .dwattr $C$DW$355, DW_AT_decl_column(0x15)
    3822                    
    3823                            .dwattr $C$DW$T$149, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154st
    3824                            .dwattr $C$DW$T$149, DW_AT_decl_line(0x3f4)
    3825                            .dwattr $C$DW$T$149, DW_AT_decl_column(0x01)
    3826                            .dwendtag $C$DW$T$149
    3827                    
    3828                    $C$DW$T$151     .dwtag  DW_TAG_typedef
    3829                            .dwattr $C$DW$T$151, DW_AT_name("icall_directAPIMsg_t")
    3830                            .dwattr $C$DW$T$151, DW_AT_type(*$C$DW$T$149)
    3831                            .dwattr $C$DW$T$151, DW_AT_language(DW_LANG_C)
    3832                            .dwattr $C$DW$T$151, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154st
    3833                            .dwattr $C$DW$T$151, DW_AT_decl_line(0x3f7)
    3834                            .dwattr $C$DW$T$151, DW_AT_decl_column(0x03)
    3835                    
    3836                    
    3837                    $C$DW$T$152     .dwtag  DW_TAG_structure_type
    3838                            .dwattr $C$DW$T$152, DW_AT_byte_size(0x14)
    3839                    $C$DW$356       .dwtag  DW_TAG_member
    3840                            .dwattr $C$DW$356, DW_AT_type(*$C$DW$T$150)
    3841                            .dwattr $C$DW$356, DW_AT_name("hdr")
    3842                            .dwattr $C$DW$356, DW_AT_TI_symbol_name("hdr")
    3843                            .dwattr $C$DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3844                            .dwattr $C$DW$356, DW_AT_accessibility(DW_ACCESS_public)
    3845                            .dwattr $C$DW$356, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    3846                            .dwattr $C$DW$356, DW_AT_decl_line(0x3fb)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:20 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{660A6764-99DA-4793-9BD5-2319D66F92D2} PAGE   71

    3847                            .dwattr $C$DW$356, DW_AT_decl_column(0x10)
    3848                    
    3849                    $C$DW$357       .dwtag  DW_TAG_member
    3850                            .dwattr $C$DW$357, DW_AT_type(*$C$DW$T$151)
    3851                            .dwattr $C$DW$357, DW_AT_name("msg")
    3852                            .dwattr $C$DW$357, DW_AT_TI_symbol_name("msg")
    3853                            .dwattr $C$DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3854                            .dwattr $C$DW$357, DW_AT_accessibility(DW_ACCESS_public)
    3855                            .dwattr $C$DW$357, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    3856                            .dwattr $C$DW$357, DW_AT_decl_line(0x3fc)
    3857                            .dwattr $C$DW$357, DW_AT_decl_column(0x1a)
    3858                    
    3859                            .dwattr $C$DW$T$152, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154st
    3860                            .dwattr $C$DW$T$152, DW_AT_decl_line(0x3fa)
    3861                            .dwattr $C$DW$T$152, DW_AT_decl_column(0x01)
    3862                            .dwendtag $C$DW$T$152
    3863                    
    3864                    $C$DW$T$824     .dwtag  DW_TAG_typedef
    3865                            .dwattr $C$DW$T$824, DW_AT_name("icallLiteMsg_t")
    3866                            .dwattr $C$DW$T$824, DW_AT_type(*$C$DW$T$152)
    3867                            .dwattr $C$DW$T$824, DW_AT_language(DW_LANG_C)
    3868                            .dwattr $C$DW$T$824, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154st
    3869                            .dwattr $C$DW$T$824, DW_AT_decl_line(0x3fd)
    3870                            .dwattr $C$DW$T$824, DW_AT_decl_column(0x03)
    3871                    
    3872                    
    3873                    $C$DW$T$193     .dwtag  DW_TAG_structure_type
    3874                            .dwattr $C$DW$T$193, DW_AT_byte_size(0x4c)
    3875                    $C$DW$358       .dwtag  DW_TAG_member
    3876                            .dwattr $C$DW$358, DW_AT_type(*$C$DW$T$157)
    3877                            .dwattr $C$DW$358, DW_AT_name("Crc32")
    3878                            .dwattr $C$DW$358, DW_AT_TI_symbol_name("Crc32")
    3879                            .dwattr $C$DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3880                            .dwattr $C$DW$358, DW_AT_accessibility(DW_ACCESS_public)
    3881                            .dwattr $C$DW$358, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    3882                            .dwattr $C$DW$358, DW_AT_decl_line(0x76)
    3883                            .dwattr $C$DW$358, DW_AT_decl_column(0x25)
    3884                    
    3885                    $C$DW$359       .dwtag  DW_TAG_member
    3886                            .dwattr $C$DW$359, DW_AT_type(*$C$DW$T$160)
    3887                            .dwattr $C$DW$359, DW_AT_name("FlashGetSize")
    3888                            .dwattr $C$DW$359, DW_AT_TI_symbol_name("FlashGetSize")
    3889                            .dwattr $C$DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3890                            .dwattr $C$DW$359, DW_AT_accessibility(DW_ACCESS_public)
    3891                            .dwattr $C$DW$359, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    3892                            .dwattr $C$DW$359, DW_AT_decl_line(0x77)
    3893                            .dwattr $C$DW$359, DW_AT_decl_column(0x25)
    3894                    
    3895                    $C$DW$360       .dwtag  DW_TAG_member
    3896                            .dwattr $C$DW$360, DW_AT_type(*$C$DW$T$161)
    3897                            .dwattr $C$DW$360, DW_AT_name("GetChipId")
    3898                            .dwattr $C$DW$360, DW_AT_TI_symbol_name("GetChipId")
    3899                            .dwattr $C$DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3900                            .dwattr $C$DW$360, DW_AT_accessibility(DW_ACCESS_public)
    3901                            .dwattr $C$DW$360, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:20 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{660A6764-99DA-4793-9BD5-2319D66F92D2} PAGE   72

    3902                            .dwattr $C$DW$360, DW_AT_decl_line(0x78)
    3903                            .dwattr $C$DW$360, DW_AT_decl_column(0x25)
    3904                    
    3905                    $C$DW$361       .dwtag  DW_TAG_member
    3906                            .dwattr $C$DW$361, DW_AT_type(*$C$DW$T$164)
    3907                            .dwattr $C$DW$361, DW_AT_name("ReservedLocation1")
    3908                            .dwattr $C$DW$361, DW_AT_TI_symbol_name("ReservedLocation1")
    3909                            .dwattr $C$DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3910                            .dwattr $C$DW$361, DW_AT_accessibility(DW_ACCESS_public)
    3911                            .dwattr $C$DW$361, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    3912                            .dwattr $C$DW$361, DW_AT_decl_line(0x79)
    3913                            .dwattr $C$DW$361, DW_AT_decl_column(0x25)
    3914                    
    3915                    $C$DW$362       .dwtag  DW_TAG_member
    3916                            .dwattr $C$DW$362, DW_AT_type(*$C$DW$T$165)
    3917                            .dwattr $C$DW$362, DW_AT_name("ReservedLocation2")
    3918                            .dwattr $C$DW$362, DW_AT_TI_symbol_name("ReservedLocation2")
    3919                            .dwattr $C$DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3920                            .dwattr $C$DW$362, DW_AT_accessibility(DW_ACCESS_public)
    3921                            .dwattr $C$DW$362, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    3922                            .dwattr $C$DW$362, DW_AT_decl_line(0x7a)
    3923                            .dwattr $C$DW$362, DW_AT_decl_column(0x25)
    3924                    
    3925                    $C$DW$363       .dwtag  DW_TAG_member
    3926                            .dwattr $C$DW$363, DW_AT_type(*$C$DW$T$166)
    3927                            .dwattr $C$DW$363, DW_AT_name("ReservedLocation3")
    3928                            .dwattr $C$DW$363, DW_AT_TI_symbol_name("ReservedLocation3")
    3929                            .dwattr $C$DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3930                            .dwattr $C$DW$363, DW_AT_accessibility(DW_ACCESS_public)
    3931                            .dwattr $C$DW$363, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    3932                            .dwattr $C$DW$363, DW_AT_decl_line(0x7b)
    3933                            .dwattr $C$DW$363, DW_AT_decl_column(0x25)
    3934                    
    3935                    $C$DW$364       .dwtag  DW_TAG_member
    3936                            .dwattr $C$DW$364, DW_AT_type(*$C$DW$T$169)
    3937                            .dwattr $C$DW$364, DW_AT_name("ResetDevice")
    3938                            .dwattr $C$DW$364, DW_AT_TI_symbol_name("ResetDevice")
    3939                            .dwattr $C$DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3940                            .dwattr $C$DW$364, DW_AT_accessibility(DW_ACCESS_public)
    3941                            .dwattr $C$DW$364, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    3942                            .dwattr $C$DW$364, DW_AT_decl_line(0x7c)
    3943                            .dwattr $C$DW$364, DW_AT_decl_column(0x25)
    3944                    
    3945                    $C$DW$365       .dwtag  DW_TAG_member
    3946                            .dwattr $C$DW$365, DW_AT_type(*$C$DW$T$174)
    3947                            .dwattr $C$DW$365, DW_AT_name("Fletcher32")
    3948                            .dwattr $C$DW$365, DW_AT_TI_symbol_name("Fletcher32")
    3949                            .dwattr $C$DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3950                            .dwattr $C$DW$365, DW_AT_accessibility(DW_ACCESS_public)
    3951                            .dwattr $C$DW$365, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    3952                            .dwattr $C$DW$365, DW_AT_decl_line(0x7d)
    3953                            .dwattr $C$DW$365, DW_AT_decl_column(0x25)
    3954                    
    3955                    $C$DW$366       .dwtag  DW_TAG_member
    3956                            .dwattr $C$DW$366, DW_AT_type(*$C$DW$T$178)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:20 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{660A6764-99DA-4793-9BD5-2319D66F92D2} PAGE   73

    3957                            .dwattr $C$DW$366, DW_AT_name("MinValue")
    3958                            .dwattr $C$DW$366, DW_AT_TI_symbol_name("MinValue")
    3959                            .dwattr $C$DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    3960                            .dwattr $C$DW$366, DW_AT_accessibility(DW_ACCESS_public)
    3961                            .dwattr $C$DW$366, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    3962                            .dwattr $C$DW$366, DW_AT_decl_line(0x7e)
    3963                            .dwattr $C$DW$366, DW_AT_decl_column(0x25)
    3964                    
    3965                    $C$DW$367       .dwtag  DW_TAG_member
    3966                            .dwattr $C$DW$367, DW_AT_type(*$C$DW$T$179)
    3967                            .dwattr $C$DW$367, DW_AT_name("MaxValue")
    3968                            .dwattr $C$DW$367, DW_AT_TI_symbol_name("MaxValue")
    3969                            .dwattr $C$DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    3970                            .dwattr $C$DW$367, DW_AT_accessibility(DW_ACCESS_public)
    3971                            .dwattr $C$DW$367, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    3972                            .dwattr $C$DW$367, DW_AT_decl_line(0x7f)
    3973                            .dwattr $C$DW$367, DW_AT_decl_column(0x25)
    3974                    
    3975                    $C$DW$368       .dwtag  DW_TAG_member
    3976                            .dwattr $C$DW$368, DW_AT_type(*$C$DW$T$180)
    3977                            .dwattr $C$DW$368, DW_AT_name("MeanValue")
    3978                            .dwattr $C$DW$368, DW_AT_TI_symbol_name("MeanValue")
    3979                            .dwattr $C$DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    3980                            .dwattr $C$DW$368, DW_AT_accessibility(DW_ACCESS_public)
    3981                            .dwattr $C$DW$368, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    3982                            .dwattr $C$DW$368, DW_AT_decl_line(0x80)
    3983                            .dwattr $C$DW$368, DW_AT_decl_column(0x25)
    3984                    
    3985                    $C$DW$369       .dwtag  DW_TAG_member
    3986                            .dwattr $C$DW$369, DW_AT_type(*$C$DW$T$181)
    3987                            .dwattr $C$DW$369, DW_AT_name("StandDeviationValue")
    3988                            .dwattr $C$DW$369, DW_AT_TI_symbol_name("StandDeviationValue")
    3989                            .dwattr $C$DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    3990                            .dwattr $C$DW$369, DW_AT_accessibility(DW_ACCESS_public)
    3991                            .dwattr $C$DW$369, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    3992                            .dwattr $C$DW$369, DW_AT_decl_line(0x81)
    3993                            .dwattr $C$DW$369, DW_AT_decl_column(0x25)
    3994                    
    3995                    $C$DW$370       .dwtag  DW_TAG_member
    3996                            .dwattr $C$DW$370, DW_AT_type(*$C$DW$T$184)
    3997                            .dwattr $C$DW$370, DW_AT_name("ReservedLocation4")
    3998                            .dwattr $C$DW$370, DW_AT_TI_symbol_name("ReservedLocation4")
    3999                            .dwattr $C$DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    4000                            .dwattr $C$DW$370, DW_AT_accessibility(DW_ACCESS_public)
    4001                            .dwattr $C$DW$370, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    4002                            .dwattr $C$DW$370, DW_AT_decl_line(0x82)
    4003                            .dwattr $C$DW$370, DW_AT_decl_column(0x25)
    4004                    
    4005                    $C$DW$371       .dwtag  DW_TAG_member
    4006                            .dwattr $C$DW$371, DW_AT_type(*$C$DW$T$185)
    4007                            .dwattr $C$DW$371, DW_AT_name("ReservedLocation5")
    4008                            .dwattr $C$DW$371, DW_AT_TI_symbol_name("ReservedLocation5")
    4009                            .dwattr $C$DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    4010                            .dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)
    4011                            .dwattr $C$DW$371, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:20 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{660A6764-99DA-4793-9BD5-2319D66F92D2} PAGE   74

    4012                            .dwattr $C$DW$371, DW_AT_decl_line(0x83)
    4013                            .dwattr $C$DW$371, DW_AT_decl_column(0x25)
    4014                    
    4015                    $C$DW$372       .dwtag  DW_TAG_member
    4016                            .dwattr $C$DW$372, DW_AT_type(*$C$DW$T$186)
    4017                            .dwattr $C$DW$372, DW_AT_name("HFSourceSafeSwitch")
    4018                            .dwattr $C$DW$372, DW_AT_TI_symbol_name("HFSourceSafeSwitch")
    4019                            .dwattr $C$DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    4020                            .dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)
    4021                            .dwattr $C$DW$372, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    4022                            .dwattr $C$DW$372, DW_AT_decl_line(0x84)
    4023                            .dwattr $C$DW$372, DW_AT_decl_column(0x25)
    4024                    
    4025                    $C$DW$373       .dwtag  DW_TAG_member
    4026                            .dwattr $C$DW$373, DW_AT_type(*$C$DW$T$189)
    4027                            .dwattr $C$DW$373, DW_AT_name("SelectCompAInput")
    4028                            .dwattr $C$DW$373, DW_AT_TI_symbol_name("SelectCompAInput")
    4029                            .dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    4030                            .dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)
    4031                            .dwattr $C$DW$373, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    4032                            .dwattr $C$DW$373, DW_AT_decl_line(0x85)
    4033                            .dwattr $C$DW$373, DW_AT_decl_column(0x25)
    4034                    
    4035                    $C$DW$374       .dwtag  DW_TAG_member
    4036                            .dwattr $C$DW$374, DW_AT_type(*$C$DW$T$190)
    4037                            .dwattr $C$DW$374, DW_AT_name("SelectCompARef")
    4038                            .dwattr $C$DW$374, DW_AT_TI_symbol_name("SelectCompARef")
    4039                            .dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    4040                            .dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
    4041                            .dwattr $C$DW$374, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    4042                            .dwattr $C$DW$374, DW_AT_decl_line(0x86)
    4043                            .dwattr $C$DW$374, DW_AT_decl_column(0x25)
    4044                    
    4045                    $C$DW$375       .dwtag  DW_TAG_member
    4046                            .dwattr $C$DW$375, DW_AT_type(*$C$DW$T$191)
    4047                            .dwattr $C$DW$375, DW_AT_name("SelectADCCompBInput")
    4048                            .dwattr $C$DW$375, DW_AT_TI_symbol_name("SelectADCCompBInput")
    4049                            .dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    4050                            .dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)
    4051                            .dwattr $C$DW$375, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    4052                            .dwattr $C$DW$375, DW_AT_decl_line(0x87)
    4053                            .dwattr $C$DW$375, DW_AT_decl_column(0x25)
    4054                    
    4055                    $C$DW$376       .dwtag  DW_TAG_member
    4056                            .dwattr $C$DW$376, DW_AT_type(*$C$DW$T$192)
    4057                            .dwattr $C$DW$376, DW_AT_name("SelectCompBRef")
    4058                            .dwattr $C$DW$376, DW_AT_TI_symbol_name("SelectCompBRef")
    4059                            .dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    4060                            .dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)
    4061                            .dwattr $C$DW$376, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    4062                            .dwattr $C$DW$376, DW_AT_decl_line(0x88)
    4063                            .dwattr $C$DW$376, DW_AT_decl_column(0x25)
    4064                    
    4065                            .dwattr $C$DW$T$193, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices
    4066                            .dwattr $C$DW$T$193, DW_AT_decl_line(0x75)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:20 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{660A6764-99DA-4793-9BD5-2319D66F92D2} PAGE   75

    4067                            .dwattr $C$DW$T$193, DW_AT_decl_column(0x01)
    4068                            .dwendtag $C$DW$T$193
    4069                    
    4070                    $C$DW$T$825     .dwtag  DW_TAG_typedef
    4071                            .dwattr $C$DW$T$825, DW_AT_name("HARD_API_T")
    4072                            .dwattr $C$DW$T$825, DW_AT_type(*$C$DW$T$193)
    4073                            .dwattr $C$DW$T$825, DW_AT_language(DW_LANG_C)
    4074                            .dwattr $C$DW$T$825, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices
    4075                            .dwattr $C$DW$T$825, DW_AT_decl_line(0x89)
    4076                            .dwattr $C$DW$T$825, DW_AT_decl_column(0x03)
    4077                    
    4078                    
    4079                    $C$DW$T$196     .dwtag  DW_TAG_structure_type
    4080                            .dwattr $C$DW$T$196, DW_AT_byte_size(0x08)
    4081                    $C$DW$377       .dwtag  DW_TAG_member
    4082                            .dwattr $C$DW$377, DW_AT_type(*$C$DW$T$10)
    4083                            .dwattr $C$DW$377, DW_AT_name("length")
    4084                            .dwattr $C$DW$377, DW_AT_TI_symbol_name("length")
    4085                            .dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4086                            .dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)
    4087                            .dwattr $C$DW$377, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/kernel/tirtos/packa
    4088                            .dwattr $C$DW$377, DW_AT_decl_line(0x165)
    4089                            .dwattr $C$DW$377, DW_AT_decl_column(0x16)
    4090                    
    4091                    $C$DW$378       .dwtag  DW_TAG_member
    4092                            .dwattr $C$DW$378, DW_AT_type(*$C$DW$T$195)
    4093                            .dwattr $C$DW$378, DW_AT_name("elem")
    4094                            .dwattr $C$DW$378, DW_AT_TI_symbol_name("elem")
    4095                            .dwattr $C$DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4096                            .dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)
    4097                            .dwattr $C$DW$378, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/kernel/tirtos/packa
    4098                            .dwattr $C$DW$378, DW_AT_decl_line(0x165)
    4099                            .dwattr $C$DW$378, DW_AT_decl_column(0x3a)
    4100                    
    4101                            .dwattr $C$DW$T$196, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/kernel/tirtos/pac
    4102                            .dwattr $C$DW$T$196, DW_AT_decl_line(0x165)
    4103                            .dwattr $C$DW$T$196, DW_AT_decl_column(0x10)
    4104                            .dwendtag $C$DW$T$196
    4105                    
    4106                    $C$DW$T$826     .dwtag  DW_TAG_typedef
    4107                            .dwattr $C$DW$T$826, DW_AT_name("__ARRAY1_ti_sysbios_knl_Swi_hooks")
    4108                            .dwattr $C$DW$T$826, DW_AT_type(*$C$DW$T$196)
    4109                            .dwattr $C$DW$T$826, DW_AT_language(DW_LANG_C)
    4110                            .dwattr $C$DW$T$826, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/kernel/tirtos/pac
    4111                            .dwattr $C$DW$T$826, DW_AT_decl_line(0x165)
    4112                            .dwattr $C$DW$T$826, DW_AT_decl_column(0x42)
    4113                    
    4114                    
    4115                    $C$DW$T$199     .dwtag  DW_TAG_structure_type
    4116                            .dwattr $C$DW$T$199, DW_AT_byte_size(0x08)
    4117                    $C$DW$379       .dwtag  DW_TAG_member
    4118                            .dwattr $C$DW$379, DW_AT_type(*$C$DW$T$10)
    4119                            .dwattr $C$DW$379, DW_AT_name("length")
    4120                            .dwattr $C$DW$379, DW_AT_TI_symbol_name("length")
    4121                            .dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:20 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{660A6764-99DA-4793-9BD5-2319D66F92D2} PAGE   76

    4122                            .dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)
    4123                            .dwattr $C$DW$379, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/kernel/tirtos/packa
    4124                            .dwattr $C$DW$379, DW_AT_decl_line(0x166)
    4125                            .dwattr $C$DW$379, DW_AT_decl_column(0x16)
    4126                    
    4127                    $C$DW$380       .dwtag  DW_TAG_member
    4128                            .dwattr $C$DW$380, DW_AT_type(*$C$DW$T$198)
    4129                            .dwattr $C$DW$380, DW_AT_name("elem")
    4130                            .dwattr $C$DW$380, DW_AT_TI_symbol_name("elem")
    4131                            .dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4132                            .dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
    4133                            .dwattr $C$DW$380, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/kernel/tirtos/packa
    4134                            .dwattr $C$DW$380, DW_AT_decl_line(0x166)
    4135                            .dwattr $C$DW$380, DW_AT_decl_column(0x40)
    4136                    
    4137                            .dwattr $C$DW$T$199, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/kernel/tirtos/pac
    4138                            .dwattr $C$DW$T$199, DW_AT_decl_line(0x166)
    4139                            .dwattr $C$DW$T$199, DW_AT_decl_column(0x10)
    4140                            .dwendtag $C$DW$T$199
    4141                    
    4142                    $C$DW$T$827     .dwtag  DW_TAG_typedef
    4143                            .dwattr $C$DW$T$827, DW_AT_name("__CARRAY1_ti_sysbios_knl_Swi_hooks")
    4144                            .dwattr $C$DW$T$827, DW_AT_type(*$C$DW$T$199)
    4145                            .dwattr $C$DW$T$827, DW_AT_language(DW_LANG_C)
    4146                            .dwattr $C$DW$T$827, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/kernel/tirtos/pac
    4147                            .dwattr $C$DW$T$827, DW_AT_decl_line(0x166)
    4148                            .dwattr $C$DW$T$827, DW_AT_decl_column(0x48)
    4149                    
    4150                    $C$DW$T$828     .dwtag  DW_TAG_typedef
    4151                            .dwattr $C$DW$T$828, DW_AT_name("CT__ti_sysbios_knl_Swi_hooks")
    4152                            .dwattr $C$DW$T$828, DW_AT_type(*$C$DW$T$827)
    4153                            .dwattr $C$DW$T$828, DW_AT_language(DW_LANG_C)
    4154                            .dwattr $C$DW$T$828, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/kernel/tirtos/pac
    4155                            .dwattr $C$DW$T$828, DW_AT_decl_line(0x168)
    4156                            .dwattr $C$DW$T$828, DW_AT_decl_column(0x2c)
    4157                    
    4158                    $C$DW$T$829     .dwtag  DW_TAG_typedef
    4159                            .dwattr $C$DW$T$829, DW_AT_name("__TA_ti_sysbios_knl_Swi_hooks")
    4160                            .dwattr $C$DW$T$829, DW_AT_type(*$C$DW$T$827)
    4161                            .dwattr $C$DW$T$829, DW_AT_language(DW_LANG_C)
    4162                            .dwattr $C$DW$T$829, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/kernel/tirtos/pac
    4163                            .dwattr $C$DW$T$829, DW_AT_decl_line(0x167)
    4164                            .dwattr $C$DW$T$829, DW_AT_decl_column(0x2c)
    4165                    
    4166                    
    4167                    $C$DW$T$202     .dwtag  DW_TAG_structure_type
    4168                            .dwattr $C$DW$T$202, DW_AT_byte_size(0x0a)
    4169                    $C$DW$381       .dwtag  DW_TAG_member
    4170                            .dwattr $C$DW$381, DW_AT_type(*$C$DW$T$219)
    4171                            .dwattr $C$DW$381, DW_AT_name("addr")
    4172                            .dwattr $C$DW$381, DW_AT_TI_symbol_name("addr")
    4173                            .dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4174                            .dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
    4175                            .dwattr $C$DW$381, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/ap
    4176                            .dwattr $C$DW$381, DW_AT_decl_line(0x4a7)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:20 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{660A6764-99DA-4793-9BD5-2319D66F92D2} PAGE   77

    4177                            .dwattr $C$DW$381, DW_AT_decl_column(0x07)
    4178                    
    4179                    $C$DW$382       .dwtag  DW_TAG_member
    4180                            .dwattr $C$DW$382, DW_AT_type(*$C$DW$T$201)
    4181                            .dwattr $C$DW$382, DW_AT_name("addrMode")
    4182                            .dwattr $C$DW$382, DW_AT_TI_symbol_name("addrMode")
    4183                            .dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4184                            .dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
    4185                            .dwattr $C$DW$382, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/ap
    4186                            .dwattr $C$DW$382, DW_AT_decl_line(0x4aa)
    4187                            .dwattr $C$DW$382, DW_AT_decl_column(0x17)
    4188                    
    4189                            .dwattr $C$DW$T$202, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/
    4190                            .dwattr $C$DW$T$202, DW_AT_decl_line(0x49c)
    4191                            .dwattr $C$DW$T$202, DW_AT_decl_column(0x01)
    4192                            .dwendtag $C$DW$T$202
    4193                    
    4194                    $C$DW$T$361     .dwtag  DW_TAG_typedef
    4195                            .dwattr $C$DW$T$361, DW_AT_name("ApiMac_sAddr_t")
    4196                            .dwattr $C$DW$T$361, DW_AT_type(*$C$DW$T$202)
    4197                            .dwattr $C$DW$T$361, DW_AT_language(DW_LANG_C)
    4198                            .dwattr $C$DW$T$361, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/
    4199                            .dwattr $C$DW$T$361, DW_AT_decl_line(0x4ab)
    4200                            .dwattr $C$DW$T$361, DW_AT_decl_column(0x03)
    4201                    
    4202                    
    4203                    $C$DW$T$206     .dwtag  DW_TAG_structure_type
    4204                            .dwattr $C$DW$T$206, DW_AT_byte_size(0x40)
    4205                    $C$DW$383       .dwtag  DW_TAG_member
    4206                            .dwattr $C$DW$383, DW_AT_type(*$C$DW$T$204)
    4207                            .dwattr $C$DW$383, DW_AT_name("beaconType")
    4208                            .dwattr $C$DW$383, DW_AT_TI_symbol_name("beaconType")
    4209                            .dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4210                            .dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)
    4211                            .dwattr $C$DW$383, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/ap
    4212                            .dwattr $C$DW$383, DW_AT_decl_line(0x848)
    4213                            .dwattr $C$DW$383, DW_AT_decl_column(0x19)
    4214                    
    4215                    $C$DW$384       .dwtag  DW_TAG_member
    4216                            .dwattr $C$DW$384, DW_AT_type(*$C$DW$T$153)
    4217                            .dwattr $C$DW$384, DW_AT_name("bsn")
    4218                            .dwattr $C$DW$384, DW_AT_TI_symbol_name("bsn")
    4219                            .dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4220                            .dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)
    4221                            .dwattr $C$DW$384, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/ap
    4222                            .dwattr $C$DW$384, DW_AT_decl_line(0x84a)
    4223                            .dwattr $C$DW$384, DW_AT_decl_column(0x0d)
    4224                    
    4225                    $C$DW$385       .dwtag  DW_TAG_member
    4226                            .dwattr $C$DW$385, DW_AT_type(*$C$DW$T$205)
    4227                            .dwattr $C$DW$385, DW_AT_name("panDesc")
    4228                            .dwattr $C$DW$385, DW_AT_TI_symbol_name("panDesc")
    4229                            .dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4230                            .dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
    4231                            .dwattr $C$DW$385, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/ap
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:20 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{660A6764-99DA-4793-9BD5-2319D66F92D2} PAGE   78

    4232                            .dwattr $C$DW$385, DW_AT_decl_line(0x84c)
    4233                            .dwattr $C$DW$385, DW_AT_decl_column(0x16)
    4234                    
    4235                    $C$DW$386       .dwtag  DW_TAG_member
    4236                            .dwattr $C$DW$386, DW_AT_type(*$C$DW$T$222)
    4237                            .dwattr $C$DW$386, DW_AT_name("beaconData")
    4238                            .dwattr $C$DW$386, DW_AT_TI_symbol_name("beaconData")
    4239                            .dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    4240                            .dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
    4241                            .dwattr $C$DW$386, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/ap
    4242                            .dwattr $C$DW$386, DW_AT_decl_line(0x857)
    4243                            .dwattr $C$DW$386, DW_AT_decl_column(0x07)
    4244                    
    4245                            .dwattr $C$DW$T$206, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/
    4246                            .dwattr $C$DW$T$206, DW_AT_decl_line(0x846)
    4247                            .dwattr $C$DW$T$206, DW_AT_decl_column(0x01)
    4248                            .dwendtag $C$DW$T$206
    4249                    
    4250                    $C$DW$T$273     .dwtag  DW_TAG_typedef
    4251                            .dwattr $C$DW$T$273, DW_AT_name("ApiMac_mlmeBeaconNotifyInd_t")
    4252                            .dwattr $C$DW$T$273, DW_AT_type(*$C$DW$T$206)
    4253                            .dwattr $C$DW$T$273, DW_AT_language(DW_LANG_C)
    4254                            .dwattr $C$DW$T$273, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/
    4255                            .dwattr $C$DW$T$273, DW_AT_decl_line(0x858)
    4256                            .dwattr $C$DW$T$273, DW_AT_decl_column(0x03)
    4257                    
    4258                    $C$DW$T$274     .dwtag  DW_TAG_pointer_type
    4259                            .dwattr $C$DW$T$274, DW_AT_type(*$C$DW$T$273)
    4260                            .dwattr $C$DW$T$274, DW_AT_address_class(0x20)
    4261                    
    4262                    
    4263                    $C$DW$T$210     .dwtag  DW_TAG_union_type
    4264                            .dwattr $C$DW$T$210, DW_AT_byte_size(0x04)
    4265                    $C$DW$387       .dwtag  DW_TAG_member
    4266                            .dwattr $C$DW$387, DW_AT_type(*$C$DW$T$207)
    4267                            .dwattr $C$DW$387, DW_AT_name("f")
    4268                            .dwattr $C$DW$387, DW_AT_TI_symbol_name("f")
    4269                            .dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4270                            .dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)
    4271                            .dwattr $C$DW$387, DW_AT_decl_file("C:/ti/xdctools_3_50_03_33_core/packages/xdc/std.h")
    4272                            .dwattr $C$DW$387, DW_AT_decl_line(0xb7)
    4273                            .dwattr $C$DW$387, DW_AT_decl_column(0x0f)
    4274                    
    4275                    $C$DW$388       .dwtag  DW_TAG_member
    4276                            .dwattr $C$DW$388, DW_AT_type(*$C$DW$T$209)
    4277                            .dwattr $C$DW$388, DW_AT_name("a")
    4278                            .dwattr $C$DW$388, DW_AT_TI_symbol_name("a")
    4279                            .dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4280                            .dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)
    4281                            .dwattr $C$DW$388, DW_AT_decl_file("C:/ti/xdctools_3_50_03_33_core/packages/xdc/std.h")
    4282                            .dwattr $C$DW$388, DW_AT_decl_line(0xb8)
    4283                            .dwattr $C$DW$388, DW_AT_decl_column(0x0f)
    4284                    
    4285                            .dwattr $C$DW$T$210, DW_AT_decl_file("C:/ti/xdctools_3_50_03_33_core/packages/xdc/std.h")
    4286                            .dwattr $C$DW$T$210, DW_AT_decl_line(0xb6)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:20 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{660A6764-99DA-4793-9BD5-2319D66F92D2} PAGE   79

    4287                            .dwattr $C$DW$T$210, DW_AT_decl_column(0x0f)
    4288                            .dwendtag $C$DW$T$210
    4289                    
    4290                    $C$DW$T$830     .dwtag  DW_TAG_typedef
    4291                            .dwattr $C$DW$T$830, DW_AT_name("xdc_FloatData")
    4292                            .dwattr $C$DW$T$830, DW_AT_type(*$C$DW$T$210)
    4293                            .dwattr $C$DW$T$830, DW_AT_language(DW_LANG_C)
    4294                            .dwattr $C$DW$T$830, DW_AT_decl_file("C:/ti/xdctools_3_50_03_33_core/packages/xdc/std.h")
    4295                            .dwattr $C$DW$T$830, DW_AT_decl_line(0xb9)
    4296                            .dwattr $C$DW$T$830, DW_AT_decl_column(0x03)
    4297                    
    4298                    
    4299                    $C$DW$T$215     .dwtag  DW_TAG_union_type
    4300                            .dwattr $C$DW$T$215, DW_AT_byte_size(0x02)
    4301                    $C$DW$389       .dwtag  DW_TAG_member
    4302                            .dwattr $C$DW$389, DW_AT_type(*$C$DW$T$212)
    4303                            .dwattr $C$DW$389, DW_AT_name("entityId")
    4304                            .dwattr $C$DW$389, DW_AT_TI_symbol_name("entityId")
    4305                            .dwattr $C$DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4306                            .dwattr $C$DW$389, DW_AT_accessibility(DW_ACCESS_public)
    4307                            .dwattr $C$DW$389, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    4308                            .dwattr $C$DW$389, DW_AT_decl_line(0x1fe)
    4309                            .dwattr $C$DW$389, DW_AT_decl_column(0x14)
    4310                    
    4311                    $C$DW$390       .dwtag  DW_TAG_member
    4312                            .dwattr $C$DW$390, DW_AT_type(*$C$DW$T$214)
    4313                            .dwattr $C$DW$390, DW_AT_name("servId")
    4314                            .dwattr $C$DW$390, DW_AT_TI_symbol_name("servId")
    4315                            .dwattr $C$DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4316                            .dwattr $C$DW$390, DW_AT_accessibility(DW_ACCESS_public)
    4317                            .dwattr $C$DW$390, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    4318                            .dwattr $C$DW$390, DW_AT_decl_line(0x200)
    4319                            .dwattr $C$DW$390, DW_AT_decl_column(0x17)
    4320                    
    4321                            .dwattr $C$DW$T$215, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154st
    4322                            .dwattr $C$DW$T$215, DW_AT_decl_line(0x1fc)
    4323                            .dwattr $C$DW$T$215, DW_AT_decl_column(0x03)
    4324                            .dwendtag $C$DW$T$215
    4325                    
    4326                    
    4327                    $C$DW$T$216     .dwtag  DW_TAG_union_type
    4328                            .dwattr $C$DW$T$216, DW_AT_byte_size(0x02)
    4329                    $C$DW$391       .dwtag  DW_TAG_member
    4330                            .dwattr $C$DW$391, DW_AT_type(*$C$DW$T$214)
    4331                            .dwattr $C$DW$391, DW_AT_name("servId")
    4332                            .dwattr $C$DW$391, DW_AT_TI_symbol_name("servId")
    4333                            .dwattr $C$DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4334                            .dwattr $C$DW$391, DW_AT_accessibility(DW_ACCESS_public)
    4335                            .dwattr $C$DW$391, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    4336                            .dwattr $C$DW$391, DW_AT_decl_line(0x211)
    4337                            .dwattr $C$DW$391, DW_AT_decl_column(0x17)
    4338                    
    4339                    $C$DW$392       .dwtag  DW_TAG_member
    4340                            .dwattr $C$DW$392, DW_AT_type(*$C$DW$T$212)
    4341                            .dwattr $C$DW$392, DW_AT_name("entityId")
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:20 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{660A6764-99DA-4793-9BD5-2319D66F92D2} PAGE   80

    4342                            .dwattr $C$DW$392, DW_AT_TI_symbol_name("entityId")
    4343                            .dwattr $C$DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4344                            .dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)
    4345                            .dwattr $C$DW$392, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    4346                            .dwattr $C$DW$392, DW_AT_decl_line(0x213)
    4347                            .dwattr $C$DW$392, DW_AT_decl_column(0x14)
    4348                    
    4349                            .dwattr $C$DW$T$216, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154st
    4350                            .dwattr $C$DW$T$216, DW_AT_decl_line(0x20f)
    4351                            .dwattr $C$DW$T$216, DW_AT_decl_column(0x03)
    4352                            .dwendtag $C$DW$T$216
    4353                    
    4354                    
    4355                    $C$DW$T$219     .dwtag  DW_TAG_union_type
    4356                            .dwattr $C$DW$T$219, DW_AT_byte_size(0x08)
    4357                    $C$DW$393       .dwtag  DW_TAG_member
    4358                            .dwattr $C$DW$393, DW_AT_type(*$C$DW$T$170)
    4359                            .dwattr $C$DW$393, DW_AT_name("shortAddr")
    4360                            .dwattr $C$DW$393, DW_AT_TI_symbol_name("shortAddr")
    4361                            .dwattr $C$DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4362                            .dwattr $C$DW$393, DW_AT_accessibility(DW_ACCESS_public)
    4363                            .dwattr $C$DW$393, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/ap
    4364                            .dwattr $C$DW$393, DW_AT_decl_line(0x4a4)
    4365                            .dwattr $C$DW$393, DW_AT_decl_column(0x12)
    4366                    
    4367                    $C$DW$394       .dwtag  DW_TAG_member
    4368                            .dwattr $C$DW$394, DW_AT_type(*$C$DW$T$218)
    4369                            .dwattr $C$DW$394, DW_AT_name("extAddr")
    4370                            .dwattr $C$DW$394, DW_AT_TI_symbol_name("extAddr")
    4371                            .dwattr $C$DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4372                            .dwattr $C$DW$394, DW_AT_accessibility(DW_ACCESS_public)
    4373                            .dwattr $C$DW$394, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/ap
    4374                            .dwattr $C$DW$394, DW_AT_decl_line(0x4a6)
    4375                            .dwattr $C$DW$394, DW_AT_decl_column(0x1b)
    4376                    
    4377                            .dwattr $C$DW$T$219, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/
    4378                            .dwattr $C$DW$T$219, DW_AT_decl_line(0x4a2)
    4379                            .dwattr $C$DW$T$219, DW_AT_decl_column(0x05)
    4380                            .dwendtag $C$DW$T$219
    4381                    
    4382                    
    4383                    $C$DW$T$222     .dwtag  DW_TAG_union_type
    4384                            .dwattr $C$DW$T$222, DW_AT_byte_size(0x18)
    4385                    $C$DW$395       .dwtag  DW_TAG_member
    4386                            .dwattr $C$DW$395, DW_AT_type(*$C$DW$T$220)
    4387                            .dwattr $C$DW$395, DW_AT_name("beacon")
    4388                            .dwattr $C$DW$395, DW_AT_TI_symbol_name("beacon")
    4389                            .dwattr $C$DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4390                            .dwattr $C$DW$395, DW_AT_accessibility(DW_ACCESS_public)
    4391                            .dwattr $C$DW$395, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/ap
    4392                            .dwattr $C$DW$395, DW_AT_decl_line(0x854)
    4393                            .dwattr $C$DW$395, DW_AT_decl_column(0x1d)
    4394                    
    4395                    $C$DW$396       .dwtag  DW_TAG_member
    4396                            .dwattr $C$DW$396, DW_AT_type(*$C$DW$T$221)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:20 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{660A6764-99DA-4793-9BD5-2319D66F92D2} PAGE   81

    4397                            .dwattr $C$DW$396, DW_AT_name("eBeacon")
    4398                            .dwattr $C$DW$396, DW_AT_TI_symbol_name("eBeacon")
    4399                            .dwattr $C$DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4400                            .dwattr $C$DW$396, DW_AT_accessibility(DW_ACCESS_public)
    4401                            .dwattr $C$DW$396, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/ap
    4402                            .dwattr $C$DW$396, DW_AT_decl_line(0x856)
    4403                            .dwattr $C$DW$396, DW_AT_decl_column(0x1e)
    4404                    
    4405                            .dwattr $C$DW$T$222, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/
    4406                            .dwattr $C$DW$T$222, DW_AT_decl_line(0x852)
    4407                            .dwattr $C$DW$T$222, DW_AT_decl_column(0x05)
    4408                            .dwendtag $C$DW$T$222
    4409                    
    4410                    
    4411                    $C$DW$T$224     .dwtag  DW_TAG_union_type
    4412                            .dwattr $C$DW$T$224, DW_AT_byte_size(0x04)
    4413                    $C$DW$397       .dwtag  DW_TAG_member
    4414                            .dwattr $C$DW$397, DW_AT_type(*$C$DW$T$154)
    4415                            .dwattr $C$DW$397, DW_AT_name("pEnergyDetect")
    4416                            .dwattr $C$DW$397, DW_AT_TI_symbol_name("pEnergyDetect")
    4417                            .dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4418                            .dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_public)
    4419                            .dwattr $C$DW$397, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/ap
    4420                            .dwattr $C$DW$397, DW_AT_decl_line(0x876)
    4421                            .dwattr $C$DW$397, DW_AT_decl_column(0x12)
    4422                    
    4423                    $C$DW$398       .dwtag  DW_TAG_member
    4424                            .dwattr $C$DW$398, DW_AT_type(*$C$DW$T$223)
    4425                            .dwattr $C$DW$398, DW_AT_name("pPanDescriptor")
    4426                            .dwattr $C$DW$398, DW_AT_TI_symbol_name("pPanDescriptor")
    4427                            .dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4428                            .dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_public)
    4429                            .dwattr $C$DW$398, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/ap
    4430                            .dwattr $C$DW$398, DW_AT_decl_line(0x878)
    4431                            .dwattr $C$DW$398, DW_AT_decl_column(0x1b)
    4432                    
    4433                            .dwattr $C$DW$T$224, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/
    4434                            .dwattr $C$DW$T$224, DW_AT_decl_line(0x874)
    4435                            .dwattr $C$DW$T$224, DW_AT_decl_column(0x05)
    4436                            .dwendtag $C$DW$T$224
    4437                    
    4438                    
    4439                    $C$DW$T$228     .dwtag  DW_TAG_structure_type
    4440                            .dwattr $C$DW$T$228, DW_AT_name(".ggroup1")
    4441                            .dwattr $C$DW$T$228, DW_AT_byte_size(0x50)
    4442                    $C$DW$399       .dwtag  DW_TAG_member
    4443                            .dwattr $C$DW$399, DW_AT_type(*$C$DW$T$225)
    4444                            .dwattr $C$DW$399, DW_AT_name("ledPinHandle")
    4445                            .dwattr $C$DW$399, DW_AT_TI_symbol_name("ledPinHandle")
    4446                            .dwattr $C$DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4447                            .dwattr $C$DW$399, DW_AT_accessibility(DW_ACCESS_public)
    4448                    
    4449                    $C$DW$400       .dwtag  DW_TAG_member
    4450                            .dwattr $C$DW$400, DW_AT_type(*$C$DW$T$226)
    4451                            .dwattr $C$DW$400, DW_AT_name("ledStatus")
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:20 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{660A6764-99DA-4793-9BD5-2319D66F92D2} PAGE   82

    4452                            .dwattr $C$DW$400, DW_AT_TI_symbol_name("ledStatus")
    4453                            .dwattr $C$DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4454                            .dwattr $C$DW$400, DW_AT_accessibility(DW_ACCESS_public)
    4455                    
    4456                    $C$DW$401       .dwtag  DW_TAG_member
    4457                            .dwattr $C$DW$401, DW_AT_type(*$C$DW$T$242)
    4458                            .dwattr $C$DW$401, DW_AT_name("ledPinState")
    4459                            .dwattr $C$DW$401, DW_AT_TI_symbol_name("ledPinState")
    4460                            .dwattr $C$DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4461                            .dwattr $C$DW$401, DW_AT_accessibility(DW_ACCESS_public)
    4462                    
    4463                    $C$DW$402       .dwtag  DW_TAG_member
    4464                            .dwattr $C$DW$402, DW_AT_type(*$C$DW$T$227)
    4465                            .dwattr $C$DW$402, DW_AT_name("ledPinTable")
    4466                            .dwattr $C$DW$402, DW_AT_TI_symbol_name("ledPinTable")
    4467                            .dwattr $C$DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    4468                            .dwattr $C$DW$402, DW_AT_accessibility(DW_ACCESS_public)
    4469                    
    4470                    $C$DW$403       .dwtag  DW_TAG_member
    4471                            .dwattr $C$DW$403, DW_AT_type(*$C$DW$T$573)
    4472                            .dwattr $C$DW$403, DW_AT_name("blinkClkStruct")
    4473                            .dwattr $C$DW$403, DW_AT_TI_symbol_name("blinkClkStruct")
    4474                            .dwattr $C$DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    4475                            .dwattr $C$DW$403, DW_AT_accessibility(DW_ACCESS_public)
    4476                    
    4477                            .dwendtag $C$DW$T$228
    4478                    
    4479                    
    4480                    $C$DW$T$832     .dwtag  DW_TAG_enumeration_type
    4481                            .dwattr $C$DW$T$832, DW_AT_name("CC13X0_LAUNCHXL_ADCBufName")
    4482                            .dwattr $C$DW$T$832, DW_AT_byte_size(0x01)
    4483                    $C$DW$404       .dwtag  DW_TAG_enumerator
    4484                            .dwattr $C$DW$404, DW_AT_name("CC13X0_LAUNCHXL_ADCBuf0")
    4485                            .dwattr $C$DW$404, DW_AT_const_value(0x00)
    4486                            .dwattr $C$DW$404, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC131
    4487                            .dwattr $C$DW$404, DW_AT_decl_line(0x129)
    4488                            .dwattr $C$DW$404, DW_AT_decl_column(0x05)
    4489                    
    4490                    $C$DW$405       .dwtag  DW_TAG_enumerator
    4491                            .dwattr $C$DW$405, DW_AT_name("CC13X0_LAUNCHXL_ADCBufCOUNT")
    4492                            .dwattr $C$DW$405, DW_AT_const_value(0x01)
    4493                            .dwattr $C$DW$405, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC131
    4494                            .dwattr $C$DW$405, DW_AT_decl_line(0x12a)
    4495                            .dwattr $C$DW$405, DW_AT_decl_column(0x05)
    4496                    
    4497                            .dwattr $C$DW$T$832, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC1
    4498                            .dwattr $C$DW$T$832, DW_AT_decl_line(0x128)
    4499                            .dwattr $C$DW$T$832, DW_AT_decl_column(0x0e)
    4500                            .dwendtag $C$DW$T$832
    4501                    
    4502                    $C$DW$T$833     .dwtag  DW_TAG_typedef
    4503                            .dwattr $C$DW$T$833, DW_AT_name("CC13X0_LAUNCHXL_ADCBufName")
    4504                            .dwattr $C$DW$T$833, DW_AT_type(*$C$DW$T$832)
    4505                            .dwattr $C$DW$T$833, DW_AT_language(DW_LANG_C)
    4506                            .dwattr $C$DW$T$833, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC1
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:20 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{660A6764-99DA-4793-9BD5-2319D66F92D2} PAGE   83

    4507                            .dwattr $C$DW$T$833, DW_AT_decl_line(0x12b)
    4508                            .dwattr $C$DW$T$833, DW_AT_decl_column(0x03)
    4509                    
    4510                    
    4511                    $C$DW$T$834     .dwtag  DW_TAG_enumeration_type
    4512                            .dwattr $C$DW$T$834, DW_AT_name("CC13X0_LAUNCHXL_ADCName")
    4513                            .dwattr $C$DW$T$834, DW_AT_byte_size(0x01)
    4514                    $C$DW$406       .dwtag  DW_TAG_enumerator
    4515                            .dwattr $C$DW$406, DW_AT_name("CC13X0_LAUNCHXL_ADC0")
    4516                            .dwattr $C$DW$406, DW_AT_const_value(0x00)
    4517                            .dwattr $C$DW$406, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC131
    4518                            .dwattr $C$DW$406, DW_AT_decl_line(0x133)
    4519                            .dwattr $C$DW$406, DW_AT_decl_column(0x05)
    4520                    
    4521                    $C$DW$407       .dwtag  DW_TAG_enumerator
    4522                            .dwattr $C$DW$407, DW_AT_name("CC13X0_LAUNCHXL_ADC1")
    4523                            .dwattr $C$DW$407, DW_AT_const_value(0x01)
    4524                            .dwattr $C$DW$407, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC131
    4525                            .dwattr $C$DW$407, DW_AT_decl_line(0x134)
    4526                            .dwattr $C$DW$407, DW_AT_decl_column(0x05)
    4527                    
    4528                    $C$DW$408       .dwtag  DW_TAG_enumerator
    4529                            .dwattr $C$DW$408, DW_AT_name("CC13X0_LAUNCHXL_ADC2")
    4530                            .dwattr $C$DW$408, DW_AT_const_value(0x02)
    4531                            .dwattr $C$DW$408, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC131
    4532                            .dwattr $C$DW$408, DW_AT_decl_line(0x135)
    4533                            .dwattr $C$DW$408, DW_AT_decl_column(0x05)
    4534                    
    4535                    $C$DW$409       .dwtag  DW_TAG_enumerator
    4536                            .dwattr $C$DW$409, DW_AT_name("CC13X0_LAUNCHXL_ADC3")
    4537                            .dwattr $C$DW$409, DW_AT_const_value(0x03)
    4538                            .dwattr $C$DW$409, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC131
    4539                            .dwattr $C$DW$409, DW_AT_decl_line(0x136)
    4540                            .dwattr $C$DW$409, DW_AT_decl_column(0x05)
    4541                    
    4542                    $C$DW$410       .dwtag  DW_TAG_enumerator
    4543                            .dwattr $C$DW$410, DW_AT_name("CC13X0_LAUNCHXL_ADC4")
    4544                            .dwattr $C$DW$410, DW_AT_const_value(0x04)
    4545                            .dwattr $C$DW$410, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC131
    4546                            .dwattr $C$DW$410, DW_AT_decl_line(0x137)
    4547                            .dwattr $C$DW$410, DW_AT_decl_column(0x05)
    4548                    
    4549                    $C$DW$411       .dwtag  DW_TAG_enumerator
    4550                            .dwattr $C$DW$411, DW_AT_name("CC13X0_LAUNCHXL_ADC5")
    4551                            .dwattr $C$DW$411, DW_AT_const_value(0x05)
    4552                            .dwattr $C$DW$411, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC131
    4553                            .dwattr $C$DW$411, DW_AT_decl_line(0x138)
    4554                            .dwattr $C$DW$411, DW_AT_decl_column(0x05)
    4555                    
    4556                    $C$DW$412       .dwtag  DW_TAG_enumerator
    4557                            .dwattr $C$DW$412, DW_AT_name("CC13X0_LAUNCHXL_ADC6")
    4558                            .dwattr $C$DW$412, DW_AT_const_value(0x06)
    4559                            .dwattr $C$DW$412, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC131
    4560                            .dwattr $C$DW$412, DW_AT_decl_line(0x139)
    4561                            .dwattr $C$DW$412, DW_AT_decl_column(0x05)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:20 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{660A6764-99DA-4793-9BD5-2319D66F92D2} PAGE   84

    4562                    
    4563                    $C$DW$413       .dwtag  DW_TAG_enumerator
    4564                            .dwattr $C$DW$413, DW_AT_name("CC13X0_LAUNCHXL_ADC7")
    4565                            .dwattr $C$DW$413, DW_AT_const_value(0x07)
    4566                            .dwattr $C$DW$413, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC131
    4567                            .dwattr $C$DW$413, DW_AT_decl_line(0x13a)
    4568                            .dwattr $C$DW$413, DW_AT_decl_column(0x05)
    4569                    
    4570                    $C$DW$414       .dwtag  DW_TAG_enumerator
    4571                            .dwattr $C$DW$414, DW_AT_name("CC13X0_LAUNCHXL_ADCDCOUPL")
    4572                            .dwattr $C$DW$414, DW_AT_const_value(0x08)
    4573                            .dwattr $C$DW$414, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC131
    4574                            .dwattr $C$DW$414, DW_AT_decl_line(0x13b)
    4575                            .dwattr $C$DW$414, DW_AT_decl_column(0x05)
    4576                    
    4577                    $C$DW$415       .dwtag  DW_TAG_enumerator
    4578                            .dwattr $C$DW$415, DW_AT_name("CC13X0_LAUNCHXL_ADCVSS")
    4579                            .dwattr $C$DW$415, DW_AT_const_value(0x09)
    4580                            .dwattr $C$DW$415, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC131
    4581                            .dwattr $C$DW$415, DW_AT_decl_line(0x13c)
    4582                            .dwattr $C$DW$415, DW_AT_decl_column(0x05)
    4583                    
    4584                    $C$DW$416       .dwtag  DW_TAG_enumerator
    4585                            .dwattr $C$DW$416, DW_AT_name("CC13X0_LAUNCHXL_ADCVDDS")
    4586                            .dwattr $C$DW$416, DW_AT_const_value(0x0a)
    4587                            .dwattr $C$DW$416, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC131
    4588                            .dwattr $C$DW$416, DW_AT_decl_line(0x13d)
    4589                            .dwattr $C$DW$416, DW_AT_decl_column(0x05)
    4590                    
    4591                    $C$DW$417       .dwtag  DW_TAG_enumerator
    4592                            .dwattr $C$DW$417, DW_AT_name("CC13X0_LAUNCHXL_ADCCOUNT")
    4593                            .dwattr $C$DW$417, DW_AT_const_value(0x0b)
    4594                            .dwattr $C$DW$417, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC131
    4595                            .dwattr $C$DW$417, DW_AT_decl_line(0x13e)
    4596                            .dwattr $C$DW$417, DW_AT_decl_column(0x05)
    4597                    
    4598                            .dwattr $C$DW$T$834, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC1
    4599                            .dwattr $C$DW$T$834, DW_AT_decl_line(0x132)
    4600                            .dwattr $C$DW$T$834, DW_AT_decl_column(0x0e)
    4601                            .dwendtag $C$DW$T$834
    4602                    
    4603                    $C$DW$T$835     .dwtag  DW_TAG_typedef
    4604                            .dwattr $C$DW$T$835, DW_AT_name("CC13X0_LAUNCHXL_ADCName")
    4605                            .dwattr $C$DW$T$835, DW_AT_type(*$C$DW$T$834)
    4606                            .dwattr $C$DW$T$835, DW_AT_language(DW_LANG_C)
    4607                            .dwattr $C$DW$T$835, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC1
    4608                            .dwattr $C$DW$T$835, DW_AT_decl_line(0x13f)
    4609                            .dwattr $C$DW$T$835, DW_AT_decl_column(0x03)
    4610                    
    4611                    
    4612                    $C$DW$T$836     .dwtag  DW_TAG_enumeration_type
    4613                            .dwattr $C$DW$T$836, DW_AT_name("CC13X0_LAUNCHXL_CryptoName")
    4614                            .dwattr $C$DW$T$836, DW_AT_byte_size(0x01)
    4615                    $C$DW$418       .dwtag  DW_TAG_enumerator
    4616                            .dwattr $C$DW$418, DW_AT_name("CC13X0_LAUNCHXL_CRYPTO0")
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:20 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{660A6764-99DA-4793-9BD5-2319D66F92D2} PAGE   85

    4617                            .dwattr $C$DW$418, DW_AT_const_value(0x00)
    4618                            .dwattr $C$DW$418, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC131
    4619                            .dwattr $C$DW$418, DW_AT_decl_line(0xd0)
    4620                            .dwattr $C$DW$418, DW_AT_decl_column(0x05)
    4621                    
    4622                    $C$DW$419       .dwtag  DW_TAG_enumerator
    4623                            .dwattr $C$DW$419, DW_AT_name("CC13X0_LAUNCHXL_CRYPTOCOUNT")
    4624                            .dwattr $C$DW$419, DW_AT_const_value(0x01)
    4625                            .dwattr $C$DW$419, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC131
    4626                            .dwattr $C$DW$419, DW_AT_decl_line(0xd2)
    4627                            .dwattr $C$DW$419, DW_AT_decl_column(0x05)
    4628                    
    4629                            .dwattr $C$DW$T$836, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC1
    4630                            .dwattr $C$DW$T$836, DW_AT_decl_line(0xcf)
    4631                            .dwattr $C$DW$T$836, DW_AT_decl_column(0x0e)
    4632                            .dwendtag $C$DW$T$836
    4633                    
    4634                    $C$DW$T$837     .dwtag  DW_TAG_typedef
    4635                            .dwattr $C$DW$T$837, DW_AT_name("CC13X0_LAUNCHXL_CryptoName")
    4636                            .dwattr $C$DW$T$837, DW_AT_type(*$C$DW$T$836)
    4637                            .dwattr $C$DW$T$837, DW_AT_language(DW_LANG_C)
    4638                            .dwattr $C$DW$T$837, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC1
    4639                            .dwattr $C$DW$T$837, DW_AT_decl_line(0xd3)
    4640                            .dwattr $C$DW$T$837, DW_AT_decl_column(0x03)
    4641                    
    4642                    
    4643                    $C$DW$T$838     .dwtag  DW_TAG_enumeration_type
    4644                            .dwattr $C$DW$T$838, DW_AT_name("CC13X0_LAUNCHXL_GPTimerName")
    4645                            .dwattr $C$DW$T$838, DW_AT_byte_size(0x01)
    4646                    $C$DW$420       .dwtag  DW_TAG_enumerator
    4647                            .dwattr $C$DW$420, DW_AT_name("CC13X0_LAUNCHXL_GPTIMER0A")
    4648                            .dwattr $C$DW$420, DW_AT_const_value(0x00)
    4649                            .dwattr $C$DW$420, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC131
    4650                            .dwattr $C$DW$420, DW_AT_decl_line(0xfb)
    4651                            .dwattr $C$DW$420, DW_AT_decl_column(0x05)
    4652                    
    4653                    $C$DW$421       .dwtag  DW_TAG_enumerator
    4654                            .dwattr $C$DW$421, DW_AT_name("CC13X0_LAUNCHXL_GPTIMER0B")
    4655                            .dwattr $C$DW$421, DW_AT_const_value(0x01)
    4656                            .dwattr $C$DW$421, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC131
    4657                            .dwattr $C$DW$421, DW_AT_decl_line(0xfc)
    4658                            .dwattr $C$DW$421, DW_AT_decl_column(0x05)
    4659                    
    4660                    $C$DW$422       .dwtag  DW_TAG_enumerator
    4661                            .dwattr $C$DW$422, DW_AT_name("CC13X0_LAUNCHXL_GPTIMER1A")
    4662                            .dwattr $C$DW$422, DW_AT_const_value(0x02)
    4663                            .dwattr $C$DW$422, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC131
    4664                            .dwattr $C$DW$422, DW_AT_decl_line(0xfd)
    4665                            .dwattr $C$DW$422, DW_AT_decl_column(0x05)
    4666                    
    4667                    $C$DW$423       .dwtag  DW_TAG_enumerator
    4668                            .dwattr $C$DW$423, DW_AT_name("CC13X0_LAUNCHXL_GPTIMER1B")
    4669                            .dwattr $C$DW$423, DW_AT_const_value(0x03)
    4670                            .dwattr $C$DW$423, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC131
    4671                            .dwattr $C$DW$423, DW_AT_decl_line(0xfe)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:20 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{660A6764-99DA-4793-9BD5-2319D66F92D2} PAGE   86

    4672                            .dwattr $C$DW$423, DW_AT_decl_column(0x05)
    4673                    
    4674                    $C$DW$424       .dwtag  DW_TAG_enumerator
    4675                            .dwattr $C$DW$424, DW_AT_name("CC13X0_LAUNCHXL_GPTIMER2A")
    4676                            .dwattr $C$DW$424, DW_AT_const_value(0x04)
    4677                            .dwattr $C$DW$424, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC131
    4678                            .dwattr $C$DW$424, DW_AT_decl_line(0xff)
    4679                            .dwattr $C$DW$424, DW_AT_decl_column(0x05)
    4680                    
    4681                    $C$DW$425       .dwtag  DW_TAG_enumerator
    4682                            .dwattr $C$DW$425, DW_AT_name("CC13X0_LAUNCHXL_GPTIMER2B")
    4683                            .dwattr $C$DW$425, DW_AT_const_value(0x05)
    4684                            .dwattr $C$DW$425, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC131
    4685                            .dwattr $C$DW$425, DW_AT_decl_line(0x100)
    4686                            .dwattr $C$DW$425, DW_AT_decl_column(0x05)
    4687                    
    4688                    $C$DW$426       .dwtag  DW_TAG_enumerator
    4689                            .dwattr $C$DW$426, DW_AT_name("CC13X0_LAUNCHXL_GPTIMER3A")
    4690                            .dwattr $C$DW$426, DW_AT_const_value(0x06)
    4691                            .dwattr $C$DW$426, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC131
    4692                            .dwattr $C$DW$426, DW_AT_decl_line(0x101)
    4693                            .dwattr $C$DW$426, DW_AT_decl_column(0x05)
    4694                    
    4695                    $C$DW$427       .dwtag  DW_TAG_enumerator
    4696                            .dwattr $C$DW$427, DW_AT_name("CC13X0_LAUNCHXL_GPTIMER3B")
    4697                            .dwattr $C$DW$427, DW_AT_const_value(0x07)
    4698                            .dwattr $C$DW$427, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC131
    4699                            .dwattr $C$DW$427, DW_AT_decl_line(0x102)
    4700                            .dwattr $C$DW$427, DW_AT_decl_column(0x05)
    4701                    
    4702                    $C$DW$428       .dwtag  DW_TAG_enumerator
    4703                            .dwattr $C$DW$428, DW_AT_name("CC13X0_LAUNCHXL_GPTIMERPARTSCOUNT")
    4704                            .dwattr $C$DW$428, DW_AT_const_value(0x08)
    4705                            .dwattr $C$DW$428, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC131
    4706                            .dwattr $C$DW$428, DW_AT_decl_line(0x103)
    4707                            .dwattr $C$DW$428, DW_AT_decl_column(0x05)
    4708                    
    4709                            .dwattr $C$DW$T$838, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC1
    4710                            .dwattr $C$DW$T$838, DW_AT_decl_line(0xf9)
    4711                            .dwattr $C$DW$T$838, DW_AT_decl_column(0x0e)
    4712                            .dwendtag $C$DW$T$838
    4713                    
    4714                    $C$DW$T$839     .dwtag  DW_TAG_typedef
    4715                            .dwattr $C$DW$T$839, DW_AT_name("CC13X0_LAUNCHXL_GPTimerName")
    4716                            .dwattr $C$DW$T$839, DW_AT_type(*$C$DW$T$838)
    4717                            .dwattr $C$DW$T$839, DW_AT_language(DW_LANG_C)
    4718                            .dwattr $C$DW$T$839, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC1
    4719                            .dwattr $C$DW$T$839, DW_AT_decl_line(0x104)
    4720                            .dwattr $C$DW$T$839, DW_AT_decl_column(0x03)
    4721                    
    4722                    
    4723                    $C$DW$T$840     .dwtag  DW_TAG_enumeration_type
    4724                            .dwattr $C$DW$T$840, DW_AT_name("CC13X0_LAUNCHXL_GPTimers")
    4725                            .dwattr $C$DW$T$840, DW_AT_byte_size(0x01)
    4726                    $C$DW$429       .dwtag  DW_TAG_enumerator
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:20 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{660A6764-99DA-4793-9BD5-2319D66F92D2} PAGE   87

    4727                            .dwattr $C$DW$429, DW_AT_name("CC13X0_LAUNCHXL_GPTIMER0")
    4728                            .dwattr $C$DW$429, DW_AT_const_value(0x00)
    4729                            .dwattr $C$DW$429, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC131
    4730                            .dwattr $C$DW$429, DW_AT_decl_line(0x10c)
    4731                            .dwattr $C$DW$429, DW_AT_decl_column(0x05)
    4732                    
    4733                    $C$DW$430       .dwtag  DW_TAG_enumerator
    4734                            .dwattr $C$DW$430, DW_AT_name("CC13X0_LAUNCHXL_GPTIMER1")
    4735                            .dwattr $C$DW$430, DW_AT_const_value(0x01)
    4736                            .dwattr $C$DW$430, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC131
    4737                            .dwattr $C$DW$430, DW_AT_decl_line(0x10d)
    4738                            .dwattr $C$DW$430, DW_AT_decl_column(0x05)
    4739                    
    4740                    $C$DW$431       .dwtag  DW_TAG_enumerator
    4741                            .dwattr $C$DW$431, DW_AT_name("CC13X0_LAUNCHXL_GPTIMER2")
    4742                            .dwattr $C$DW$431, DW_AT_const_value(0x02)
    4743                            .dwattr $C$DW$431, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC131
    4744                            .dwattr $C$DW$431, DW_AT_decl_line(0x10e)
    4745                            .dwattr $C$DW$431, DW_AT_decl_column(0x05)
    4746                    
    4747                    $C$DW$432       .dwtag  DW_TAG_enumerator
    4748                            .dwattr $C$DW$432, DW_AT_name("CC13X0_LAUNCHXL_GPTIMER3")
    4749                            .dwattr $C$DW$432, DW_AT_const_value(0x03)
    4750                            .dwattr $C$DW$432, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC131
    4751                            .dwattr $C$DW$432, DW_AT_decl_line(0x10f)
    4752                            .dwattr $C$DW$432, DW_AT_decl_column(0x05)
    4753                    
    4754                    $C$DW$433       .dwtag  DW_TAG_enumerator
    4755                            .dwattr $C$DW$433, DW_AT_name("CC13X0_LAUNCHXL_GPTIMERCOUNT")
    4756                            .dwattr $C$DW$433, DW_AT_const_value(0x04)
    4757                            .dwattr $C$DW$433, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC131
    4758                            .dwattr $C$DW$433, DW_AT_decl_line(0x110)
