TI ARM Assembler PC v16.9.4 Sat Apr 14 19:24:42 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{45093464-70BA-42D9-8680-B044D19F6979} PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                        PC v16.9.4.LTS *
       3                    ;* Date/Time created: Sat Apr 14 19:24:40 2018                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../Application/LaunchPad/board_led.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v16.9.4.LTS Copyright (c) 1996-20
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Kevin\workspace_v7\sensor_cc1310lp\sensor_cc1310lp"
      13                    
      14                    $C$DW$1 .dwtag  DW_TAG_subprogram

    3582                            .dwendtag $C$DW$T$813
    3583                    
    3584                    $C$DW$T$814     .dwtag  DW_TAG_typedef
    3585                            .dwattr $C$DW$T$814, DW_AT_name("ApiMac_MLMESubIE_t")
    3586                            .dwattr $C$DW$T$814, DW_AT_type(*$C$DW$T$813)
    3587                            .dwattr $C$DW$T$814, DW_AT_language(DW_LANG_C)
    3588                            .dwattr $C$DW$T$814, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/
    3589                            .dwattr $C$DW$T$814, DW_AT_decl_line(0x43d)
    3590                            .dwattr $C$DW$T$814, DW_AT_decl_column(0x03)
    3591                    
    3592                    
    3593                    $C$DW$T$815     .dwtag  DW_TAG_enumeration_type
    3594                            .dwattr $C$DW$T$815, DW_AT_byte_size(0x01)
    3595                    $C$DW$339       .dwtag  DW_TAG_enumerator
    3596                            .dwattr $C$DW$339, DW_AT_name("ApiMac_wisunSubIE_USIE")
    3597                            .dwattr $C$DW$339, DW_AT_const_value(0x01)
    3598                            .dwattr $C$DW$339, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/ap
    3599                            .dwattr $C$DW$339, DW_AT_decl_line(0x443)
    3600                            .dwattr $C$DW$339, DW_AT_decl_column(0x05)
    3601                    
    3602                    $C$DW$340       .dwtag  DW_TAG_enumerator
    3603                            .dwattr $C$DW$340, DW_AT_name("ApiMac_wisunSubIE_BSIE")
    3604                            .dwattr $C$DW$340, DW_AT_const_value(0x02)
    3605                            .dwattr $C$DW$340, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/ap
    3606                            .dwattr $C$DW$340, DW_AT_decl_line(0x445)
    3607                            .dwattr $C$DW$340, DW_AT_decl_column(0x05)
    3608                    
    3609                    $C$DW$341       .dwtag  DW_TAG_enumerator
    3610                            .dwattr $C$DW$341, DW_AT_name("ApiMac_wisunSubIE_PANIE")
    3611                            .dwattr $C$DW$341, DW_AT_const_value(0x04)
    3612                            .dwattr $C$DW$341, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/ap
    3613                            .dwattr $C$DW$341, DW_AT_decl_line(0x447)
    3614                            .dwattr $C$DW$341, DW_AT_decl_column(0x05)
    3615                    
    3616                    $C$DW$342       .dwtag  DW_TAG_enumerator
    3617                            .dwattr $C$DW$342, DW_AT_name("ApiMac_wisunSubIE_netNameIE")
    3618                            .dwattr $C$DW$342, DW_AT_const_value(0x05)
    3619                            .dwattr $C$DW$342, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/ap
    3620                            .dwattr $C$DW$342, DW_AT_decl_line(0x449)
    3621                            .dwattr $C$DW$342, DW_AT_decl_column(0x05)
    3622                    
    3623                    $C$DW$343       .dwtag  DW_TAG_enumerator
    3624                            .dwattr $C$DW$343, DW_AT_name("ApiMac_wisunSubIE_PANVersionIE")
    3625                            .dwattr $C$DW$343, DW_AT_const_value(0x06)
    3626                            .dwattr $C$DW$343, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/ap
TI ARM Assembler PC v16.9.4 Sat Apr 14 19:24:42 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{45093464-70BA-42D9-8680-B044D19F6979} PAGE   67

    3627                            .dwattr $C$DW$343, DW_AT_decl_line(0x44b)
    3628                            .dwattr $C$DW$343, DW_AT_decl_column(0x05)
    3629                    
    3630                    $C$DW$344       .dwtag  DW_TAG_enumerator
    3631                            .dwattr $C$DW$344, DW_AT_name("ApiMac_wisunSubIE_GTKHashIE")
    3632                            .dwattr $C$DW$344, DW_AT_const_value(0x07)
    3633                            .dwattr $C$DW$344, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/ap
    3634                            .dwattr $C$DW$344, DW_AT_decl_line(0x44d)
    3635                            .dwattr $C$DW$344, DW_AT_decl_column(0x05)
    3636                    
    3637                            .dwattr $C$DW$T$815, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/
    3638                            .dwattr $C$DW$T$815, DW_AT_decl_line(0x441)
    3639                            .dwattr $C$DW$T$815, DW_AT_decl_column(0x01)
    3640                            .dwendtag $C$DW$T$815
    3641                    
    3642                    $C$DW$T$816     .dwtag  DW_TAG_typedef
    3643                            .dwattr $C$DW$T$816, DW_AT_name("ApiMac_wisunSubIE_t")
    3644                            .dwattr $C$DW$T$816, DW_AT_type(*$C$DW$T$815)
    3645                            .dwattr $C$DW$T$816, DW_AT_language(DW_LANG_C)
    3646                            .dwattr $C$DW$T$816, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/
    3647                            .dwattr $C$DW$T$816, DW_AT_decl_line(0x44e)
    3648                            .dwattr $C$DW$T$816, DW_AT_decl_column(0x03)
    3649                    
    3650                    
    3651                    $C$DW$T$141     .dwtag  DW_TAG_structure_type
    3652                            .dwattr $C$DW$T$141, DW_AT_byte_size(0x02)
    3653                    $C$DW$345       .dwtag  DW_TAG_member
    3654                            .dwattr $C$DW$345, DW_AT_type(*$C$DW$T$138)
    3655                            .dwattr $C$DW$345, DW_AT_name("state")
    3656                            .dwattr $C$DW$345, DW_AT_TI_symbol_name("state")
    3657                            .dwattr $C$DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3658                            .dwattr $C$DW$345, DW_AT_accessibility(DW_ACCESS_public)
    3659                            .dwattr $C$DW$345, DW_AT_decl_file("../Application/LaunchPad/board_led.c")
    3660                            .dwattr $C$DW$345, DW_AT_decl_line(0x52)
    3661                            .dwattr $C$DW$345, DW_AT_decl_column(0x15)
    3662                    
    3663                    $C$DW$346       .dwtag  DW_TAG_member
    3664                            .dwattr $C$DW$346, DW_AT_type(*$C$DW$T$140)
    3665                            .dwattr $C$DW$346, DW_AT_name("status")
    3666                            .dwattr $C$DW$346, DW_AT_TI_symbol_name("status")
    3667                            .dwattr $C$DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3668                            .dwattr $C$DW$346, DW_AT_accessibility(DW_ACCESS_public)
    3669                            .dwattr $C$DW$346, DW_AT_decl_file("../Application/LaunchPad/board_led.c")
    3670                            .dwattr $C$DW$346, DW_AT_decl_line(0x53)
    3671                            .dwattr $C$DW$346, DW_AT_decl_column(0x11)
    3672                    
    3673                            .dwattr $C$DW$T$141, DW_AT_decl_file("../Application/LaunchPad/board_led.c")
    3674                            .dwattr $C$DW$T$141, DW_AT_decl_line(0x51)
    3675                            .dwattr $C$DW$T$141, DW_AT_decl_column(0x01)
    3676                            .dwendtag $C$DW$T$141
    3677                    
    3678                    
    3679                    $C$DW$T$226     .dwtag  DW_TAG_array_type
    3680                            .dwattr $C$DW$T$226, DW_AT_type(*$C$DW$T$141)
    3681                            .dwattr $C$DW$T$226, DW_AT_language(DW_LANG_C)
TI ARM Assembler PC v16.9.4 Sat Apr 14 19:24:42 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{45093464-70BA-42D9-8680-B044D19F6979} PAGE   68

    3682                            .dwattr $C$DW$T$226, DW_AT_byte_size(0x0a)
    3683                    $C$DW$347       .dwtag  DW_TAG_subrange_type
    3684                            .dwattr $C$DW$347, DW_AT_upper_bound(0x04)
    3685                    
    3686                            .dwendtag $C$DW$T$226
    3687                    
    3688                    $C$DW$T$819     .dwtag  DW_TAG_typedef
    3689                            .dwattr $C$DW$T$819, DW_AT_name("board_led_status_t")
    3690                            .dwattr $C$DW$T$819, DW_AT_type(*$C$DW$T$141)
    3691                            .dwattr $C$DW$T$819, DW_AT_language(DW_LANG_C)
    3692                            .dwattr $C$DW$T$819, DW_AT_decl_file("../Application/LaunchPad/board_led.c")
    3693                            .dwattr $C$DW$T$819, DW_AT_decl_line(0x54)
    3694                            .dwattr $C$DW$T$819, DW_AT_decl_column(0x03)
    3695                    
    3696                    
    3697                    $C$DW$T$820     .dwtag  DW_TAG_array_type
    3698                            .dwattr $C$DW$T$820, DW_AT_type(*$C$DW$T$819)
    3699                            .dwattr $C$DW$T$820, DW_AT_language(DW_LANG_C)
    3700                            .dwattr $C$DW$T$820, DW_AT_byte_size(0x0a)
    3701                    $C$DW$348       .dwtag  DW_TAG_subrange_type
    3702                            .dwattr $C$DW$348, DW_AT_upper_bound(0x04)
    3703                    
    3704                            .dwendtag $C$DW$T$820
    3705                    
    3706                    
    3707                    $C$DW$T$142     .dwtag  DW_TAG_structure_type
    3708                            .dwattr $C$DW$T$142, DW_AT_byte_size(0x08)
    3709                    $C$DW$349       .dwtag  DW_TAG_member
    3710                            .dwattr $C$DW$349, DW_AT_type(*$C$DW$T$10)
    3711                            .dwattr $C$DW$349, DW_AT_name("quot")
    3712                            .dwattr $C$DW$349, DW_AT_TI_symbol_name("quot")
    3713                            .dwattr $C$DW$349, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3714                            .dwattr $C$DW$349, DW_AT_accessibility(DW_ACCESS_public)
    3715                            .dwattr $C$DW$349, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/s
    3716                            .dwattr $C$DW$349, DW_AT_decl_line(0x5c)
    3717                            .dwattr $C$DW$349, DW_AT_decl_column(0x16)
    3718                    
    3719                    $C$DW$350       .dwtag  DW_TAG_member
    3720                            .dwattr $C$DW$350, DW_AT_type(*$C$DW$T$10)
    3721                            .dwattr $C$DW$350, DW_AT_name("rem")
    3722                            .dwattr $C$DW$350, DW_AT_TI_symbol_name("rem")
    3723                            .dwattr $C$DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3724                            .dwattr $C$DW$350, DW_AT_accessibility(DW_ACCESS_public)
    3725                            .dwattr $C$DW$350, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/s
    3726                            .dwattr $C$DW$350, DW_AT_decl_line(0x5c)
    3727                            .dwattr $C$DW$350, DW_AT_decl_column(0x1c)
    3728                    
    3729                            .dwattr $C$DW$T$142, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include
    3730                            .dwattr $C$DW$T$142, DW_AT_decl_line(0x5c)
    3731                            .dwattr $C$DW$T$142, DW_AT_decl_column(0x10)
    3732                            .dwendtag $C$DW$T$142
    3733                    
    3734                    $C$DW$T$821     .dwtag  DW_TAG_typedef
    3735                            .dwattr $C$DW$T$821, DW_AT_name("div_t")
    3736                            .dwattr $C$DW$T$821, DW_AT_type(*$C$DW$T$142)
TI ARM Assembler PC v16.9.4 Sat Apr 14 19:24:42 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{45093464-70BA-42D9-8680-B044D19F6979} PAGE   69

    3737                            .dwattr $C$DW$T$821, DW_AT_language(DW_LANG_C)
    3738                            .dwattr $C$DW$T$821, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include
    3739                            .dwattr $C$DW$T$821, DW_AT_decl_line(0x5c)
    3740                            .dwattr $C$DW$T$821, DW_AT_decl_column(0x23)
    3741                    
    3742                    
    3743                    $C$DW$T$143     .dwtag  DW_TAG_structure_type
    3744                            .dwattr $C$DW$T$143, DW_AT_byte_size(0x08)
    3745                    $C$DW$351       .dwtag  DW_TAG_member
    3746                            .dwattr $C$DW$351, DW_AT_type(*$C$DW$T$10)
    3747                            .dwattr $C$DW$351, DW_AT_name("quot")
    3748                            .dwattr $C$DW$351, DW_AT_TI_symbol_name("quot")
    3749                            .dwattr $C$DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3750                            .dwattr $C$DW$351, DW_AT_accessibility(DW_ACCESS_public)
    3751                            .dwattr $C$DW$351, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/s
    3752                            .dwattr $C$DW$351, DW_AT_decl_line(0x5e)
    3753                            .dwattr $C$DW$351, DW_AT_decl_column(0x16)
    3754                    
    3755                    $C$DW$352       .dwtag  DW_TAG_member
    3756                            .dwattr $C$DW$352, DW_AT_type(*$C$DW$T$10)
    3757                            .dwattr $C$DW$352, DW_AT_name("rem")
    3758                            .dwattr $C$DW$352, DW_AT_TI_symbol_name("rem")
    3759                            .dwattr $C$DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3760                            .dwattr $C$DW$352, DW_AT_accessibility(DW_ACCESS_public)
    3761                            .dwattr $C$DW$352, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/s
    3762                            .dwattr $C$DW$352, DW_AT_decl_line(0x5e)
    3763                            .dwattr $C$DW$352, DW_AT_decl_column(0x1c)
    3764                    
    3765                            .dwattr $C$DW$T$143, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include
    3766                            .dwattr $C$DW$T$143, DW_AT_decl_line(0x5e)
    3767                            .dwattr $C$DW$T$143, DW_AT_decl_column(0x10)
    3768                            .dwendtag $C$DW$T$143
    3769                    
    3770                    $C$DW$T$822     .dwtag  DW_TAG_typedef
    3771                            .dwattr $C$DW$T$822, DW_AT_name("ldiv_t")
    3772                            .dwattr $C$DW$T$822, DW_AT_type(*$C$DW$T$143)
    3773                            .dwattr $C$DW$T$822, DW_AT_language(DW_LANG_C)
    3774                            .dwattr $C$DW$T$822, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include
    3775                            .dwattr $C$DW$T$822, DW_AT_decl_line(0x5e)
    3776                            .dwattr $C$DW$T$822, DW_AT_decl_column(0x23)
    3777                    
    3778                    
    3779                    $C$DW$T$144     .dwtag  DW_TAG_structure_type
    3780                            .dwattr $C$DW$T$144, DW_AT_byte_size(0x10)
    3781                    $C$DW$353       .dwtag  DW_TAG_member
    3782                            .dwattr $C$DW$353, DW_AT_type(*$C$DW$T$14)
    3783                            .dwattr $C$DW$353, DW_AT_name("quot")
    3784                            .dwattr $C$DW$353, DW_AT_TI_symbol_name("quot")
    3785                            .dwattr $C$DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3786                            .dwattr $C$DW$353, DW_AT_accessibility(DW_ACCESS_public)
    3787                            .dwattr $C$DW$353, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/s
    3788                            .dwattr $C$DW$353, DW_AT_decl_line(0x61)
    3789                            .dwattr $C$DW$353, DW_AT_decl_column(0x1c)
    3790                    
    3791                    $C$DW$354       .dwtag  DW_TAG_member
TI ARM Assembler PC v16.9.4 Sat Apr 14 19:24:42 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{45093464-70BA-42D9-8680-B044D19F6979} PAGE   70

    3792                            .dwattr $C$DW$354, DW_AT_type(*$C$DW$T$14)
    3793                            .dwattr $C$DW$354, DW_AT_name("rem")
    3794                            .dwattr $C$DW$354, DW_AT_TI_symbol_name("rem")
    3795                            .dwattr $C$DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3796                            .dwattr $C$DW$354, DW_AT_accessibility(DW_ACCESS_public)
    3797                            .dwattr $C$DW$354, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/s
    3798                            .dwattr $C$DW$354, DW_AT_decl_line(0x61)
    3799                            .dwattr $C$DW$354, DW_AT_decl_column(0x22)
    3800                    
    3801                            .dwattr $C$DW$T$144, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include
    3802                            .dwattr $C$DW$T$144, DW_AT_decl_line(0x61)
    3803                            .dwattr $C$DW$T$144, DW_AT_decl_column(0x10)
    3804                            .dwendtag $C$DW$T$144
    3805                    
    3806                    $C$DW$T$823     .dwtag  DW_TAG_typedef
    3807                            .dwattr $C$DW$T$823, DW_AT_name("lldiv_t")
    3808                            .dwattr $C$DW$T$823, DW_AT_type(*$C$DW$T$144)
    3809                            .dwattr $C$DW$T$823, DW_AT_language(DW_LANG_C)
    3810                            .dwattr $C$DW$T$823, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include
    3811                            .dwattr $C$DW$T$823, DW_AT_decl_line(0x61)
    3812                            .dwattr $C$DW$T$823, DW_AT_decl_column(0x29)
    3813                    
    3814                    
    3815                    $C$DW$T$149     .dwtag  DW_TAG_structure_type
    3816                            .dwattr $C$DW$T$149, DW_AT_byte_size(0x08)
    3817                    $C$DW$355       .dwtag  DW_TAG_member
    3818                            .dwattr $C$DW$355, DW_AT_type(*$C$DW$T$147)
    3819                            .dwattr $C$DW$355, DW_AT_name("pointerStack")
    3820                            .dwattr $C$DW$355, DW_AT_TI_symbol_name("pointerStack")
    3821                            .dwattr $C$DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3822                            .dwattr $C$DW$355, DW_AT_accessibility(DW_ACCESS_public)
    3823                            .dwattr $C$DW$355, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    3824                            .dwattr $C$DW$355, DW_AT_decl_line(0x3f5)
    3825                            .dwattr $C$DW$355, DW_AT_decl_column(0x16)
    3826                    
    3827                    $C$DW$356       .dwtag  DW_TAG_member
    3828                            .dwattr $C$DW$356, DW_AT_type(*$C$DW$T$148)
    3829                            .dwattr $C$DW$356, DW_AT_name("directAPI")
    3830                            .dwattr $C$DW$356, DW_AT_TI_symbol_name("directAPI")
    3831                            .dwattr $C$DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3832                            .dwattr $C$DW$356, DW_AT_accessibility(DW_ACCESS_public)
    3833                            .dwattr $C$DW$356, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    3834                            .dwattr $C$DW$356, DW_AT_decl_line(0x3f6)
    3835                            .dwattr $C$DW$356, DW_AT_decl_column(0x15)
    3836                    
    3837                            .dwattr $C$DW$T$149, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154st
    3838                            .dwattr $C$DW$T$149, DW_AT_decl_line(0x3f4)
    3839                            .dwattr $C$DW$T$149, DW_AT_decl_column(0x01)
    3840                            .dwendtag $C$DW$T$149
    3841                    
    3842                    $C$DW$T$151     .dwtag  DW_TAG_typedef
    3843                            .dwattr $C$DW$T$151, DW_AT_name("icall_directAPIMsg_t")
    3844                            .dwattr $C$DW$T$151, DW_AT_type(*$C$DW$T$149)
    3845                            .dwattr $C$DW$T$151, DW_AT_language(DW_LANG_C)
    3846                            .dwattr $C$DW$T$151, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154st
TI ARM Assembler PC v16.9.4 Sat Apr 14 19:24:42 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{45093464-70BA-42D9-8680-B044D19F6979} PAGE   71

    3847                            .dwattr $C$DW$T$151, DW_AT_decl_line(0x3f7)
    3848                            .dwattr $C$DW$T$151, DW_AT_decl_column(0x03)
    3849                    
    3850                    
    3851                    $C$DW$T$152     .dwtag  DW_TAG_structure_type
    3852                            .dwattr $C$DW$T$152, DW_AT_byte_size(0x14)
    3853                    $C$DW$357       .dwtag  DW_TAG_member
    3854                            .dwattr $C$DW$357, DW_AT_type(*$C$DW$T$150)
    3855                            .dwattr $C$DW$357, DW_AT_name("hdr")
    3856                            .dwattr $C$DW$357, DW_AT_TI_symbol_name("hdr")
    3857                            .dwattr $C$DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3858                            .dwattr $C$DW$357, DW_AT_accessibility(DW_ACCESS_public)
    3859                            .dwattr $C$DW$357, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    3860                            .dwattr $C$DW$357, DW_AT_decl_line(0x3fb)
    3861                            .dwattr $C$DW$357, DW_AT_decl_column(0x10)
    3862                    
    3863                    $C$DW$358       .dwtag  DW_TAG_member
    3864                            .dwattr $C$DW$358, DW_AT_type(*$C$DW$T$151)
    3865                            .dwattr $C$DW$358, DW_AT_name("msg")
    3866                            .dwattr $C$DW$358, DW_AT_TI_symbol_name("msg")
    3867                            .dwattr $C$DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3868                            .dwattr $C$DW$358, DW_AT_accessibility(DW_ACCESS_public)
    3869                            .dwattr $C$DW$358, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    3870                            .dwattr $C$DW$358, DW_AT_decl_line(0x3fc)
    3871                            .dwattr $C$DW$358, DW_AT_decl_column(0x1a)
    3872                    
    3873                            .dwattr $C$DW$T$152, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154st
    3874                            .dwattr $C$DW$T$152, DW_AT_decl_line(0x3fa)
    3875                            .dwattr $C$DW$T$152, DW_AT_decl_column(0x01)
    3876                            .dwendtag $C$DW$T$152
    3877                    
    3878                    $C$DW$T$824     .dwtag  DW_TAG_typedef
    3879                            .dwattr $C$DW$T$824, DW_AT_name("icallLiteMsg_t")
    3880                            .dwattr $C$DW$T$824, DW_AT_type(*$C$DW$T$152)
    3881                            .dwattr $C$DW$T$824, DW_AT_language(DW_LANG_C)
    3882                            .dwattr $C$DW$T$824, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154st
    3883                            .dwattr $C$DW$T$824, DW_AT_decl_line(0x3fd)
    3884                            .dwattr $C$DW$T$824, DW_AT_decl_column(0x03)
    3885                    
    3886                    
    3887                    $C$DW$T$193     .dwtag  DW_TAG_structure_type
    3888                            .dwattr $C$DW$T$193, DW_AT_byte_size(0x4c)
    3889                    $C$DW$359       .dwtag  DW_TAG_member
    3890                            .dwattr $C$DW$359, DW_AT_type(*$C$DW$T$157)
    3891                            .dwattr $C$DW$359, DW_AT_name("Crc32")
    3892                            .dwattr $C$DW$359, DW_AT_TI_symbol_name("Crc32")
    3893                            .dwattr $C$DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3894                            .dwattr $C$DW$359, DW_AT_accessibility(DW_ACCESS_public)
    3895                            .dwattr $C$DW$359, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    3896                            .dwattr $C$DW$359, DW_AT_decl_line(0x76)
    3897                            .dwattr $C$DW$359, DW_AT_decl_column(0x25)
    3898                    
    3899                    $C$DW$360       .dwtag  DW_TAG_member
    3900                            .dwattr $C$DW$360, DW_AT_type(*$C$DW$T$160)
    3901                            .dwattr $C$DW$360, DW_AT_name("FlashGetSize")
TI ARM Assembler PC v16.9.4 Sat Apr 14 19:24:42 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{45093464-70BA-42D9-8680-B044D19F6979} PAGE   72

    3902                            .dwattr $C$DW$360, DW_AT_TI_symbol_name("FlashGetSize")
    3903                            .dwattr $C$DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3904                            .dwattr $C$DW$360, DW_AT_accessibility(DW_ACCESS_public)
    3905                            .dwattr $C$DW$360, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    3906                            .dwattr $C$DW$360, DW_AT_decl_line(0x77)
    3907                            .dwattr $C$DW$360, DW_AT_decl_column(0x25)
    3908                    
    3909                    $C$DW$361       .dwtag  DW_TAG_member
    3910                            .dwattr $C$DW$361, DW_AT_type(*$C$DW$T$161)
    3911                            .dwattr $C$DW$361, DW_AT_name("GetChipId")
    3912                            .dwattr $C$DW$361, DW_AT_TI_symbol_name("GetChipId")
    3913                            .dwattr $C$DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3914                            .dwattr $C$DW$361, DW_AT_accessibility(DW_ACCESS_public)
    3915                            .dwattr $C$DW$361, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    3916                            .dwattr $C$DW$361, DW_AT_decl_line(0x78)
    3917                            .dwattr $C$DW$361, DW_AT_decl_column(0x25)
    3918                    
    3919                    $C$DW$362       .dwtag  DW_TAG_member
    3920                            .dwattr $C$DW$362, DW_AT_type(*$C$DW$T$164)
    3921                            .dwattr $C$DW$362, DW_AT_name("ReservedLocation1")
    3922                            .dwattr $C$DW$362, DW_AT_TI_symbol_name("ReservedLocation1")
    3923                            .dwattr $C$DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3924                            .dwattr $C$DW$362, DW_AT_accessibility(DW_ACCESS_public)
    3925                            .dwattr $C$DW$362, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    3926                            .dwattr $C$DW$362, DW_AT_decl_line(0x79)
    3927                            .dwattr $C$DW$362, DW_AT_decl_column(0x25)
    3928                    
    3929                    $C$DW$363       .dwtag  DW_TAG_member
    3930                            .dwattr $C$DW$363, DW_AT_type(*$C$DW$T$165)
    3931                            .dwattr $C$DW$363, DW_AT_name("ReservedLocation2")
    3932                            .dwattr $C$DW$363, DW_AT_TI_symbol_name("ReservedLocation2")
    3933                            .dwattr $C$DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3934                            .dwattr $C$DW$363, DW_AT_accessibility(DW_ACCESS_public)
    3935                            .dwattr $C$DW$363, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    3936                            .dwattr $C$DW$363, DW_AT_decl_line(0x7a)
    3937                            .dwattr $C$DW$363, DW_AT_decl_column(0x25)
    3938                    
    3939                    $C$DW$364       .dwtag  DW_TAG_member
    3940                            .dwattr $C$DW$364, DW_AT_type(*$C$DW$T$166)
    3941                            .dwattr $C$DW$364, DW_AT_name("ReservedLocation3")
    3942                            .dwattr $C$DW$364, DW_AT_TI_symbol_name("ReservedLocation3")
    3943                            .dwattr $C$DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3944                            .dwattr $C$DW$364, DW_AT_accessibility(DW_ACCESS_public)
    3945                            .dwattr $C$DW$364, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    3946                            .dwattr $C$DW$364, DW_AT_decl_line(0x7b)
    3947                            .dwattr $C$DW$364, DW_AT_decl_column(0x25)
    3948                    
    3949                    $C$DW$365       .dwtag  DW_TAG_member
    3950                            .dwattr $C$DW$365, DW_AT_type(*$C$DW$T$169)
    3951                            .dwattr $C$DW$365, DW_AT_name("ResetDevice")
    3952                            .dwattr $C$DW$365, DW_AT_TI_symbol_name("ResetDevice")
    3953                            .dwattr $C$DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3954                            .dwattr $C$DW$365, DW_AT_accessibility(DW_ACCESS_public)
    3955                            .dwattr $C$DW$365, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    3956                            .dwattr $C$DW$365, DW_AT_decl_line(0x7c)
TI ARM Assembler PC v16.9.4 Sat Apr 14 19:24:42 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{45093464-70BA-42D9-8680-B044D19F6979} PAGE   73

    3957                            .dwattr $C$DW$365, DW_AT_decl_column(0x25)
    3958                    
    3959                    $C$DW$366       .dwtag  DW_TAG_member
    3960                            .dwattr $C$DW$366, DW_AT_type(*$C$DW$T$174)
    3961                            .dwattr $C$DW$366, DW_AT_name("Fletcher32")
    3962                            .dwattr $C$DW$366, DW_AT_TI_symbol_name("Fletcher32")
    3963                            .dwattr $C$DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3964                            .dwattr $C$DW$366, DW_AT_accessibility(DW_ACCESS_public)
    3965                            .dwattr $C$DW$366, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    3966                            .dwattr $C$DW$366, DW_AT_decl_line(0x7d)
    3967                            .dwattr $C$DW$366, DW_AT_decl_column(0x25)
    3968                    
    3969                    $C$DW$367       .dwtag  DW_TAG_member
    3970                            .dwattr $C$DW$367, DW_AT_type(*$C$DW$T$178)
    3971                            .dwattr $C$DW$367, DW_AT_name("MinValue")
    3972                            .dwattr $C$DW$367, DW_AT_TI_symbol_name("MinValue")
    3973                            .dwattr $C$DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    3974                            .dwattr $C$DW$367, DW_AT_accessibility(DW_ACCESS_public)
    3975                            .dwattr $C$DW$367, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    3976                            .dwattr $C$DW$367, DW_AT_decl_line(0x7e)
    3977                            .dwattr $C$DW$367, DW_AT_decl_column(0x25)
    3978                    
    3979                    $C$DW$368       .dwtag  DW_TAG_member
    3980                            .dwattr $C$DW$368, DW_AT_type(*$C$DW$T$179)
    3981                            .dwattr $C$DW$368, DW_AT_name("MaxValue")
    3982                            .dwattr $C$DW$368, DW_AT_TI_symbol_name("MaxValue")
    3983                            .dwattr $C$DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    3984                            .dwattr $C$DW$368, DW_AT_accessibility(DW_ACCESS_public)
    3985                            .dwattr $C$DW$368, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    3986                            .dwattr $C$DW$368, DW_AT_decl_line(0x7f)
    3987                            .dwattr $C$DW$368, DW_AT_decl_column(0x25)
    3988                    
    3989                    $C$DW$369       .dwtag  DW_TAG_member
    3990                            .dwattr $C$DW$369, DW_AT_type(*$C$DW$T$180)
    3991                            .dwattr $C$DW$369, DW_AT_name("MeanValue")
    3992                            .dwattr $C$DW$369, DW_AT_TI_symbol_name("MeanValue")
    3993                            .dwattr $C$DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    3994                            .dwattr $C$DW$369, DW_AT_accessibility(DW_ACCESS_public)
    3995                            .dwattr $C$DW$369, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    3996                            .dwattr $C$DW$369, DW_AT_decl_line(0x80)
    3997                            .dwattr $C$DW$369, DW_AT_decl_column(0x25)
    3998                    
    3999                    $C$DW$370       .dwtag  DW_TAG_member
    4000                            .dwattr $C$DW$370, DW_AT_type(*$C$DW$T$181)
    4001                            .dwattr $C$DW$370, DW_AT_name("StandDeviationValue")
    4002                            .dwattr $C$DW$370, DW_AT_TI_symbol_name("StandDeviationValue")
    4003                            .dwattr $C$DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    4004                            .dwattr $C$DW$370, DW_AT_accessibility(DW_ACCESS_public)
    4005                            .dwattr $C$DW$370, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    4006                            .dwattr $C$DW$370, DW_AT_decl_line(0x81)
    4007                            .dwattr $C$DW$370, DW_AT_decl_column(0x25)
    4008                    
    4009                    $C$DW$371       .dwtag  DW_TAG_member
    4010                            .dwattr $C$DW$371, DW_AT_type(*$C$DW$T$184)
    4011                            .dwattr $C$DW$371, DW_AT_name("ReservedLocation4")
TI ARM Assembler PC v16.9.4 Sat Apr 14 19:24:42 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{45093464-70BA-42D9-8680-B044D19F6979} PAGE   74

    4012                            .dwattr $C$DW$371, DW_AT_TI_symbol_name("ReservedLocation4")
    4013                            .dwattr $C$DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    4014                            .dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)
    4015                            .dwattr $C$DW$371, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    4016                            .dwattr $C$DW$371, DW_AT_decl_line(0x82)
    4017                            .dwattr $C$DW$371, DW_AT_decl_column(0x25)
    4018                    
    4019                    $C$DW$372       .dwtag  DW_TAG_member
    4020                            .dwattr $C$DW$372, DW_AT_type(*$C$DW$T$185)
    4021                            .dwattr $C$DW$372, DW_AT_name("ReservedLocation5")
    4022                            .dwattr $C$DW$372, DW_AT_TI_symbol_name("ReservedLocation5")
    4023                            .dwattr $C$DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    4024                            .dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)
    4025                            .dwattr $C$DW$372, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    4026                            .dwattr $C$DW$372, DW_AT_decl_line(0x83)
    4027                            .dwattr $C$DW$372, DW_AT_decl_column(0x25)
    4028                    
    4029                    $C$DW$373       .dwtag  DW_TAG_member
    4030                            .dwattr $C$DW$373, DW_AT_type(*$C$DW$T$186)
    4031                            .dwattr $C$DW$373, DW_AT_name("HFSourceSafeSwitch")
    4032                            .dwattr $C$DW$373, DW_AT_TI_symbol_name("HFSourceSafeSwitch")
    4033                            .dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    4034                            .dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)
    4035                            .dwattr $C$DW$373, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    4036                            .dwattr $C$DW$373, DW_AT_decl_line(0x84)
    4037                            .dwattr $C$DW$373, DW_AT_decl_column(0x25)
    4038                    
    4039                    $C$DW$374       .dwtag  DW_TAG_member
    4040                            .dwattr $C$DW$374, DW_AT_type(*$C$DW$T$189)
    4041                            .dwattr $C$DW$374, DW_AT_name("SelectCompAInput")
    4042                            .dwattr $C$DW$374, DW_AT_TI_symbol_name("SelectCompAInput")
    4043                            .dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    4044                            .dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
    4045                            .dwattr $C$DW$374, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    4046                            .dwattr $C$DW$374, DW_AT_decl_line(0x85)
    4047                            .dwattr $C$DW$374, DW_AT_decl_column(0x25)
    4048                    
    4049                    $C$DW$375       .dwtag  DW_TAG_member
    4050                            .dwattr $C$DW$375, DW_AT_type(*$C$DW$T$190)
    4051                            .dwattr $C$DW$375, DW_AT_name("SelectCompARef")
    4052                            .dwattr $C$DW$375, DW_AT_TI_symbol_name("SelectCompARef")
    4053                            .dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    4054                            .dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)
    4055                            .dwattr $C$DW$375, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    4056                            .dwattr $C$DW$375, DW_AT_decl_line(0x86)
    4057                            .dwattr $C$DW$375, DW_AT_decl_column(0x25)
    4058                    
    4059                    $C$DW$376       .dwtag  DW_TAG_member
    4060                            .dwattr $C$DW$376, DW_AT_type(*$C$DW$T$191)
    4061                            .dwattr $C$DW$376, DW_AT_name("SelectADCCompBInput")
    4062                            .dwattr $C$DW$376, DW_AT_TI_symbol_name("SelectADCCompBInput")
    4063                            .dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    4064                            .dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)
    4065                            .dwattr $C$DW$376, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    4066                            .dwattr $C$DW$376, DW_AT_decl_line(0x87)
TI ARM Assembler PC v16.9.4 Sat Apr 14 19:24:42 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{45093464-70BA-42D9-8680-B044D19F6979} PAGE   75

    4067                            .dwattr $C$DW$376, DW_AT_decl_column(0x25)
    4068                    
    4069                    $C$DW$377       .dwtag  DW_TAG_member
    4070                            .dwattr $C$DW$377, DW_AT_type(*$C$DW$T$192)
    4071                            .dwattr $C$DW$377, DW_AT_name("SelectCompBRef")
    4072                            .dwattr $C$DW$377, DW_AT_TI_symbol_name("SelectCompBRef")
    4073                            .dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    4074                            .dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)
    4075                            .dwattr $C$DW$377, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    4076                            .dwattr $C$DW$377, DW_AT_decl_line(0x88)
    4077                            .dwattr $C$DW$377, DW_AT_decl_column(0x25)
    4078                    
    4079                            .dwattr $C$DW$T$193, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices
    4080                            .dwattr $C$DW$T$193, DW_AT_decl_line(0x75)
    4081                            .dwattr $C$DW$T$193, DW_AT_decl_column(0x01)
    4082                            .dwendtag $C$DW$T$193
    4083                    
    4084                    $C$DW$T$825     .dwtag  DW_TAG_typedef
    4085                            .dwattr $C$DW$T$825, DW_AT_name("HARD_API_T")
    4086                            .dwattr $C$DW$T$825, DW_AT_type(*$C$DW$T$193)
    4087                            .dwattr $C$DW$T$825, DW_AT_language(DW_LANG_C)
    4088                            .dwattr $C$DW$T$825, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices
    4089                            .dwattr $C$DW$T$825, DW_AT_decl_line(0x89)
    4090                            .dwattr $C$DW$T$825, DW_AT_decl_column(0x03)
    4091                    
    4092                    
    4093                    $C$DW$T$196     .dwtag  DW_TAG_structure_type
    4094                            .dwattr $C$DW$T$196, DW_AT_byte_size(0x08)
    4095                    $C$DW$378       .dwtag  DW_TAG_member
    4096                            .dwattr $C$DW$378, DW_AT_type(*$C$DW$T$10)
    4097                            .dwattr $C$DW$378, DW_AT_name("length")
    4098                            .dwattr $C$DW$378, DW_AT_TI_symbol_name("length")
    4099                            .dwattr $C$DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4100                            .dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)
    4101                            .dwattr $C$DW$378, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/kernel/tirtos/packa
    4102                            .dwattr $C$DW$378, DW_AT_decl_line(0x165)
    4103                            .dwattr $C$DW$378, DW_AT_decl_column(0x16)
    4104                    
    4105                    $C$DW$379       .dwtag  DW_TAG_member
    4106                            .dwattr $C$DW$379, DW_AT_type(*$C$DW$T$195)
    4107                            .dwattr $C$DW$379, DW_AT_name("elem")
    4108                            .dwattr $C$DW$379, DW_AT_TI_symbol_name("elem")
    4109                            .dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4110                            .dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)
    4111                            .dwattr $C$DW$379, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/kernel/tirtos/packa
    4112                            .dwattr $C$DW$379, DW_AT_decl_line(0x165)
    4113                            .dwattr $C$DW$379, DW_AT_decl_column(0x3a)
    4114                    
    4115                            .dwattr $C$DW$T$196, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/kernel/tirtos/pac
    4116                            .dwattr $C$DW$T$196, DW_AT_decl_line(0x165)
    4117                            .dwattr $C$DW$T$196, DW_AT_decl_column(0x10)
    4118                            .dwendtag $C$DW$T$196
    4119                    
    4120                    $C$DW$T$826     .dwtag  DW_TAG_typedef
    4121                            .dwattr $C$DW$T$826, DW_AT_name("__ARRAY1_ti_sysbios_knl_Swi_hooks")
TI ARM Assembler PC v16.9.4 Sat Apr 14 19:24:42 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{45093464-70BA-42D9-8680-B044D19F6979} PAGE   76

    4122                            .dwattr $C$DW$T$826, DW_AT_type(*$C$DW$T$196)
    4123                            .dwattr $C$DW$T$826, DW_AT_language(DW_LANG_C)
    4124                            .dwattr $C$DW$T$826, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/kernel/tirtos/pac
    4125                            .dwattr $C$DW$T$826, DW_AT_decl_line(0x165)
    4126                            .dwattr $C$DW$T$826, DW_AT_decl_column(0x42)
    4127                    
    4128                    
    4129                    $C$DW$T$199     .dwtag  DW_TAG_structure_type
    4130                            .dwattr $C$DW$T$199, DW_AT_byte_size(0x08)
    4131                    $C$DW$380       .dwtag  DW_TAG_member
    4132                            .dwattr $C$DW$380, DW_AT_type(*$C$DW$T$10)
    4133                            .dwattr $C$DW$380, DW_AT_name("length")
    4134                            .dwattr $C$DW$380, DW_AT_TI_symbol_name("length")
    4135                            .dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4136                            .dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
    4137                            .dwattr $C$DW$380, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/kernel/tirtos/packa
    4138                            .dwattr $C$DW$380, DW_AT_decl_line(0x166)
    4139                            .dwattr $C$DW$380, DW_AT_decl_column(0x16)
    4140                    
    4141                    $C$DW$381       .dwtag  DW_TAG_member
    4142                            .dwattr $C$DW$381, DW_AT_type(*$C$DW$T$198)
    4143                            .dwattr $C$DW$381, DW_AT_name("elem")
    4144                            .dwattr $C$DW$381, DW_AT_TI_symbol_name("elem")
    4145                            .dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4146                            .dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
    4147                            .dwattr $C$DW$381, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/kernel/tirtos/packa
    4148                            .dwattr $C$DW$381, DW_AT_decl_line(0x166)
    4149                            .dwattr $C$DW$381, DW_AT_decl_column(0x40)
    4150                    
    4151                            .dwattr $C$DW$T$199, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/kernel/tirtos/pac
    4152                            .dwattr $C$DW$T$199, DW_AT_decl_line(0x166)
    4153                            .dwattr $C$DW$T$199, DW_AT_decl_column(0x10)
    4154                            .dwendtag $C$DW$T$199
    4155                    
    4156                    $C$DW$T$827     .dwtag  DW_TAG_typedef
    4157                            .dwattr $C$DW$T$827, DW_AT_name("__CARRAY1_ti_sysbios_knl_Swi_hooks")
    4158                            .dwattr $C$DW$T$827, DW_AT_type(*$C$DW$T$199)
    4159                            .dwattr $C$DW$T$827, DW_AT_language(DW_LANG_C)
    4160                            .dwattr $C$DW$T$827, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/kernel/tirtos/pac
    4161                            .dwattr $C$DW$T$827, DW_AT_decl_line(0x166)
    4162                            .dwattr $C$DW$T$827, DW_AT_decl_column(0x48)
    4163                    
    4164                    $C$DW$T$828     .dwtag  DW_TAG_typedef
    4165                            .dwattr $C$DW$T$828, DW_AT_name("CT__ti_sysbios_knl_Swi_hooks")
    4166                            .dwattr $C$DW$T$828, DW_AT_type(*$C$DW$T$827)
    4167                            .dwattr $C$DW$T$828, DW_AT_language(DW_LANG_C)
    4168                            .dwattr $C$DW$T$828, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/kernel/tirtos/pac
    4169                            .dwattr $C$DW$T$828, DW_AT_decl_line(0x168)
    4170                            .dwattr $C$DW$T$828, DW_AT_decl_column(0x2c)
    4171                    
    4172                    $C$DW$T$829     .dwtag  DW_TAG_typedef
    4173                            .dwattr $C$DW$T$829, DW_AT_name("__TA_ti_sysbios_knl_Swi_hooks")
    4174                            .dwattr $C$DW$T$829, DW_AT_type(*$C$DW$T$827)
    4175                            .dwattr $C$DW$T$829, DW_AT_language(DW_LANG_C)
    4176                            .dwattr $C$DW$T$829, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/kernel/tirtos/pac
TI ARM Assembler PC v16.9.4 Sat Apr 14 19:24:42 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{45093464-70BA-42D9-8680-B044D19F6979} PAGE   77

    4177                            .dwattr $C$DW$T$829, DW_AT_decl_line(0x167)
    4178                            .dwattr $C$DW$T$829, DW_AT_decl_column(0x2c)
    4179                    
    4180                    
    4181                    $C$DW$T$202     .dwtag  DW_TAG_structure_type
    4182                            .dwattr $C$DW$T$202, DW_AT_byte_size(0x0a)
    4183                    $C$DW$382       .dwtag  DW_TAG_member
    4184                            .dwattr $C$DW$382, DW_AT_type(*$C$DW$T$219)
    4185                            .dwattr $C$DW$382, DW_AT_name("addr")
    4186                            .dwattr $C$DW$382, DW_AT_TI_symbol_name("addr")
    4187                            .dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4188                            .dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
    4189                            .dwattr $C$DW$382, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/ap
    4190                            .dwattr $C$DW$382, DW_AT_decl_line(0x4a7)
    4191                            .dwattr $C$DW$382, DW_AT_decl_column(0x07)
    4192                    
    4193                    $C$DW$383       .dwtag  DW_TAG_member
    4194                            .dwattr $C$DW$383, DW_AT_type(*$C$DW$T$201)
    4195                            .dwattr $C$DW$383, DW_AT_name("addrMode")
    4196                            .dwattr $C$DW$383, DW_AT_TI_symbol_name("addrMode")
    4197                            .dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4198                            .dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)
    4199                            .dwattr $C$DW$383, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/ap
    4200                            .dwattr $C$DW$383, DW_AT_decl_line(0x4aa)
    4201                            .dwattr $C$DW$383, DW_AT_decl_column(0x17)
    4202                    
    4203                            .dwattr $C$DW$T$202, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/
    4204                            .dwattr $C$DW$T$202, DW_AT_decl_line(0x49c)
    4205                            .dwattr $C$DW$T$202, DW_AT_decl_column(0x01)
    4206                            .dwendtag $C$DW$T$202
    4207                    
    4208                    $C$DW$T$361     .dwtag  DW_TAG_typedef
    4209                            .dwattr $C$DW$T$361, DW_AT_name("ApiMac_sAddr_t")
    4210                            .dwattr $C$DW$T$361, DW_AT_type(*$C$DW$T$202)
    4211                            .dwattr $C$DW$T$361, DW_AT_language(DW_LANG_C)
    4212                            .dwattr $C$DW$T$361, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/
    4213                            .dwattr $C$DW$T$361, DW_AT_decl_line(0x4ab)
    4214                            .dwattr $C$DW$T$361, DW_AT_decl_column(0x03)
    4215                    
    4216                    
    4217                    $C$DW$T$206     .dwtag  DW_TAG_structure_type
    4218                            .dwattr $C$DW$T$206, DW_AT_byte_size(0x40)
    4219                    $C$DW$384       .dwtag  DW_TAG_member
    4220                            .dwattr $C$DW$384, DW_AT_type(*$C$DW$T$204)
    4221                            .dwattr $C$DW$384, DW_AT_name("beaconType")
    4222                            .dwattr $C$DW$384, DW_AT_TI_symbol_name("beaconType")
    4223                            .dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4224                            .dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)
    4225                            .dwattr $C$DW$384, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/ap
    4226                            .dwattr $C$DW$384, DW_AT_decl_line(0x848)
    4227                            .dwattr $C$DW$384, DW_AT_decl_column(0x19)
    4228                    
    4229                    $C$DW$385       .dwtag  DW_TAG_member
    4230                            .dwattr $C$DW$385, DW_AT_type(*$C$DW$T$153)
    4231                            .dwattr $C$DW$385, DW_AT_name("bsn")
TI ARM Assembler PC v16.9.4 Sat Apr 14 19:24:42 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{45093464-70BA-42D9-8680-B044D19F6979} PAGE   78

    4232                            .dwattr $C$DW$385, DW_AT_TI_symbol_name("bsn")
    4233                            .dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4234                            .dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
    4235                            .dwattr $C$DW$385, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/ap
    4236                            .dwattr $C$DW$385, DW_AT_decl_line(0x84a)
    4237                            .dwattr $C$DW$385, DW_AT_decl_column(0x0d)
    4238                    
    4239                    $C$DW$386       .dwtag  DW_TAG_member
    4240                            .dwattr $C$DW$386, DW_AT_type(*$C$DW$T$205)
    4241                            .dwattr $C$DW$386, DW_AT_name("panDesc")
    4242                            .dwattr $C$DW$386, DW_AT_TI_symbol_name("panDesc")
    4243                            .dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4244                            .dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
    4245                            .dwattr $C$DW$386, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/ap
    4246                            .dwattr $C$DW$386, DW_AT_decl_line(0x84c)
    4247                            .dwattr $C$DW$386, DW_AT_decl_column(0x16)
    4248                    
    4249                    $C$DW$387       .dwtag  DW_TAG_member
    4250                            .dwattr $C$DW$387, DW_AT_type(*$C$DW$T$222)
    4251                            .dwattr $C$DW$387, DW_AT_name("beaconData")
    4252                            .dwattr $C$DW$387, DW_AT_TI_symbol_name("beaconData")
    4253                            .dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    4254                            .dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)
    4255                            .dwattr $C$DW$387, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/ap
    4256                            .dwattr $C$DW$387, DW_AT_decl_line(0x857)
    4257                            .dwattr $C$DW$387, DW_AT_decl_column(0x07)
    4258                    
    4259                            .dwattr $C$DW$T$206, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/
    4260                            .dwattr $C$DW$T$206, DW_AT_decl_line(0x846)
    4261                            .dwattr $C$DW$T$206, DW_AT_decl_column(0x01)
    4262                            .dwendtag $C$DW$T$206
    4263                    
    4264                    $C$DW$T$273     .dwtag  DW_TAG_typedef
    4265                            .dwattr $C$DW$T$273, DW_AT_name("ApiMac_mlmeBeaconNotifyInd_t")
    4266                            .dwattr $C$DW$T$273, DW_AT_type(*$C$DW$T$206)
    4267                            .dwattr $C$DW$T$273, DW_AT_language(DW_LANG_C)
    4268                            .dwattr $C$DW$T$273, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/
    4269                            .dwattr $C$DW$T$273, DW_AT_decl_line(0x858)
    4270                            .dwattr $C$DW$T$273, DW_AT_decl_column(0x03)
    4271                    
    4272                    $C$DW$T$274     .dwtag  DW_TAG_pointer_type
    4273                            .dwattr $C$DW$T$274, DW_AT_type(*$C$DW$T$273)
    4274                            .dwattr $C$DW$T$274, DW_AT_address_class(0x20)
    4275                    
    4276                    
    4277                    $C$DW$T$210     .dwtag  DW_TAG_union_type
    4278                            .dwattr $C$DW$T$210, DW_AT_byte_size(0x04)
    4279                    $C$DW$388       .dwtag  DW_TAG_member
    4280                            .dwattr $C$DW$388, DW_AT_type(*$C$DW$T$207)
    4281                            .dwattr $C$DW$388, DW_AT_name("f")
    4282                            .dwattr $C$DW$388, DW_AT_TI_symbol_name("f")
    4283                            .dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4284                            .dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)
    4285                            .dwattr $C$DW$388, DW_AT_decl_file("C:/ti/xdctools_3_50_03_33_core/packages/xdc/std.h")
    4286                            .dwattr $C$DW$388, DW_AT_decl_line(0xb7)
TI ARM Assembler PC v16.9.4 Sat Apr 14 19:24:42 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{45093464-70BA-42D9-8680-B044D19F6979} PAGE   79

    4287                            .dwattr $C$DW$388, DW_AT_decl_column(0x0f)
    4288                    
    4289                    $C$DW$389       .dwtag  DW_TAG_member
    4290                            .dwattr $C$DW$389, DW_AT_type(*$C$DW$T$209)
    4291                            .dwattr $C$DW$389, DW_AT_name("a")
    4292                            .dwattr $C$DW$389, DW_AT_TI_symbol_name("a")
    4293                            .dwattr $C$DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4294                            .dwattr $C$DW$389, DW_AT_accessibility(DW_ACCESS_public)
    4295                            .dwattr $C$DW$389, DW_AT_decl_file("C:/ti/xdctools_3_50_03_33_core/packages/xdc/std.h")
    4296                            .dwattr $C$DW$389, DW_AT_decl_line(0xb8)
    4297                            .dwattr $C$DW$389, DW_AT_decl_column(0x0f)
    4298                    
    4299                            .dwattr $C$DW$T$210, DW_AT_decl_file("C:/ti/xdctools_3_50_03_33_core/packages/xdc/std.h")
    4300                            .dwattr $C$DW$T$210, DW_AT_decl_line(0xb6)
    4301                            .dwattr $C$DW$T$210, DW_AT_decl_column(0x0f)
    4302                            .dwendtag $C$DW$T$210
    4303                    
    4304                    $C$DW$T$830     .dwtag  DW_TAG_typedef
    4305                            .dwattr $C$DW$T$830, DW_AT_name("xdc_FloatData")
    4306                            .dwattr $C$DW$T$830, DW_AT_type(*$C$DW$T$210)
    4307                            .dwattr $C$DW$T$830, DW_AT_language(DW_LANG_C)
    4308                            .dwattr $C$DW$T$830, DW_AT_decl_file("C:/ti/xdctools_3_50_03_33_core/packages/xdc/std.h")
    4309                            .dwattr $C$DW$T$830, DW_AT_decl_line(0xb9)
    4310                            .dwattr $C$DW$T$830, DW_AT_decl_column(0x03)
    4311                    
    4312                    
    4313                    $C$DW$T$215     .dwtag  DW_TAG_union_type
    4314                            .dwattr $C$DW$T$215, DW_AT_byte_size(0x02)
    4315                    $C$DW$390       .dwtag  DW_TAG_member
    4316                            .dwattr $C$DW$390, DW_AT_type(*$C$DW$T$212)
    4317                            .dwattr $C$DW$390, DW_AT_name("entityId")
    4318                            .dwattr $C$DW$390, DW_AT_TI_symbol_name("entityId")
    4319                            .dwattr $C$DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4320                            .dwattr $C$DW$390, DW_AT_accessibility(DW_ACCESS_public)
    4321                            .dwattr $C$DW$390, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    4322                            .dwattr $C$DW$390, DW_AT_decl_line(0x1fe)
    4323                            .dwattr $C$DW$390, DW_AT_decl_column(0x14)
    4324                    
    4325                    $C$DW$391       .dwtag  DW_TAG_member
    4326                            .dwattr $C$DW$391, DW_AT_type(*$C$DW$T$214)
    4327                            .dwattr $C$DW$391, DW_AT_name("servId")
    4328                            .dwattr $C$DW$391, DW_AT_TI_symbol_name("servId")
    4329                            .dwattr $C$DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4330                            .dwattr $C$DW$391, DW_AT_accessibility(DW_ACCESS_public)
    4331                            .dwattr $C$DW$391, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    4332                            .dwattr $C$DW$391, DW_AT_decl_line(0x200)
    4333                            .dwattr $C$DW$391, DW_AT_decl_column(0x17)
    4334                    
    4335                            .dwattr $C$DW$T$215, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154st
    4336                            .dwattr $C$DW$T$215, DW_AT_decl_line(0x1fc)
    4337                            .dwattr $C$DW$T$215, DW_AT_decl_column(0x03)
    4338                            .dwendtag $C$DW$T$215
    4339                    
    4340                    
    4341                    $C$DW$T$216     .dwtag  DW_TAG_union_type
TI ARM Assembler PC v16.9.4 Sat Apr 14 19:24:42 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{45093464-70BA-42D9-8680-B044D19F6979} PAGE   80

    4342                            .dwattr $C$DW$T$216, DW_AT_byte_size(0x02)
    4343                    $C$DW$392       .dwtag  DW_TAG_member
    4344                            .dwattr $C$DW$392, DW_AT_type(*$C$DW$T$214)
    4345                            .dwattr $C$DW$392, DW_AT_name("servId")
    4346                            .dwattr $C$DW$392, DW_AT_TI_symbol_name("servId")
    4347                            .dwattr $C$DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4348                            .dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)
    4349                            .dwattr $C$DW$392, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    4350                            .dwattr $C$DW$392, DW_AT_decl_line(0x211)
    4351                            .dwattr $C$DW$392, DW_AT_decl_column(0x17)
    4352                    
    4353                    $C$DW$393       .dwtag  DW_TAG_member
    4354                            .dwattr $C$DW$393, DW_AT_type(*$C$DW$T$212)
    4355                            .dwattr $C$DW$393, DW_AT_name("entityId")
    4356                            .dwattr $C$DW$393, DW_AT_TI_symbol_name("entityId")
    4357                            .dwattr $C$DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4358                            .dwattr $C$DW$393, DW_AT_accessibility(DW_ACCESS_public)
    4359                            .dwattr $C$DW$393, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    4360                            .dwattr $C$DW$393, DW_AT_decl_line(0x213)
    4361                            .dwattr $C$DW$393, DW_AT_decl_column(0x14)
    4362                    
    4363                            .dwattr $C$DW$T$216, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154st
    4364                            .dwattr $C$DW$T$216, DW_AT_decl_line(0x20f)
    4365                            .dwattr $C$DW$T$216, DW_AT_decl_column(0x03)
    4366                            .dwendtag $C$DW$T$216
    4367                    
    4368                    
    4369                    $C$DW$T$219     .dwtag  DW_TAG_union_type
    4370                            .dwattr $C$DW$T$219, DW_AT_byte_size(0x08)
    4371                    $C$DW$394       .dwtag  DW_TAG_member
    4372                            .dwattr $C$DW$394, DW_AT_type(*$C$DW$T$170)
    4373                            .dwattr $C$DW$394, DW_AT_name("shortAddr")
    4374                            .dwattr $C$DW$394, DW_AT_TI_symbol_name("shortAddr")
    4375                            .dwattr $C$DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4376                            .dwattr $C$DW$394, DW_AT_accessibility(DW_ACCESS_public)
    4377                            .dwattr $C$DW$394, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/ap
    4378                            .dwattr $C$DW$394, DW_AT_decl_line(0x4a4)
    4379                            .dwattr $C$DW$394, DW_AT_decl_column(0x12)
    4380                    
    4381                    $C$DW$395       .dwtag  DW_TAG_member
    4382                            .dwattr $C$DW$395, DW_AT_type(*$C$DW$T$218)
    4383                            .dwattr $C$DW$395, DW_AT_name("extAddr")
    4384                            .dwattr $C$DW$395, DW_AT_TI_symbol_name("extAddr")
    4385                            .dwattr $C$DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4386                            .dwattr $C$DW$395, DW_AT_accessibility(DW_ACCESS_public)
    4387                            .dwattr $C$DW$395, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/ap
    4388                            .dwattr $C$DW$395, DW_AT_decl_line(0x4a6)
    4389                            .dwattr $C$DW$395, DW_AT_decl_column(0x1b)
    4390                    
    4391                            .dwattr $C$DW$T$219, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/
    4392                            .dwattr $C$DW$T$219, DW_AT_decl_line(0x4a2)
    4393                            .dwattr $C$DW$T$219, DW_AT_decl_column(0x05)
    4394                            .dwendtag $C$DW$T$219
    4395                    
    4396                    
TI ARM Assembler PC v16.9.4 Sat Apr 14 19:24:42 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{45093464-70BA-42D9-8680-B044D19F6979} PAGE   81

    4397                    $C$DW$T$222     .dwtag  DW_TAG_union_type
    4398                            .dwattr $C$DW$T$222, DW_AT_byte_size(0x18)
    4399                    $C$DW$396       .dwtag  DW_TAG_member
    4400                            .dwattr $C$DW$396, DW_AT_type(*$C$DW$T$220)
    4401                            .dwattr $C$DW$396, DW_AT_name("beacon")
    4402                            .dwattr $C$DW$396, DW_AT_TI_symbol_name("beacon")
    4403                            .dwattr $C$DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4404                            .dwattr $C$DW$396, DW_AT_accessibility(DW_ACCESS_public)
    4405                            .dwattr $C$DW$396, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/ap
    4406                            .dwattr $C$DW$396, DW_AT_decl_line(0x854)
    4407                            .dwattr $C$DW$396, DW_AT_decl_column(0x1d)
    4408                    
    4409                    $C$DW$397       .dwtag  DW_TAG_member
    4410                            .dwattr $C$DW$397, DW_AT_type(*$C$DW$T$221)
    4411                            .dwattr $C$DW$397, DW_AT_name("eBeacon")
    4412                            .dwattr $C$DW$397, DW_AT_TI_symbol_name("eBeacon")
    4413                            .dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4414                            .dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_public)
    4415                            .dwattr $C$DW$397, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/ap
    4416                            .dwattr $C$DW$397, DW_AT_decl_line(0x856)
    4417                            .dwattr $C$DW$397, DW_AT_decl_column(0x1e)
    4418                    
    4419                            .dwattr $C$DW$T$222, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/
    4420                            .dwattr $C$DW$T$222, DW_AT_decl_line(0x852)
    4421                            .dwattr $C$DW$T$222, DW_AT_decl_column(0x05)
    4422                            .dwendtag $C$DW$T$222
    4423                    
    4424                    
    4425                    $C$DW$T$224     .dwtag  DW_TAG_union_type
    4426                            .dwattr $C$DW$T$224, DW_AT_byte_size(0x04)
    4427                    $C$DW$398       .dwtag  DW_TAG_member
    4428                            .dwattr $C$DW$398, DW_AT_type(*$C$DW$T$154)
    4429                            .dwattr $C$DW$398, DW_AT_name("pEnergyDetect")
    4430                            .dwattr $C$DW$398, DW_AT_TI_symbol_name("pEnergyDetect")
    4431                            .dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4432                            .dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_public)
    4433                            .dwattr $C$DW$398, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/ap
    4434                            .dwattr $C$DW$398, DW_AT_decl_line(0x876)
    4435                            .dwattr $C$DW$398, DW_AT_decl_column(0x12)
    4436                    
    4437                    $C$DW$399       .dwtag  DW_TAG_member
    4438                            .dwattr $C$DW$399, DW_AT_type(*$C$DW$T$223)
    4439                            .dwattr $C$DW$399, DW_AT_name("pPanDescriptor")
    4440                            .dwattr $C$DW$399, DW_AT_TI_symbol_name("pPanDescriptor")
    4441                            .dwattr $C$DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4442                            .dwattr $C$DW$399, DW_AT_accessibility(DW_ACCESS_public)
    4443                            .dwattr $C$DW$399, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/ap
    4444                            .dwattr $C$DW$399, DW_AT_decl_line(0x878)
    4445                            .dwattr $C$DW$399, DW_AT_decl_column(0x1b)
    4446                    
    4447                            .dwattr $C$DW$T$224, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/
    4448                            .dwattr $C$DW$T$224, DW_AT_decl_line(0x874)
    4449                            .dwattr $C$DW$T$224, DW_AT_decl_column(0x05)
    4450                            .dwendtag $C$DW$T$224
    4451                    
TI ARM Assembler PC v16.9.4 Sat Apr 14 19:24:42 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{45093464-70BA-42D9-8680-B044D19F6979} PAGE   82

    4452                    
    4453                    $C$DW$T$228     .dwtag  DW_TAG_structure_type
    4454                            .dwattr $C$DW$T$228, DW_AT_name(".ggroup1")
    4455                            .dwattr $C$DW$T$228, DW_AT_byte_size(0x58)
    4456                    $C$DW$400       .dwtag  DW_TAG_member
    4457                            .dwattr $C$DW$400, DW_AT_type(*$C$DW$T$225)
    4458                            .dwattr $C$DW$400, DW_AT_name("ledPinHandle")
    4459                            .dwattr $C$DW$400, DW_AT_TI_symbol_name("ledPinHandle")
    4460                            .dwattr $C$DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4461                            .dwattr $C$DW$400, DW_AT_accessibility(DW_ACCESS_public)
    4462                    
    4463                    $C$DW$401       .dwtag  DW_TAG_member
    4464                            .dwattr $C$DW$401, DW_AT_type(*$C$DW$T$226)
    4465                            .dwattr $C$DW$401, DW_AT_name("ledStatus")
    4466                            .dwattr $C$DW$401, DW_AT_TI_symbol_name("ledStatus")
    4467                            .dwattr $C$DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4468                            .dwattr $C$DW$401, DW_AT_accessibility(DW_ACCESS_public)
    4469                    
    4470                    $C$DW$402       .dwtag  DW_TAG_member
    4471                            .dwattr $C$DW$402, DW_AT_type(*$C$DW$T$242)
    4472                            .dwattr $C$DW$402, DW_AT_name("ledPinState")
    4473                            .dwattr $C$DW$402, DW_AT_TI_symbol_name("ledPinState")
    4474                            .dwattr $C$DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4475                            .dwattr $C$DW$402, DW_AT_accessibility(DW_ACCESS_public)
    4476                    
    4477                    $C$DW$403       .dwtag  DW_TAG_member
    4478                            .dwattr $C$DW$403, DW_AT_type(*$C$DW$T$227)
    4479                            .dwattr $C$DW$403, DW_AT_name("ledPinTable")
    4480                            .dwattr $C$DW$403, DW_AT_TI_symbol_name("ledPinTable")
    4481                            .dwattr $C$DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    4482                            .dwattr $C$DW$403, DW_AT_accessibility(DW_ACCESS_public)
    4483                    
    4484                    $C$DW$404       .dwtag  DW_TAG_member
    4485                            .dwattr $C$DW$404, DW_AT_type(*$C$DW$T$573)
    4486                            .dwattr $C$DW$404, DW_AT_name("blinkClkStruct")
    4487                            .dwattr $C$DW$404, DW_AT_TI_symbol_name("blinkClkStruct")
    4488                            .dwattr $C$DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    4489                            .dwattr $C$DW$404, DW_AT_accessibility(DW_ACCESS_public)
    4490                    
    4491                            .dwendtag $C$DW$T$228
    4492                    
    4493                    
    4494                    $C$DW$T$832     .dwtag  DW_TAG_enumeration_type
    4495                            .dwattr $C$DW$T$832, DW_AT_name("CC13X0_LAUNCHXL_ADCBufName")
    4496                            .dwattr $C$DW$T$832, DW_AT_byte_size(0x01)
    4497                    $C$DW$405       .dwtag  DW_TAG_enumerator
    4498                            .dwattr $C$DW$405, DW_AT_name("CC13X0_LAUNCHXL_ADCBuf0")
    4499                            .dwattr $C$DW$405, DW_AT_const_value(0x00)
    4500                            .dwattr $C$DW$405, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC131
    4501                            .dwattr $C$DW$405, DW_AT_decl_line(0x129)
    4502                            .dwattr $C$DW$405, DW_AT_decl_column(0x05)
    4503                    
    4504                    $C$DW$406       .dwtag  DW_TAG_enumerator
    4505                            .dwattr $C$DW$406, DW_AT_name("CC13X0_LAUNCHXL_ADCBufCOUNT")
    4506                            .dwattr $C$DW$406, DW_AT_const_value(0x01)
TI ARM Assembler PC v16.9.4 Sat Apr 14 19:24:42 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{45093464-70BA-42D9-8680-B044D19F6979} PAGE   83

    4507                            .dwattr $C$DW$406, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC131
    4508                            .dwattr $C$DW$406, DW_AT_decl_line(0x12a)
    4509                            .dwattr $C$DW$406, DW_AT_decl_column(0x05)
    4510                    
    4511                            .dwattr $C$DW$T$832, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC1
    4512                            .dwattr $C$DW$T$832, DW_AT_decl_line(0x128)
    4513                            .dwattr $C$DW$T$832, DW_AT_decl_column(0x0e)
    4514                            .dwendtag $C$DW$T$832
    4515                    
    4516                    $C$DW$T$833     .dwtag  DW_TAG_typedef
    4517                            .dwattr $C$DW$T$833, DW_AT_name("CC13X0_LAUNCHXL_ADCBufName")
    4518                            .dwattr $C$DW$T$833, DW_AT_type(*$C$DW$T$832)
    4519                            .dwattr $C$DW$T$833, DW_AT_language(DW_LANG_C)
    4520                            .dwattr $C$DW$T$833, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC1
    4521                            .dwattr $C$DW$T$833, DW_AT_decl_line(0x12b)
    4522                            .dwattr $C$DW$T$833, DW_AT_decl_column(0x03)
    4523                    
    4524                    
    4525                    $C$DW$T$834     .dwtag  DW_TAG_enumeration_type
    4526                            .dwattr $C$DW$T$834, DW_AT_name("CC13X0_LAUNCHXL_ADCName")
    4527                            .dwattr $C$DW$T$834, DW_AT_byte_size(0x01)
    4528                    $C$DW$407       .dwtag  DW_TAG_enumerator
    4529                            .dwattr $C$DW$407, DW_AT_name("CC13X0_LAUNCHXL_ADC0")
    4530                            .dwattr $C$DW$407, DW_AT_const_value(0x00)
    4531                            .dwattr $C$DW$407, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC131
    4532                            .dwattr $C$DW$407, DW_AT_decl_line(0x133)
    4533                            .dwattr $C$DW$407, DW_AT_decl_column(0x05)
    4534                    
    4535                    $C$DW$408       .dwtag  DW_TAG_enumerator
    4536                            .dwattr $C$DW$408, DW_AT_name("CC13X0_LAUNCHXL_ADC1")
    4537                            .dwattr $C$DW$408, DW_AT_const_value(0x01)
    4538                            .dwattr $C$DW$408, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC131
    4539                            .dwattr $C$DW$408, DW_AT_decl_line(0x134)
    4540                            .dwattr $C$DW$408, DW_AT_decl_column(0x05)
    4541                    
    4542                    $C$DW$409       .dwtag  DW_TAG_enumerator
    4543                            .dwattr $C$DW$409, DW_AT_name("CC13X0_LAUNCHXL_ADC2")
    4544                            .dwattr $C$DW$409, DW_AT_const_value(0x02)
    4545                            .dwattr $C$DW$409, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC131
    4546                            .dwattr $C$DW$409, DW_AT_decl_line(0x135)
    4547                            .dwattr $C$DW$409, DW_AT_decl_column(0x05)
    4548                    
    4549                    $C$DW$410       .dwtag  DW_TAG_enumerator
    4550                            .dwattr $C$DW$410, DW_AT_name("CC13X0_LAUNCHXL_ADC3")
    4551                            .dwattr $C$DW$410, DW_AT_const_value(0x03)
    4552                            .dwattr $C$DW$410, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC131
    4553                            .dwattr $C$DW$410, DW_AT_decl_line(0x136)
    4554                            .dwattr $C$DW$410, DW_AT_decl_column(0x05)
    4555                    
    4556                    $C$DW$411       .dwtag  DW_TAG_enumerator
    4557                            .dwattr $C$DW$411, DW_AT_name("CC13X0_LAUNCHXL_ADC4")
    4558                            .dwattr $C$DW$411, DW_AT_const_value(0x04)
    4559                            .dwattr $C$DW$411, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC131
    4560                            .dwattr $C$DW$411, DW_AT_decl_line(0x137)
    4561                            .dwattr $C$DW$411, DW_AT_decl_column(0x05)
TI ARM Assembler PC v16.9.4 Sat Apr 14 19:24:42 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{45093464-70BA-42D9-8680-B044D19F6979} PAGE   84

    4562                    
    4563                    $C$DW$412       .dwtag  DW_TAG_enumerator
    4564                            .dwattr $C$DW$412, DW_AT_name("CC13X0_LAUNCHXL_ADC5")
    4565                            .dwattr $C$DW$412, DW_AT_const_value(0x05)
    4566                            .dwattr $C$DW$412, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC131
    4567                            .dwattr $C$DW$412, DW_AT_decl_line(0x138)
    4568                            .dwattr $C$DW$412, DW_AT_decl_column(0x05)
    4569                    
    4570                    $C$DW$413       .dwtag  DW_TAG_enumerator
    4571                            .dwattr $C$DW$413, DW_AT_name("CC13X0_LAUNCHXL_ADC6")
    4572                            .dwattr $C$DW$413, DW_AT_const_value(0x06)
    4573                            .dwattr $C$DW$413, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC131
    4574                            .dwattr $C$DW$413, DW_AT_decl_line(0x139)
    4575                            .dwattr $C$DW$413, DW_AT_decl_column(0x05)
    4576                    
    4577                    $C$DW$414       .dwtag  DW_TAG_enumerator
    4578                            .dwattr $C$DW$414, DW_AT_name("CC13X0_LAUNCHXL_ADC7")
    4579                            .dwattr $C$DW$414, DW_AT_const_value(0x07)
    4580                            .dwattr $C$DW$414, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC131
    4581                            .dwattr $C$DW$414, DW_AT_decl_line(0x13a)
    4582                            .dwattr $C$DW$414, DW_AT_decl_column(0x05)
    4583                    
    4584                    $C$DW$415       .dwtag  DW_TAG_enumerator
    4585                            .dwattr $C$DW$415, DW_AT_name("CC13X0_LAUNCHXL_ADCDCOUPL")
    4586                            .dwattr $C$DW$415, DW_AT_const_value(0x08)
    4587                            .dwattr $C$DW$415, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC131
    4588                            .dwattr $C$DW$415, DW_AT_decl_line(0x13b)
    4589                            .dwattr $C$DW$415, DW_AT_decl_column(0x05)
    4590                    
    4591                    $C$DW$416       .dwtag  DW_TAG_enumerator
    4592                            .dwattr $C$DW$416, DW_AT_name("CC13X0_LAUNCHXL_ADCVSS")
    4593                            .dwattr $C$DW$416, DW_AT_const_value(0x09)
    4594                            .dwattr $C$DW$416, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC131
    4595                            .dwattr $C$DW$416, DW_AT_decl_line(0x13c)
    4596                            .dwattr $C$DW$416, DW_AT_decl_column(0x05)
    4597                    
    4598                    $C$DW$417       .dwtag  DW_TAG_enumerator
    4599                            .dwattr $C$DW$417, DW_AT_name("CC13X0_LAUNCHXL_ADCVDDS")
    4600                            .dwattr $C$DW$417, DW_AT_const_value(0x0a)
    4601                            .dwattr $C$DW$417, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC131
    4602                            .dwattr $C$DW$417, DW_AT_decl_line(0x13d)
    4603                            .dwattr $C$DW$417, DW_AT_decl_column(0x05)
    4604                    
    4605                    $C$DW$418       .dwtag  DW_TAG_enumerator
    4606                            .dwattr $C$DW$418, DW_AT_name("CC13X0_LAUNCHXL_ADCCOUNT")
    4607                            .dwattr $C$DW$418, DW_AT_const_value(0x0b)
    4608                            .dwattr $C$DW$418, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC131
    4609                            .dwattr $C$DW$418, DW_AT_decl_line(0x13e)
    4610                            .dwattr $C$DW$418, DW_AT_decl_column(0x05)
    4611                    
    4612                            .dwattr $C$DW$T$834, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC1
    4613                            .dwattr $C$DW$T$834, DW_AT_decl_line(0x132)
    4614                            .dwattr $C$DW$T$834, DW_AT_decl_column(0x0e)
    4615                            .dwendtag $C$DW$T$834
    4616                    
TI ARM Assembler PC v16.9.4 Sat Apr 14 19:24:42 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{45093464-70BA-42D9-8680-B044D19F6979} PAGE   85

    4617                    $C$DW$T$835     .dwtag  DW_TAG_typedef
    4618                            .dwattr $C$DW$T$835, DW_AT_name("CC13X0_LAUNCHXL_ADCName")
    4619                            .dwattr $C$DW$T$835, DW_AT_type(*$C$DW$T$834)
    4620                            .dwattr $C$DW$T$835, DW_AT_language(DW_LANG_C)
    4621                            .dwattr $C$DW$T$835, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC1
    4622                            .dwattr $C$DW$T$835, DW_AT_decl_line(0x13f)
    4623                            .dwattr $C$DW$T$835, DW_AT_decl_column(0x03)
    4624                    
    4625                    
    4626                    $C$DW$T$836     .dwtag  DW_TAG_enumeration_type
    4627                            .dwattr $C$DW$T$836, DW_AT_name("CC13X0_LAUNCHXL_CryptoName")
    4628                            .dwattr $C$DW$T$836, DW_AT_byte_size(0x01)
    4629                    $C$DW$419       .dwtag  DW_TAG_enumerator
    4630                            .dwattr $C$DW$419, DW_AT_name("CC13X0_LAUNCHXL_CRYPTO0")
    4631                            .dwattr $C$DW$419, DW_AT_const_value(0x00)
    4632                            .dwattr $C$DW$419, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC131
    4633                            .dwattr $C$DW$419, DW_AT_decl_line(0xd0)
    4634                            .dwattr $C$DW$419, DW_AT_decl_column(0x05)
    4635                    
    4636                    $C$DW$420       .dwtag  DW_TAG_enumerator
    4637                            .dwattr $C$DW$420, DW_AT_name("CC13X0_LAUNCHXL_CRYPTOCOUNT")
    4638                            .dwattr $C$DW$420, DW_AT_const_value(0x01)
    4639                            .dwattr $C$DW$420, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC131
    4640                            .dwattr $C$DW$420, DW_AT_decl_line(0xd2)
    4641                            .dwattr $C$DW$420, DW_AT_decl_column(0x05)
    4642                    
    4643                            .dwattr $C$DW$T$836, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC1
    4644                            .dwattr $C$DW$T$836, DW_AT_decl_line(0xcf)
    4645                            .dwattr $C$DW$T$836, DW_AT_decl_column(0x0e)
    4646                            .dwendtag $C$DW$T$836
    4647                    
    4648                    $C$DW$T$837     .dwtag  DW_TAG_typedef
    4649                            .dwattr $C$DW$T$837, DW_AT_name("CC13X0_LAUNCHXL_CryptoName")
    4650                            .dwattr $C$DW$T$837, DW_AT_type(*$C$DW$T$836)
    4651                            .dwattr $C$DW$T$837, DW_AT_language(DW_LANG_C)
    4652                            .dwattr $C$DW$T$837, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC1
    4653                            .dwattr $C$DW$T$837, DW_AT_decl_line(0xd3)
    4654                            .dwattr $C$DW$T$837, DW_AT_decl_column(0x03)
    4655                    
    4656                    
    4657                    $C$DW$T$838     .dwtag  DW_TAG_enumeration_type
    4658                            .dwattr $C$DW$T$838, DW_AT_name("CC13X0_LAUNCHXL_GPTimerName")
    4659                            .dwattr $C$DW$T$838, DW_AT_byte_size(0x01)
    4660                    $C$DW$421       .dwtag  DW_TAG_enumerator
    4661                            .dwattr $C$DW$421, DW_AT_name("CC13X0_LAUNCHXL_GPTIMER0A")
    4662                            .dwattr $C$DW$421, DW_AT_const_value(0x00)
    4663                            .dwattr $C$DW$421, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC131
    4664                            .dwattr $C$DW$421, DW_AT_decl_line(0xfb)
    4665                            .dwattr $C$DW$421, DW_AT_decl_column(0x05)
    4666                    
    4667                    $C$DW$422       .dwtag  DW_TAG_enumerator
    4668                            .dwattr $C$DW$422, DW_AT_name("CC13X0_LAUNCHXL_GPTIMER0B")
    4669                            .dwattr $C$DW$422, DW_AT_const_value(0x01)
    4670                            .dwattr $C$DW$422, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC131
    4671                            .dwattr $C$DW$422, DW_AT_decl_line(0xfc)
TI ARM Assembler PC v16.9.4 Sat Apr 14 19:24:42 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{45093464-70BA-42D9-8680-B044D19F6979} PAGE   86

    4672                            .dwattr $C$DW$422, DW_AT_decl_column(0x05)
    4673                    
    4674                    $C$DW$423       .dwtag  DW_TAG_enumerator
    4675                            .dwattr $C$DW$423, DW_AT_name("CC13X0_LAUNCHXL_GPTIMER1A")
    4676                            .dwattr $C$DW$423, DW_AT_const_value(0x02)
    4677                            .dwattr $C$DW$423, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC131
    4678                            .dwattr $C$DW$423, DW_AT_decl_line(0xfd)
    4679                            .dwattr $C$DW$423, DW_AT_decl_column(0x05)
    4680                    
    4681                    $C$DW$424       .dwtag  DW_TAG_enumerator
    4682                            .dwattr $C$DW$424, DW_AT_name("CC13X0_LAUNCHXL_GPTIMER1B")
    4683                            .dwattr $C$DW$424, DW_AT_const_value(0x03)
    4684                            .dwattr $C$DW$424, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC131
    4685                            .dwattr $C$DW$424, DW_AT_decl_line(0xfe)
    4686                            .dwattr $C$DW$424, DW_AT_decl_column(0x05)
    4687                    
    4688                    $C$DW$425       .dwtag  DW_TAG_enumerator
    4689                            .dwattr $C$DW$425, DW_AT_name("CC13X0_LAUNCHXL_GPTIMER2A")
    4690                            .dwattr $C$DW$425, DW_AT_const_value(0x04)
    4691                            .dwattr $C$DW$425, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC131
    4692                            .dwattr $C$DW$425, DW_AT_decl_line(0xff)
    4693                            .dwattr $C$DW$425, DW_AT_decl_column(0x05)
    4694                    
    4695                    $C$DW$426       .dwtag  DW_TAG_enumerator
    4696                            .dwattr $C$DW$426, DW_AT_name("CC13X0_LAUNCHXL_GPTIMER2B")
    4697                            .dwattr $C$DW$426, DW_AT_const_value(0x05)
    4698                            .dwattr $C$DW$426, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC131
    4699                            .dwattr $C$DW$426, DW_AT_decl_line(0x100)
    4700                            .dwattr $C$DW$426, DW_AT_decl_column(0x05)
    4701                    
    4702                    $C$DW$427       .dwtag  DW_TAG_enumerator
    4703                            .dwattr $C$DW$427, DW_AT_name("CC13X0_LAUNCHXL_GPTIMER3A")
    4704                            .dwattr $C$DW$427, DW_AT_const_value(0x06)
    4705                            .dwattr $C$DW$427, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC131
    4706                            .dwattr $C$DW$427, DW_AT_decl_line(0x101)
    4707                            .dwattr $C$DW$427, DW_AT_decl_column(0x05)
    4708                    
    4709                    $C$DW$428       .dwtag  DW_TAG_enumerator
    4710                            .dwattr $C$DW$428, DW_AT_name("CC13X0_LAUNCHXL_GPTIMER3B")
    4711                            .dwattr $C$DW$428, DW_AT_const_value(0x07)
    4712                            .dwattr $C$DW$428, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC131
    4713                            .dwattr $C$DW$428, DW_AT_decl_line(0x102)
    4714                            .dwattr $C$DW$428, DW_AT_decl_column(0x05)
    4715                    
    4716                    $C$DW$429       .dwtag  DW_TAG_enumerator
    4717                            .dwattr $C$DW$429, DW_AT_name("CC13X0_LAUNCHXL_GPTIMERPARTSCOUNT")
    4718                            .dwattr $C$DW$429, DW_AT_const_value(0x08)
    4719                            .dwattr $C$DW$429, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC131
    4720                            .dwattr $C$DW$429, DW_AT_decl_line(0x103)
    4721                            .dwattr $C$DW$429, DW_AT_decl_column(0x05)
    4722                    
    4723                            .dwattr $C$DW$T$838, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC1
    4724                            .dwattr $C$DW$T$838, DW_AT_decl_line(0xf9)
    4725                            .dwattr $C$DW$T$838, DW_AT_decl_column(0x0e)
    4726                            .dwendtag $C$DW$T$838
TI ARM Assembler PC v16.9.4 Sat Apr 14 19:24:42 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{45093464-70BA-42D9-8680-B044D19F6979} PAGE   87

    4727                    
    4728                    $C$DW$T$839     .dwtag  DW_TAG_typedef
    4729                            .dwattr $C$DW$T$839, DW_AT_name("CC13X0_LAUNCHXL_GPTimerName")
    4730                            .dwattr $C$DW$T$839, DW_AT_type(*$C$DW$T$838)
    4731                            .dwattr $C$DW$T$839, DW_AT_language(DW_LANG_C)
    4732                            .dwattr $C$DW$T$839, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC1
    4733                            .dwattr $C$DW$T$839, DW_AT_decl_line(0x104)
    4734                            .dwattr $C$DW$T$839, DW_AT_decl_column(0x03)
    4735                    
    4736                    
    4737                    $C$DW$T$840     .dwtag  DW_TAG_enumeration_type
    4738                            .dwattr $C$DW$T$840, DW_AT_name("CC13X0_LAUNCHXL_GPTimers")
    4739                            .dwattr $C$DW$T$840, DW_AT_byte_size(0x01)
    4740                    $C$DW$430       .dwtag  DW_TAG_enumerator
    4741                            .dwattr $C$DW$430, DW_AT_name("CC13X0_LAUNCHXL_GPTIMER0")
    4742                            .dwattr $C$DW$430, DW_AT_const_value(0x00)
    4743                            .dwattr $C$DW$430, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC131
    4744                            .dwattr $C$DW$430, DW_AT_decl_line(0x10c)
    4745                            .dwattr $C$DW$430, DW_AT_decl_column(0x05)
    4746                    
    4747                    $C$DW$431       .dwtag  DW_TAG_enumerator
    4748                            .dwattr $C$DW$431, DW_AT_name("CC13X0_LAUNCHXL_GPTIMER1")
    4749                            .dwattr $C$DW$431, DW_AT_const_value(0x01)
    4750                            .dwattr $C$DW$431, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC131
    4751                            .dwattr $C$DW$431, DW_AT_decl_line(0x10d)
    4752                            .dwattr $C$DW$431, DW_AT_decl_column(0x05)
    4753                    
    4754                    $C$DW$432       .dwtag  DW_TAG_enumerator
    4755                            .dwattr $C$DW$432, DW_AT_name("CC13X0_LAUNCHXL_GPTIMER2")
    4756                            .dwattr $C$DW$432, DW_AT_const_value(0x02)
    4757                            .dwattr $C$DW$432, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC131
    4758                            .dwattr $C$DW$432, DW_AT_decl_line(0x10e)
    4759                            .dwattr $C$DW$432, DW_AT_decl_column(0x05)
    4760                    
    4761                    $C$DW$433       .dwtag  DW_TAG_enumerator
    4762                            .dwattr $C$DW$433, DW_AT_name("CC13X0_LAUNCHXL_GPTIMER3")
    4763                            .dwattr $C$DW$433, DW_AT_const_value(0x03)
    4764                            .dwattr $C$DW$433, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC131
    4765                            .dwattr $C$DW$433, DW_AT_decl_line(0x10f)
    4766                            .dwattr $C$DW$433, DW_AT_decl_column(0x05)
    4767                    
    4768                    $C$DW$434       .dwtag  DW_TAG_enumerator
    4769                            .dwattr $C$DW$434, DW_AT_name("CC13X0_LAUNCHXL_GPTIMERCOUNT")
    4770                            .dwattr $C$DW$434, DW_AT_const_value(0x04)
    4771                            .dwattr $C$DW$434, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC131
