TI ARM Assembler PC v16.9.4 Thu Apr 12 20:27:36 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{C001DE3B-F0FF-445D-8CCE-7D0EAD14970B} PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                        PC v16.9.4.LTS *
       3                    ;* Date/Time created: Thu Apr 12 20:27:35 2018                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../Application/LaunchPad/CC13X0_LAUNCHXL.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v16.9.4.LTS Copyright (c) 1996-20
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Kevin\workspace_v7\sensor_cc1310lp\sensor_cc1310lp"
      13                    
      14                    $C$DW$1 .dwtag  DW_TAG_subprogram

    1233                            .dwattr $C$DW$86, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/rf
    1234                            .dwattr $C$DW$86, DW_AT_decl_line(0x2de)
    1235                            .dwattr $C$DW$86, DW_AT_decl_column(0x05)
    1236                    
    1237                    $C$DW$87        .dwtag  DW_TAG_enumerator
    1238                            .dwattr $C$DW$87, DW_AT_name("RF_StatSuccess")
    1239                            .dwattr $C$DW$87, DW_AT_const_value(0x83)
    1240                            .dwattr $C$DW$87, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/rf
    1241                            .dwattr $C$DW$87, DW_AT_decl_line(0x2df)
    1242                            .dwattr $C$DW$87, DW_AT_decl_column(0x05)
    1243                    
    1244                            .dwattr $C$DW$T$1128, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/driver
    1245                            .dwattr $C$DW$T$1128, DW_AT_decl_line(0x2d6)
    1246                            .dwattr $C$DW$T$1128, DW_AT_decl_column(0x0e)
    1247                            .dwendtag $C$DW$T$1128
    1248                    
    1249                    $C$DW$T$1129    .dwtag  DW_TAG_typedef
    1250                            .dwattr $C$DW$T$1129, DW_AT_name("RF_Stat")
    1251                            .dwattr $C$DW$T$1129, DW_AT_type(*$C$DW$T$1128)
    1252                            .dwattr $C$DW$T$1129, DW_AT_language(DW_LANG_C)
    1253                            .dwattr $C$DW$T$1129, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/driver
    1254                            .dwattr $C$DW$T$1129, DW_AT_decl_line(0x2e0)
    1255                            .dwattr $C$DW$T$1129, DW_AT_decl_column(0x03)
    1256                    
    1257                    
    1258                    $C$DW$T$1130    .dwtag  DW_TAG_enumeration_type
    1259                            .dwattr $C$DW$T$1130, DW_AT_byte_size(0x01)
    1260                    $C$DW$88        .dwtag  DW_TAG_enumerator
    1261                            .dwattr $C$DW$88, DW_AT_name("RF_GET_CURR_CMD")
    1262                            .dwattr $C$DW$88, DW_AT_const_value(0x00)
    1263                            .dwattr $C$DW$88, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/rf
    1264                            .dwattr $C$DW$88, DW_AT_decl_line(0x3aa)
TI ARM Assembler PC v16.9.4 Thu Apr 12 20:27:36 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{C001DE3B-F0FF-445D-8CCE-7D0EAD14970B} PAGE   24

    1265                            .dwattr $C$DW$88, DW_AT_decl_column(0x05)
    1266                    
    1267                    $C$DW$89        .dwtag  DW_TAG_enumerator
    1268                            .dwattr $C$DW$89, DW_AT_name("RF_GET_AVAIL_RAT_CH")
    1269                            .dwattr $C$DW$89, DW_AT_const_value(0x01)
    1270                            .dwattr $C$DW$89, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/rf
    1271                            .dwattr $C$DW$89, DW_AT_decl_line(0x3ab)
    1272                            .dwattr $C$DW$89, DW_AT_decl_column(0x05)
    1273                    
    1274                    $C$DW$90        .dwtag  DW_TAG_enumerator
    1275                            .dwattr $C$DW$90, DW_AT_name("RF_GET_RADIO_STATE")
    1276                            .dwattr $C$DW$90, DW_AT_const_value(0x02)
    1277                            .dwattr $C$DW$90, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/rf
    1278                            .dwattr $C$DW$90, DW_AT_decl_line(0x3ac)
    1279                            .dwattr $C$DW$90, DW_AT_decl_column(0x05)
    1280                    
    1281                    $C$DW$91        .dwtag  DW_TAG_enumerator
    1282                            .dwattr $C$DW$91, DW_AT_name("RF_GET_SCHEDULE_MAP")
    1283                            .dwattr $C$DW$91, DW_AT_const_value(0x03)
    1284                            .dwattr $C$DW$91, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/rf
    1285                            .dwattr $C$DW$91, DW_AT_decl_line(0x3ad)
    1286                            .dwattr $C$DW$91, DW_AT_decl_column(0x05)
    1287                    
    1288                            .dwattr $C$DW$T$1130, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/driver
    1289                            .dwattr $C$DW$T$1130, DW_AT_decl_line(0x3a9)
    1290                            .dwattr $C$DW$T$1130, DW_AT_decl_column(0x0e)
    1291                            .dwendtag $C$DW$T$1130
    1292                    
    1293                    $C$DW$T$1131    .dwtag  DW_TAG_typedef
    1294                            .dwattr $C$DW$T$1131, DW_AT_name("RF_InfoType")
    1295                            .dwattr $C$DW$T$1131, DW_AT_type(*$C$DW$T$1130)
    1296                            .dwattr $C$DW$T$1131, DW_AT_language(DW_LANG_C)
    1297                            .dwattr $C$DW$T$1131, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/driver
    1298                            .dwattr $C$DW$T$1131, DW_AT_decl_line(0x3ae)
    1299                            .dwattr $C$DW$T$1131, DW_AT_decl_column(0x03)
    1300                    
    1301                    
    1302                    $C$DW$T$110     .dwtag  DW_TAG_structure_type
    1303                            .dwattr $C$DW$T$110, DW_AT_byte_size(0x04)
    1304                    $C$DW$92        .dwtag  DW_TAG_member
    1305                            .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$109)
    1306                            .dwattr $C$DW$92, DW_AT_name("hwiCpe0Priority")
    1307                            .dwattr $C$DW$92, DW_AT_TI_symbol_name("hwiCpe0Priority")
    1308                            .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1309                            .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1310                            .dwattr $C$DW$92, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/rf
    1311                            .dwattr $C$DW$92, DW_AT_decl_line(0x33b)
    1312                            .dwattr $C$DW$92, DW_AT_decl_column(0x15)
    1313                    
    1314                    $C$DW$93        .dwtag  DW_TAG_member
    1315                            .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$109)
    1316                            .dwattr $C$DW$93, DW_AT_name("hwiHwPriority")
    1317                            .dwattr $C$DW$93, DW_AT_TI_symbol_name("hwiHwPriority")
    1318                            .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1319                            .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v16.9.4 Thu Apr 12 20:27:36 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{C001DE3B-F0FF-445D-8CCE-7D0EAD14970B} PAGE   25

    1320                            .dwattr $C$DW$93, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/rf
    1321                            .dwattr $C$DW$93, DW_AT_decl_line(0x33c)
    1322                            .dwattr $C$DW$93, DW_AT_decl_column(0x15)
    1323                    
    1324                    $C$DW$94        .dwtag  DW_TAG_member
    1325                            .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$109)
    1326                            .dwattr $C$DW$94, DW_AT_name("swiCpe0Priority")
    1327                            .dwattr $C$DW$94, DW_AT_TI_symbol_name("swiCpe0Priority")
    1328                            .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1329                            .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1330                            .dwattr $C$DW$94, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/rf
    1331                            .dwattr $C$DW$94, DW_AT_decl_line(0x33d)
    1332                            .dwattr $C$DW$94, DW_AT_decl_column(0x15)
    1333                    
    1334                    $C$DW$95        .dwtag  DW_TAG_member
    1335                            .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$109)
    1336                            .dwattr $C$DW$95, DW_AT_name("swiHwPriority")
    1337                            .dwattr $C$DW$95, DW_AT_TI_symbol_name("swiHwPriority")
    1338                            .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1339                            .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1340                            .dwattr $C$DW$95, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/rf
    1341                            .dwattr $C$DW$95, DW_AT_decl_line(0x33e)
    1342                            .dwattr $C$DW$95, DW_AT_decl_column(0x15)
    1343                    
    1344                            .dwattr $C$DW$T$110, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers
    1345                            .dwattr $C$DW$T$110, DW_AT_decl_line(0x33a)
    1346                            .dwattr $C$DW$T$110, DW_AT_decl_column(0x10)
    1347                            .dwendtag $C$DW$T$110
    1348                    
    1349                    $C$DW$T$1132    .dwtag  DW_TAG_typedef
    1350                            .dwattr $C$DW$T$1132, DW_AT_name("RFCC26XX_HWAttrs")
    1351                            .dwattr $C$DW$T$1132, DW_AT_type(*$C$DW$T$110)
    1352                            .dwattr $C$DW$T$1132, DW_AT_language(DW_LANG_C)
    1353                            .dwattr $C$DW$T$1132, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/driver
    1354                            .dwattr $C$DW$T$1132, DW_AT_decl_line(0x33f)
    1355                            .dwattr $C$DW$T$1132, DW_AT_decl_column(0x03)
    1356                    
    1357                    $C$DW$T$1133    .dwtag  DW_TAG_const_type
    1358                            .dwattr $C$DW$T$1133, DW_AT_type(*$C$DW$T$1132)
    1359                    
    1360                    
    1361                    $C$DW$T$112     .dwtag  DW_TAG_structure_type
    1362                            .dwattr $C$DW$T$112, DW_AT_byte_size(0x08)
    1363                    $C$DW$96        .dwtag  DW_TAG_member
    1364                            .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$111)
    1365                            .dwattr $C$DW$96, DW_AT_name("fg")
    1366                            .dwattr $C$DW$96, DW_AT_TI_symbol_name("fg")
    1367                            .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1368                            .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1369                            .dwattr $C$DW$96, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/display/Di
    1370                            .dwattr $C$DW$96, DW_AT_decl_line(0x53)
    1371                            .dwattr $C$DW$96, DW_AT_decl_column(0x0e)
    1372                    
    1373                    $C$DW$97        .dwtag  DW_TAG_member
    1374                            .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$111)
TI ARM Assembler PC v16.9.4 Thu Apr 12 20:27:36 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{C001DE3B-F0FF-445D-8CCE-7D0EAD14970B} PAGE   26

    1375                            .dwattr $C$DW$97, DW_AT_name("bg")
    1376                            .dwattr $C$DW$97, DW_AT_TI_symbol_name("bg")
    1377                            .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1378                            .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1379                            .dwattr $C$DW$97, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/display/Di
    1380                            .dwattr $C$DW$97, DW_AT_decl_line(0x54)
    1381                            .dwattr $C$DW$97, DW_AT_decl_column(0x0e)
    1382                    
    1383                            .dwattr $C$DW$T$112, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/display
    1384                            .dwattr $C$DW$T$112, DW_AT_decl_line(0x52)
    1385                            .dwattr $C$DW$T$112, DW_AT_decl_column(0x01)
    1386                            .dwendtag $C$DW$T$112
    1387                    
    1388                    $C$DW$T$418     .dwtag  DW_TAG_typedef
    1389                            .dwattr $C$DW$T$418, DW_AT_name("DisplaySharpColor_t")
    1390                            .dwattr $C$DW$T$418, DW_AT_type(*$C$DW$T$112)
    1391                            .dwattr $C$DW$T$418, DW_AT_language(DW_LANG_C)
    1392                            .dwattr $C$DW$T$418, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/display
    1393                            .dwattr $C$DW$T$418, DW_AT_decl_line(0x55)
    1394                            .dwattr $C$DW$T$418, DW_AT_decl_column(0x03)
    1395                    
    1396                    
    1397                    $C$DW$T$116     .dwtag  DW_TAG_structure_type
    1398                            .dwattr $C$DW$T$116, DW_AT_byte_size(0x08)
    1399                    $C$DW$98        .dwtag  DW_TAG_member
    1400                            .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$10)
    1401                            .dwattr $C$DW$98, DW_AT_name("length")
    1402                            .dwattr $C$DW$98, DW_AT_TI_symbol_name("length")
    1403                            .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1404                            .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1405                            .dwattr $C$DW$98, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/kernel/tirtos/packag
    1406                            .dwattr $C$DW$98, DW_AT_decl_line(0x36f)
    1407                            .dwattr $C$DW$98, DW_AT_decl_column(0x16)
    1408                    
    1409                    $C$DW$99        .dwtag  DW_TAG_member
    1410                            .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$115)
    1411                            .dwattr $C$DW$99, DW_AT_name("elem")
    1412                            .dwattr $C$DW$99, DW_AT_TI_symbol_name("elem")
    1413                            .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1414                            .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1415                            .dwattr $C$DW$99, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/kernel/tirtos/packag
    1416                            .dwattr $C$DW$99, DW_AT_decl_line(0x36f)
    1417                            .dwattr $C$DW$99, DW_AT_decl_column(0x44)
    1418                    
    1419                            .dwattr $C$DW$T$116, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/kernel/tirtos/pac
    1420                            .dwattr $C$DW$T$116, DW_AT_decl_line(0x36f)
    1421                            .dwattr $C$DW$T$116, DW_AT_decl_column(0x10)
    1422                            .dwendtag $C$DW$T$116
    1423                    
    1424                    $C$DW$T$1134    .dwtag  DW_TAG_typedef
    1425                            .dwattr $C$DW$T$1134, DW_AT_name("__ARRAY1_ti_sysbios_family_arm_m3_Hwi_hooks")
    1426                            .dwattr $C$DW$T$1134, DW_AT_type(*$C$DW$T$116)
    1427                            .dwattr $C$DW$T$1134, DW_AT_language(DW_LANG_C)
    1428                            .dwattr $C$DW$T$1134, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/kernel/tirtos/pa
    1429                            .dwattr $C$DW$T$1134, DW_AT_decl_line(0x36f)
TI ARM Assembler PC v16.9.4 Thu Apr 12 20:27:36 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{C001DE3B-F0FF-445D-8CCE-7D0EAD14970B} PAGE   27

    1430                            .dwattr $C$DW$T$1134, DW_AT_decl_column(0x4c)
    1431                    
    1432                    
    1433                    $C$DW$T$119     .dwtag  DW_TAG_structure_type
    1434                            .dwattr $C$DW$T$119, DW_AT_byte_size(0x08)
    1435                    $C$DW$100       .dwtag  DW_TAG_member
    1436                            .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$10)
    1437                            .dwattr $C$DW$100, DW_AT_name("length")
    1438                            .dwattr $C$DW$100, DW_AT_TI_symbol_name("length")
    1439                            .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1440                            .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1441                            .dwattr $C$DW$100, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/kernel/tirtos/packa
    1442                            .dwattr $C$DW$100, DW_AT_decl_line(0x370)
    1443                            .dwattr $C$DW$100, DW_AT_decl_column(0x16)
    1444                    
    1445                    $C$DW$101       .dwtag  DW_TAG_member
    1446                            .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$118)
    1447                            .dwattr $C$DW$101, DW_AT_name("elem")
    1448                            .dwattr $C$DW$101, DW_AT_TI_symbol_name("elem")
    1449                            .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1450                            .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1451                            .dwattr $C$DW$101, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/kernel/tirtos/packa
    1452                            .dwattr $C$DW$101, DW_AT_decl_line(0x370)
    1453                            .dwattr $C$DW$101, DW_AT_decl_column(0x4a)
    1454                    
    1455                            .dwattr $C$DW$T$119, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/kernel/tirtos/pac
    1456                            .dwattr $C$DW$T$119, DW_AT_decl_line(0x370)
    1457                            .dwattr $C$DW$T$119, DW_AT_decl_column(0x10)
    1458                            .dwendtag $C$DW$T$119
    1459                    
    1460                    $C$DW$T$1135    .dwtag  DW_TAG_typedef
    1461                            .dwattr $C$DW$T$1135, DW_AT_name("__CARRAY1_ti_sysbios_family_arm_m3_Hwi_hooks")
    1462                            .dwattr $C$DW$T$1135, DW_AT_type(*$C$DW$T$119)
    1463                            .dwattr $C$DW$T$1135, DW_AT_language(DW_LANG_C)
    1464                            .dwattr $C$DW$T$1135, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/kernel/tirtos/pa
    1465                            .dwattr $C$DW$T$1135, DW_AT_decl_line(0x370)
    1466                            .dwattr $C$DW$T$1135, DW_AT_decl_column(0x52)
    1467                    
    1468                    $C$DW$T$1136    .dwtag  DW_TAG_typedef
    1469                            .dwattr $C$DW$T$1136, DW_AT_name("CT__ti_sysbios_family_arm_m3_Hwi_hooks")
    1470                            .dwattr $C$DW$T$1136, DW_AT_type(*$C$DW$T$1135)
    1471                            .dwattr $C$DW$T$1136, DW_AT_language(DW_LANG_C)
    1472                            .dwattr $C$DW$T$1136, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/kernel/tirtos/pa
    1473                            .dwattr $C$DW$T$1136, DW_AT_decl_line(0x372)
    1474                            .dwattr $C$DW$T$1136, DW_AT_decl_column(0x36)
    1475                    
    1476                    $C$DW$T$1137    .dwtag  DW_TAG_typedef
    1477                            .dwattr $C$DW$T$1137, DW_AT_name("__TA_ti_sysbios_family_arm_m3_Hwi_hooks")
    1478                            .dwattr $C$DW$T$1137, DW_AT_type(*$C$DW$T$1135)
    1479                            .dwattr $C$DW$T$1137, DW_AT_language(DW_LANG_C)
    1480                            .dwattr $C$DW$T$1137, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/kernel/tirtos/pa
    1481                            .dwattr $C$DW$T$1137, DW_AT_decl_line(0x371)
    1482                            .dwattr $C$DW$T$1137, DW_AT_decl_column(0x36)
    1483                    
    1484                    
TI ARM Assembler PC v16.9.4 Thu Apr 12 20:27:36 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{C001DE3B-F0FF-445D-8CCE-7D0EAD14970B} PAGE   28

    1485                    $C$DW$T$159     .dwtag  DW_TAG_structure_type
    1486                            .dwattr $C$DW$T$159, DW_AT_byte_size(0x4c)
    1487                    $C$DW$102       .dwtag  DW_TAG_member
    1488                            .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$123)
    1489                            .dwattr $C$DW$102, DW_AT_name("Crc32")
    1490                            .dwattr $C$DW$102, DW_AT_TI_symbol_name("Crc32")
    1491                            .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1492                            .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1493                            .dwattr $C$DW$102, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    1494                            .dwattr $C$DW$102, DW_AT_decl_line(0x76)
    1495                            .dwattr $C$DW$102, DW_AT_decl_column(0x25)
    1496                    
    1497                    $C$DW$103       .dwtag  DW_TAG_member
    1498                            .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$126)
    1499                            .dwattr $C$DW$103, DW_AT_name("FlashGetSize")
    1500                            .dwattr $C$DW$103, DW_AT_TI_symbol_name("FlashGetSize")
    1501                            .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1502                            .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1503                            .dwattr $C$DW$103, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    1504                            .dwattr $C$DW$103, DW_AT_decl_line(0x77)
    1505                            .dwattr $C$DW$103, DW_AT_decl_column(0x25)
    1506                    
    1507                    $C$DW$104       .dwtag  DW_TAG_member
    1508                            .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$127)
    1509                            .dwattr $C$DW$104, DW_AT_name("GetChipId")
    1510                            .dwattr $C$DW$104, DW_AT_TI_symbol_name("GetChipId")
    1511                            .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1512                            .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1513                            .dwattr $C$DW$104, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    1514                            .dwattr $C$DW$104, DW_AT_decl_line(0x78)
    1515                            .dwattr $C$DW$104, DW_AT_decl_column(0x25)
    1516                    
    1517                    $C$DW$105       .dwtag  DW_TAG_member
    1518                            .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$130)
    1519                            .dwattr $C$DW$105, DW_AT_name("ReservedLocation1")
    1520                            .dwattr $C$DW$105, DW_AT_TI_symbol_name("ReservedLocation1")
    1521                            .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1522                            .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1523                            .dwattr $C$DW$105, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    1524                            .dwattr $C$DW$105, DW_AT_decl_line(0x79)
    1525                            .dwattr $C$DW$105, DW_AT_decl_column(0x25)
    1526                    
    1527                    $C$DW$106       .dwtag  DW_TAG_member
    1528                            .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$131)
    1529                            .dwattr $C$DW$106, DW_AT_name("ReservedLocation2")
    1530                            .dwattr $C$DW$106, DW_AT_TI_symbol_name("ReservedLocation2")
    1531                            .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1532                            .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1533                            .dwattr $C$DW$106, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    1534                            .dwattr $C$DW$106, DW_AT_decl_line(0x7a)
    1535                            .dwattr $C$DW$106, DW_AT_decl_column(0x25)
    1536                    
    1537                    $C$DW$107       .dwtag  DW_TAG_member
    1538                            .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$132)
    1539                            .dwattr $C$DW$107, DW_AT_name("ReservedLocation3")
TI ARM Assembler PC v16.9.4 Thu Apr 12 20:27:36 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{C001DE3B-F0FF-445D-8CCE-7D0EAD14970B} PAGE   29

    1540                            .dwattr $C$DW$107, DW_AT_TI_symbol_name("ReservedLocation3")
    1541                            .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1542                            .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1543                            .dwattr $C$DW$107, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    1544                            .dwattr $C$DW$107, DW_AT_decl_line(0x7b)
    1545                            .dwattr $C$DW$107, DW_AT_decl_column(0x25)
    1546                    
    1547                    $C$DW$108       .dwtag  DW_TAG_member
    1548                            .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$135)
    1549                            .dwattr $C$DW$108, DW_AT_name("ResetDevice")
    1550                            .dwattr $C$DW$108, DW_AT_TI_symbol_name("ResetDevice")
    1551                            .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1552                            .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1553                            .dwattr $C$DW$108, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    1554                            .dwattr $C$DW$108, DW_AT_decl_line(0x7c)
    1555                            .dwattr $C$DW$108, DW_AT_decl_column(0x25)
    1556                    
    1557                    $C$DW$109       .dwtag  DW_TAG_member
    1558                            .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$140)
    1559                            .dwattr $C$DW$109, DW_AT_name("Fletcher32")
    1560                            .dwattr $C$DW$109, DW_AT_TI_symbol_name("Fletcher32")
    1561                            .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1562                            .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1563                            .dwattr $C$DW$109, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    1564                            .dwattr $C$DW$109, DW_AT_decl_line(0x7d)
    1565                            .dwattr $C$DW$109, DW_AT_decl_column(0x25)
    1566                    
    1567                    $C$DW$110       .dwtag  DW_TAG_member
    1568                            .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$144)
    1569                            .dwattr $C$DW$110, DW_AT_name("MinValue")
    1570                            .dwattr $C$DW$110, DW_AT_TI_symbol_name("MinValue")
    1571                            .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1572                            .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1573                            .dwattr $C$DW$110, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    1574                            .dwattr $C$DW$110, DW_AT_decl_line(0x7e)
    1575                            .dwattr $C$DW$110, DW_AT_decl_column(0x25)
    1576                    
    1577                    $C$DW$111       .dwtag  DW_TAG_member
    1578                            .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$145)
    1579                            .dwattr $C$DW$111, DW_AT_name("MaxValue")
    1580                            .dwattr $C$DW$111, DW_AT_TI_symbol_name("MaxValue")
    1581                            .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1582                            .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1583                            .dwattr $C$DW$111, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    1584                            .dwattr $C$DW$111, DW_AT_decl_line(0x7f)
    1585                            .dwattr $C$DW$111, DW_AT_decl_column(0x25)
    1586                    
    1587                    $C$DW$112       .dwtag  DW_TAG_member
    1588                            .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$146)
    1589                            .dwattr $C$DW$112, DW_AT_name("MeanValue")
    1590                            .dwattr $C$DW$112, DW_AT_TI_symbol_name("MeanValue")
    1591                            .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    1592                            .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1593                            .dwattr $C$DW$112, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    1594                            .dwattr $C$DW$112, DW_AT_decl_line(0x80)
TI ARM Assembler PC v16.9.4 Thu Apr 12 20:27:36 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{C001DE3B-F0FF-445D-8CCE-7D0EAD14970B} PAGE   30

    1595                            .dwattr $C$DW$112, DW_AT_decl_column(0x25)
    1596                    
    1597                    $C$DW$113       .dwtag  DW_TAG_member
    1598                            .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$147)
    1599                            .dwattr $C$DW$113, DW_AT_name("StandDeviationValue")
    1600                            .dwattr $C$DW$113, DW_AT_TI_symbol_name("StandDeviationValue")
    1601                            .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    1602                            .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1603                            .dwattr $C$DW$113, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    1604                            .dwattr $C$DW$113, DW_AT_decl_line(0x81)
    1605                            .dwattr $C$DW$113, DW_AT_decl_column(0x25)
    1606                    
    1607                    $C$DW$114       .dwtag  DW_TAG_member
    1608                            .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$150)
    1609                            .dwattr $C$DW$114, DW_AT_name("ReservedLocation4")
    1610                            .dwattr $C$DW$114, DW_AT_TI_symbol_name("ReservedLocation4")
    1611                            .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    1612                            .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1613                            .dwattr $C$DW$114, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    1614                            .dwattr $C$DW$114, DW_AT_decl_line(0x82)
    1615                            .dwattr $C$DW$114, DW_AT_decl_column(0x25)
    1616                    
    1617                    $C$DW$115       .dwtag  DW_TAG_member
    1618                            .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$151)
    1619                            .dwattr $C$DW$115, DW_AT_name("ReservedLocation5")
    1620                            .dwattr $C$DW$115, DW_AT_TI_symbol_name("ReservedLocation5")
    1621                            .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    1622                            .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1623                            .dwattr $C$DW$115, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    1624                            .dwattr $C$DW$115, DW_AT_decl_line(0x83)
    1625                            .dwattr $C$DW$115, DW_AT_decl_column(0x25)
    1626                    
    1627                    $C$DW$116       .dwtag  DW_TAG_member
    1628                            .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$152)
    1629                            .dwattr $C$DW$116, DW_AT_name("HFSourceSafeSwitch")
    1630                            .dwattr $C$DW$116, DW_AT_TI_symbol_name("HFSourceSafeSwitch")
    1631                            .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    1632                            .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1633                            .dwattr $C$DW$116, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    1634                            .dwattr $C$DW$116, DW_AT_decl_line(0x84)
    1635                            .dwattr $C$DW$116, DW_AT_decl_column(0x25)
    1636                    
    1637                    $C$DW$117       .dwtag  DW_TAG_member
    1638                            .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$155)
    1639                            .dwattr $C$DW$117, DW_AT_name("SelectCompAInput")
    1640                            .dwattr $C$DW$117, DW_AT_TI_symbol_name("SelectCompAInput")
    1641                            .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    1642                            .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1643                            .dwattr $C$DW$117, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    1644                            .dwattr $C$DW$117, DW_AT_decl_line(0x85)
    1645                            .dwattr $C$DW$117, DW_AT_decl_column(0x25)
    1646                    
    1647                    $C$DW$118       .dwtag  DW_TAG_member
    1648                            .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$156)
    1649                            .dwattr $C$DW$118, DW_AT_name("SelectCompARef")
TI ARM Assembler PC v16.9.4 Thu Apr 12 20:27:36 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{C001DE3B-F0FF-445D-8CCE-7D0EAD14970B} PAGE   31

    1650                            .dwattr $C$DW$118, DW_AT_TI_symbol_name("SelectCompARef")
    1651                            .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    1652                            .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1653                            .dwattr $C$DW$118, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    1654                            .dwattr $C$DW$118, DW_AT_decl_line(0x86)
    1655                            .dwattr $C$DW$118, DW_AT_decl_column(0x25)
    1656                    
    1657                    $C$DW$119       .dwtag  DW_TAG_member
    1658                            .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$157)
    1659                            .dwattr $C$DW$119, DW_AT_name("SelectADCCompBInput")
    1660                            .dwattr $C$DW$119, DW_AT_TI_symbol_name("SelectADCCompBInput")
    1661                            .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    1662                            .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1663                            .dwattr $C$DW$119, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    1664                            .dwattr $C$DW$119, DW_AT_decl_line(0x87)
    1665                            .dwattr $C$DW$119, DW_AT_decl_column(0x25)
    1666                    
    1667                    $C$DW$120       .dwtag  DW_TAG_member
    1668                            .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$158)
    1669                            .dwattr $C$DW$120, DW_AT_name("SelectCompBRef")
    1670                            .dwattr $C$DW$120, DW_AT_TI_symbol_name("SelectCompBRef")
    1671                            .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    1672                            .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1673                            .dwattr $C$DW$120, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    1674                            .dwattr $C$DW$120, DW_AT_decl_line(0x88)
    1675                            .dwattr $C$DW$120, DW_AT_decl_column(0x25)
    1676                    
    1677                            .dwattr $C$DW$T$159, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices
    1678                            .dwattr $C$DW$T$159, DW_AT_decl_line(0x75)
    1679                            .dwattr $C$DW$T$159, DW_AT_decl_column(0x01)
    1680                            .dwendtag $C$DW$T$159
    1681                    
    1682                    $C$DW$T$1138    .dwtag  DW_TAG_typedef
    1683                            .dwattr $C$DW$T$1138, DW_AT_name("HARD_API_T")
    1684                            .dwattr $C$DW$T$1138, DW_AT_type(*$C$DW$T$159)
    1685                            .dwattr $C$DW$T$1138, DW_AT_language(DW_LANG_C)
    1686                            .dwattr $C$DW$T$1138, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\device
    1687                            .dwattr $C$DW$T$1138, DW_AT_decl_line(0x89)
    1688                            .dwattr $C$DW$T$1138, DW_AT_decl_column(0x03)
    1689                    
    1690                    
    1691                    $C$DW$T$163     .dwtag  DW_TAG_structure_type
    1692                            .dwattr $C$DW$T$163, DW_AT_byte_size(0x10)
    1693                    $C$DW$121       .dwtag  DW_TAG_member
    1694                            .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$161)
    1695                            .dwattr $C$DW$121, DW_AT_name("pvSrcEndAddr")
    1696                            .dwattr $C$DW$121, DW_AT_TI_symbol_name("pvSrcEndAddr")
    1697                            .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1698                            .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1699                            .dwattr $C$DW$121, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    1700                            .dwattr $C$DW$121, DW_AT_decl_line(0x69)
    1701                            .dwattr $C$DW$121, DW_AT_decl_column(0x14)
    1702                    
    1703                    $C$DW$122       .dwtag  DW_TAG_member
    1704                            .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$161)
TI ARM Assembler PC v16.9.4 Thu Apr 12 20:27:36 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{C001DE3B-F0FF-445D-8CCE-7D0EAD14970B} PAGE   32

    1705                            .dwattr $C$DW$122, DW_AT_name("pvDstEndAddr")
    1706                            .dwattr $C$DW$122, DW_AT_TI_symbol_name("pvDstEndAddr")
    1707                            .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1708                            .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1709                            .dwattr $C$DW$122, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    1710                            .dwattr $C$DW$122, DW_AT_decl_line(0x6a)
    1711                            .dwattr $C$DW$122, DW_AT_decl_column(0x14)
    1712                    
    1713                    $C$DW$123       .dwtag  DW_TAG_member
    1714                            .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$162)
    1715                            .dwattr $C$DW$123, DW_AT_name("ui32Control")
    1716                            .dwattr $C$DW$123, DW_AT_TI_symbol_name("ui32Control")
    1717                            .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1718                            .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1719                            .dwattr $C$DW$123, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    1720                            .dwattr $C$DW$123, DW_AT_decl_line(0x6b)
    1721                            .dwattr $C$DW$123, DW_AT_decl_column(0x17)
    1722                    
    1723                    $C$DW$124       .dwtag  DW_TAG_member
    1724                            .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$162)
    1725                            .dwattr $C$DW$124, DW_AT_name("ui32Spare")
    1726                            .dwattr $C$DW$124, DW_AT_TI_symbol_name("ui32Spare")
    1727                            .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1728                            .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1729                            .dwattr $C$DW$124, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    1730                            .dwattr $C$DW$124, DW_AT_decl_line(0x6c)
    1731                            .dwattr $C$DW$124, DW_AT_decl_column(0x17)
    1732                    
    1733                            .dwattr $C$DW$T$163, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices
    1734                            .dwattr $C$DW$T$163, DW_AT_decl_line(0x68)
    1735                            .dwattr $C$DW$T$163, DW_AT_decl_column(0x01)
    1736                            .dwendtag $C$DW$T$163
    1737                    
    1738                    $C$DW$T$1139    .dwtag  DW_TAG_typedef
    1739                            .dwattr $C$DW$T$1139, DW_AT_name("tDMAControlTable")
    1740                            .dwattr $C$DW$T$1139, DW_AT_type(*$C$DW$T$163)
    1741                            .dwattr $C$DW$T$1139, DW_AT_language(DW_LANG_C)
    1742                            .dwattr $C$DW$T$1139, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/device
    1743                            .dwattr $C$DW$T$1139, DW_AT_decl_line(0x6e)
    1744                            .dwattr $C$DW$T$1139, DW_AT_decl_column(0x01)
    1745                    
    1746                    
    1747                    $C$DW$T$164     .dwtag  DW_TAG_structure_type
    1748                            .dwattr $C$DW$T$164, DW_AT_byte_size(0x08)
    1749                    $C$DW$125       .dwtag  DW_TAG_member
    1750                            .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$120)
    1751                            .dwattr $C$DW$125, DW_AT_name("pCurrEntry")
    1752                            .dwattr $C$DW$125, DW_AT_TI_symbol_name("pCurrEntry")
    1753                            .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1754                            .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1755                            .dwattr $C$DW$125, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    1756                            .dwattr $C$DW$125, DW_AT_decl_line(0x41)
    1757                            .dwattr $C$DW$125, DW_AT_decl_column(0x0d)
    1758                    
    1759                    $C$DW$126       .dwtag  DW_TAG_member
TI ARM Assembler PC v16.9.4 Thu Apr 12 20:27:36 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{C001DE3B-F0FF-445D-8CCE-7D0EAD14970B} PAGE   33

    1760                            .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$120)
    1761                            .dwattr $C$DW$126, DW_AT_name("pLastEntry")
    1762                            .dwattr $C$DW$126, DW_AT_TI_symbol_name("pLastEntry")
    1763                            .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1764                            .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1765                            .dwattr $C$DW$126, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    1766                            .dwattr $C$DW$126, DW_AT_decl_line(0x42)
    1767                            .dwattr $C$DW$126, DW_AT_decl_column(0x0d)
    1768                    
    1769                            .dwattr $C$DW$T$164, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices
    1770                            .dwattr $C$DW$T$164, DW_AT_decl_line(0x40)
    1771                            .dwattr $C$DW$T$164, DW_AT_decl_column(0x10)
    1772                            .dwendtag $C$DW$T$164
    1773                    
    1774                    $C$DW$T$692     .dwtag  DW_TAG_typedef
    1775                            .dwattr $C$DW$T$692, DW_AT_name("dataQueue_t")
    1776                            .dwattr $C$DW$T$692, DW_AT_type(*$C$DW$T$164)
    1777                            .dwattr $C$DW$T$692, DW_AT_language(DW_LANG_C)
    1778                            .dwattr $C$DW$T$692, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices
    1779                            .dwattr $C$DW$T$692, DW_AT_decl_line(0x43)
    1780                            .dwattr $C$DW$T$692, DW_AT_decl_column(0x03)
    1781                    
    1782                    $C$DW$T$693     .dwtag  DW_TAG_pointer_type
    1783                            .dwattr $C$DW$T$693, DW_AT_type(*$C$DW$T$692)
    1784                            .dwattr $C$DW$T$693, DW_AT_address_class(0x20)
    1785                    
    1786                    
    1787                    $C$DW$T$165     .dwtag  DW_TAG_structure_type
    1788                            .dwattr $C$DW$T$165, DW_AT_byte_size(0x01)
    1789                    $C$DW$127       .dwtag  DW_TAG_member
    1790                            .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$109)
    1791                            .dwattr $C$DW$127, DW_AT_name("triggerType")
    1792                            .dwattr $C$DW$127, DW_AT_TI_symbol_name("triggerType")
    1793                            .dwattr $C$DW$127, DW_AT_bit_offset(0x04)
    1794                            .dwattr $C$DW$127, DW_AT_bit_size(0x04)
    1795                            .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1796                            .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1797                            .dwattr $C$DW$127, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    1798                            .dwattr $C$DW$127, DW_AT_decl_line(0x77)
    1799                            .dwattr $C$DW$127, DW_AT_decl_column(0x0f)
    1800                    
    1801                    $C$DW$128       .dwtag  DW_TAG_member
    1802                            .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$109)
    1803                            .dwattr $C$DW$128, DW_AT_name("bEnaCmd")
    1804                            .dwattr $C$DW$128, DW_AT_TI_symbol_name("bEnaCmd")
    1805                            .dwattr $C$DW$128, DW_AT_bit_offset(0x03)
    1806                            .dwattr $C$DW$128, DW_AT_bit_size(0x01)
    1807                            .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1808                            .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1809                            .dwattr $C$DW$128, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    1810                            .dwattr $C$DW$128, DW_AT_decl_line(0x78)
    1811                            .dwattr $C$DW$128, DW_AT_decl_column(0x0f)
    1812                    
    1813                    $C$DW$129       .dwtag  DW_TAG_member
    1814                            .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$109)
TI ARM Assembler PC v16.9.4 Thu Apr 12 20:27:36 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{C001DE3B-F0FF-445D-8CCE-7D0EAD14970B} PAGE   34

    1815                            .dwattr $C$DW$129, DW_AT_name("triggerNo")
    1816                            .dwattr $C$DW$129, DW_AT_TI_symbol_name("triggerNo")
    1817                            .dwattr $C$DW$129, DW_AT_bit_offset(0x01)
    1818                            .dwattr $C$DW$129, DW_AT_bit_size(0x02)
    1819                            .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1820                            .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1821                            .dwattr $C$DW$129, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    1822                            .dwattr $C$DW$129, DW_AT_decl_line(0x7a)
    1823                            .dwattr $C$DW$129, DW_AT_decl_column(0x0f)
    1824                    
    1825                    $C$DW$130       .dwtag  DW_TAG_member
    1826                            .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$109)
    1827                            .dwattr $C$DW$130, DW_AT_name("pastTrig")
    1828                            .dwattr $C$DW$130, DW_AT_TI_symbol_name("pastTrig")
    1829                            .dwattr $C$DW$130, DW_AT_bit_offset(0x00)
    1830                            .dwattr $C$DW$130, DW_AT_bit_size(0x01)
    1831                            .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1832                            .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1833                            .dwattr $C$DW$130, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    1834                            .dwattr $C$DW$130, DW_AT_decl_line(0x7b)
    1835                            .dwattr $C$DW$130, DW_AT_decl_column(0x0f)
    1836                    
    1837                            .dwattr $C$DW$T$165, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices
    1838                            .dwattr $C$DW$T$165, DW_AT_decl_line(0x76)
    1839                            .dwattr $C$DW$T$165, DW_AT_decl_column(0x0b)
    1840                            .dwendtag $C$DW$T$165
    1841                    
    1842                    
    1843                    $C$DW$T$166     .dwtag  DW_TAG_structure_type
    1844                            .dwattr $C$DW$T$166, DW_AT_byte_size(0x01)
    1845                    $C$DW$131       .dwtag  DW_TAG_member
    1846                            .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$109)
    1847                            .dwattr $C$DW$131, DW_AT_name("rule")
    1848                            .dwattr $C$DW$131, DW_AT_TI_symbol_name("rule")
    1849                            .dwattr $C$DW$131, DW_AT_bit_offset(0x04)
    1850                            .dwattr $C$DW$131, DW_AT_bit_size(0x04)
    1851                            .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1852                            .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1853                            .dwattr $C$DW$131, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    1854                            .dwattr $C$DW$131, DW_AT_decl_line(0x7f)
    1855                            .dwattr $C$DW$131, DW_AT_decl_column(0x0f)
    1856                    
    1857                    $C$DW$132       .dwtag  DW_TAG_member
    1858                            .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$109)
    1859                            .dwattr $C$DW$132, DW_AT_name("nSkip")
    1860                            .dwattr $C$DW$132, DW_AT_TI_symbol_name("nSkip")
    1861                            .dwattr $C$DW$132, DW_AT_bit_offset(0x00)
    1862                            .dwattr $C$DW$132, DW_AT_bit_size(0x04)
    1863                            .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1864                            .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1865                            .dwattr $C$DW$132, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    1866                            .dwattr $C$DW$132, DW_AT_decl_line(0x80)
    1867                            .dwattr $C$DW$132, DW_AT_decl_column(0x0f)
    1868                    
    1869                            .dwattr $C$DW$T$166, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices
TI ARM Assembler PC v16.9.4 Thu Apr 12 20:27:36 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{C001DE3B-F0FF-445D-8CCE-7D0EAD14970B} PAGE   35

    1870                            .dwattr $C$DW$T$166, DW_AT_decl_line(0x7e)
    1871                            .dwattr $C$DW$T$166, DW_AT_decl_column(0x0b)
    1872                            .dwendtag $C$DW$T$166
    1873                    
    1874                    
    1875                    $C$DW$T$167     .dwtag  DW_TAG_structure_type
    1876                            .dwattr $C$DW$T$167, DW_AT_byte_size(0x01)
    1877                    $C$DW$133       .dwtag  DW_TAG_member
    1878                            .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$109)
    1879                            .dwattr $C$DW$133, DW_AT_name("triggerType")
    1880                            .dwattr $C$DW$133, DW_AT_TI_symbol_name("triggerType")
    1881                            .dwattr $C$DW$133, DW_AT_bit_offset(0x04)
    1882                            .dwattr $C$DW$133, DW_AT_bit_size(0x04)
    1883                            .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1884                            .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1885                            .dwattr $C$DW$133, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    1886                            .dwattr $C$DW$133, DW_AT_decl_line(0x92)
    1887                            .dwattr $C$DW$133, DW_AT_decl_column(0x0f)
    1888                    
    1889                    $C$DW$134       .dwtag  DW_TAG_member
    1890                            .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$109)
    1891                            .dwattr $C$DW$134, DW_AT_name("bEnaCmd")
    1892                            .dwattr $C$DW$134, DW_AT_TI_symbol_name("bEnaCmd")
    1893                            .dwattr $C$DW$134, DW_AT_bit_offset(0x03)
    1894                            .dwattr $C$DW$134, DW_AT_bit_size(0x01)
    1895                            .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1896                            .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1897                            .dwattr $C$DW$134, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    1898                            .dwattr $C$DW$134, DW_AT_decl_line(0x93)
    1899                            .dwattr $C$DW$134, DW_AT_decl_column(0x0f)
    1900                    
    1901                    $C$DW$135       .dwtag  DW_TAG_member
    1902                            .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$109)
    1903                            .dwattr $C$DW$135, DW_AT_name("triggerNo")
    1904                            .dwattr $C$DW$135, DW_AT_TI_symbol_name("triggerNo")
    1905                            .dwattr $C$DW$135, DW_AT_bit_offset(0x01)
    1906                            .dwattr $C$DW$135, DW_AT_bit_size(0x02)
    1907                            .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1908                            .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1909                            .dwattr $C$DW$135, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    1910                            .dwattr $C$DW$135, DW_AT_decl_line(0x95)
    1911                            .dwattr $C$DW$135, DW_AT_decl_column(0x0f)
    1912                    
    1913                    $C$DW$136       .dwtag  DW_TAG_member
    1914                            .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$109)
    1915                            .dwattr $C$DW$136, DW_AT_name("pastTrig")
    1916                            .dwattr $C$DW$136, DW_AT_TI_symbol_name("pastTrig")
    1917                            .dwattr $C$DW$136, DW_AT_bit_offset(0x00)
    1918                            .dwattr $C$DW$136, DW_AT_bit_size(0x01)
    1919                            .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1920                            .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1921                            .dwattr $C$DW$136, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    1922                            .dwattr $C$DW$136, DW_AT_decl_line(0x96)
    1923                            .dwattr $C$DW$136, DW_AT_decl_column(0x0f)
    1924                    
TI ARM Assembler PC v16.9.4 Thu Apr 12 20:27:36 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{C001DE3B-F0FF-445D-8CCE-7D0EAD14970B} PAGE   36

    1925                            .dwattr $C$DW$T$167, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices
    1926                            .dwattr $C$DW$T$167, DW_AT_decl_line(0x91)
    1927                            .dwattr $C$DW$T$167, DW_AT_decl_column(0x0b)
    1928                            .dwendtag $C$DW$T$167
    1929                    
    1930                    
    1931                    $C$DW$T$168     .dwtag  DW_TAG_structure_type
    1932                            .dwattr $C$DW$T$168, DW_AT_byte_size(0x01)
    1933                    $C$DW$137       .dwtag  DW_TAG_member
    1934                            .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$109)
    1935                            .dwattr $C$DW$137, DW_AT_name("rule")
    1936                            .dwattr $C$DW$137, DW_AT_TI_symbol_name("rule")
    1937                            .dwattr $C$DW$137, DW_AT_bit_offset(0x04)
    1938                            .dwattr $C$DW$137, DW_AT_bit_size(0x04)
    1939                            .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1940                            .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1941                            .dwattr $C$DW$137, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    1942                            .dwattr $C$DW$137, DW_AT_decl_line(0x9a)
    1943                            .dwattr $C$DW$137, DW_AT_decl_column(0x0f)
    1944                    
    1945                    $C$DW$138       .dwtag  DW_TAG_member
    1946                            .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$109)
    1947                            .dwattr $C$DW$138, DW_AT_name("nSkip")
    1948                            .dwattr $C$DW$138, DW_AT_TI_symbol_name("nSkip")
    1949                            .dwattr $C$DW$138, DW_AT_bit_offset(0x00)
    1950                            .dwattr $C$DW$138, DW_AT_bit_size(0x04)
    1951                            .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1952                            .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1953                            .dwattr $C$DW$138, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    1954                            .dwattr $C$DW$138, DW_AT_decl_line(0x9b)
    1955                            .dwattr $C$DW$138, DW_AT_decl_column(0x0f)
    1956                    
    1957                            .dwattr $C$DW$T$168, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices
    1958                            .dwattr $C$DW$T$168, DW_AT_decl_line(0x99)
    1959                            .dwattr $C$DW$T$168, DW_AT_decl_column(0x0b)
    1960                            .dwendtag $C$DW$T$168
    1961                    
    1962                    
    1963                    $C$DW$T$169     .dwtag  DW_TAG_structure_type
    1964                            .dwattr $C$DW$T$169, DW_AT_byte_size(0x01)
    1965                    $C$DW$139       .dwtag  DW_TAG_member
    1966                            .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$109)
    1967                            .dwattr $C$DW$139, DW_AT_name("triggerType")
    1968                            .dwattr $C$DW$139, DW_AT_TI_symbol_name("triggerType")
    1969                            .dwattr $C$DW$139, DW_AT_bit_offset(0x04)
    1970                            .dwattr $C$DW$139, DW_AT_bit_size(0x04)
    1971                            .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1972                            .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1973                            .dwattr $C$DW$139, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    1974                            .dwattr $C$DW$139, DW_AT_decl_line(0xad)
    1975                            .dwattr $C$DW$139, DW_AT_decl_column(0x0f)
    1976                    
    1977                    $C$DW$140       .dwtag  DW_TAG_member
    1978                            .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$109)
    1979                            .dwattr $C$DW$140, DW_AT_name("bEnaCmd")
TI ARM Assembler PC v16.9.4 Thu Apr 12 20:27:36 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{C001DE3B-F0FF-445D-8CCE-7D0EAD14970B} PAGE   37

    1980                            .dwattr $C$DW$140, DW_AT_TI_symbol_name("bEnaCmd")
    1981                            .dwattr $C$DW$140, DW_AT_bit_offset(0x03)
    1982                            .dwattr $C$DW$140, DW_AT_bit_size(0x01)
    1983                            .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1984                            .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1985                            .dwattr $C$DW$140, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    1986                            .dwattr $C$DW$140, DW_AT_decl_line(0xae)
    1987                            .dwattr $C$DW$140, DW_AT_decl_column(0x0f)
    1988                    
    1989                    $C$DW$141       .dwtag  DW_TAG_member
    1990                            .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$109)
    1991                            .dwattr $C$DW$141, DW_AT_name("triggerNo")
    1992                            .dwattr $C$DW$141, DW_AT_TI_symbol_name("triggerNo")
    1993                            .dwattr $C$DW$141, DW_AT_bit_offset(0x01)
    1994                            .dwattr $C$DW$141, DW_AT_bit_size(0x02)
    1995                            .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1996                            .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1997                            .dwattr $C$DW$141, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    1998                            .dwattr $C$DW$141, DW_AT_decl_line(0xb0)
    1999                            .dwattr $C$DW$141, DW_AT_decl_column(0x0f)
    2000                    
    2001                    $C$DW$142       .dwtag  DW_TAG_member
    2002                            .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$109)
    2003                            .dwattr $C$DW$142, DW_AT_name("pastTrig")
    2004                            .dwattr $C$DW$142, DW_AT_TI_symbol_name("pastTrig")
    2005                            .dwattr $C$DW$142, DW_AT_bit_offset(0x00)
    2006                            .dwattr $C$DW$142, DW_AT_bit_size(0x01)
    2007                            .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2008                            .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    2009                            .dwattr $C$DW$142, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2010                            .dwattr $C$DW$142, DW_AT_decl_line(0xb1)
    2011                            .dwattr $C$DW$142, DW_AT_decl_column(0x0f)
    2012                    
    2013                            .dwattr $C$DW$T$169, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices
    2014                            .dwattr $C$DW$T$169, DW_AT_decl_line(0xac)
    2015                            .dwattr $C$DW$T$169, DW_AT_decl_column(0x0b)
    2016                            .dwendtag $C$DW$T$169
    2017                    
    2018                    
    2019                    $C$DW$T$170     .dwtag  DW_TAG_structure_type
    2020                            .dwattr $C$DW$T$170, DW_AT_byte_size(0x01)
    2021                    $C$DW$143       .dwtag  DW_TAG_member
    2022                            .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$109)
    2023                            .dwattr $C$DW$143, DW_AT_name("rule")
    2024                            .dwattr $C$DW$143, DW_AT_TI_symbol_name("rule")
    2025                            .dwattr $C$DW$143, DW_AT_bit_offset(0x04)
    2026                            .dwattr $C$DW$143, DW_AT_bit_size(0x04)
    2027                            .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2028                            .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    2029                            .dwattr $C$DW$143, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2030                            .dwattr $C$DW$143, DW_AT_decl_line(0xb5)
    2031                            .dwattr $C$DW$143, DW_AT_decl_column(0x0f)
    2032                    
    2033                    $C$DW$144       .dwtag  DW_TAG_member
    2034                            .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$109)
TI ARM Assembler PC v16.9.4 Thu Apr 12 20:27:36 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{C001DE3B-F0FF-445D-8CCE-7D0EAD14970B} PAGE   38

    2035                            .dwattr $C$DW$144, DW_AT_name("nSkip")
    2036                            .dwattr $C$DW$144, DW_AT_TI_symbol_name("nSkip")
    2037                            .dwattr $C$DW$144, DW_AT_bit_offset(0x00)
    2038                            .dwattr $C$DW$144, DW_AT_bit_size(0x04)
    2039                            .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2040                            .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    2041                            .dwattr $C$DW$144, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2042                            .dwattr $C$DW$144, DW_AT_decl_line(0xb6)
    2043                            .dwattr $C$DW$144, DW_AT_decl_column(0x0f)
    2044                    
    2045                            .dwattr $C$DW$T$170, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices
    2046                            .dwattr $C$DW$T$170, DW_AT_decl_line(0xb4)
    2047                            .dwattr $C$DW$T$170, DW_AT_decl_column(0x0b)
    2048                            .dwendtag $C$DW$T$170
    2049                    
    2050                    
    2051                    $C$DW$T$171     .dwtag  DW_TAG_structure_type
    2052                            .dwattr $C$DW$T$171, DW_AT_byte_size(0x02)
    2053                    $C$DW$145       .dwtag  DW_TAG_member
    2054                            .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$136)
    2055                            .dwattr $C$DW$145, DW_AT_name("frontEndMode")
    2056                            .dwattr $C$DW$145, DW_AT_TI_symbol_name("frontEndMode")
    2057                            .dwattr $C$DW$145, DW_AT_bit_offset(0x0d)
    2058                            .dwattr $C$DW$145, DW_AT_bit_size(0x03)
    2059                            .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2060                            .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    2061                            .dwattr $C$DW$145, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2062                            .dwattr $C$DW$145, DW_AT_decl_line(0xc3)
    2063                            .dwattr $C$DW$145, DW_AT_decl_column(0x10)
    2064                    
    2065                    $C$DW$146       .dwtag  DW_TAG_member
    2066                            .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$136)
    2067                            .dwattr $C$DW$146, DW_AT_name("biasMode")
    2068                            .dwattr $C$DW$146, DW_AT_TI_symbol_name("biasMode")
    2069                            .dwattr $C$DW$146, DW_AT_bit_offset(0x0c)
    2070                            .dwattr $C$DW$146, DW_AT_bit_size(0x01)
    2071                            .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2072                            .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    2073                            .dwattr $C$DW$146, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2074                            .dwattr $C$DW$146, DW_AT_decl_line(0xc9)
    2075                            .dwattr $C$DW$146, DW_AT_decl_column(0x10)
    2076                    
    2077                    $C$DW$147       .dwtag  DW_TAG_member
    2078                            .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$136)
    2079                            .dwattr $C$DW$147, DW_AT_name("analogCfgMode")
    2080                            .dwattr $C$DW$147, DW_AT_TI_symbol_name("analogCfgMode")
    2081                            .dwattr $C$DW$147, DW_AT_bit_offset(0x06)
    2082                            .dwattr $C$DW$147, DW_AT_bit_size(0x06)
    2083                            .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2084                            .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    2085                            .dwattr $C$DW$147, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2086                            .dwattr $C$DW$147, DW_AT_decl_line(0xcb)
    2087                            .dwattr $C$DW$147, DW_AT_decl_column(0x10)
    2088                    
    2089                    $C$DW$148       .dwtag  DW_TAG_member
TI ARM Assembler PC v16.9.4 Thu Apr 12 20:27:36 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{C001DE3B-F0FF-445D-8CCE-7D0EAD14970B} PAGE   39

    2090                            .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$136)
    2091                            .dwattr $C$DW$148, DW_AT_name("bNoFsPowerUp")
    2092                            .dwattr $C$DW$148, DW_AT_TI_symbol_name("bNoFsPowerUp")
    2093                            .dwattr $C$DW$148, DW_AT_bit_offset(0x05)
    2094                            .dwattr $C$DW$148, DW_AT_bit_size(0x01)
    2095                            .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2096                            .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    2097                            .dwattr $C$DW$148, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2098                            .dwattr $C$DW$148, DW_AT_decl_line(0xd2)
    2099                            .dwattr $C$DW$148, DW_AT_decl_column(0x10)
    2100                    
    2101                            .dwattr $C$DW$T$171, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices
    2102                            .dwattr $C$DW$T$171, DW_AT_decl_line(0xc2)
    2103                            .dwattr $C$DW$T$171, DW_AT_decl_column(0x0b)
    2104                            .dwendtag $C$DW$T$171
    2105                    
    2106                    
    2107                    $C$DW$T$172     .dwtag  DW_TAG_structure_type
    2108                            .dwattr $C$DW$T$172, DW_AT_byte_size(0x01)
    2109                    $C$DW$149       .dwtag  DW_TAG_member
    2110                            .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$109)
    2111                            .dwattr $C$DW$149, DW_AT_name("triggerType")
    2112                            .dwattr $C$DW$149, DW_AT_TI_symbol_name("triggerType")
    2113                            .dwattr $C$DW$149, DW_AT_bit_offset(0x04)
    2114                            .dwattr $C$DW$149, DW_AT_bit_size(0x04)
    2115                            .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2116                            .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    2117                            .dwattr $C$DW$149, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2118                            .dwattr $C$DW$149, DW_AT_decl_line(0xe8)
    2119                            .dwattr $C$DW$149, DW_AT_decl_column(0x0f)
    2120                    
    2121                    $C$DW$150       .dwtag  DW_TAG_member
    2122                            .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$109)
    2123                            .dwattr $C$DW$150, DW_AT_name("bEnaCmd")
    2124                            .dwattr $C$DW$150, DW_AT_TI_symbol_name("bEnaCmd")
    2125                            .dwattr $C$DW$150, DW_AT_bit_offset(0x03)
    2126                            .dwattr $C$DW$150, DW_AT_bit_size(0x01)
    2127                            .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2128                            .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    2129                            .dwattr $C$DW$150, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2130                            .dwattr $C$DW$150, DW_AT_decl_line(0xe9)
    2131                            .dwattr $C$DW$150, DW_AT_decl_column(0x0f)
    2132                    
    2133                    $C$DW$151       .dwtag  DW_TAG_member
    2134                            .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$109)
    2135                            .dwattr $C$DW$151, DW_AT_name("triggerNo")
    2136                            .dwattr $C$DW$151, DW_AT_TI_symbol_name("triggerNo")
    2137                            .dwattr $C$DW$151, DW_AT_bit_offset(0x01)
    2138                            .dwattr $C$DW$151, DW_AT_bit_size(0x02)
    2139                            .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2140                            .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    2141                            .dwattr $C$DW$151, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2142                            .dwattr $C$DW$151, DW_AT_decl_line(0xeb)
    2143                            .dwattr $C$DW$151, DW_AT_decl_column(0x0f)
    2144                    
TI ARM Assembler PC v16.9.4 Thu Apr 12 20:27:36 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{C001DE3B-F0FF-445D-8CCE-7D0EAD14970B} PAGE   40

    2145                    $C$DW$152       .dwtag  DW_TAG_member
    2146                            .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$109)
    2147                            .dwattr $C$DW$152, DW_AT_name("pastTrig")
    2148                            .dwattr $C$DW$152, DW_AT_TI_symbol_name("pastTrig")
    2149                            .dwattr $C$DW$152, DW_AT_bit_offset(0x00)
    2150                            .dwattr $C$DW$152, DW_AT_bit_size(0x01)
    2151                            .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2152                            .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    2153                            .dwattr $C$DW$152, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2154                            .dwattr $C$DW$152, DW_AT_decl_line(0xec)
    2155                            .dwattr $C$DW$152, DW_AT_decl_column(0x0f)
    2156                    
    2157                            .dwattr $C$DW$T$172, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices
    2158                            .dwattr $C$DW$T$172, DW_AT_decl_line(0xe7)
    2159                            .dwattr $C$DW$T$172, DW_AT_decl_column(0x0b)
    2160                            .dwendtag $C$DW$T$172
    2161                    
    2162                    
    2163                    $C$DW$T$173     .dwtag  DW_TAG_structure_type
    2164                            .dwattr $C$DW$T$173, DW_AT_byte_size(0x01)
    2165                    $C$DW$153       .dwtag  DW_TAG_member
    2166                            .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$109)
    2167                            .dwattr $C$DW$153, DW_AT_name("rule")
    2168                            .dwattr $C$DW$153, DW_AT_TI_symbol_name("rule")
    2169                            .dwattr $C$DW$153, DW_AT_bit_offset(0x04)
    2170                            .dwattr $C$DW$153, DW_AT_bit_size(0x04)
    2171                            .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2172                            .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    2173                            .dwattr $C$DW$153, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2174                            .dwattr $C$DW$153, DW_AT_decl_line(0xf0)
    2175                            .dwattr $C$DW$153, DW_AT_decl_column(0x0f)
    2176                    
    2177                    $C$DW$154       .dwtag  DW_TAG_member
    2178                            .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$109)
    2179                            .dwattr $C$DW$154, DW_AT_name("nSkip")
    2180                            .dwattr $C$DW$154, DW_AT_TI_symbol_name("nSkip")
    2181                            .dwattr $C$DW$154, DW_AT_bit_offset(0x00)
    2182                            .dwattr $C$DW$154, DW_AT_bit_size(0x04)
    2183                            .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2184                            .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    2185                            .dwattr $C$DW$154, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2186                            .dwattr $C$DW$154, DW_AT_decl_line(0xf1)
    2187                            .dwattr $C$DW$154, DW_AT_decl_column(0x0f)
    2188                    
    2189                            .dwattr $C$DW$T$173, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices
    2190                            .dwattr $C$DW$T$173, DW_AT_decl_line(0xef)
    2191                            .dwattr $C$DW$T$173, DW_AT_decl_column(0x0b)
    2192                            .dwendtag $C$DW$T$173
    2193                    
    2194                    
    2195                    $C$DW$T$174     .dwtag  DW_TAG_structure_type
    2196                            .dwattr $C$DW$T$174, DW_AT_byte_size(0x01)
    2197                    $C$DW$155       .dwtag  DW_TAG_member
    2198                            .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$109)
    2199                            .dwattr $C$DW$155, DW_AT_name("bTxMode")
TI ARM Assembler PC v16.9.4 Thu Apr 12 20:27:36 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{C001DE3B-F0FF-445D-8CCE-7D0EAD14970B} PAGE   41

    2200                            .dwattr $C$DW$155, DW_AT_TI_symbol_name("bTxMode")
    2201                            .dwattr $C$DW$155, DW_AT_bit_offset(0x07)
    2202                            .dwattr $C$DW$155, DW_AT_bit_size(0x01)
    2203                            .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2204                            .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    2205                            .dwattr $C$DW$155, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2206                            .dwattr $C$DW$155, DW_AT_decl_line(0xf6)
    2207                            .dwattr $C$DW$155, DW_AT_decl_column(0x0f)
    2208                    
    2209                    $C$DW$156       .dwtag  DW_TAG_member
    2210                            .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$109)
    2211                            .dwattr $C$DW$156, DW_AT_name("refFreq")
    2212                            .dwattr $C$DW$156, DW_AT_TI_symbol_name("refFreq")
    2213                            .dwattr $C$DW$156, DW_AT_bit_offset(0x01)
    2214                            .dwattr $C$DW$156, DW_AT_bit_size(0x06)
    2215                            .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2216                            .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    2217                            .dwattr $C$DW$156, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2218                            .dwattr $C$DW$156, DW_AT_decl_line(0xf8)
    2219                            .dwattr $C$DW$156, DW_AT_decl_column(0x0f)
    2220                    
    2221                            .dwattr $C$DW$T$174, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices
    2222                            .dwattr $C$DW$T$174, DW_AT_decl_line(0xf5)
    2223                            .dwattr $C$DW$T$174, DW_AT_decl_column(0x0b)
    2224                            .dwendtag $C$DW$T$174
    2225                    
    2226                    
    2227                    $C$DW$T$175     .dwtag  DW_TAG_structure_type
    2228                            .dwattr $C$DW$T$175, DW_AT_byte_size(0x01)
    2229                    $C$DW$157       .dwtag  DW_TAG_member
    2230                            .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$109)
    2231                            .dwattr $C$DW$157, DW_AT_name("triggerType")
    2232                            .dwattr $C$DW$157, DW_AT_TI_symbol_name("triggerType")
    2233                            .dwattr $C$DW$157, DW_AT_bit_offset(0x04)
    2234                            .dwattr $C$DW$157, DW_AT_bit_size(0x04)
    2235                            .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2236                            .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    2237                            .dwattr $C$DW$157, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2238                            .dwattr $C$DW$157, DW_AT_decl_line(0x10f)
    2239                            .dwattr $C$DW$157, DW_AT_decl_column(0x0f)
    2240                    
    2241                    $C$DW$158       .dwtag  DW_TAG_member
    2242                            .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$109)
    2243                            .dwattr $C$DW$158, DW_AT_name("bEnaCmd")
    2244                            .dwattr $C$DW$158, DW_AT_TI_symbol_name("bEnaCmd")
    2245                            .dwattr $C$DW$158, DW_AT_bit_offset(0x03)
    2246                            .dwattr $C$DW$158, DW_AT_bit_size(0x01)
    2247                            .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2248                            .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    2249                            .dwattr $C$DW$158, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2250                            .dwattr $C$DW$158, DW_AT_decl_line(0x110)
    2251                            .dwattr $C$DW$158, DW_AT_decl_column(0x0f)
    2252                    
    2253                    $C$DW$159       .dwtag  DW_TAG_member
    2254                            .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$109)
TI ARM Assembler PC v16.9.4 Thu Apr 12 20:27:36 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{C001DE3B-F0FF-445D-8CCE-7D0EAD14970B} PAGE   42

    2255                            .dwattr $C$DW$159, DW_AT_name("triggerNo")
    2256                            .dwattr $C$DW$159, DW_AT_TI_symbol_name("triggerNo")
    2257                            .dwattr $C$DW$159, DW_AT_bit_offset(0x01)
    2258                            .dwattr $C$DW$159, DW_AT_bit_size(0x02)
    2259                            .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2260                            .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    2261                            .dwattr $C$DW$159, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2262                            .dwattr $C$DW$159, DW_AT_decl_line(0x112)
    2263                            .dwattr $C$DW$159, DW_AT_decl_column(0x0f)
    2264                    
    2265                    $C$DW$160       .dwtag  DW_TAG_member
    2266                            .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$109)
    2267                            .dwattr $C$DW$160, DW_AT_name("pastTrig")
    2268                            .dwattr $C$DW$160, DW_AT_TI_symbol_name("pastTrig")
    2269                            .dwattr $C$DW$160, DW_AT_bit_offset(0x00)
    2270                            .dwattr $C$DW$160, DW_AT_bit_size(0x01)
    2271                            .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2272                            .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2273                            .dwattr $C$DW$160, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2274                            .dwattr $C$DW$160, DW_AT_decl_line(0x113)
    2275                            .dwattr $C$DW$160, DW_AT_decl_column(0x0f)
    2276                    
    2277                            .dwattr $C$DW$T$175, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices
    2278                            .dwattr $C$DW$T$175, DW_AT_decl_line(0x10e)
    2279                            .dwattr $C$DW$T$175, DW_AT_decl_column(0x0b)
    2280                            .dwendtag $C$DW$T$175
    2281                    
    2282                    
    2283                    $C$DW$T$176     .dwtag  DW_TAG_structure_type
    2284                            .dwattr $C$DW$T$176, DW_AT_byte_size(0x01)
    2285                    $C$DW$161       .dwtag  DW_TAG_member
    2286                            .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$109)
    2287                            .dwattr $C$DW$161, DW_AT_name("rule")
    2288                            .dwattr $C$DW$161, DW_AT_TI_symbol_name("rule")
    2289                            .dwattr $C$DW$161, DW_AT_bit_offset(0x04)
    2290                            .dwattr $C$DW$161, DW_AT_bit_size(0x04)
    2291                            .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2292                            .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    2293                            .dwattr $C$DW$161, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2294                            .dwattr $C$DW$161, DW_AT_decl_line(0x117)
    2295                            .dwattr $C$DW$161, DW_AT_decl_column(0x0f)
    2296                    
    2297                    $C$DW$162       .dwtag  DW_TAG_member
    2298                            .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$109)
    2299                            .dwattr $C$DW$162, DW_AT_name("nSkip")
    2300                            .dwattr $C$DW$162, DW_AT_TI_symbol_name("nSkip")
    2301                            .dwattr $C$DW$162, DW_AT_bit_offset(0x00)
    2302                            .dwattr $C$DW$162, DW_AT_bit_size(0x04)
    2303                            .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2304                            .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2305                            .dwattr $C$DW$162, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2306                            .dwattr $C$DW$162, DW_AT_decl_line(0x118)
    2307                            .dwattr $C$DW$162, DW_AT_decl_column(0x0f)
    2308                    
    2309                            .dwattr $C$DW$T$176, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices
TI ARM Assembler PC v16.9.4 Thu Apr 12 20:27:36 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{C001DE3B-F0FF-445D-8CCE-7D0EAD14970B} PAGE   43

    2310                            .dwattr $C$DW$T$176, DW_AT_decl_line(0x116)
    2311                            .dwattr $C$DW$T$176, DW_AT_decl_column(0x0b)
    2312                            .dwendtag $C$DW$T$176
    2313                    
    2314                    
    2315                    $C$DW$T$177     .dwtag  DW_TAG_structure_type
    2316                            .dwattr $C$DW$T$177, DW_AT_byte_size(0x01)
    2317                    $C$DW$163       .dwtag  DW_TAG_member
    2318                            .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$109)
    2319                            .dwattr $C$DW$163, DW_AT_name("triggerType")
    2320                            .dwattr $C$DW$163, DW_AT_TI_symbol_name("triggerType")
    2321                            .dwattr $C$DW$163, DW_AT_bit_offset(0x04)
    2322                            .dwattr $C$DW$163, DW_AT_bit_size(0x04)
    2323                            .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2324                            .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2325                            .dwattr $C$DW$163, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2326                            .dwattr $C$DW$163, DW_AT_decl_line(0x12a)
    2327                            .dwattr $C$DW$163, DW_AT_decl_column(0x0f)
    2328                    
    2329                    $C$DW$164       .dwtag  DW_TAG_member
    2330                            .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$109)
    2331                            .dwattr $C$DW$164, DW_AT_name("bEnaCmd")
    2332                            .dwattr $C$DW$164, DW_AT_TI_symbol_name("bEnaCmd")
    2333                            .dwattr $C$DW$164, DW_AT_bit_offset(0x03)
    2334                            .dwattr $C$DW$164, DW_AT_bit_size(0x01)
    2335                            .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2336                            .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2337                            .dwattr $C$DW$164, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2338                            .dwattr $C$DW$164, DW_AT_decl_line(0x12b)
    2339                            .dwattr $C$DW$164, DW_AT_decl_column(0x0f)
    2340                    
    2341                    $C$DW$165       .dwtag  DW_TAG_member
    2342                            .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$109)
    2343                            .dwattr $C$DW$165, DW_AT_name("triggerNo")
    2344                            .dwattr $C$DW$165, DW_AT_TI_symbol_name("triggerNo")
    2345                            .dwattr $C$DW$165, DW_AT_bit_offset(0x01)
    2346                            .dwattr $C$DW$165, DW_AT_bit_size(0x02)
    2347                            .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2348                            .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2349                            .dwattr $C$DW$165, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2350                            .dwattr $C$DW$165, DW_AT_decl_line(0x12d)
    2351                            .dwattr $C$DW$165, DW_AT_decl_column(0x0f)
    2352                    
    2353                    $C$DW$166       .dwtag  DW_TAG_member
    2354                            .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$109)
    2355                            .dwattr $C$DW$166, DW_AT_name("pastTrig")
    2356                            .dwattr $C$DW$166, DW_AT_TI_symbol_name("pastTrig")
    2357                            .dwattr $C$DW$166, DW_AT_bit_offset(0x00)
    2358                            .dwattr $C$DW$166, DW_AT_bit_size(0x01)
    2359                            .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2360                            .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2361                            .dwattr $C$DW$166, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2362                            .dwattr $C$DW$166, DW_AT_decl_line(0x12e)
    2363                            .dwattr $C$DW$166, DW_AT_decl_column(0x0f)
    2364                    
TI ARM Assembler PC v16.9.4 Thu Apr 12 20:27:36 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{C001DE3B-F0FF-445D-8CCE-7D0EAD14970B} PAGE   44

    2365                            .dwattr $C$DW$T$177, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices
    2366                            .dwattr $C$DW$T$177, DW_AT_decl_line(0x129)
    2367                            .dwattr $C$DW$T$177, DW_AT_decl_column(0x0b)
    2368                            .dwendtag $C$DW$T$177
    2369                    
    2370                    
    2371                    $C$DW$T$178     .dwtag  DW_TAG_structure_type
    2372                            .dwattr $C$DW$T$178, DW_AT_byte_size(0x01)
    2373                    $C$DW$167       .dwtag  DW_TAG_member
    2374                            .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$109)
    2375                            .dwattr $C$DW$167, DW_AT_name("rule")
    2376                            .dwattr $C$DW$167, DW_AT_TI_symbol_name("rule")
    2377                            .dwattr $C$DW$167, DW_AT_bit_offset(0x04)
    2378                            .dwattr $C$DW$167, DW_AT_bit_size(0x04)
    2379                            .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2380                            .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2381                            .dwattr $C$DW$167, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2382                            .dwattr $C$DW$167, DW_AT_decl_line(0x132)
    2383                            .dwattr $C$DW$167, DW_AT_decl_column(0x0f)
    2384                    
    2385                    $C$DW$168       .dwtag  DW_TAG_member
    2386                            .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$109)
    2387                            .dwattr $C$DW$168, DW_AT_name("nSkip")
    2388                            .dwattr $C$DW$168, DW_AT_TI_symbol_name("nSkip")
    2389                            .dwattr $C$DW$168, DW_AT_bit_offset(0x00)
    2390                            .dwattr $C$DW$168, DW_AT_bit_size(0x04)
    2391                            .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2392                            .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2393                            .dwattr $C$DW$168, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2394                            .dwattr $C$DW$168, DW_AT_decl_line(0x133)
    2395                            .dwattr $C$DW$168, DW_AT_decl_column(0x0f)
    2396                    
    2397                            .dwattr $C$DW$T$178, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices
    2398                            .dwattr $C$DW$T$178, DW_AT_decl_line(0x131)
    2399                            .dwattr $C$DW$T$178, DW_AT_decl_column(0x0b)
    2400                            .dwendtag $C$DW$T$178
    2401                    
    2402                    
    2403                    $C$DW$T$179     .dwtag  DW_TAG_structure_type
    2404                            .dwattr $C$DW$T$179, DW_AT_byte_size(0x01)
    2405                    $C$DW$169       .dwtag  DW_TAG_member
    2406                            .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$109)
    2407                            .dwattr $C$DW$169, DW_AT_name("bEnaFifo")
    2408                            .dwattr $C$DW$169, DW_AT_TI_symbol_name("bEnaFifo")
    2409                            .dwattr $C$DW$169, DW_AT_bit_offset(0x07)
    2410                            .dwattr $C$DW$169, DW_AT_bit_size(0x01)
