TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:21 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{91E5085D-660D-4F25-9A12-879222E44D75} PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                        PC v16.9.4.LTS *
       3                    ;* Date/Time created: Sat Nov 18 18:46:21 2017                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../Application/MAC/HAL/target/dbg.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v16.9.4.LTS Copyright (c) 1996-20
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Kevin\workspace_v7\sensor_cc1310lp\sensor_cc1310lp"
      13                    
      14                    $C$DW$1 .dwtag  DW_TAG_subprogram

    2918                            .dwattr $C$DW$287, DW_AT_const_value(0x08)
    2919                            .dwattr $C$DW$287, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2920                            .dwattr $C$DW$287, DW_AT_decl_line(0xa8)
    2921                            .dwattr $C$DW$287, DW_AT_decl_column(0x05)
    2922                    
    2923                    $C$DW$288       .dwtag  DW_TAG_enumerator
    2924                            .dwattr $C$DW$288, DW_AT_name("FAPI_VALIDATE_SECTOR")
    2925                            .dwattr $C$DW$288, DW_AT_const_value(0x0e)
    2926                            .dwattr $C$DW$288, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2927                            .dwattr $C$DW$288, DW_AT_decl_line(0xa9)
    2928                            .dwattr $C$DW$288, DW_AT_decl_column(0x05)
    2929                    
    2930                    $C$DW$289       .dwtag  DW_TAG_enumerator
    2931                            .dwattr $C$DW$289, DW_AT_name("FAPI_CLEAR_STATUS")
    2932                            .dwattr $C$DW$289, DW_AT_const_value(0x10)
    2933                            .dwattr $C$DW$289, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2934                            .dwattr $C$DW$289, DW_AT_decl_line(0xaa)
    2935                            .dwattr $C$DW$289, DW_AT_decl_column(0x05)
    2936                    
    2937                    $C$DW$290       .dwtag  DW_TAG_enumerator
    2938                            .dwattr $C$DW$290, DW_AT_name("FAPI_PROGRAM_RESUME")
    2939                            .dwattr $C$DW$290, DW_AT_const_value(0x14)
    2940                            .dwattr $C$DW$290, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2941                            .dwattr $C$DW$290, DW_AT_decl_line(0xab)
    2942                            .dwattr $C$DW$290, DW_AT_decl_column(0x05)
    2943                    
    2944                    $C$DW$291       .dwtag  DW_TAG_enumerator
    2945                            .dwattr $C$DW$291, DW_AT_name("FAPI_ERASE_RESUME")
    2946                            .dwattr $C$DW$291, DW_AT_const_value(0x16)
    2947                            .dwattr $C$DW$291, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2948                            .dwattr $C$DW$291, DW_AT_decl_line(0xac)
    2949                            .dwattr $C$DW$291, DW_AT_decl_column(0x05)
    2950                    
    2951                    $C$DW$292       .dwtag  DW_TAG_enumerator
    2952                            .dwattr $C$DW$292, DW_AT_name("FAPI_CLEAR_MORE")
    2953                            .dwattr $C$DW$292, DW_AT_const_value(0x18)
    2954                            .dwattr $C$DW$292, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2955                            .dwattr $C$DW$292, DW_AT_decl_line(0xad)
    2956                            .dwattr $C$DW$292, DW_AT_decl_column(0x05)
    2957                    
    2958                    $C$DW$293       .dwtag  DW_TAG_enumerator
    2959                            .dwattr $C$DW$293, DW_AT_name("FAPI_PROGRAM_SECTOR")
    2960                            .dwattr $C$DW$293, DW_AT_const_value(0x20)
    2961                            .dwattr $C$DW$293, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2962                            .dwattr $C$DW$293, DW_AT_decl_line(0xae)
    2963                            .dwattr $C$DW$293, DW_AT_decl_column(0x05)
    2964                    
    2965                    $C$DW$294       .dwtag  DW_TAG_enumerator
    2966                            .dwattr $C$DW$294, DW_AT_name("FAPI_ERASE_OTP")
    2967                            .dwattr $C$DW$294, DW_AT_const_value(0x30)
    2968                            .dwattr $C$DW$294, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:21 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{91E5085D-660D-4F25-9A12-879222E44D75} PAGE   55

    2969                            .dwattr $C$DW$294, DW_AT_decl_line(0xaf)
    2970                            .dwattr $C$DW$294, DW_AT_decl_column(0x05)
    2971                    
    2972                            .dwattr $C$DW$T$861, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices
    2973                            .dwattr $C$DW$T$861, DW_AT_decl_line(0xa5)
    2974                            .dwattr $C$DW$T$861, DW_AT_decl_column(0x01)
    2975                            .dwendtag $C$DW$T$861
    2976                    
    2977                    $C$DW$T$862     .dwtag  DW_TAG_typedef
    2978                            .dwattr $C$DW$T$862, DW_AT_name("tFlashStateCommandsType")
    2979                            .dwattr $C$DW$T$862, DW_AT_type(*$C$DW$T$861)
    2980                            .dwattr $C$DW$T$862, DW_AT_language(DW_LANG_C)
    2981                            .dwattr $C$DW$T$862, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices
    2982                            .dwattr $C$DW$T$862, DW_AT_decl_line(0xb0)
    2983                            .dwattr $C$DW$T$862, DW_AT_decl_column(0x03)
    2984                    
    2985                    
    2986                    $C$DW$T$21      .dwtag  DW_TAG_structure_type
    2987                            .dwattr $C$DW$T$21, DW_AT_byte_size(0x08)
    2988                    $C$DW$295       .dwtag  DW_TAG_member
    2989                            .dwattr $C$DW$295, DW_AT_type(*$C$DW$T$20)
    2990                            .dwattr $C$DW$295, DW_AT_name("pCurrEntry")
    2991                            .dwattr $C$DW$295, DW_AT_TI_symbol_name("pCurrEntry")
    2992                            .dwattr $C$DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2993                            .dwattr $C$DW$295, DW_AT_accessibility(DW_ACCESS_public)
    2994                            .dwattr $C$DW$295, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    2995                            .dwattr $C$DW$295, DW_AT_decl_line(0x41)
    2996                            .dwattr $C$DW$295, DW_AT_decl_column(0x0d)
    2997                    
    2998                    $C$DW$296       .dwtag  DW_TAG_member
    2999                            .dwattr $C$DW$296, DW_AT_type(*$C$DW$T$20)
    3000                            .dwattr $C$DW$296, DW_AT_name("pLastEntry")
    3001                            .dwattr $C$DW$296, DW_AT_TI_symbol_name("pLastEntry")
    3002                            .dwattr $C$DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3003                            .dwattr $C$DW$296, DW_AT_accessibility(DW_ACCESS_public)
    3004                            .dwattr $C$DW$296, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    3005                            .dwattr $C$DW$296, DW_AT_decl_line(0x42)
    3006                            .dwattr $C$DW$296, DW_AT_decl_column(0x0d)
    3007                    
    3008                            .dwattr $C$DW$T$21, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\
    3009                            .dwattr $C$DW$T$21, DW_AT_decl_line(0x40)
    3010                            .dwattr $C$DW$T$21, DW_AT_decl_column(0x10)
    3011                            .dwendtag $C$DW$T$21
    3012                    
    3013                    $C$DW$T$705     .dwtag  DW_TAG_typedef
    3014                            .dwattr $C$DW$T$705, DW_AT_name("dataQueue_t")
    3015                            .dwattr $C$DW$T$705, DW_AT_type(*$C$DW$T$21)
    3016                            .dwattr $C$DW$T$705, DW_AT_language(DW_LANG_C)
    3017                            .dwattr $C$DW$T$705, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices
    3018                            .dwattr $C$DW$T$705, DW_AT_decl_line(0x43)
    3019                            .dwattr $C$DW$T$705, DW_AT_decl_column(0x03)
    3020                    
    3021                    $C$DW$T$706     .dwtag  DW_TAG_pointer_type
    3022                            .dwattr $C$DW$T$706, DW_AT_type(*$C$DW$T$705)
    3023                            .dwattr $C$DW$T$706, DW_AT_address_class(0x20)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:21 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{91E5085D-660D-4F25-9A12-879222E44D75} PAGE   56

    3024                    
    3025                    
    3026                    $C$DW$T$22      .dwtag  DW_TAG_structure_type
    3027                            .dwattr $C$DW$T$22, DW_AT_byte_size(0x01)
    3028                    $C$DW$297       .dwtag  DW_TAG_member
    3029                            .dwattr $C$DW$297, DW_AT_type(*$C$DW$T$19)
    3030                            .dwattr $C$DW$297, DW_AT_name("triggerType")
    3031                            .dwattr $C$DW$297, DW_AT_TI_symbol_name("triggerType")
    3032                            .dwattr $C$DW$297, DW_AT_bit_offset(0x04)
    3033                            .dwattr $C$DW$297, DW_AT_bit_size(0x04)
    3034                            .dwattr $C$DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3035                            .dwattr $C$DW$297, DW_AT_accessibility(DW_ACCESS_public)
    3036                            .dwattr $C$DW$297, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    3037                            .dwattr $C$DW$297, DW_AT_decl_line(0x77)
    3038                            .dwattr $C$DW$297, DW_AT_decl_column(0x0f)
    3039                    
    3040                    $C$DW$298       .dwtag  DW_TAG_member
    3041                            .dwattr $C$DW$298, DW_AT_type(*$C$DW$T$19)
    3042                            .dwattr $C$DW$298, DW_AT_name("bEnaCmd")
    3043                            .dwattr $C$DW$298, DW_AT_TI_symbol_name("bEnaCmd")
    3044                            .dwattr $C$DW$298, DW_AT_bit_offset(0x03)
    3045                            .dwattr $C$DW$298, DW_AT_bit_size(0x01)
    3046                            .dwattr $C$DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3047                            .dwattr $C$DW$298, DW_AT_accessibility(DW_ACCESS_public)
    3048                            .dwattr $C$DW$298, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    3049                            .dwattr $C$DW$298, DW_AT_decl_line(0x78)
    3050                            .dwattr $C$DW$298, DW_AT_decl_column(0x0f)
    3051                    
    3052                    $C$DW$299       .dwtag  DW_TAG_member
    3053                            .dwattr $C$DW$299, DW_AT_type(*$C$DW$T$19)
    3054                            .dwattr $C$DW$299, DW_AT_name("triggerNo")
    3055                            .dwattr $C$DW$299, DW_AT_TI_symbol_name("triggerNo")
    3056                            .dwattr $C$DW$299, DW_AT_bit_offset(0x01)
    3057                            .dwattr $C$DW$299, DW_AT_bit_size(0x02)
    3058                            .dwattr $C$DW$299, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3059                            .dwattr $C$DW$299, DW_AT_accessibility(DW_ACCESS_public)
    3060                            .dwattr $C$DW$299, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    3061                            .dwattr $C$DW$299, DW_AT_decl_line(0x7a)
    3062                            .dwattr $C$DW$299, DW_AT_decl_column(0x0f)
    3063                    
    3064                    $C$DW$300       .dwtag  DW_TAG_member
    3065                            .dwattr $C$DW$300, DW_AT_type(*$C$DW$T$19)
    3066                            .dwattr $C$DW$300, DW_AT_name("pastTrig")
    3067                            .dwattr $C$DW$300, DW_AT_TI_symbol_name("pastTrig")
    3068                            .dwattr $C$DW$300, DW_AT_bit_offset(0x00)
    3069                            .dwattr $C$DW$300, DW_AT_bit_size(0x01)
    3070                            .dwattr $C$DW$300, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3071                            .dwattr $C$DW$300, DW_AT_accessibility(DW_ACCESS_public)
    3072                            .dwattr $C$DW$300, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    3073                            .dwattr $C$DW$300, DW_AT_decl_line(0x7b)
    3074                            .dwattr $C$DW$300, DW_AT_decl_column(0x0f)
    3075                    
    3076                            .dwattr $C$DW$T$22, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/
    3077                            .dwattr $C$DW$T$22, DW_AT_decl_line(0x76)
    3078                            .dwattr $C$DW$T$22, DW_AT_decl_column(0x0b)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:21 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{91E5085D-660D-4F25-9A12-879222E44D75} PAGE   57

    3079                            .dwendtag $C$DW$T$22
    3080                    
    3081                    
    3082                    $C$DW$T$23      .dwtag  DW_TAG_structure_type
    3083                            .dwattr $C$DW$T$23, DW_AT_byte_size(0x01)
    3084                    $C$DW$301       .dwtag  DW_TAG_member
    3085                            .dwattr $C$DW$301, DW_AT_type(*$C$DW$T$19)
    3086                            .dwattr $C$DW$301, DW_AT_name("rule")
    3087                            .dwattr $C$DW$301, DW_AT_TI_symbol_name("rule")
    3088                            .dwattr $C$DW$301, DW_AT_bit_offset(0x04)
    3089                            .dwattr $C$DW$301, DW_AT_bit_size(0x04)
    3090                            .dwattr $C$DW$301, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3091                            .dwattr $C$DW$301, DW_AT_accessibility(DW_ACCESS_public)
    3092                            .dwattr $C$DW$301, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    3093                            .dwattr $C$DW$301, DW_AT_decl_line(0x7f)
    3094                            .dwattr $C$DW$301, DW_AT_decl_column(0x0f)
    3095                    
    3096                    $C$DW$302       .dwtag  DW_TAG_member
    3097                            .dwattr $C$DW$302, DW_AT_type(*$C$DW$T$19)
    3098                            .dwattr $C$DW$302, DW_AT_name("nSkip")
    3099                            .dwattr $C$DW$302, DW_AT_TI_symbol_name("nSkip")
    3100                            .dwattr $C$DW$302, DW_AT_bit_offset(0x00)
    3101                            .dwattr $C$DW$302, DW_AT_bit_size(0x04)
    3102                            .dwattr $C$DW$302, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3103                            .dwattr $C$DW$302, DW_AT_accessibility(DW_ACCESS_public)
    3104                            .dwattr $C$DW$302, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    3105                            .dwattr $C$DW$302, DW_AT_decl_line(0x80)
    3106                            .dwattr $C$DW$302, DW_AT_decl_column(0x0f)
    3107                    
    3108                            .dwattr $C$DW$T$23, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/
    3109                            .dwattr $C$DW$T$23, DW_AT_decl_line(0x7e)
    3110                            .dwattr $C$DW$T$23, DW_AT_decl_column(0x0b)
    3111                            .dwendtag $C$DW$T$23
    3112                    
    3113                    
    3114                    $C$DW$T$24      .dwtag  DW_TAG_structure_type
    3115                            .dwattr $C$DW$T$24, DW_AT_byte_size(0x01)
    3116                    $C$DW$303       .dwtag  DW_TAG_member
    3117                            .dwattr $C$DW$303, DW_AT_type(*$C$DW$T$19)
    3118                            .dwattr $C$DW$303, DW_AT_name("triggerType")
    3119                            .dwattr $C$DW$303, DW_AT_TI_symbol_name("triggerType")
    3120                            .dwattr $C$DW$303, DW_AT_bit_offset(0x04)
    3121                            .dwattr $C$DW$303, DW_AT_bit_size(0x04)
    3122                            .dwattr $C$DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3123                            .dwattr $C$DW$303, DW_AT_accessibility(DW_ACCESS_public)
    3124                            .dwattr $C$DW$303, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    3125                            .dwattr $C$DW$303, DW_AT_decl_line(0x92)
    3126                            .dwattr $C$DW$303, DW_AT_decl_column(0x0f)
    3127                    
    3128                    $C$DW$304       .dwtag  DW_TAG_member
    3129                            .dwattr $C$DW$304, DW_AT_type(*$C$DW$T$19)
    3130                            .dwattr $C$DW$304, DW_AT_name("bEnaCmd")
    3131                            .dwattr $C$DW$304, DW_AT_TI_symbol_name("bEnaCmd")
    3132                            .dwattr $C$DW$304, DW_AT_bit_offset(0x03)
    3133                            .dwattr $C$DW$304, DW_AT_bit_size(0x01)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:21 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{91E5085D-660D-4F25-9A12-879222E44D75} PAGE   58

    3134                            .dwattr $C$DW$304, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3135                            .dwattr $C$DW$304, DW_AT_accessibility(DW_ACCESS_public)
    3136                            .dwattr $C$DW$304, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    3137                            .dwattr $C$DW$304, DW_AT_decl_line(0x93)
    3138                            .dwattr $C$DW$304, DW_AT_decl_column(0x0f)
    3139                    
    3140                    $C$DW$305       .dwtag  DW_TAG_member
    3141                            .dwattr $C$DW$305, DW_AT_type(*$C$DW$T$19)
    3142                            .dwattr $C$DW$305, DW_AT_name("triggerNo")
    3143                            .dwattr $C$DW$305, DW_AT_TI_symbol_name("triggerNo")
    3144                            .dwattr $C$DW$305, DW_AT_bit_offset(0x01)
    3145                            .dwattr $C$DW$305, DW_AT_bit_size(0x02)
    3146                            .dwattr $C$DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3147                            .dwattr $C$DW$305, DW_AT_accessibility(DW_ACCESS_public)
    3148                            .dwattr $C$DW$305, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    3149                            .dwattr $C$DW$305, DW_AT_decl_line(0x95)
    3150                            .dwattr $C$DW$305, DW_AT_decl_column(0x0f)
    3151                    
    3152                    $C$DW$306       .dwtag  DW_TAG_member
    3153                            .dwattr $C$DW$306, DW_AT_type(*$C$DW$T$19)
    3154                            .dwattr $C$DW$306, DW_AT_name("pastTrig")
    3155                            .dwattr $C$DW$306, DW_AT_TI_symbol_name("pastTrig")
    3156                            .dwattr $C$DW$306, DW_AT_bit_offset(0x00)
    3157                            .dwattr $C$DW$306, DW_AT_bit_size(0x01)
    3158                            .dwattr $C$DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3159                            .dwattr $C$DW$306, DW_AT_accessibility(DW_ACCESS_public)
    3160                            .dwattr $C$DW$306, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    3161                            .dwattr $C$DW$306, DW_AT_decl_line(0x96)
    3162                            .dwattr $C$DW$306, DW_AT_decl_column(0x0f)
    3163                    
    3164                            .dwattr $C$DW$T$24, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/
    3165                            .dwattr $C$DW$T$24, DW_AT_decl_line(0x91)
    3166                            .dwattr $C$DW$T$24, DW_AT_decl_column(0x0b)
    3167                            .dwendtag $C$DW$T$24
    3168                    
    3169                    
    3170                    $C$DW$T$25      .dwtag  DW_TAG_structure_type
    3171                            .dwattr $C$DW$T$25, DW_AT_byte_size(0x01)
    3172                    $C$DW$307       .dwtag  DW_TAG_member
    3173                            .dwattr $C$DW$307, DW_AT_type(*$C$DW$T$19)
    3174                            .dwattr $C$DW$307, DW_AT_name("rule")
    3175                            .dwattr $C$DW$307, DW_AT_TI_symbol_name("rule")
    3176                            .dwattr $C$DW$307, DW_AT_bit_offset(0x04)
    3177                            .dwattr $C$DW$307, DW_AT_bit_size(0x04)
    3178                            .dwattr $C$DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3179                            .dwattr $C$DW$307, DW_AT_accessibility(DW_ACCESS_public)
    3180                            .dwattr $C$DW$307, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    3181                            .dwattr $C$DW$307, DW_AT_decl_line(0x9a)
    3182                            .dwattr $C$DW$307, DW_AT_decl_column(0x0f)
    3183                    
    3184                    $C$DW$308       .dwtag  DW_TAG_member
    3185                            .dwattr $C$DW$308, DW_AT_type(*$C$DW$T$19)
    3186                            .dwattr $C$DW$308, DW_AT_name("nSkip")
    3187                            .dwattr $C$DW$308, DW_AT_TI_symbol_name("nSkip")
    3188                            .dwattr $C$DW$308, DW_AT_bit_offset(0x00)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:21 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{91E5085D-660D-4F25-9A12-879222E44D75} PAGE   59

    3189                            .dwattr $C$DW$308, DW_AT_bit_size(0x04)
    3190                            .dwattr $C$DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3191                            .dwattr $C$DW$308, DW_AT_accessibility(DW_ACCESS_public)
    3192                            .dwattr $C$DW$308, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    3193                            .dwattr $C$DW$308, DW_AT_decl_line(0x9b)
    3194                            .dwattr $C$DW$308, DW_AT_decl_column(0x0f)
    3195                    
    3196                            .dwattr $C$DW$T$25, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/
    3197                            .dwattr $C$DW$T$25, DW_AT_decl_line(0x99)
    3198                            .dwattr $C$DW$T$25, DW_AT_decl_column(0x0b)
    3199                            .dwendtag $C$DW$T$25
    3200                    
    3201                    
    3202                    $C$DW$T$26      .dwtag  DW_TAG_structure_type
    3203                            .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
    3204                    $C$DW$309       .dwtag  DW_TAG_member
    3205                            .dwattr $C$DW$309, DW_AT_type(*$C$DW$T$19)
    3206                            .dwattr $C$DW$309, DW_AT_name("triggerType")
    3207                            .dwattr $C$DW$309, DW_AT_TI_symbol_name("triggerType")
    3208                            .dwattr $C$DW$309, DW_AT_bit_offset(0x04)
    3209                            .dwattr $C$DW$309, DW_AT_bit_size(0x04)
    3210                            .dwattr $C$DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3211                            .dwattr $C$DW$309, DW_AT_accessibility(DW_ACCESS_public)
    3212                            .dwattr $C$DW$309, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    3213                            .dwattr $C$DW$309, DW_AT_decl_line(0xad)
    3214                            .dwattr $C$DW$309, DW_AT_decl_column(0x0f)
    3215                    
    3216                    $C$DW$310       .dwtag  DW_TAG_member
    3217                            .dwattr $C$DW$310, DW_AT_type(*$C$DW$T$19)
    3218                            .dwattr $C$DW$310, DW_AT_name("bEnaCmd")
    3219                            .dwattr $C$DW$310, DW_AT_TI_symbol_name("bEnaCmd")
    3220                            .dwattr $C$DW$310, DW_AT_bit_offset(0x03)
    3221                            .dwattr $C$DW$310, DW_AT_bit_size(0x01)
    3222                            .dwattr $C$DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3223                            .dwattr $C$DW$310, DW_AT_accessibility(DW_ACCESS_public)
    3224                            .dwattr $C$DW$310, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    3225                            .dwattr $C$DW$310, DW_AT_decl_line(0xae)
    3226                            .dwattr $C$DW$310, DW_AT_decl_column(0x0f)
    3227                    
    3228                    $C$DW$311       .dwtag  DW_TAG_member
    3229                            .dwattr $C$DW$311, DW_AT_type(*$C$DW$T$19)
    3230                            .dwattr $C$DW$311, DW_AT_name("triggerNo")
    3231                            .dwattr $C$DW$311, DW_AT_TI_symbol_name("triggerNo")
    3232                            .dwattr $C$DW$311, DW_AT_bit_offset(0x01)
    3233                            .dwattr $C$DW$311, DW_AT_bit_size(0x02)
    3234                            .dwattr $C$DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3235                            .dwattr $C$DW$311, DW_AT_accessibility(DW_ACCESS_public)
    3236                            .dwattr $C$DW$311, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    3237                            .dwattr $C$DW$311, DW_AT_decl_line(0xb0)
    3238                            .dwattr $C$DW$311, DW_AT_decl_column(0x0f)
    3239                    
    3240                    $C$DW$312       .dwtag  DW_TAG_member
    3241                            .dwattr $C$DW$312, DW_AT_type(*$C$DW$T$19)
    3242                            .dwattr $C$DW$312, DW_AT_name("pastTrig")
    3243                            .dwattr $C$DW$312, DW_AT_TI_symbol_name("pastTrig")
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:21 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{91E5085D-660D-4F25-9A12-879222E44D75} PAGE   60

    3244                            .dwattr $C$DW$312, DW_AT_bit_offset(0x00)
    3245                            .dwattr $C$DW$312, DW_AT_bit_size(0x01)
    3246                            .dwattr $C$DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3247                            .dwattr $C$DW$312, DW_AT_accessibility(DW_ACCESS_public)
    3248                            .dwattr $C$DW$312, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    3249                            .dwattr $C$DW$312, DW_AT_decl_line(0xb1)
    3250                            .dwattr $C$DW$312, DW_AT_decl_column(0x0f)
    3251                    
    3252                            .dwattr $C$DW$T$26, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/
    3253                            .dwattr $C$DW$T$26, DW_AT_decl_line(0xac)
    3254                            .dwattr $C$DW$T$26, DW_AT_decl_column(0x0b)
    3255                            .dwendtag $C$DW$T$26
    3256                    
    3257                    
    3258                    $C$DW$T$27      .dwtag  DW_TAG_structure_type
    3259                            .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
    3260                    $C$DW$313       .dwtag  DW_TAG_member
    3261                            .dwattr $C$DW$313, DW_AT_type(*$C$DW$T$19)
    3262                            .dwattr $C$DW$313, DW_AT_name("rule")
    3263                            .dwattr $C$DW$313, DW_AT_TI_symbol_name("rule")
    3264                            .dwattr $C$DW$313, DW_AT_bit_offset(0x04)
    3265                            .dwattr $C$DW$313, DW_AT_bit_size(0x04)
    3266                            .dwattr $C$DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3267                            .dwattr $C$DW$313, DW_AT_accessibility(DW_ACCESS_public)
    3268                            .dwattr $C$DW$313, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    3269                            .dwattr $C$DW$313, DW_AT_decl_line(0xb5)
    3270                            .dwattr $C$DW$313, DW_AT_decl_column(0x0f)
    3271                    
    3272                    $C$DW$314       .dwtag  DW_TAG_member
    3273                            .dwattr $C$DW$314, DW_AT_type(*$C$DW$T$19)
    3274                            .dwattr $C$DW$314, DW_AT_name("nSkip")
    3275                            .dwattr $C$DW$314, DW_AT_TI_symbol_name("nSkip")
    3276                            .dwattr $C$DW$314, DW_AT_bit_offset(0x00)
    3277                            .dwattr $C$DW$314, DW_AT_bit_size(0x04)
    3278                            .dwattr $C$DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3279                            .dwattr $C$DW$314, DW_AT_accessibility(DW_ACCESS_public)
    3280                            .dwattr $C$DW$314, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    3281                            .dwattr $C$DW$314, DW_AT_decl_line(0xb6)
    3282                            .dwattr $C$DW$314, DW_AT_decl_column(0x0f)
    3283                    
    3284                            .dwattr $C$DW$T$27, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/
    3285                            .dwattr $C$DW$T$27, DW_AT_decl_line(0xb4)
    3286                            .dwattr $C$DW$T$27, DW_AT_decl_column(0x0b)
    3287                            .dwendtag $C$DW$T$27
    3288                    
    3289                    
    3290                    $C$DW$T$29      .dwtag  DW_TAG_structure_type
    3291                            .dwattr $C$DW$T$29, DW_AT_byte_size(0x02)
    3292                    $C$DW$315       .dwtag  DW_TAG_member
    3293                            .dwattr $C$DW$315, DW_AT_type(*$C$DW$T$28)
    3294                            .dwattr $C$DW$315, DW_AT_name("frontEndMode")
    3295                            .dwattr $C$DW$315, DW_AT_TI_symbol_name("frontEndMode")
    3296                            .dwattr $C$DW$315, DW_AT_bit_offset(0x0d)
    3297                            .dwattr $C$DW$315, DW_AT_bit_size(0x03)
    3298                            .dwattr $C$DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:21 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{91E5085D-660D-4F25-9A12-879222E44D75} PAGE   61

    3299                            .dwattr $C$DW$315, DW_AT_accessibility(DW_ACCESS_public)
    3300                            .dwattr $C$DW$315, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    3301                            .dwattr $C$DW$315, DW_AT_decl_line(0xc3)
    3302                            .dwattr $C$DW$315, DW_AT_decl_column(0x10)
    3303                    
    3304                    $C$DW$316       .dwtag  DW_TAG_member
    3305                            .dwattr $C$DW$316, DW_AT_type(*$C$DW$T$28)
    3306                            .dwattr $C$DW$316, DW_AT_name("biasMode")
    3307                            .dwattr $C$DW$316, DW_AT_TI_symbol_name("biasMode")
    3308                            .dwattr $C$DW$316, DW_AT_bit_offset(0x0c)
    3309                            .dwattr $C$DW$316, DW_AT_bit_size(0x01)
    3310                            .dwattr $C$DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3311                            .dwattr $C$DW$316, DW_AT_accessibility(DW_ACCESS_public)
    3312                            .dwattr $C$DW$316, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    3313                            .dwattr $C$DW$316, DW_AT_decl_line(0xc9)
    3314                            .dwattr $C$DW$316, DW_AT_decl_column(0x10)
    3315                    
    3316                    $C$DW$317       .dwtag  DW_TAG_member
    3317                            .dwattr $C$DW$317, DW_AT_type(*$C$DW$T$28)
    3318                            .dwattr $C$DW$317, DW_AT_name("analogCfgMode")
    3319                            .dwattr $C$DW$317, DW_AT_TI_symbol_name("analogCfgMode")
    3320                            .dwattr $C$DW$317, DW_AT_bit_offset(0x06)
    3321                            .dwattr $C$DW$317, DW_AT_bit_size(0x06)
    3322                            .dwattr $C$DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3323                            .dwattr $C$DW$317, DW_AT_accessibility(DW_ACCESS_public)
    3324                            .dwattr $C$DW$317, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    3325                            .dwattr $C$DW$317, DW_AT_decl_line(0xcb)
    3326                            .dwattr $C$DW$317, DW_AT_decl_column(0x10)
    3327                    
    3328                    $C$DW$318       .dwtag  DW_TAG_member
    3329                            .dwattr $C$DW$318, DW_AT_type(*$C$DW$T$28)
    3330                            .dwattr $C$DW$318, DW_AT_name("bNoFsPowerUp")
    3331                            .dwattr $C$DW$318, DW_AT_TI_symbol_name("bNoFsPowerUp")
    3332                            .dwattr $C$DW$318, DW_AT_bit_offset(0x05)
    3333                            .dwattr $C$DW$318, DW_AT_bit_size(0x01)
    3334                            .dwattr $C$DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3335                            .dwattr $C$DW$318, DW_AT_accessibility(DW_ACCESS_public)
    3336                            .dwattr $C$DW$318, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    3337                            .dwattr $C$DW$318, DW_AT_decl_line(0xd2)
    3338                            .dwattr $C$DW$318, DW_AT_decl_column(0x10)
    3339                    
    3340                            .dwattr $C$DW$T$29, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/
    3341                            .dwattr $C$DW$T$29, DW_AT_decl_line(0xc2)
    3342                            .dwattr $C$DW$T$29, DW_AT_decl_column(0x0b)
    3343                            .dwendtag $C$DW$T$29
    3344                    
    3345                    
    3346                    $C$DW$T$30      .dwtag  DW_TAG_structure_type
    3347                            .dwattr $C$DW$T$30, DW_AT_byte_size(0x01)
    3348                    $C$DW$319       .dwtag  DW_TAG_member
    3349                            .dwattr $C$DW$319, DW_AT_type(*$C$DW$T$19)
    3350                            .dwattr $C$DW$319, DW_AT_name("triggerType")
    3351                            .dwattr $C$DW$319, DW_AT_TI_symbol_name("triggerType")
    3352                            .dwattr $C$DW$319, DW_AT_bit_offset(0x04)
    3353                            .dwattr $C$DW$319, DW_AT_bit_size(0x04)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:21 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{91E5085D-660D-4F25-9A12-879222E44D75} PAGE   62

    3354                            .dwattr $C$DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3355                            .dwattr $C$DW$319, DW_AT_accessibility(DW_ACCESS_public)
    3356                            .dwattr $C$DW$319, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    3357                            .dwattr $C$DW$319, DW_AT_decl_line(0xe8)
    3358                            .dwattr $C$DW$319, DW_AT_decl_column(0x0f)
    3359                    
    3360                    $C$DW$320       .dwtag  DW_TAG_member
    3361                            .dwattr $C$DW$320, DW_AT_type(*$C$DW$T$19)
    3362                            .dwattr $C$DW$320, DW_AT_name("bEnaCmd")
    3363                            .dwattr $C$DW$320, DW_AT_TI_symbol_name("bEnaCmd")
    3364                            .dwattr $C$DW$320, DW_AT_bit_offset(0x03)
    3365                            .dwattr $C$DW$320, DW_AT_bit_size(0x01)
    3366                            .dwattr $C$DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3367                            .dwattr $C$DW$320, DW_AT_accessibility(DW_ACCESS_public)
    3368                            .dwattr $C$DW$320, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    3369                            .dwattr $C$DW$320, DW_AT_decl_line(0xe9)
    3370                            .dwattr $C$DW$320, DW_AT_decl_column(0x0f)
    3371                    
    3372                    $C$DW$321       .dwtag  DW_TAG_member
    3373                            .dwattr $C$DW$321, DW_AT_type(*$C$DW$T$19)
    3374                            .dwattr $C$DW$321, DW_AT_name("triggerNo")
    3375                            .dwattr $C$DW$321, DW_AT_TI_symbol_name("triggerNo")
    3376                            .dwattr $C$DW$321, DW_AT_bit_offset(0x01)
    3377                            .dwattr $C$DW$321, DW_AT_bit_size(0x02)
    3378                            .dwattr $C$DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3379                            .dwattr $C$DW$321, DW_AT_accessibility(DW_ACCESS_public)
    3380                            .dwattr $C$DW$321, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    3381                            .dwattr $C$DW$321, DW_AT_decl_line(0xeb)
    3382                            .dwattr $C$DW$321, DW_AT_decl_column(0x0f)
    3383                    
    3384                    $C$DW$322       .dwtag  DW_TAG_member
    3385                            .dwattr $C$DW$322, DW_AT_type(*$C$DW$T$19)
    3386                            .dwattr $C$DW$322, DW_AT_name("pastTrig")
    3387                            .dwattr $C$DW$322, DW_AT_TI_symbol_name("pastTrig")
    3388                            .dwattr $C$DW$322, DW_AT_bit_offset(0x00)
    3389                            .dwattr $C$DW$322, DW_AT_bit_size(0x01)
    3390                            .dwattr $C$DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3391                            .dwattr $C$DW$322, DW_AT_accessibility(DW_ACCESS_public)
    3392                            .dwattr $C$DW$322, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    3393                            .dwattr $C$DW$322, DW_AT_decl_line(0xec)
    3394                            .dwattr $C$DW$322, DW_AT_decl_column(0x0f)
    3395                    
    3396                            .dwattr $C$DW$T$30, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/
    3397                            .dwattr $C$DW$T$30, DW_AT_decl_line(0xe7)
    3398                            .dwattr $C$DW$T$30, DW_AT_decl_column(0x0b)
    3399                            .dwendtag $C$DW$T$30
    3400                    
    3401                    
    3402                    $C$DW$T$31      .dwtag  DW_TAG_structure_type
    3403                            .dwattr $C$DW$T$31, DW_AT_byte_size(0x01)
    3404                    $C$DW$323       .dwtag  DW_TAG_member
    3405                            .dwattr $C$DW$323, DW_AT_type(*$C$DW$T$19)
    3406                            .dwattr $C$DW$323, DW_AT_name("rule")
    3407                            .dwattr $C$DW$323, DW_AT_TI_symbol_name("rule")
    3408                            .dwattr $C$DW$323, DW_AT_bit_offset(0x04)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:21 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{91E5085D-660D-4F25-9A12-879222E44D75} PAGE   63

    3409                            .dwattr $C$DW$323, DW_AT_bit_size(0x04)
    3410                            .dwattr $C$DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3411                            .dwattr $C$DW$323, DW_AT_accessibility(DW_ACCESS_public)
    3412                            .dwattr $C$DW$323, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    3413                            .dwattr $C$DW$323, DW_AT_decl_line(0xf0)
    3414                            .dwattr $C$DW$323, DW_AT_decl_column(0x0f)
    3415                    
    3416                    $C$DW$324       .dwtag  DW_TAG_member
    3417                            .dwattr $C$DW$324, DW_AT_type(*$C$DW$T$19)
    3418                            .dwattr $C$DW$324, DW_AT_name("nSkip")
    3419                            .dwattr $C$DW$324, DW_AT_TI_symbol_name("nSkip")
    3420                            .dwattr $C$DW$324, DW_AT_bit_offset(0x00)
    3421                            .dwattr $C$DW$324, DW_AT_bit_size(0x04)
    3422                            .dwattr $C$DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3423                            .dwattr $C$DW$324, DW_AT_accessibility(DW_ACCESS_public)
    3424                            .dwattr $C$DW$324, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    3425                            .dwattr $C$DW$324, DW_AT_decl_line(0xf1)
    3426                            .dwattr $C$DW$324, DW_AT_decl_column(0x0f)
    3427                    
    3428                            .dwattr $C$DW$T$31, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/
    3429                            .dwattr $C$DW$T$31, DW_AT_decl_line(0xef)
    3430                            .dwattr $C$DW$T$31, DW_AT_decl_column(0x0b)
    3431                            .dwendtag $C$DW$T$31
    3432                    
    3433                    
    3434                    $C$DW$T$32      .dwtag  DW_TAG_structure_type
    3435                            .dwattr $C$DW$T$32, DW_AT_byte_size(0x01)
    3436                    $C$DW$325       .dwtag  DW_TAG_member
    3437                            .dwattr $C$DW$325, DW_AT_type(*$C$DW$T$19)
    3438                            .dwattr $C$DW$325, DW_AT_name("bTxMode")
    3439                            .dwattr $C$DW$325, DW_AT_TI_symbol_name("bTxMode")
    3440                            .dwattr $C$DW$325, DW_AT_bit_offset(0x07)
    3441                            .dwattr $C$DW$325, DW_AT_bit_size(0x01)
    3442                            .dwattr $C$DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3443                            .dwattr $C$DW$325, DW_AT_accessibility(DW_ACCESS_public)
    3444                            .dwattr $C$DW$325, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    3445                            .dwattr $C$DW$325, DW_AT_decl_line(0xf6)
    3446                            .dwattr $C$DW$325, DW_AT_decl_column(0x0f)
    3447                    
    3448                    $C$DW$326       .dwtag  DW_TAG_member
    3449                            .dwattr $C$DW$326, DW_AT_type(*$C$DW$T$19)
    3450                            .dwattr $C$DW$326, DW_AT_name("refFreq")
    3451                            .dwattr $C$DW$326, DW_AT_TI_symbol_name("refFreq")
    3452                            .dwattr $C$DW$326, DW_AT_bit_offset(0x01)
    3453                            .dwattr $C$DW$326, DW_AT_bit_size(0x06)
    3454                            .dwattr $C$DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3455                            .dwattr $C$DW$326, DW_AT_accessibility(DW_ACCESS_public)
    3456                            .dwattr $C$DW$326, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    3457                            .dwattr $C$DW$326, DW_AT_decl_line(0xf8)
    3458                            .dwattr $C$DW$326, DW_AT_decl_column(0x0f)
    3459                    
    3460                            .dwattr $C$DW$T$32, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/
    3461                            .dwattr $C$DW$T$32, DW_AT_decl_line(0xf5)
    3462                            .dwattr $C$DW$T$32, DW_AT_decl_column(0x0b)
    3463                            .dwendtag $C$DW$T$32
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:21 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{91E5085D-660D-4F25-9A12-879222E44D75} PAGE   64

    3464                    
    3465                    
    3466                    $C$DW$T$33      .dwtag  DW_TAG_structure_type
    3467                            .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
    3468                    $C$DW$327       .dwtag  DW_TAG_member
    3469                            .dwattr $C$DW$327, DW_AT_type(*$C$DW$T$19)
    3470                            .dwattr $C$DW$327, DW_AT_name("triggerType")
    3471                            .dwattr $C$DW$327, DW_AT_TI_symbol_name("triggerType")
    3472                            .dwattr $C$DW$327, DW_AT_bit_offset(0x04)
    3473                            .dwattr $C$DW$327, DW_AT_bit_size(0x04)
    3474                            .dwattr $C$DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3475                            .dwattr $C$DW$327, DW_AT_accessibility(DW_ACCESS_public)
    3476                            .dwattr $C$DW$327, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    3477                            .dwattr $C$DW$327, DW_AT_decl_line(0x10f)
    3478                            .dwattr $C$DW$327, DW_AT_decl_column(0x0f)
    3479                    
    3480                    $C$DW$328       .dwtag  DW_TAG_member
    3481                            .dwattr $C$DW$328, DW_AT_type(*$C$DW$T$19)
    3482                            .dwattr $C$DW$328, DW_AT_name("bEnaCmd")
    3483                            .dwattr $C$DW$328, DW_AT_TI_symbol_name("bEnaCmd")
    3484                            .dwattr $C$DW$328, DW_AT_bit_offset(0x03)
    3485                            .dwattr $C$DW$328, DW_AT_bit_size(0x01)
    3486                            .dwattr $C$DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3487                            .dwattr $C$DW$328, DW_AT_accessibility(DW_ACCESS_public)
    3488                            .dwattr $C$DW$328, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    3489                            .dwattr $C$DW$328, DW_AT_decl_line(0x110)
    3490                            .dwattr $C$DW$328, DW_AT_decl_column(0x0f)
    3491                    
    3492                    $C$DW$329       .dwtag  DW_TAG_member
    3493                            .dwattr $C$DW$329, DW_AT_type(*$C$DW$T$19)
    3494                            .dwattr $C$DW$329, DW_AT_name("triggerNo")
    3495                            .dwattr $C$DW$329, DW_AT_TI_symbol_name("triggerNo")
    3496                            .dwattr $C$DW$329, DW_AT_bit_offset(0x01)
    3497                            .dwattr $C$DW$329, DW_AT_bit_size(0x02)
    3498                            .dwattr $C$DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3499                            .dwattr $C$DW$329, DW_AT_accessibility(DW_ACCESS_public)
    3500                            .dwattr $C$DW$329, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    3501                            .dwattr $C$DW$329, DW_AT_decl_line(0x112)
    3502                            .dwattr $C$DW$329, DW_AT_decl_column(0x0f)
    3503                    
    3504                    $C$DW$330       .dwtag  DW_TAG_member
    3505                            .dwattr $C$DW$330, DW_AT_type(*$C$DW$T$19)
    3506                            .dwattr $C$DW$330, DW_AT_name("pastTrig")
    3507                            .dwattr $C$DW$330, DW_AT_TI_symbol_name("pastTrig")
    3508                            .dwattr $C$DW$330, DW_AT_bit_offset(0x00)
    3509                            .dwattr $C$DW$330, DW_AT_bit_size(0x01)
    3510                            .dwattr $C$DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3511                            .dwattr $C$DW$330, DW_AT_accessibility(DW_ACCESS_public)
    3512                            .dwattr $C$DW$330, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    3513                            .dwattr $C$DW$330, DW_AT_decl_line(0x113)
    3514                            .dwattr $C$DW$330, DW_AT_decl_column(0x0f)
    3515                    
    3516                            .dwattr $C$DW$T$33, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/
    3517                            .dwattr $C$DW$T$33, DW_AT_decl_line(0x10e)
    3518                            .dwattr $C$DW$T$33, DW_AT_decl_column(0x0b)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:21 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{91E5085D-660D-4F25-9A12-879222E44D75} PAGE   65

    3519                            .dwendtag $C$DW$T$33
    3520                    
    3521                    
    3522                    $C$DW$T$34      .dwtag  DW_TAG_structure_type
    3523                            .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
    3524                    $C$DW$331       .dwtag  DW_TAG_member
    3525                            .dwattr $C$DW$331, DW_AT_type(*$C$DW$T$19)
    3526                            .dwattr $C$DW$331, DW_AT_name("rule")
    3527                            .dwattr $C$DW$331, DW_AT_TI_symbol_name("rule")
    3528                            .dwattr $C$DW$331, DW_AT_bit_offset(0x04)
    3529                            .dwattr $C$DW$331, DW_AT_bit_size(0x04)
    3530                            .dwattr $C$DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3531                            .dwattr $C$DW$331, DW_AT_accessibility(DW_ACCESS_public)
    3532                            .dwattr $C$DW$331, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    3533                            .dwattr $C$DW$331, DW_AT_decl_line(0x117)
    3534                            .dwattr $C$DW$331, DW_AT_decl_column(0x0f)
    3535                    
    3536                    $C$DW$332       .dwtag  DW_TAG_member
    3537                            .dwattr $C$DW$332, DW_AT_type(*$C$DW$T$19)
    3538                            .dwattr $C$DW$332, DW_AT_name("nSkip")
    3539                            .dwattr $C$DW$332, DW_AT_TI_symbol_name("nSkip")
    3540                            .dwattr $C$DW$332, DW_AT_bit_offset(0x00)
    3541                            .dwattr $C$DW$332, DW_AT_bit_size(0x04)
    3542                            .dwattr $C$DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3543                            .dwattr $C$DW$332, DW_AT_accessibility(DW_ACCESS_public)
    3544                            .dwattr $C$DW$332, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    3545                            .dwattr $C$DW$332, DW_AT_decl_line(0x118)
    3546                            .dwattr $C$DW$332, DW_AT_decl_column(0x0f)
    3547                    
    3548                            .dwattr $C$DW$T$34, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/
    3549                            .dwattr $C$DW$T$34, DW_AT_decl_line(0x116)
    3550                            .dwattr $C$DW$T$34, DW_AT_decl_column(0x0b)
    3551                            .dwendtag $C$DW$T$34
    3552                    
    3553                    
    3554                    $C$DW$T$35      .dwtag  DW_TAG_structure_type
    3555                            .dwattr $C$DW$T$35, DW_AT_byte_size(0x01)
    3556                    $C$DW$333       .dwtag  DW_TAG_member
    3557                            .dwattr $C$DW$333, DW_AT_type(*$C$DW$T$19)
    3558                            .dwattr $C$DW$333, DW_AT_name("triggerType")
    3559                            .dwattr $C$DW$333, DW_AT_TI_symbol_name("triggerType")
    3560                            .dwattr $C$DW$333, DW_AT_bit_offset(0x04)
    3561                            .dwattr $C$DW$333, DW_AT_bit_size(0x04)
    3562                            .dwattr $C$DW$333, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3563                            .dwattr $C$DW$333, DW_AT_accessibility(DW_ACCESS_public)
    3564                            .dwattr $C$DW$333, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    3565                            .dwattr $C$DW$333, DW_AT_decl_line(0x12a)
    3566                            .dwattr $C$DW$333, DW_AT_decl_column(0x0f)
    3567                    
    3568                    $C$DW$334       .dwtag  DW_TAG_member
    3569                            .dwattr $C$DW$334, DW_AT_type(*$C$DW$T$19)
    3570                            .dwattr $C$DW$334, DW_AT_name("bEnaCmd")
    3571                            .dwattr $C$DW$334, DW_AT_TI_symbol_name("bEnaCmd")
    3572                            .dwattr $C$DW$334, DW_AT_bit_offset(0x03)
    3573                            .dwattr $C$DW$334, DW_AT_bit_size(0x01)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:21 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{91E5085D-660D-4F25-9A12-879222E44D75} PAGE   66

    3574                            .dwattr $C$DW$334, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3575                            .dwattr $C$DW$334, DW_AT_accessibility(DW_ACCESS_public)
    3576                            .dwattr $C$DW$334, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    3577                            .dwattr $C$DW$334, DW_AT_decl_line(0x12b)
    3578                            .dwattr $C$DW$334, DW_AT_decl_column(0x0f)
    3579                    
    3580                    $C$DW$335       .dwtag  DW_TAG_member
    3581                            .dwattr $C$DW$335, DW_AT_type(*$C$DW$T$19)
    3582                            .dwattr $C$DW$335, DW_AT_name("triggerNo")
    3583                            .dwattr $C$DW$335, DW_AT_TI_symbol_name("triggerNo")
    3584                            .dwattr $C$DW$335, DW_AT_bit_offset(0x01)
    3585                            .dwattr $C$DW$335, DW_AT_bit_size(0x02)
    3586                            .dwattr $C$DW$335, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3587                            .dwattr $C$DW$335, DW_AT_accessibility(DW_ACCESS_public)
    3588                            .dwattr $C$DW$335, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    3589                            .dwattr $C$DW$335, DW_AT_decl_line(0x12d)
    3590                            .dwattr $C$DW$335, DW_AT_decl_column(0x0f)
    3591                    
    3592                    $C$DW$336       .dwtag  DW_TAG_member
    3593                            .dwattr $C$DW$336, DW_AT_type(*$C$DW$T$19)
    3594                            .dwattr $C$DW$336, DW_AT_name("pastTrig")
    3595                            .dwattr $C$DW$336, DW_AT_TI_symbol_name("pastTrig")
    3596                            .dwattr $C$DW$336, DW_AT_bit_offset(0x00)
    3597                            .dwattr $C$DW$336, DW_AT_bit_size(0x01)
    3598                            .dwattr $C$DW$336, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3599                            .dwattr $C$DW$336, DW_AT_accessibility(DW_ACCESS_public)
    3600                            .dwattr $C$DW$336, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    3601                            .dwattr $C$DW$336, DW_AT_decl_line(0x12e)
    3602                            .dwattr $C$DW$336, DW_AT_decl_column(0x0f)
    3603                    
    3604                            .dwattr $C$DW$T$35, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/
    3605                            .dwattr $C$DW$T$35, DW_AT_decl_line(0x129)
    3606                            .dwattr $C$DW$T$35, DW_AT_decl_column(0x0b)
    3607                            .dwendtag $C$DW$T$35
    3608                    
    3609                    
    3610                    $C$DW$T$36      .dwtag  DW_TAG_structure_type
    3611                            .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
    3612                    $C$DW$337       .dwtag  DW_TAG_member
    3613                            .dwattr $C$DW$337, DW_AT_type(*$C$DW$T$19)
    3614                            .dwattr $C$DW$337, DW_AT_name("rule")
    3615                            .dwattr $C$DW$337, DW_AT_TI_symbol_name("rule")
    3616                            .dwattr $C$DW$337, DW_AT_bit_offset(0x04)
    3617                            .dwattr $C$DW$337, DW_AT_bit_size(0x04)
    3618                            .dwattr $C$DW$337, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3619                            .dwattr $C$DW$337, DW_AT_accessibility(DW_ACCESS_public)
    3620                            .dwattr $C$DW$337, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    3621                            .dwattr $C$DW$337, DW_AT_decl_line(0x132)
    3622                            .dwattr $C$DW$337, DW_AT_decl_column(0x0f)
    3623                    
    3624                    $C$DW$338       .dwtag  DW_TAG_member
    3625                            .dwattr $C$DW$338, DW_AT_type(*$C$DW$T$19)
    3626                            .dwattr $C$DW$338, DW_AT_name("nSkip")
    3627                            .dwattr $C$DW$338, DW_AT_TI_symbol_name("nSkip")
    3628                            .dwattr $C$DW$338, DW_AT_bit_offset(0x00)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:21 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{91E5085D-660D-4F25-9A12-879222E44D75} PAGE   67

    3629                            .dwattr $C$DW$338, DW_AT_bit_size(0x04)
    3630                            .dwattr $C$DW$338, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3631                            .dwattr $C$DW$338, DW_AT_accessibility(DW_ACCESS_public)
    3632                            .dwattr $C$DW$338, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    3633                            .dwattr $C$DW$338, DW_AT_decl_line(0x133)
    3634                            .dwattr $C$DW$338, DW_AT_decl_column(0x0f)
    3635                    
    3636                            .dwattr $C$DW$T$36, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/
    3637                            .dwattr $C$DW$T$36, DW_AT_decl_line(0x131)
    3638                            .dwattr $C$DW$T$36, DW_AT_decl_column(0x0b)
    3639                            .dwendtag $C$DW$T$36
    3640                    
    3641                    
    3642                    $C$DW$T$37      .dwtag  DW_TAG_structure_type
    3643                            .dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
    3644                    $C$DW$339       .dwtag  DW_TAG_member
    3645                            .dwattr $C$DW$339, DW_AT_type(*$C$DW$T$19)
    3646                            .dwattr $C$DW$339, DW_AT_name("bEnaFifo")
    3647                            .dwattr $C$DW$339, DW_AT_TI_symbol_name("bEnaFifo")
    3648                            .dwattr $C$DW$339, DW_AT_bit_offset(0x07)
    3649                            .dwattr $C$DW$339, DW_AT_bit_size(0x01)
    3650                            .dwattr $C$DW$339, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3651                            .dwattr $C$DW$339, DW_AT_accessibility(DW_ACCESS_public)
    3652                            .dwattr $C$DW$339, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    3653                            .dwattr $C$DW$339, DW_AT_decl_line(0x136)
    3654                            .dwattr $C$DW$339, DW_AT_decl_column(0x0f)
    3655                    
    3656                    $C$DW$340       .dwtag  DW_TAG_member
    3657                            .dwattr $C$DW$340, DW_AT_type(*$C$DW$T$19)
    3658                            .dwattr $C$DW$340, DW_AT_name("bFsOff")
    3659                            .dwattr $C$DW$340, DW_AT_TI_symbol_name("bFsOff")
    3660                            .dwattr $C$DW$340, DW_AT_bit_offset(0x06)
    3661                            .dwattr $C$DW$340, DW_AT_bit_size(0x01)
    3662                            .dwattr $C$DW$340, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3663                            .dwattr $C$DW$340, DW_AT_accessibility(DW_ACCESS_public)
    3664                            .dwattr $C$DW$340, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    3665                            .dwattr $C$DW$340, DW_AT_decl_line(0x138)
    3666                            .dwattr $C$DW$340, DW_AT_decl_column(0x0f)
    3667                    
    3668                    $C$DW$341       .dwtag  DW_TAG_member
    3669                            .dwattr $C$DW$341, DW_AT_type(*$C$DW$T$19)
    3670                            .dwattr $C$DW$341, DW_AT_name("bNoSync")
    3671                            .dwattr $C$DW$341, DW_AT_TI_symbol_name("bNoSync")
    3672                            .dwattr $C$DW$341, DW_AT_bit_offset(0x05)
    3673                            .dwattr $C$DW$341, DW_AT_bit_size(0x01)
    3674                            .dwattr $C$DW$341, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3675                            .dwattr $C$DW$341, DW_AT_accessibility(DW_ACCESS_public)
    3676                            .dwattr $C$DW$341, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    3677                            .dwattr $C$DW$341, DW_AT_decl_line(0x13a)
    3678                            .dwattr $C$DW$341, DW_AT_decl_column(0x0f)
    3679                    
    3680                            .dwattr $C$DW$T$37, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/
    3681                            .dwattr $C$DW$T$37, DW_AT_decl_line(0x135)
    3682                            .dwattr $C$DW$T$37, DW_AT_decl_column(0x0b)
    3683                            .dwendtag $C$DW$T$37
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:21 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{91E5085D-660D-4F25-9A12-879222E44D75} PAGE   68

    3684                    
    3685                    
    3686                    $C$DW$T$38      .dwtag  DW_TAG_structure_type
    3687                            .dwattr $C$DW$T$38, DW_AT_byte_size(0x01)
    3688                    $C$DW$342       .dwtag  DW_TAG_member
    3689                            .dwattr $C$DW$342, DW_AT_type(*$C$DW$T$19)
    3690                            .dwattr $C$DW$342, DW_AT_name("triggerType")
    3691                            .dwattr $C$DW$342, DW_AT_TI_symbol_name("triggerType")
    3692                            .dwattr $C$DW$342, DW_AT_bit_offset(0x04)
    3693                            .dwattr $C$DW$342, DW_AT_bit_size(0x04)
    3694                            .dwattr $C$DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3695                            .dwattr $C$DW$342, DW_AT_accessibility(DW_ACCESS_public)
    3696                            .dwattr $C$DW$342, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    3697                            .dwattr $C$DW$342, DW_AT_decl_line(0x13e)
    3698                            .dwattr $C$DW$342, DW_AT_decl_column(0x0f)
    3699                    
    3700                    $C$DW$343       .dwtag  DW_TAG_member
    3701                            .dwattr $C$DW$343, DW_AT_type(*$C$DW$T$19)
    3702                            .dwattr $C$DW$343, DW_AT_name("bEnaCmd")
    3703                            .dwattr $C$DW$343, DW_AT_TI_symbol_name("bEnaCmd")
    3704                            .dwattr $C$DW$343, DW_AT_bit_offset(0x03)
    3705                            .dwattr $C$DW$343, DW_AT_bit_size(0x01)
    3706                            .dwattr $C$DW$343, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3707                            .dwattr $C$DW$343, DW_AT_accessibility(DW_ACCESS_public)
    3708                            .dwattr $C$DW$343, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    3709                            .dwattr $C$DW$343, DW_AT_decl_line(0x13f)
    3710                            .dwattr $C$DW$343, DW_AT_decl_column(0x0f)
    3711                    
    3712                    $C$DW$344       .dwtag  DW_TAG_member
    3713                            .dwattr $C$DW$344, DW_AT_type(*$C$DW$T$19)
    3714                            .dwattr $C$DW$344, DW_AT_name("triggerNo")
    3715                            .dwattr $C$DW$344, DW_AT_TI_symbol_name("triggerNo")
    3716                            .dwattr $C$DW$344, DW_AT_bit_offset(0x01)
    3717                            .dwattr $C$DW$344, DW_AT_bit_size(0x02)
    3718                            .dwattr $C$DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3719                            .dwattr $C$DW$344, DW_AT_accessibility(DW_ACCESS_public)
    3720                            .dwattr $C$DW$344, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    3721                            .dwattr $C$DW$344, DW_AT_decl_line(0x141)
    3722                            .dwattr $C$DW$344, DW_AT_decl_column(0x0f)
    3723                    
    3724                    $C$DW$345       .dwtag  DW_TAG_member
    3725                            .dwattr $C$DW$345, DW_AT_type(*$C$DW$T$19)
    3726                            .dwattr $C$DW$345, DW_AT_name("pastTrig")
    3727                            .dwattr $C$DW$345, DW_AT_TI_symbol_name("pastTrig")
    3728                            .dwattr $C$DW$345, DW_AT_bit_offset(0x00)
    3729                            .dwattr $C$DW$345, DW_AT_bit_size(0x01)
    3730                            .dwattr $C$DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3731                            .dwattr $C$DW$345, DW_AT_accessibility(DW_ACCESS_public)
    3732                            .dwattr $C$DW$345, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    3733                            .dwattr $C$DW$345, DW_AT_decl_line(0x142)
    3734                            .dwattr $C$DW$345, DW_AT_decl_column(0x0f)
    3735                    
    3736                            .dwattr $C$DW$T$38, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/
    3737                            .dwattr $C$DW$T$38, DW_AT_decl_line(0x13d)
    3738                            .dwattr $C$DW$T$38, DW_AT_decl_column(0x0b)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:21 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{91E5085D-660D-4F25-9A12-879222E44D75} PAGE   69

    3739                            .dwendtag $C$DW$T$38
    3740                    
    3741                    
    3742                    $C$DW$T$39      .dwtag  DW_TAG_structure_type
    3743                            .dwattr $C$DW$T$39, DW_AT_byte_size(0x01)
    3744                    $C$DW$346       .dwtag  DW_TAG_member
    3745                            .dwattr $C$DW$346, DW_AT_type(*$C$DW$T$19)
    3746                            .dwattr $C$DW$346, DW_AT_name("triggerType")
    3747                            .dwattr $C$DW$346, DW_AT_TI_symbol_name("triggerType")
    3748                            .dwattr $C$DW$346, DW_AT_bit_offset(0x04)
    3749                            .dwattr $C$DW$346, DW_AT_bit_size(0x04)
    3750                            .dwattr $C$DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3751                            .dwattr $C$DW$346, DW_AT_accessibility(DW_ACCESS_public)
    3752                            .dwattr $C$DW$346, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    3753                            .dwattr $C$DW$346, DW_AT_decl_line(0x157)
    3754                            .dwattr $C$DW$346, DW_AT_decl_column(0x0f)
    3755                    
    3756                    $C$DW$347       .dwtag  DW_TAG_member
    3757                            .dwattr $C$DW$347, DW_AT_type(*$C$DW$T$19)
    3758                            .dwattr $C$DW$347, DW_AT_name("bEnaCmd")
    3759                            .dwattr $C$DW$347, DW_AT_TI_symbol_name("bEnaCmd")
    3760                            .dwattr $C$DW$347, DW_AT_bit_offset(0x03)
    3761                            .dwattr $C$DW$347, DW_AT_bit_size(0x01)
    3762                            .dwattr $C$DW$347, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3763                            .dwattr $C$DW$347, DW_AT_accessibility(DW_ACCESS_public)
    3764                            .dwattr $C$DW$347, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    3765                            .dwattr $C$DW$347, DW_AT_decl_line(0x158)
    3766                            .dwattr $C$DW$347, DW_AT_decl_column(0x0f)
    3767                    
    3768                    $C$DW$348       .dwtag  DW_TAG_member
    3769                            .dwattr $C$DW$348, DW_AT_type(*$C$DW$T$19)
    3770                            .dwattr $C$DW$348, DW_AT_name("triggerNo")
    3771                            .dwattr $C$DW$348, DW_AT_TI_symbol_name("triggerNo")
    3772                            .dwattr $C$DW$348, DW_AT_bit_offset(0x01)
    3773                            .dwattr $C$DW$348, DW_AT_bit_size(0x02)
    3774                            .dwattr $C$DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3775                            .dwattr $C$DW$348, DW_AT_accessibility(DW_ACCESS_public)
    3776                            .dwattr $C$DW$348, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    3777                            .dwattr $C$DW$348, DW_AT_decl_line(0x15a)
    3778                            .dwattr $C$DW$348, DW_AT_decl_column(0x0f)
    3779                    
    3780                    $C$DW$349       .dwtag  DW_TAG_member
    3781                            .dwattr $C$DW$349, DW_AT_type(*$C$DW$T$19)
    3782                            .dwattr $C$DW$349, DW_AT_name("pastTrig")
    3783                            .dwattr $C$DW$349, DW_AT_TI_symbol_name("pastTrig")
    3784                            .dwattr $C$DW$349, DW_AT_bit_offset(0x00)
    3785                            .dwattr $C$DW$349, DW_AT_bit_size(0x01)
    3786                            .dwattr $C$DW$349, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3787                            .dwattr $C$DW$349, DW_AT_accessibility(DW_ACCESS_public)
    3788                            .dwattr $C$DW$349, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    3789                            .dwattr $C$DW$349, DW_AT_decl_line(0x15b)
    3790                            .dwattr $C$DW$349, DW_AT_decl_column(0x0f)
    3791                    
    3792                            .dwattr $C$DW$T$39, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/
    3793                            .dwattr $C$DW$T$39, DW_AT_decl_line(0x156)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:21 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{91E5085D-660D-4F25-9A12-879222E44D75} PAGE   70

    3794                            .dwattr $C$DW$T$39, DW_AT_decl_column(0x0b)
    3795                            .dwendtag $C$DW$T$39
    3796                    
    3797                    
    3798                    $C$DW$T$40      .dwtag  DW_TAG_structure_type
    3799                            .dwattr $C$DW$T$40, DW_AT_byte_size(0x01)
    3800                    $C$DW$350       .dwtag  DW_TAG_member
    3801                            .dwattr $C$DW$350, DW_AT_type(*$C$DW$T$19)
    3802                            .dwattr $C$DW$350, DW_AT_name("rule")
    3803                            .dwattr $C$DW$350, DW_AT_TI_symbol_name("rule")
    3804                            .dwattr $C$DW$350, DW_AT_bit_offset(0x04)
    3805                            .dwattr $C$DW$350, DW_AT_bit_size(0x04)
    3806                            .dwattr $C$DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3807                            .dwattr $C$DW$350, DW_AT_accessibility(DW_ACCESS_public)
    3808                            .dwattr $C$DW$350, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    3809                            .dwattr $C$DW$350, DW_AT_decl_line(0x15f)
    3810                            .dwattr $C$DW$350, DW_AT_decl_column(0x0f)
    3811                    
    3812                    $C$DW$351       .dwtag  DW_TAG_member
    3813                            .dwattr $C$DW$351, DW_AT_type(*$C$DW$T$19)
    3814                            .dwattr $C$DW$351, DW_AT_name("nSkip")
    3815                            .dwattr $C$DW$351, DW_AT_TI_symbol_name("nSkip")
    3816                            .dwattr $C$DW$351, DW_AT_bit_offset(0x00)
    3817                            .dwattr $C$DW$351, DW_AT_bit_size(0x04)
    3818                            .dwattr $C$DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3819                            .dwattr $C$DW$351, DW_AT_accessibility(DW_ACCESS_public)
    3820                            .dwattr $C$DW$351, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    3821                            .dwattr $C$DW$351, DW_AT_decl_line(0x160)
    3822                            .dwattr $C$DW$351, DW_AT_decl_column(0x0f)
    3823                    
    3824                            .dwattr $C$DW$T$40, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/
    3825                            .dwattr $C$DW$T$40, DW_AT_decl_line(0x15e)
    3826                            .dwattr $C$DW$T$40, DW_AT_decl_column(0x0b)
    3827                            .dwendtag $C$DW$T$40
    3828                    
    3829                    
    3830                    $C$DW$T$41      .dwtag  DW_TAG_structure_type
    3831                            .dwattr $C$DW$T$41, DW_AT_byte_size(0x01)
    3832                    $C$DW$352       .dwtag  DW_TAG_member
    3833                            .dwattr $C$DW$352, DW_AT_type(*$C$DW$T$19)
    3834                            .dwattr $C$DW$352, DW_AT_name("bUseCw")
    3835                            .dwattr $C$DW$352, DW_AT_TI_symbol_name("bUseCw")
    3836                            .dwattr $C$DW$352, DW_AT_bit_offset(0x07)
    3837                            .dwattr $C$DW$352, DW_AT_bit_size(0x01)
    3838                            .dwattr $C$DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3839                            .dwattr $C$DW$352, DW_AT_accessibility(DW_ACCESS_public)
    3840                            .dwattr $C$DW$352, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    3841                            .dwattr $C$DW$352, DW_AT_decl_line(0x163)
    3842                            .dwattr $C$DW$352, DW_AT_decl_column(0x0f)
    3843                    
    3844                    $C$DW$353       .dwtag  DW_TAG_member
    3845                            .dwattr $C$DW$353, DW_AT_type(*$C$DW$T$19)
    3846                            .dwattr $C$DW$353, DW_AT_name("bFsOff")
    3847                            .dwattr $C$DW$353, DW_AT_TI_symbol_name("bFsOff")
    3848                            .dwattr $C$DW$353, DW_AT_bit_offset(0x06)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:21 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{91E5085D-660D-4F25-9A12-879222E44D75} PAGE   71

    3849                            .dwattr $C$DW$353, DW_AT_bit_size(0x01)
    3850                            .dwattr $C$DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3851                            .dwattr $C$DW$353, DW_AT_accessibility(DW_ACCESS_public)
    3852                            .dwattr $C$DW$353, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    3853                            .dwattr $C$DW$353, DW_AT_decl_line(0x165)
    3854                            .dwattr $C$DW$353, DW_AT_decl_column(0x0f)
    3855                    
    3856                    $C$DW$354       .dwtag  DW_TAG_member
    3857                            .dwattr $C$DW$354, DW_AT_type(*$C$DW$T$19)
    3858                            .dwattr $C$DW$354, DW_AT_name("whitenMode")
    3859                            .dwattr $C$DW$354, DW_AT_TI_symbol_name("whitenMode")
    3860                            .dwattr $C$DW$354, DW_AT_bit_offset(0x04)
    3861                            .dwattr $C$DW$354, DW_AT_bit_size(0x02)
    3862                            .dwattr $C$DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3863                            .dwattr $C$DW$354, DW_AT_accessibility(DW_ACCESS_public)
    3864                            .dwattr $C$DW$354, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    3865                            .dwattr $C$DW$354, DW_AT_decl_line(0x167)
    3866                            .dwattr $C$DW$354, DW_AT_decl_column(0x0f)
    3867                    
    3868                            .dwattr $C$DW$T$41, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/
    3869                            .dwattr $C$DW$T$41, DW_AT_decl_line(0x162)
    3870                            .dwattr $C$DW$T$41, DW_AT_decl_column(0x0b)
    3871                            .dwendtag $C$DW$T$41
    3872                    
    3873                    
    3874                    $C$DW$T$42      .dwtag  DW_TAG_structure_type
    3875                            .dwattr $C$DW$T$42, DW_AT_byte_size(0x01)
    3876                    $C$DW$355       .dwtag  DW_TAG_member
    3877                            .dwattr $C$DW$355, DW_AT_type(*$C$DW$T$19)
    3878                            .dwattr $C$DW$355, DW_AT_name("triggerType")
    3879                            .dwattr $C$DW$355, DW_AT_TI_symbol_name("triggerType")
    3880                            .dwattr $C$DW$355, DW_AT_bit_offset(0x04)
    3881                            .dwattr $C$DW$355, DW_AT_bit_size(0x04)
    3882                            .dwattr $C$DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3883                            .dwattr $C$DW$355, DW_AT_accessibility(DW_ACCESS_public)
    3884                            .dwattr $C$DW$355, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    3885                            .dwattr $C$DW$355, DW_AT_decl_line(0x170)
    3886                            .dwattr $C$DW$355, DW_AT_decl_column(0x0f)
    3887                    
    3888                    $C$DW$356       .dwtag  DW_TAG_member
    3889                            .dwattr $C$DW$356, DW_AT_type(*$C$DW$T$19)
    3890                            .dwattr $C$DW$356, DW_AT_name("bEnaCmd")
    3891                            .dwattr $C$DW$356, DW_AT_TI_symbol_name("bEnaCmd")
    3892                            .dwattr $C$DW$356, DW_AT_bit_offset(0x03)
    3893                            .dwattr $C$DW$356, DW_AT_bit_size(0x01)
    3894                            .dwattr $C$DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3895                            .dwattr $C$DW$356, DW_AT_accessibility(DW_ACCESS_public)
    3896                            .dwattr $C$DW$356, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    3897                            .dwattr $C$DW$356, DW_AT_decl_line(0x171)
    3898                            .dwattr $C$DW$356, DW_AT_decl_column(0x0f)
    3899                    
    3900                    $C$DW$357       .dwtag  DW_TAG_member
    3901                            .dwattr $C$DW$357, DW_AT_type(*$C$DW$T$19)
    3902                            .dwattr $C$DW$357, DW_AT_name("triggerNo")
    3903                            .dwattr $C$DW$357, DW_AT_TI_symbol_name("triggerNo")
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:21 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{91E5085D-660D-4F25-9A12-879222E44D75} PAGE   72

    3904                            .dwattr $C$DW$357, DW_AT_bit_offset(0x01)
    3905                            .dwattr $C$DW$357, DW_AT_bit_size(0x02)
    3906                            .dwattr $C$DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3907                            .dwattr $C$DW$357, DW_AT_accessibility(DW_ACCESS_public)
    3908                            .dwattr $C$DW$357, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    3909                            .dwattr $C$DW$357, DW_AT_decl_line(0x173)
    3910                            .dwattr $C$DW$357, DW_AT_decl_column(0x0f)
    3911                    
    3912                    $C$DW$358       .dwtag  DW_TAG_member
    3913                            .dwattr $C$DW$358, DW_AT_type(*$C$DW$T$19)
    3914                            .dwattr $C$DW$358, DW_AT_name("pastTrig")
    3915                            .dwattr $C$DW$358, DW_AT_TI_symbol_name("pastTrig")
    3916                            .dwattr $C$DW$358, DW_AT_bit_offset(0x00)
    3917                            .dwattr $C$DW$358, DW_AT_bit_size(0x01)
    3918                            .dwattr $C$DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3919                            .dwattr $C$DW$358, DW_AT_accessibility(DW_ACCESS_public)
    3920                            .dwattr $C$DW$358, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    3921                            .dwattr $C$DW$358, DW_AT_decl_line(0x174)
    3922                            .dwattr $C$DW$358, DW_AT_decl_column(0x0f)
    3923                    
    3924                            .dwattr $C$DW$T$42, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/
    3925                            .dwattr $C$DW$T$42, DW_AT_decl_line(0x16f)
    3926                            .dwattr $C$DW$T$42, DW_AT_decl_column(0x0b)
    3927                            .dwendtag $C$DW$T$42
    3928                    
    3929                    
    3930                    $C$DW$T$43      .dwtag  DW_TAG_structure_type
    3931                            .dwattr $C$DW$T$43, DW_AT_byte_size(0x01)
    3932                    $C$DW$359       .dwtag  DW_TAG_member
    3933                            .dwattr $C$DW$359, DW_AT_type(*$C$DW$T$19)
    3934                            .dwattr $C$DW$359, DW_AT_name("triggerType")
    3935                            .dwattr $C$DW$359, DW_AT_TI_symbol_name("triggerType")
    3936                            .dwattr $C$DW$359, DW_AT_bit_offset(0x04)
    3937                            .dwattr $C$DW$359, DW_AT_bit_size(0x04)
    3938                            .dwattr $C$DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3939                            .dwattr $C$DW$359, DW_AT_accessibility(DW_ACCESS_public)
    3940                            .dwattr $C$DW$359, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    3941                            .dwattr $C$DW$359, DW_AT_decl_line(0x189)
    3942                            .dwattr $C$DW$359, DW_AT_decl_column(0x0f)
    3943                    
    3944                    $C$DW$360       .dwtag  DW_TAG_member
    3945                            .dwattr $C$DW$360, DW_AT_type(*$C$DW$T$19)
    3946                            .dwattr $C$DW$360, DW_AT_name("bEnaCmd")
    3947                            .dwattr $C$DW$360, DW_AT_TI_symbol_name("bEnaCmd")
    3948                            .dwattr $C$DW$360, DW_AT_bit_offset(0x03)
    3949                            .dwattr $C$DW$360, DW_AT_bit_size(0x01)
    3950                            .dwattr $C$DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3951                            .dwattr $C$DW$360, DW_AT_accessibility(DW_ACCESS_public)
    3952                            .dwattr $C$DW$360, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    3953                            .dwattr $C$DW$360, DW_AT_decl_line(0x18a)
    3954                            .dwattr $C$DW$360, DW_AT_decl_column(0x0f)
    3955                    
    3956                    $C$DW$361       .dwtag  DW_TAG_member
    3957                            .dwattr $C$DW$361, DW_AT_type(*$C$DW$T$19)
    3958                            .dwattr $C$DW$361, DW_AT_name("triggerNo")
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:21 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{91E5085D-660D-4F25-9A12-879222E44D75} PAGE   73

    3959                            .dwattr $C$DW$361, DW_AT_TI_symbol_name("triggerNo")
    3960                            .dwattr $C$DW$361, DW_AT_bit_offset(0x01)
    3961                            .dwattr $C$DW$361, DW_AT_bit_size(0x02)
    3962                            .dwattr $C$DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3963                            .dwattr $C$DW$361, DW_AT_accessibility(DW_ACCESS_public)
    3964                            .dwattr $C$DW$361, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    3965                            .dwattr $C$DW$361, DW_AT_decl_line(0x18c)
    3966                            .dwattr $C$DW$361, DW_AT_decl_column(0x0f)
    3967                    
    3968                    $C$DW$362       .dwtag  DW_TAG_member
    3969                            .dwattr $C$DW$362, DW_AT_type(*$C$DW$T$19)
    3970                            .dwattr $C$DW$362, DW_AT_name("pastTrig")
    3971                            .dwattr $C$DW$362, DW_AT_TI_symbol_name("pastTrig")
    3972                            .dwattr $C$DW$362, DW_AT_bit_offset(0x00)
    3973                            .dwattr $C$DW$362, DW_AT_bit_size(0x01)
    3974                            .dwattr $C$DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3975                            .dwattr $C$DW$362, DW_AT_accessibility(DW_ACCESS_public)
    3976                            .dwattr $C$DW$362, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    3977                            .dwattr $C$DW$362, DW_AT_decl_line(0x18d)
    3978                            .dwattr $C$DW$362, DW_AT_decl_column(0x0f)
    3979                    
    3980                            .dwattr $C$DW$T$43, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/
    3981                            .dwattr $C$DW$T$43, DW_AT_decl_line(0x188)
    3982                            .dwattr $C$DW$T$43, DW_AT_decl_column(0x0b)
    3983                            .dwendtag $C$DW$T$43
    3984                    
    3985                    
    3986                    $C$DW$T$44      .dwtag  DW_TAG_structure_type
    3987                            .dwattr $C$DW$T$44, DW_AT_byte_size(0x01)
    3988                    $C$DW$363       .dwtag  DW_TAG_member
    3989                            .dwattr $C$DW$363, DW_AT_type(*$C$DW$T$19)
    3990                            .dwattr $C$DW$363, DW_AT_name("rule")
    3991                            .dwattr $C$DW$363, DW_AT_TI_symbol_name("rule")
    3992                            .dwattr $C$DW$363, DW_AT_bit_offset(0x04)
    3993                            .dwattr $C$DW$363, DW_AT_bit_size(0x04)
    3994                            .dwattr $C$DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3995                            .dwattr $C$DW$363, DW_AT_accessibility(DW_ACCESS_public)
    3996                            .dwattr $C$DW$363, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    3997                            .dwattr $C$DW$363, DW_AT_decl_line(0x191)
    3998                            .dwattr $C$DW$363, DW_AT_decl_column(0x0f)
    3999                    
    4000                    $C$DW$364       .dwtag  DW_TAG_member
    4001                            .dwattr $C$DW$364, DW_AT_type(*$C$DW$T$19)
    4002                            .dwattr $C$DW$364, DW_AT_name("nSkip")
    4003                            .dwattr $C$DW$364, DW_AT_TI_symbol_name("nSkip")
    4004                            .dwattr $C$DW$364, DW_AT_bit_offset(0x00)
    4005                            .dwattr $C$DW$364, DW_AT_bit_size(0x04)
    4006                            .dwattr $C$DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4007                            .dwattr $C$DW$364, DW_AT_accessibility(DW_ACCESS_public)
    4008                            .dwattr $C$DW$364, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    4009                            .dwattr $C$DW$364, DW_AT_decl_line(0x192)
    4010                            .dwattr $C$DW$364, DW_AT_decl_column(0x0f)
    4011                    
    4012                            .dwattr $C$DW$T$44, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/
    4013                            .dwattr $C$DW$T$44, DW_AT_decl_line(0x190)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:21 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{91E5085D-660D-4F25-9A12-879222E44D75} PAGE   74

    4014                            .dwattr $C$DW$T$44, DW_AT_decl_column(0x0b)
    4015                            .dwendtag $C$DW$T$44
    4016                    
    4017                    
    4018                    $C$DW$T$45      .dwtag  DW_TAG_structure_type
    4019                            .dwattr $C$DW$T$45, DW_AT_byte_size(0x01)
    4020                    $C$DW$365       .dwtag  DW_TAG_member
    4021                            .dwattr $C$DW$365, DW_AT_type(*$C$DW$T$19)
    4022                            .dwattr $C$DW$365, DW_AT_name("triggerType")
    4023                            .dwattr $C$DW$365, DW_AT_TI_symbol_name("triggerType")
    4024                            .dwattr $C$DW$365, DW_AT_bit_offset(0x04)
    4025                            .dwattr $C$DW$365, DW_AT_bit_size(0x04)
    4026                            .dwattr $C$DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4027                            .dwattr $C$DW$365, DW_AT_accessibility(DW_ACCESS_public)
    4028                            .dwattr $C$DW$365, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    4029                            .dwattr $C$DW$365, DW_AT_decl_line(0x1a7)
    4030                            .dwattr $C$DW$365, DW_AT_decl_column(0x0f)
    4031                    
    4032                    $C$DW$366       .dwtag  DW_TAG_member
    4033                            .dwattr $C$DW$366, DW_AT_type(*$C$DW$T$19)
    4034                            .dwattr $C$DW$366, DW_AT_name("bEnaCmd")
    4035                            .dwattr $C$DW$366, DW_AT_TI_symbol_name("bEnaCmd")
    4036                            .dwattr $C$DW$366, DW_AT_bit_offset(0x03)
    4037                            .dwattr $C$DW$366, DW_AT_bit_size(0x01)
    4038                            .dwattr $C$DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4039                            .dwattr $C$DW$366, DW_AT_accessibility(DW_ACCESS_public)
    4040                            .dwattr $C$DW$366, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    4041                            .dwattr $C$DW$366, DW_AT_decl_line(0x1a8)
    4042                            .dwattr $C$DW$366, DW_AT_decl_column(0x0f)
    4043                    
    4044                    $C$DW$367       .dwtag  DW_TAG_member
    4045                            .dwattr $C$DW$367, DW_AT_type(*$C$DW$T$19)
    4046                            .dwattr $C$DW$367, DW_AT_name("triggerNo")
    4047                            .dwattr $C$DW$367, DW_AT_TI_symbol_name("triggerNo")
    4048                            .dwattr $C$DW$367, DW_AT_bit_offset(0x01)
    4049                            .dwattr $C$DW$367, DW_AT_bit_size(0x02)
    4050                            .dwattr $C$DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4051                            .dwattr $C$DW$367, DW_AT_accessibility(DW_ACCESS_public)
    4052                            .dwattr $C$DW$367, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    4053                            .dwattr $C$DW$367, DW_AT_decl_line(0x1aa)
    4054                            .dwattr $C$DW$367, DW_AT_decl_column(0x0f)
    4055                    
    4056                    $C$DW$368       .dwtag  DW_TAG_member
    4057                            .dwattr $C$DW$368, DW_AT_type(*$C$DW$T$19)
    4058                            .dwattr $C$DW$368, DW_AT_name("pastTrig")
    4059                            .dwattr $C$DW$368, DW_AT_TI_symbol_name("pastTrig")
    4060                            .dwattr $C$DW$368, DW_AT_bit_offset(0x00)
    4061                            .dwattr $C$DW$368, DW_AT_bit_size(0x01)
    4062                            .dwattr $C$DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4063                            .dwattr $C$DW$368, DW_AT_accessibility(DW_ACCESS_public)
    4064                            .dwattr $C$DW$368, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    4065                            .dwattr $C$DW$368, DW_AT_decl_line(0x1ab)
    4066                            .dwattr $C$DW$368, DW_AT_decl_column(0x0f)
    4067                    
    4068                            .dwattr $C$DW$T$45, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:21 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{91E5085D-660D-4F25-9A12-879222E44D75} PAGE   75

    4069                            .dwattr $C$DW$T$45, DW_AT_decl_line(0x1a6)
    4070                            .dwattr $C$DW$T$45, DW_AT_decl_column(0x0b)
    4071                            .dwendtag $C$DW$T$45
    4072                    
    4073                    
    4074                    $C$DW$T$46      .dwtag  DW_TAG_structure_type
    4075                            .dwattr $C$DW$T$46, DW_AT_byte_size(0x01)
    4076                    $C$DW$369       .dwtag  DW_TAG_member
    4077                            .dwattr $C$DW$369, DW_AT_type(*$C$DW$T$19)
    4078                            .dwattr $C$DW$369, DW_AT_name("rule")
    4079                            .dwattr $C$DW$369, DW_AT_TI_symbol_name("rule")
    4080                            .dwattr $C$DW$369, DW_AT_bit_offset(0x04)
    4081                            .dwattr $C$DW$369, DW_AT_bit_size(0x04)
    4082                            .dwattr $C$DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4083                            .dwattr $C$DW$369, DW_AT_accessibility(DW_ACCESS_public)
    4084                            .dwattr $C$DW$369, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    4085                            .dwattr $C$DW$369, DW_AT_decl_line(0x1af)
    4086                            .dwattr $C$DW$369, DW_AT_decl_column(0x0f)
    4087                    
    4088                    $C$DW$370       .dwtag  DW_TAG_member
    4089                            .dwattr $C$DW$370, DW_AT_type(*$C$DW$T$19)
    4090                            .dwattr $C$DW$370, DW_AT_name("nSkip")
    4091                            .dwattr $C$DW$370, DW_AT_TI_symbol_name("nSkip")
    4092                            .dwattr $C$DW$370, DW_AT_bit_offset(0x00)
    4093                            .dwattr $C$DW$370, DW_AT_bit_size(0x04)
    4094                            .dwattr $C$DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4095                            .dwattr $C$DW$370, DW_AT_accessibility(DW_ACCESS_public)
    4096                            .dwattr $C$DW$370, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    4097                            .dwattr $C$DW$370, DW_AT_decl_line(0x1b0)
    4098                            .dwattr $C$DW$370, DW_AT_decl_column(0x0f)
    4099                    
    4100                            .dwattr $C$DW$T$46, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/
    4101                            .dwattr $C$DW$T$46, DW_AT_decl_line(0x1ae)
    4102                            .dwattr $C$DW$T$46, DW_AT_decl_column(0x0b)
    4103                            .dwendtag $C$DW$T$46
    4104                    
    4105                    
    4106                    $C$DW$T$47      .dwtag  DW_TAG_structure_type
