TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:20 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{3EBD5339-172C-4C2D-AFBF-B091C3B4C90F} PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                        PC v16.9.4.LTS *
       3                    ;* Date/Time created: Sat Nov 18 18:46:20 2017                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../Application/MAC/FreqHop/fh_pib.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v16.9.4.LTS Copyright (c) 1996-20
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Kevin\workspace_v7\sensor_cc1310lp\sensor_cc1310lp"
      13                    
      14                    $C$DW$1 .dwtag  DW_TAG_subprogram

    4463                            .dwendtag $C$DW$T$673
    4464                    
    4465                    
    4466                    $C$DW$T$674     .dwtag  DW_TAG_enumeration_type
    4467                            .dwattr $C$DW$T$674, DW_AT_byte_size(0x01)
    4468                    $C$DW$438       .dwtag  DW_TAG_enumerator
    4469                            .dwattr $C$DW$438, DW_AT_name("MAC_FEAT_DEVICE")
    4470                            .dwattr $C$DW$438, DW_AT_const_value(0x00)
    4471                            .dwattr $C$DW$438, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\ti154stac
    4472                            .dwattr $C$DW$438, DW_AT_decl_line(0x103)
    4473                            .dwattr $C$DW$438, DW_AT_decl_column(0x03)
    4474                    
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:20 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{3EBD5339-172C-4C2D-AFBF-B091C3B4C90F} PAGE   83

    4475                    $C$DW$439       .dwtag  DW_TAG_enumerator
    4476                            .dwattr $C$DW$439, DW_AT_name("MAC_FEAT_COORD")
    4477                            .dwattr $C$DW$439, DW_AT_const_value(0x01)
    4478                            .dwattr $C$DW$439, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\ti154stac
    4479                            .dwattr $C$DW$439, DW_AT_decl_line(0x104)
    4480                            .dwattr $C$DW$439, DW_AT_decl_column(0x03)
    4481                    
    4482                    $C$DW$440       .dwtag  DW_TAG_enumerator
    4483                            .dwattr $C$DW$440, DW_AT_name("MAC_FEAT_SECURITY")
    4484                            .dwattr $C$DW$440, DW_AT_const_value(0x02)
    4485                            .dwattr $C$DW$440, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\ti154stac
    4486                            .dwattr $C$DW$440, DW_AT_decl_line(0x105)
    4487                            .dwattr $C$DW$440, DW_AT_decl_column(0x03)
    4488                    
    4489                    $C$DW$441       .dwtag  DW_TAG_enumerator
    4490                            .dwattr $C$DW$441, DW_AT_name("MAC_FEAT_BEACON_COORD")
    4491                            .dwattr $C$DW$441, DW_AT_const_value(0x03)
    4492                            .dwattr $C$DW$441, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\ti154stac
    4493                            .dwattr $C$DW$441, DW_AT_decl_line(0x106)
    4494                            .dwattr $C$DW$441, DW_AT_decl_column(0x03)
    4495                    
    4496                    $C$DW$442       .dwtag  DW_TAG_enumerator
    4497                            .dwattr $C$DW$442, DW_AT_name("MAC_FEAT_BEACON_DEVICE")
    4498                            .dwattr $C$DW$442, DW_AT_const_value(0x04)
    4499                            .dwattr $C$DW$442, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\ti154stac
    4500                            .dwattr $C$DW$442, DW_AT_decl_line(0x107)
    4501                            .dwattr $C$DW$442, DW_AT_decl_column(0x03)
    4502                    
    4503                    $C$DW$443       .dwtag  DW_TAG_enumerator
    4504                            .dwattr $C$DW$443, DW_AT_name("MAC_FEAT_GTS_CLIENT")
    4505                            .dwattr $C$DW$443, DW_AT_const_value(0x05)
    4506                            .dwattr $C$DW$443, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\ti154stac
    4507                            .dwattr $C$DW$443, DW_AT_decl_line(0x108)
    4508                            .dwattr $C$DW$443, DW_AT_decl_column(0x03)
    4509                    
    4510                    $C$DW$444       .dwtag  DW_TAG_enumerator
    4511                            .dwattr $C$DW$444, DW_AT_name("MAC_FEAT_GTS_SERVER")
    4512                            .dwattr $C$DW$444, DW_AT_const_value(0x06)
    4513                            .dwattr $C$DW$444, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\ti154stac
    4514                            .dwattr $C$DW$444, DW_AT_decl_line(0x109)
    4515                            .dwattr $C$DW$444, DW_AT_decl_column(0x03)
    4516                    
    4517                    $C$DW$445       .dwtag  DW_TAG_enumerator
    4518                            .dwattr $C$DW$445, DW_AT_name("MAC_FEAT_MAX")
    4519                            .dwattr $C$DW$445, DW_AT_const_value(0x07)
    4520                            .dwattr $C$DW$445, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\ti154stac
    4521                            .dwattr $C$DW$445, DW_AT_decl_line(0x10a)
    4522                            .dwattr $C$DW$445, DW_AT_decl_column(0x03)
    4523                    
    4524                            .dwattr $C$DW$T$674, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\ti154st
    4525                            .dwattr $C$DW$T$674, DW_AT_decl_line(0x102)
    4526                            .dwattr $C$DW$T$674, DW_AT_decl_column(0x01)
    4527                            .dwendtag $C$DW$T$674
    4528                    
    4529                    
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:20 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{3EBD5339-172C-4C2D-AFBF-B091C3B4C90F} PAGE   84

    4530                    $C$DW$T$28      .dwtag  DW_TAG_structure_type
    4531                            .dwattr $C$DW$T$28, DW_AT_byte_size(0x88)
    4532                    $C$DW$446       .dwtag  DW_TAG_member
    4533                            .dwattr $C$DW$446, DW_AT_type(*$C$DW$T$21)
    4534                            .dwattr $C$DW$446, DW_AT_name("macTrackParentEUI")
    4535                            .dwattr $C$DW$446, DW_AT_TI_symbol_name("macTrackParentEUI")
    4536                            .dwattr $C$DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4537                            .dwattr $C$DW$446, DW_AT_accessibility(DW_ACCESS_public)
    4538                            .dwattr $C$DW$446, DW_AT_decl_file("..\Application\MAC\FreqHop\fh_pib.h")
    4539                            .dwattr $C$DW$446, DW_AT_decl_line(0x9e)
    4540                            .dwattr $C$DW$446, DW_AT_decl_column(0x15)
    4541                    
    4542                    $C$DW$447       .dwtag  DW_TAG_member
    4543                            .dwattr $C$DW$447, DW_AT_type(*$C$DW$T$22)
    4544                            .dwattr $C$DW$447, DW_AT_name("macBcInterval")
    4545                            .dwattr $C$DW$447, DW_AT_TI_symbol_name("macBcInterval")
    4546                            .dwattr $C$DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4547                            .dwattr $C$DW$447, DW_AT_accessibility(DW_ACCESS_public)
    4548                            .dwattr $C$DW$447, DW_AT_decl_file("..\Application\MAC\FreqHop\fh_pib.h")
    4549                            .dwattr $C$DW$447, DW_AT_decl_line(0xa0)
    4550                            .dwattr $C$DW$447, DW_AT_decl_column(0x15)
    4551                    
    4552                    $C$DW$448       .dwtag  DW_TAG_member
    4553                            .dwattr $C$DW$448, DW_AT_type(*$C$DW$T$24)
    4554                            .dwattr $C$DW$448, DW_AT_name("macUcExcludedChannels")
    4555                            .dwattr $C$DW$448, DW_AT_TI_symbol_name("macUcExcludedChannels")
    4556                            .dwattr $C$DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4557                            .dwattr $C$DW$448, DW_AT_accessibility(DW_ACCESS_public)
    4558                            .dwattr $C$DW$448, DW_AT_decl_file("..\Application\MAC\FreqHop\fh_pib.h")
    4559                            .dwattr $C$DW$448, DW_AT_decl_line(0xa2)
    4560                            .dwattr $C$DW$448, DW_AT_decl_column(0x15)
    4561                    
    4562                    $C$DW$449       .dwtag  DW_TAG_member
    4563                            .dwattr $C$DW$449, DW_AT_type(*$C$DW$T$24)
    4564                            .dwattr $C$DW$449, DW_AT_name("macBcExcludedChannels")
    4565                            .dwattr $C$DW$449, DW_AT_TI_symbol_name("macBcExcludedChannels")
    4566                            .dwattr $C$DW$449, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    4567                            .dwattr $C$DW$449, DW_AT_accessibility(DW_ACCESS_public)
    4568                            .dwattr $C$DW$449, DW_AT_decl_file("..\Application\MAC\FreqHop\fh_pib.h")
    4569                            .dwattr $C$DW$449, DW_AT_decl_line(0xa4)
    4570                            .dwattr $C$DW$449, DW_AT_decl_column(0x15)
    4571                    
    4572                    $C$DW$450       .dwtag  DW_TAG_member
    4573                            .dwattr $C$DW$450, DW_AT_type(*$C$DW$T$23)
    4574                            .dwattr $C$DW$450, DW_AT_name("macUcDwellInterval")
    4575                            .dwattr $C$DW$450, DW_AT_TI_symbol_name("macUcDwellInterval")
    4576                            .dwattr $C$DW$450, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    4577                            .dwattr $C$DW$450, DW_AT_accessibility(DW_ACCESS_public)
    4578                            .dwattr $C$DW$450, DW_AT_decl_file("..\Application\MAC\FreqHop\fh_pib.h")
    4579                            .dwattr $C$DW$450, DW_AT_decl_line(0xa6)
    4580                            .dwattr $C$DW$450, DW_AT_decl_column(0x15)
    4581                    
    4582                    $C$DW$451       .dwtag  DW_TAG_member
    4583                            .dwattr $C$DW$451, DW_AT_type(*$C$DW$T$23)
    4584                            .dwattr $C$DW$451, DW_AT_name("macBcDwellInterval")
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:20 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{3EBD5339-172C-4C2D-AFBF-B091C3B4C90F} PAGE   85

    4585                            .dwattr $C$DW$451, DW_AT_TI_symbol_name("macBcDwellInterval")
    4586                            .dwattr $C$DW$451, DW_AT_data_member_location[DW_OP_plus_uconst 0x2f]
    4587                            .dwattr $C$DW$451, DW_AT_accessibility(DW_ACCESS_public)
    4588                            .dwattr $C$DW$451, DW_AT_decl_file("..\Application\MAC\FreqHop\fh_pib.h")
    4589                            .dwattr $C$DW$451, DW_AT_decl_line(0xa8)
    4590                            .dwattr $C$DW$451, DW_AT_decl_column(0x15)
    4591                    
    4592                    $C$DW$452       .dwtag  DW_TAG_member
    4593                            .dwattr $C$DW$452, DW_AT_type(*$C$DW$T$23)
    4594                            .dwattr $C$DW$452, DW_AT_name("macClockDrift")
    4595                            .dwattr $C$DW$452, DW_AT_TI_symbol_name("macClockDrift")
    4596                            .dwattr $C$DW$452, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    4597                            .dwattr $C$DW$452, DW_AT_accessibility(DW_ACCESS_public)
    4598                            .dwattr $C$DW$452, DW_AT_decl_file("..\Application\MAC\FreqHop\fh_pib.h")
    4599                            .dwattr $C$DW$452, DW_AT_decl_line(0xaa)
    4600                            .dwattr $C$DW$452, DW_AT_decl_column(0x15)
    4601                    
    4602                    $C$DW$453       .dwtag  DW_TAG_member
    4603                            .dwattr $C$DW$453, DW_AT_type(*$C$DW$T$23)
    4604                            .dwattr $C$DW$453, DW_AT_name("macTimingAccuracy")
    4605                            .dwattr $C$DW$453, DW_AT_TI_symbol_name("macTimingAccuracy")
    4606                            .dwattr $C$DW$453, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
    4607                            .dwattr $C$DW$453, DW_AT_accessibility(DW_ACCESS_public)
    4608                            .dwattr $C$DW$453, DW_AT_decl_file("..\Application\MAC\FreqHop\fh_pib.h")
    4609                            .dwattr $C$DW$453, DW_AT_decl_line(0xac)
    4610                            .dwattr $C$DW$453, DW_AT_decl_column(0x15)
    4611                    
    4612                    $C$DW$454       .dwtag  DW_TAG_member
    4613                            .dwattr $C$DW$454, DW_AT_type(*$C$DW$T$23)
    4614                            .dwattr $C$DW$454, DW_AT_name("macUcChannelFunction")
    4615                            .dwattr $C$DW$454, DW_AT_TI_symbol_name("macUcChannelFunction")
    4616                            .dwattr $C$DW$454, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    4617                            .dwattr $C$DW$454, DW_AT_accessibility(DW_ACCESS_public)
    4618                            .dwattr $C$DW$454, DW_AT_decl_file("..\Application\MAC\FreqHop\fh_pib.h")
    4619                            .dwattr $C$DW$454, DW_AT_decl_line(0xae)
    4620                            .dwattr $C$DW$454, DW_AT_decl_column(0x15)
    4621                    
    4622                    $C$DW$455       .dwtag  DW_TAG_member
    4623                            .dwattr $C$DW$455, DW_AT_type(*$C$DW$T$23)
    4624                            .dwattr $C$DW$455, DW_AT_name("macBcChannelFunction")
    4625                            .dwattr $C$DW$455, DW_AT_TI_symbol_name("macBcChannelFunction")
    4626                            .dwattr $C$DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0x33]
    4627                            .dwattr $C$DW$455, DW_AT_accessibility(DW_ACCESS_public)
    4628                            .dwattr $C$DW$455, DW_AT_decl_file("..\Application\MAC\FreqHop\fh_pib.h")
    4629                            .dwattr $C$DW$455, DW_AT_decl_line(0xb0)
    4630                            .dwattr $C$DW$455, DW_AT_decl_column(0x15)
    4631                    
    4632                    $C$DW$456       .dwtag  DW_TAG_member
    4633                            .dwattr $C$DW$456, DW_AT_type(*$C$DW$T$23)
    4634                            .dwattr $C$DW$456, DW_AT_name("macUseParentBSIE")
    4635                            .dwattr $C$DW$456, DW_AT_TI_symbol_name("macUseParentBSIE")
    4636                            .dwattr $C$DW$456, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    4637                            .dwattr $C$DW$456, DW_AT_accessibility(DW_ACCESS_public)
    4638                            .dwattr $C$DW$456, DW_AT_decl_file("..\Application\MAC\FreqHop\fh_pib.h")
    4639                            .dwattr $C$DW$456, DW_AT_decl_line(0xb2)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:20 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{3EBD5339-172C-4C2D-AFBF-B091C3B4C90F} PAGE   86

    4640                            .dwattr $C$DW$456, DW_AT_decl_column(0x15)
    4641                    
    4642                    $C$DW$457       .dwtag  DW_TAG_member
    4643                            .dwattr $C$DW$457, DW_AT_type(*$C$DW$T$25)
    4644                            .dwattr $C$DW$457, DW_AT_name("macBroadcastSchedId")
    4645                            .dwattr $C$DW$457, DW_AT_TI_symbol_name("macBroadcastSchedId")
    4646                            .dwattr $C$DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0x35]
    4647                            .dwattr $C$DW$457, DW_AT_accessibility(DW_ACCESS_public)
    4648                            .dwattr $C$DW$457, DW_AT_decl_file("..\Application\MAC\FreqHop\fh_pib.h")
    4649                            .dwattr $C$DW$457, DW_AT_decl_line(0xb4)
    4650                            .dwattr $C$DW$457, DW_AT_decl_column(0x15)
    4651                    
    4652                    $C$DW$458       .dwtag  DW_TAG_member
    4653                            .dwattr $C$DW$458, DW_AT_type(*$C$DW$T$25)
    4654                            .dwattr $C$DW$458, DW_AT_name("macUcFixedChannel")
    4655                            .dwattr $C$DW$458, DW_AT_TI_symbol_name("macUcFixedChannel")
    4656                            .dwattr $C$DW$458, DW_AT_data_member_location[DW_OP_plus_uconst 0x37]
    4657                            .dwattr $C$DW$458, DW_AT_accessibility(DW_ACCESS_public)
    4658                            .dwattr $C$DW$458, DW_AT_decl_file("..\Application\MAC\FreqHop\fh_pib.h")
    4659                            .dwattr $C$DW$458, DW_AT_decl_line(0xb6)
    4660                            .dwattr $C$DW$458, DW_AT_decl_column(0x15)
    4661                    
    4662                    $C$DW$459       .dwtag  DW_TAG_member
    4663                            .dwattr $C$DW$459, DW_AT_type(*$C$DW$T$25)
    4664                            .dwattr $C$DW$459, DW_AT_name("macBcFixedChannel")
    4665                            .dwattr $C$DW$459, DW_AT_TI_symbol_name("macBcFixedChannel")
    4666                            .dwattr $C$DW$459, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
    4667                            .dwattr $C$DW$459, DW_AT_accessibility(DW_ACCESS_public)
    4668                            .dwattr $C$DW$459, DW_AT_decl_file("..\Application\MAC\FreqHop\fh_pib.h")
    4669                            .dwattr $C$DW$459, DW_AT_decl_line(0xb8)
    4670                            .dwattr $C$DW$459, DW_AT_decl_column(0x15)
    4671                    
    4672                    $C$DW$460       .dwtag  DW_TAG_member
    4673                            .dwattr $C$DW$460, DW_AT_type(*$C$DW$T$25)
    4674                            .dwattr $C$DW$460, DW_AT_name("macPanSize")
    4675                            .dwattr $C$DW$460, DW_AT_TI_symbol_name("macPanSize")
    4676                            .dwattr $C$DW$460, DW_AT_data_member_location[DW_OP_plus_uconst 0x3b]
    4677                            .dwattr $C$DW$460, DW_AT_accessibility(DW_ACCESS_public)
    4678                            .dwattr $C$DW$460, DW_AT_decl_file("..\Application\MAC\FreqHop\fh_pib.h")
    4679                            .dwattr $C$DW$460, DW_AT_decl_line(0xba)
    4680                            .dwattr $C$DW$460, DW_AT_decl_column(0x15)
    4681                    
    4682                    $C$DW$461       .dwtag  DW_TAG_member
    4683                            .dwattr $C$DW$461, DW_AT_type(*$C$DW$T$23)
    4684                            .dwattr $C$DW$461, DW_AT_name("macRoutingCost")
    4685                            .dwattr $C$DW$461, DW_AT_TI_symbol_name("macRoutingCost")
    4686                            .dwattr $C$DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0x3d]
    4687                            .dwattr $C$DW$461, DW_AT_accessibility(DW_ACCESS_public)
    4688                            .dwattr $C$DW$461, DW_AT_decl_file("..\Application\MAC\FreqHop\fh_pib.h")
    4689                            .dwattr $C$DW$461, DW_AT_decl_line(0xbc)
    4690                            .dwattr $C$DW$461, DW_AT_decl_column(0x15)
    4691                    
    4692                    $C$DW$462       .dwtag  DW_TAG_member
    4693                            .dwattr $C$DW$462, DW_AT_type(*$C$DW$T$23)
    4694                            .dwattr $C$DW$462, DW_AT_name("macRoutingMethod")
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:20 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{3EBD5339-172C-4C2D-AFBF-B091C3B4C90F} PAGE   87

    4695                            .dwattr $C$DW$462, DW_AT_TI_symbol_name("macRoutingMethod")
    4696                            .dwattr $C$DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
    4697                            .dwattr $C$DW$462, DW_AT_accessibility(DW_ACCESS_public)
    4698                            .dwattr $C$DW$462, DW_AT_decl_file("..\Application\MAC\FreqHop\fh_pib.h")
    4699                            .dwattr $C$DW$462, DW_AT_decl_line(0xbe)
    4700                            .dwattr $C$DW$462, DW_AT_decl_column(0x15)
    4701                    
    4702                    $C$DW$463       .dwtag  DW_TAG_member
    4703                            .dwattr $C$DW$463, DW_AT_type(*$C$DW$T$23)
    4704                            .dwattr $C$DW$463, DW_AT_name("macEapolReady")
    4705                            .dwattr $C$DW$463, DW_AT_TI_symbol_name("macEapolReady")
    4706                            .dwattr $C$DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0x3f]
    4707                            .dwattr $C$DW$463, DW_AT_accessibility(DW_ACCESS_public)
    4708                            .dwattr $C$DW$463, DW_AT_decl_file("..\Application\MAC\FreqHop\fh_pib.h")
    4709                            .dwattr $C$DW$463, DW_AT_decl_line(0xc0)
    4710                            .dwattr $C$DW$463, DW_AT_decl_column(0x15)
    4711                    
    4712                    $C$DW$464       .dwtag  DW_TAG_member
    4713                            .dwattr $C$DW$464, DW_AT_type(*$C$DW$T$23)
    4714                            .dwattr $C$DW$464, DW_AT_name("macFanTpsVersion")
    4715                            .dwattr $C$DW$464, DW_AT_TI_symbol_name("macFanTpsVersion")
    4716                            .dwattr $C$DW$464, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    4717                            .dwattr $C$DW$464, DW_AT_accessibility(DW_ACCESS_public)
    4718                            .dwattr $C$DW$464, DW_AT_decl_file("..\Application\MAC\FreqHop\fh_pib.h")
    4719                            .dwattr $C$DW$464, DW_AT_decl_line(0xc2)
    4720                            .dwattr $C$DW$464, DW_AT_decl_column(0x15)
    4721                    
    4722                    $C$DW$465       .dwtag  DW_TAG_member
    4723                            .dwattr $C$DW$465, DW_AT_type(*$C$DW$T$26)
    4724                            .dwattr $C$DW$465, DW_AT_name("macNetName")
    4725                            .dwattr $C$DW$465, DW_AT_TI_symbol_name("macNetName")
    4726                            .dwattr $C$DW$465, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
    4727                            .dwattr $C$DW$465, DW_AT_accessibility(DW_ACCESS_public)
    4728                            .dwattr $C$DW$465, DW_AT_decl_file("..\Application\MAC\FreqHop\fh_pib.h")
    4729                            .dwattr $C$DW$465, DW_AT_decl_line(0xc4)
    4730                            .dwattr $C$DW$465, DW_AT_decl_column(0x15)
    4731                    
    4732                    $C$DW$466       .dwtag  DW_TAG_member
    4733                            .dwattr $C$DW$466, DW_AT_type(*$C$DW$T$25)
    4734                            .dwattr $C$DW$466, DW_AT_name("macPanVersion")
    4735                            .dwattr $C$DW$466, DW_AT_TI_symbol_name("macPanVersion")
    4736                            .dwattr $C$DW$466, DW_AT_data_member_location[DW_OP_plus_uconst 0x61]
    4737                            .dwattr $C$DW$466, DW_AT_accessibility(DW_ACCESS_public)
    4738                            .dwattr $C$DW$466, DW_AT_decl_file("..\Application\MAC\FreqHop\fh_pib.h")
    4739                            .dwattr $C$DW$466, DW_AT_decl_line(0xc6)
    4740                            .dwattr $C$DW$466, DW_AT_decl_column(0x15)
    4741                    
    4742                    $C$DW$467       .dwtag  DW_TAG_member
    4743                            .dwattr $C$DW$467, DW_AT_type(*$C$DW$T$27)
    4744                            .dwattr $C$DW$467, DW_AT_name("macGtk0Hash")
    4745                            .dwattr $C$DW$467, DW_AT_TI_symbol_name("macGtk0Hash")
    4746                            .dwattr $C$DW$467, DW_AT_data_member_location[DW_OP_plus_uconst 0x63]
    4747                            .dwattr $C$DW$467, DW_AT_accessibility(DW_ACCESS_public)
    4748                            .dwattr $C$DW$467, DW_AT_decl_file("..\Application\MAC\FreqHop\fh_pib.h")
    4749                            .dwattr $C$DW$467, DW_AT_decl_line(0xc8)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:20 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{3EBD5339-172C-4C2D-AFBF-B091C3B4C90F} PAGE   88

    4750                            .dwattr $C$DW$467, DW_AT_decl_column(0x15)
    4751                    
    4752                    $C$DW$468       .dwtag  DW_TAG_member
    4753                            .dwattr $C$DW$468, DW_AT_type(*$C$DW$T$27)
    4754                            .dwattr $C$DW$468, DW_AT_name("macGtk1Hash")
    4755                            .dwattr $C$DW$468, DW_AT_TI_symbol_name("macGtk1Hash")
    4756                            .dwattr $C$DW$468, DW_AT_data_member_location[DW_OP_plus_uconst 0x6b]
    4757                            .dwattr $C$DW$468, DW_AT_accessibility(DW_ACCESS_public)
    4758                            .dwattr $C$DW$468, DW_AT_decl_file("..\Application\MAC\FreqHop\fh_pib.h")
    4759                            .dwattr $C$DW$468, DW_AT_decl_line(0xca)
    4760                            .dwattr $C$DW$468, DW_AT_decl_column(0x15)
    4761                    
    4762                    $C$DW$469       .dwtag  DW_TAG_member
    4763                            .dwattr $C$DW$469, DW_AT_type(*$C$DW$T$27)
    4764                            .dwattr $C$DW$469, DW_AT_name("macGtk2Hash")
    4765                            .dwattr $C$DW$469, DW_AT_TI_symbol_name("macGtk2Hash")
    4766                            .dwattr $C$DW$469, DW_AT_data_member_location[DW_OP_plus_uconst 0x73]
    4767                            .dwattr $C$DW$469, DW_AT_accessibility(DW_ACCESS_public)
    4768                            .dwattr $C$DW$469, DW_AT_decl_file("..\Application\MAC\FreqHop\fh_pib.h")
    4769                            .dwattr $C$DW$469, DW_AT_decl_line(0xcc)
    4770                            .dwattr $C$DW$469, DW_AT_decl_column(0x15)
    4771                    
    4772                    $C$DW$470       .dwtag  DW_TAG_member
    4773                            .dwattr $C$DW$470, DW_AT_type(*$C$DW$T$27)
    4774                            .dwattr $C$DW$470, DW_AT_name("macGtk3Hash")
    4775                            .dwattr $C$DW$470, DW_AT_TI_symbol_name("macGtk3Hash")
    4776                            .dwattr $C$DW$470, DW_AT_data_member_location[DW_OP_plus_uconst 0x7b]
    4777                            .dwattr $C$DW$470, DW_AT_accessibility(DW_ACCESS_public)
    4778                            .dwattr $C$DW$470, DW_AT_decl_file("..\Application\MAC\FreqHop\fh_pib.h")
    4779                            .dwattr $C$DW$470, DW_AT_decl_line(0xce)
    4780                            .dwattr $C$DW$470, DW_AT_decl_column(0x15)
    4781                    
    4782                    $C$DW$471       .dwtag  DW_TAG_member
    4783                            .dwattr $C$DW$471, DW_AT_type(*$C$DW$T$25)
    4784                            .dwattr $C$DW$471, DW_AT_name("macNeighborValidTime")
    4785                            .dwattr $C$DW$471, DW_AT_TI_symbol_name("macNeighborValidTime")
    4786                            .dwattr $C$DW$471, DW_AT_data_member_location[DW_OP_plus_uconst 0x83]
    4787                            .dwattr $C$DW$471, DW_AT_accessibility(DW_ACCESS_public)
    4788                            .dwattr $C$DW$471, DW_AT_decl_file("..\Application\MAC\FreqHop\fh_pib.h")
    4789                            .dwattr $C$DW$471, DW_AT_decl_line(0xd0)
    4790                            .dwattr $C$DW$471, DW_AT_decl_column(0x15)
    4791                    
    4792                    $C$DW$472       .dwtag  DW_TAG_member
    4793                            .dwattr $C$DW$472, DW_AT_type(*$C$DW$T$23)
    4794                            .dwattr $C$DW$472, DW_AT_name("macBaseBackOff")
    4795                            .dwattr $C$DW$472, DW_AT_TI_symbol_name("macBaseBackOff")
    4796                            .dwattr $C$DW$472, DW_AT_data_member_location[DW_OP_plus_uconst 0x85]
    4797                            .dwattr $C$DW$472, DW_AT_accessibility(DW_ACCESS_public)
    4798                            .dwattr $C$DW$472, DW_AT_decl_file("..\Application\MAC\FreqHop\fh_pib.h")
    4799                            .dwattr $C$DW$472, DW_AT_decl_line(0xd2)
    4800                            .dwattr $C$DW$472, DW_AT_decl_column(0x15)
    4801                    
    4802                    $C$DW$473       .dwtag  DW_TAG_member
    4803                            .dwattr $C$DW$473, DW_AT_type(*$C$DW$T$23)
    4804                            .dwattr $C$DW$473, DW_AT_name("macMaxNonSleepNodes")
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:20 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{3EBD5339-172C-4C2D-AFBF-B091C3B4C90F} PAGE   89

    4805                            .dwattr $C$DW$473, DW_AT_TI_symbol_name("macMaxNonSleepNodes")
    4806                            .dwattr $C$DW$473, DW_AT_data_member_location[DW_OP_plus_uconst 0x86]
    4807                            .dwattr $C$DW$473, DW_AT_accessibility(DW_ACCESS_public)
    4808                            .dwattr $C$DW$473, DW_AT_decl_file("..\Application\MAC\FreqHop\fh_pib.h")
    4809                            .dwattr $C$DW$473, DW_AT_decl_line(0xd4)
    4810                            .dwattr $C$DW$473, DW_AT_decl_column(0x15)
    4811                    
    4812                    $C$DW$474       .dwtag  DW_TAG_member
    4813                            .dwattr $C$DW$474, DW_AT_type(*$C$DW$T$23)
    4814                            .dwattr $C$DW$474, DW_AT_name("macMaxSleepNodes")
    4815                            .dwattr $C$DW$474, DW_AT_TI_symbol_name("macMaxSleepNodes")
    4816                            .dwattr $C$DW$474, DW_AT_data_member_location[DW_OP_plus_uconst 0x87]
    4817                            .dwattr $C$DW$474, DW_AT_accessibility(DW_ACCESS_public)
    4818                            .dwattr $C$DW$474, DW_AT_decl_file("..\Application\MAC\FreqHop\fh_pib.h")
    4819                            .dwattr $C$DW$474, DW_AT_decl_line(0xd6)
    4820                            .dwattr $C$DW$474, DW_AT_decl_column(0x15)
    4821                    
    4822                            .dwattr $C$DW$T$28, DW_AT_decl_file("..\Application\MAC\FreqHop\fh_pib.h")
    4823                            .dwattr $C$DW$T$28, DW_AT_decl_line(0x9c)
    4824                            .dwattr $C$DW$T$28, DW_AT_decl_column(0x01)
    4825                            .dwendtag $C$DW$T$28
    4826                    
    4827                    $C$DW$T$275     .dwtag  DW_TAG_const_type
    4828                            .dwattr $C$DW$T$275, DW_AT_type(*$C$DW$T$28)
    4829                    
    4830                    $C$DW$T$676     .dwtag  DW_TAG_typedef
    4831                            .dwattr $C$DW$T$676, DW_AT_name("FHPIB_DB_t")
    4832                            .dwattr $C$DW$T$676, DW_AT_type(*$C$DW$T$28)
    4833                            .dwattr $C$DW$T$676, DW_AT_language(DW_LANG_C)
    4834                            .dwattr $C$DW$T$676, DW_AT_decl_file("..\Application\MAC\FreqHop\fh_pib.h")
    4835                            .dwattr $C$DW$T$676, DW_AT_decl_line(0xd7)
    4836                            .dwattr $C$DW$T$676, DW_AT_decl_column(0x03)
    4837                    
    4838                    $C$DW$T$677     .dwtag  DW_TAG_const_type
    4839                            .dwattr $C$DW$T$677, DW_AT_type(*$C$DW$T$676)
    4840                    
    4841                    
    4842                    $C$DW$T$29      .dwtag  DW_TAG_structure_type
    4843                            .dwattr $C$DW$T$29, DW_AT_byte_size(0x0a)
    4844                    $C$DW$475       .dwtag  DW_TAG_member
    4845                            .dwattr $C$DW$475, DW_AT_type(*$C$DW$T$23)
    4846                            .dwattr $C$DW$475, DW_AT_name("offset")
    4847                            .dwattr $C$DW$475, DW_AT_TI_symbol_name("offset")
    4848                            .dwattr $C$DW$475, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4849                            .dwattr $C$DW$475, DW_AT_accessibility(DW_ACCESS_public)
    4850                            .dwattr $C$DW$475, DW_AT_decl_file("../Application/MAC/FreqHop/fh_pib.c")
    4851                            .dwattr $C$DW$475, DW_AT_decl_line(0x51)
    4852                            .dwattr $C$DW$475, DW_AT_decl_column(0x11)
    4853                    
    4854                    $C$DW$476       .dwtag  DW_TAG_member
    4855                            .dwattr $C$DW$476, DW_AT_type(*$C$DW$T$23)
    4856                            .dwattr $C$DW$476, DW_AT_name("len")
    4857                            .dwattr $C$DW$476, DW_AT_TI_symbol_name("len")
    4858                            .dwattr $C$DW$476, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4859                            .dwattr $C$DW$476, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:20 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{3EBD5339-172C-4C2D-AFBF-B091C3B4C90F} PAGE   90

    4860                            .dwattr $C$DW$476, DW_AT_decl_file("../Application/MAC/FreqHop/fh_pib.c")
    4861                            .dwattr $C$DW$476, DW_AT_decl_line(0x52)
    4862                            .dwattr $C$DW$476, DW_AT_decl_column(0x11)
    4863                    
    4864                    $C$DW$477       .dwtag  DW_TAG_member
    4865                            .dwattr $C$DW$477, DW_AT_type(*$C$DW$T$22)
    4866                            .dwattr $C$DW$477, DW_AT_name("min")
    4867                            .dwattr $C$DW$477, DW_AT_TI_symbol_name("min")
    4868                            .dwattr $C$DW$477, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4869                            .dwattr $C$DW$477, DW_AT_accessibility(DW_ACCESS_public)
    4870                            .dwattr $C$DW$477, DW_AT_decl_file("../Application/MAC/FreqHop/fh_pib.c")
    4871                            .dwattr $C$DW$477, DW_AT_decl_line(0x53)
    4872                            .dwattr $C$DW$477, DW_AT_decl_column(0x11)
    4873                    
    4874                    $C$DW$478       .dwtag  DW_TAG_member
    4875                            .dwattr $C$DW$478, DW_AT_type(*$C$DW$T$22)
    4876                            .dwattr $C$DW$478, DW_AT_name("max")
    4877                            .dwattr $C$DW$478, DW_AT_TI_symbol_name("max")
    4878                            .dwattr $C$DW$478, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4879                            .dwattr $C$DW$478, DW_AT_accessibility(DW_ACCESS_public)
    4880                            .dwattr $C$DW$478, DW_AT_decl_file("../Application/MAC/FreqHop/fh_pib.c")
    4881                            .dwattr $C$DW$478, DW_AT_decl_line(0x54)
    4882                            .dwattr $C$DW$478, DW_AT_decl_column(0x11)
    4883                    
    4884                            .dwattr $C$DW$T$29, DW_AT_decl_file("../Application/MAC/FreqHop/fh_pib.c")
    4885                            .dwattr $C$DW$T$29, DW_AT_decl_line(0x50)
    4886                            .dwattr $C$DW$T$29, DW_AT_decl_column(0x01)
    4887                            .dwendtag $C$DW$T$29
    4888                    
    4889                    $C$DW$T$276     .dwtag  DW_TAG_const_type
    4890                            .dwattr $C$DW$T$276, DW_AT_type(*$C$DW$T$29)
    4891                    
    4892                    
    4893                    $C$DW$T$277     .dwtag  DW_TAG_array_type
    4894                            .dwattr $C$DW$T$277, DW_AT_type(*$C$DW$T$276)
    4895                            .dwattr $C$DW$T$277, DW_AT_language(DW_LANG_C)
    4896                            .dwattr $C$DW$T$277, DW_AT_byte_size(0x122)
    4897                    $C$DW$479       .dwtag  DW_TAG_subrange_type
    4898                            .dwattr $C$DW$479, DW_AT_upper_bound(0x1c)
    4899                    
    4900                            .dwendtag $C$DW$T$277
    4901                    
    4902                    $C$DW$T$681     .dwtag  DW_TAG_typedef
    4903                            .dwattr $C$DW$T$681, DW_AT_name("FH_PibTbl_t")
    4904                            .dwattr $C$DW$T$681, DW_AT_type(*$C$DW$T$29)
    4905                            .dwattr $C$DW$T$681, DW_AT_language(DW_LANG_C)
    4906                            .dwattr $C$DW$T$681, DW_AT_decl_file("../Application/MAC/FreqHop/fh_pib.c")
    4907                            .dwattr $C$DW$T$681, DW_AT_decl_line(0x55)
    4908                            .dwattr $C$DW$T$681, DW_AT_decl_column(0x03)
    4909                    
    4910                    $C$DW$T$682     .dwtag  DW_TAG_const_type
    4911                            .dwattr $C$DW$T$682, DW_AT_type(*$C$DW$T$681)
    4912                    
    4913                    
    4914                    $C$DW$T$683     .dwtag  DW_TAG_array_type
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:20 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{3EBD5339-172C-4C2D-AFBF-B091C3B4C90F} PAGE   91

    4915                            .dwattr $C$DW$T$683, DW_AT_type(*$C$DW$T$682)
    4916                            .dwattr $C$DW$T$683, DW_AT_language(DW_LANG_C)
    4917                            .dwattr $C$DW$T$683, DW_AT_byte_size(0x122)
    4918                    $C$DW$480       .dwtag  DW_TAG_subrange_type
    4919                            .dwattr $C$DW$480, DW_AT_upper_bound(0x1c)
    4920                    
    4921                            .dwendtag $C$DW$T$683
    4922                    
    4923                    
    4924                    $C$DW$T$30      .dwtag  DW_TAG_structure_type
    4925                            .dwattr $C$DW$T$30, DW_AT_byte_size(0x0a)
    4926                    $C$DW$481       .dwtag  DW_TAG_member
    4927                            .dwattr $C$DW$481, DW_AT_type(*$C$DW$T$214)
    4928                            .dwattr $C$DW$481, DW_AT_name("addr")
    4929                            .dwattr $C$DW$481, DW_AT_TI_symbol_name("addr")
    4930                            .dwattr $C$DW$481, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4931                            .dwattr $C$DW$481, DW_AT_accessibility(DW_ACCESS_public)
    4932                            .dwattr $C$DW$481, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/Se
    4933                            .dwattr $C$DW$481, DW_AT_decl_line(0x52)
    4934                            .dwattr $C$DW$481, DW_AT_decl_column(0x05)
    4935                    
    4936                    $C$DW$482       .dwtag  DW_TAG_member
    4937                            .dwattr $C$DW$482, DW_AT_type(*$C$DW$T$19)
    4938                            .dwattr $C$DW$482, DW_AT_name("addrMode")
    4939                            .dwattr $C$DW$482, DW_AT_TI_symbol_name("addrMode")
    4940                            .dwattr $C$DW$482, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4941                            .dwattr $C$DW$482, DW_AT_accessibility(DW_ACCESS_public)
    4942                            .dwattr $C$DW$482, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/Se
    4943                            .dwattr $C$DW$482, DW_AT_decl_line(0x53)
    4944                            .dwattr $C$DW$482, DW_AT_decl_column(0x11)
    4945                    
    4946                            .dwattr $C$DW$T$30, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/S
    4947                            .dwattr $C$DW$T$30, DW_AT_decl_line(0x4d)
    4948                            .dwattr $C$DW$T$30, DW_AT_decl_column(0x01)
    4949                            .dwendtag $C$DW$T$30
    4950                    
    4951                    $C$DW$T$78      .dwtag  DW_TAG_typedef
    4952                            .dwattr $C$DW$T$78, DW_AT_name("sAddr_t")
    4953                            .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$30)
    4954                            .dwattr $C$DW$T$78, DW_AT_language(DW_LANG_C)
    4955                            .dwattr $C$DW$T$78, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/S
    4956                            .dwattr $C$DW$T$78, DW_AT_decl_line(0x54)
    4957                            .dwattr $C$DW$T$78, DW_AT_decl_column(0x03)
    4958                    
    4959                    
    4960                    $C$DW$T$33      .dwtag  DW_TAG_structure_type
    4961                            .dwattr $C$DW$T$33, DW_AT_byte_size(0x08)
    4962                    $C$DW$483       .dwtag  DW_TAG_member
    4963                            .dwattr $C$DW$483, DW_AT_type(*$C$DW$T$31)
    4964                            .dwattr $C$DW$483, DW_AT_name("p")
    4965                            .dwattr $C$DW$483, DW_AT_TI_symbol_name("p")
    4966                            .dwattr $C$DW$483, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4967                            .dwattr $C$DW$483, DW_AT_accessibility(DW_ACCESS_public)
    4968                            .dwattr $C$DW$483, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/Se
    4969                            .dwattr $C$DW$483, DW_AT_decl_line(0x3d)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:20 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{3EBD5339-172C-4C2D-AFBF-B091C3B4C90F} PAGE   92

    4970                            .dwattr $C$DW$483, DW_AT_decl_column(0x0e)
    4971                    
    4972                    $C$DW$484       .dwtag  DW_TAG_member
    4973                            .dwattr $C$DW$484, DW_AT_type(*$C$DW$T$32)
    4974                            .dwattr $C$DW$484, DW_AT_name("len")
    4975                            .dwattr $C$DW$484, DW_AT_TI_symbol_name("len")
    4976                            .dwattr $C$DW$484, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4977                            .dwattr $C$DW$484, DW_AT_accessibility(DW_ACCESS_public)
    4978                            .dwattr $C$DW$484, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/Se
    4979                            .dwattr $C$DW$484, DW_AT_decl_line(0x3e)
    4980                            .dwattr $C$DW$484, DW_AT_decl_column(0x0e)
    4981                    
    4982                            .dwattr $C$DW$T$33, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/S
    4983                            .dwattr $C$DW$T$33, DW_AT_decl_line(0x3c)
    4984                            .dwattr $C$DW$T$33, DW_AT_decl_column(0x01)
    4985                            .dwendtag $C$DW$T$33
    4986                    
    4987                    $C$DW$T$81      .dwtag  DW_TAG_typedef
    4988                            .dwattr $C$DW$T$81, DW_AT_name("sData_t")
    4989                            .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$33)
    4990                            .dwattr $C$DW$T$81, DW_AT_language(DW_LANG_C)
    4991                            .dwattr $C$DW$T$81, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/S
    4992                            .dwattr $C$DW$T$81, DW_AT_decl_line(0x3f)
    4993                            .dwattr $C$DW$T$81, DW_AT_decl_column(0x03)
    4994                    
    4995                    
    4996                    $C$DW$T$36      .dwtag  DW_TAG_structure_type
    4997                            .dwattr $C$DW$T$36, DW_AT_byte_size(0x0a)
    4998                    $C$DW$485       .dwtag  DW_TAG_member
    4999                            .dwattr $C$DW$485, DW_AT_type(*$C$DW$T$216)
    5000                            .dwattr $C$DW$485, DW_AT_name("addr")
    5001                            .dwattr $C$DW$485, DW_AT_TI_symbol_name("addr")
    5002                            .dwattr $C$DW$485, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5003                            .dwattr $C$DW$485, DW_AT_accessibility(DW_ACCESS_public)
    5004                            .dwattr $C$DW$485, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/ap
    5005                            .dwattr $C$DW$485, DW_AT_decl_line(0x4a7)
    5006                            .dwattr $C$DW$485, DW_AT_decl_column(0x07)
    5007                    
    5008                    $C$DW$486       .dwtag  DW_TAG_member
    5009                            .dwattr $C$DW$486, DW_AT_type(*$C$DW$T$35)
    5010                            .dwattr $C$DW$486, DW_AT_name("addrMode")
    5011                            .dwattr $C$DW$486, DW_AT_TI_symbol_name("addrMode")
    5012                            .dwattr $C$DW$486, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5013                            .dwattr $C$DW$486, DW_AT_accessibility(DW_ACCESS_public)
    5014                            .dwattr $C$DW$486, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/ap
    5015                            .dwattr $C$DW$486, DW_AT_decl_line(0x4aa)
    5016                            .dwattr $C$DW$486, DW_AT_decl_column(0x17)
    5017                    
    5018                            .dwattr $C$DW$T$36, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/a
    5019                            .dwattr $C$DW$T$36, DW_AT_decl_line(0x49c)
    5020                            .dwattr $C$DW$T$36, DW_AT_decl_column(0x01)
    5021                            .dwendtag $C$DW$T$36
    5022                    
    5023                    $C$DW$T$391     .dwtag  DW_TAG_typedef
    5024                            .dwattr $C$DW$T$391, DW_AT_name("ApiMac_sAddr_t")
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:20 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{3EBD5339-172C-4C2D-AFBF-B091C3B4C90F} PAGE   93

    5025                            .dwattr $C$DW$T$391, DW_AT_type(*$C$DW$T$36)
    5026                            .dwattr $C$DW$T$391, DW_AT_language(DW_LANG_C)
    5027                            .dwattr $C$DW$T$391, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/
    5028                            .dwattr $C$DW$T$391, DW_AT_decl_line(0x4ab)
    5029                            .dwattr $C$DW$T$391, DW_AT_decl_column(0x03)
    5030                    
    5031                    
    5032                    $C$DW$T$40      .dwtag  DW_TAG_structure_type
    5033                            .dwattr $C$DW$T$40, DW_AT_byte_size(0x40)
    5034                    $C$DW$487       .dwtag  DW_TAG_member
    5035                            .dwattr $C$DW$487, DW_AT_type(*$C$DW$T$38)
    5036                            .dwattr $C$DW$487, DW_AT_name("beaconType")
    5037                            .dwattr $C$DW$487, DW_AT_TI_symbol_name("beaconType")
    5038                            .dwattr $C$DW$487, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5039                            .dwattr $C$DW$487, DW_AT_accessibility(DW_ACCESS_public)
    5040                            .dwattr $C$DW$487, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/ap
    5041                            .dwattr $C$DW$487, DW_AT_decl_line(0x848)
    5042                            .dwattr $C$DW$487, DW_AT_decl_column(0x19)
    5043                    
    5044                    $C$DW$488       .dwtag  DW_TAG_member
    5045                            .dwattr $C$DW$488, DW_AT_type(*$C$DW$T$23)
    5046                            .dwattr $C$DW$488, DW_AT_name("bsn")
    5047                            .dwattr $C$DW$488, DW_AT_TI_symbol_name("bsn")
    5048                            .dwattr $C$DW$488, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5049                            .dwattr $C$DW$488, DW_AT_accessibility(DW_ACCESS_public)
    5050                            .dwattr $C$DW$488, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/ap
    5051                            .dwattr $C$DW$488, DW_AT_decl_line(0x84a)
    5052                            .dwattr $C$DW$488, DW_AT_decl_column(0x0d)
    5053                    
    5054                    $C$DW$489       .dwtag  DW_TAG_member
    5055                            .dwattr $C$DW$489, DW_AT_type(*$C$DW$T$39)
    5056                            .dwattr $C$DW$489, DW_AT_name("panDesc")
    5057                            .dwattr $C$DW$489, DW_AT_TI_symbol_name("panDesc")
    5058                            .dwattr $C$DW$489, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5059                            .dwattr $C$DW$489, DW_AT_accessibility(DW_ACCESS_public)
    5060                            .dwattr $C$DW$489, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/ap
    5061                            .dwattr $C$DW$489, DW_AT_decl_line(0x84c)
    5062                            .dwattr $C$DW$489, DW_AT_decl_column(0x16)
    5063                    
    5064                    $C$DW$490       .dwtag  DW_TAG_member
    5065                            .dwattr $C$DW$490, DW_AT_type(*$C$DW$T$219)
    5066                            .dwattr $C$DW$490, DW_AT_name("beaconData")
    5067                            .dwattr $C$DW$490, DW_AT_TI_symbol_name("beaconData")
    5068                            .dwattr $C$DW$490, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    5069                            .dwattr $C$DW$490, DW_AT_accessibility(DW_ACCESS_public)
    5070                            .dwattr $C$DW$490, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/ap
    5071                            .dwattr $C$DW$490, DW_AT_decl_line(0x857)
    5072                            .dwattr $C$DW$490, DW_AT_decl_column(0x07)
    5073                    
    5074                            .dwattr $C$DW$T$40, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/a
    5075                            .dwattr $C$DW$T$40, DW_AT_decl_line(0x846)
    5076                            .dwattr $C$DW$T$40, DW_AT_decl_column(0x01)
    5077                            .dwendtag $C$DW$T$40
    5078                    
    5079                    $C$DW$T$305     .dwtag  DW_TAG_typedef
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:20 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{3EBD5339-172C-4C2D-AFBF-B091C3B4C90F} PAGE   94

    5080                            .dwattr $C$DW$T$305, DW_AT_name("ApiMac_mlmeBeaconNotifyInd_t")
    5081                            .dwattr $C$DW$T$305, DW_AT_type(*$C$DW$T$40)
    5082                            .dwattr $C$DW$T$305, DW_AT_language(DW_LANG_C)
    5083                            .dwattr $C$DW$T$305, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/
    5084                            .dwattr $C$DW$T$305, DW_AT_decl_line(0x858)
    5085                            .dwattr $C$DW$T$305, DW_AT_decl_column(0x03)
    5086                    
    5087                    $C$DW$T$306     .dwtag  DW_TAG_pointer_type
    5088                            .dwattr $C$DW$T$306, DW_AT_type(*$C$DW$T$305)
    5089                            .dwattr $C$DW$T$306, DW_AT_address_class(0x20)
    5090                    
    5091                    
    5092                    $C$DW$T$42      .dwtag  DW_TAG_structure_type
    5093                            .dwattr $C$DW$T$42, DW_AT_byte_size(0x10)
    5094                    $C$DW$491       .dwtag  DW_TAG_member
    5095                            .dwattr $C$DW$491, DW_AT_type(*$C$DW$T$41)
    5096                            .dwattr $C$DW$491, DW_AT_name("firstChCentrFreq")
    5097                            .dwattr $C$DW$491, DW_AT_TI_symbol_name("firstChCentrFreq")
    5098                            .dwattr $C$DW$491, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5099                            .dwattr $C$DW$491, DW_AT_accessibility(DW_ACCESS_public)
    5100                            .dwattr $C$DW$491, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    5101                            .dwattr $C$DW$491, DW_AT_decl_line(0x286)
    5102                            .dwattr $C$DW$491, DW_AT_decl_column(0x0a)
    5103                    
    5104                    $C$DW$492       .dwtag  DW_TAG_member
    5105                            .dwattr $C$DW$492, DW_AT_type(*$C$DW$T$41)
    5106                            .dwattr $C$DW$492, DW_AT_name("channelSpacing")
    5107                            .dwattr $C$DW$492, DW_AT_TI_symbol_name("channelSpacing")
    5108                            .dwattr $C$DW$492, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5109                            .dwattr $C$DW$492, DW_AT_accessibility(DW_ACCESS_public)
    5110                            .dwattr $C$DW$492, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    5111                            .dwattr $C$DW$492, DW_AT_decl_line(0x287)
    5112                            .dwattr $C$DW$492, DW_AT_decl_column(0x0a)
    5113                    
    5114                    $C$DW$493       .dwtag  DW_TAG_member
    5115                            .dwattr $C$DW$493, DW_AT_type(*$C$DW$T$32)
    5116                            .dwattr $C$DW$493, DW_AT_name("noOfChannels")
    5117                            .dwattr $C$DW$493, DW_AT_TI_symbol_name("noOfChannels")
    5118                            .dwattr $C$DW$493, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5119                            .dwattr $C$DW$493, DW_AT_accessibility(DW_ACCESS_public)
    5120                            .dwattr $C$DW$493, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    5121                            .dwattr $C$DW$493, DW_AT_decl_line(0x288)
    5122                            .dwattr $C$DW$493, DW_AT_decl_column(0x0a)
    5123                    
    5124                    $C$DW$494       .dwtag  DW_TAG_member
    5125                            .dwattr $C$DW$494, DW_AT_type(*$C$DW$T$19)
    5126                            .dwattr $C$DW$494, DW_AT_name("fskModScheme")
    5127                            .dwattr $C$DW$494, DW_AT_TI_symbol_name("fskModScheme")
    5128                            .dwattr $C$DW$494, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5129                            .dwattr $C$DW$494, DW_AT_accessibility(DW_ACCESS_public)
    5130                            .dwattr $C$DW$494, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    5131                            .dwattr $C$DW$494, DW_AT_decl_line(0x28a)
    5132                            .dwattr $C$DW$494, DW_AT_decl_column(0x09)
    5133                    
    5134                    $C$DW$495       .dwtag  DW_TAG_member
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:20 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{3EBD5339-172C-4C2D-AFBF-B091C3B4C90F} PAGE   95

    5135                            .dwattr $C$DW$495, DW_AT_type(*$C$DW$T$32)
    5136                            .dwattr $C$DW$495, DW_AT_name("symbolRate")
    5137                            .dwattr $C$DW$495, DW_AT_TI_symbol_name("symbolRate")
    5138                            .dwattr $C$DW$495, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5139                            .dwattr $C$DW$495, DW_AT_accessibility(DW_ACCESS_public)
    5140                            .dwattr $C$DW$495, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    5141                            .dwattr $C$DW$495, DW_AT_decl_line(0x28c)
    5142                            .dwattr $C$DW$495, DW_AT_decl_column(0x0a)
    5143                    
    5144                    $C$DW$496       .dwtag  DW_TAG_member
    5145                            .dwattr $C$DW$496, DW_AT_type(*$C$DW$T$19)
    5146                            .dwattr $C$DW$496, DW_AT_name("fskModIndex")
    5147                            .dwattr $C$DW$496, DW_AT_TI_symbol_name("fskModIndex")
    5148                            .dwattr $C$DW$496, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    5149                            .dwattr $C$DW$496, DW_AT_accessibility(DW_ACCESS_public)
    5150                            .dwattr $C$DW$496, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    5151                            .dwattr $C$DW$496, DW_AT_decl_line(0x28d)
    5152                            .dwattr $C$DW$496, DW_AT_decl_column(0x09)
    5153                    
    5154                    $C$DW$497       .dwtag  DW_TAG_member
    5155                            .dwattr $C$DW$497, DW_AT_type(*$C$DW$T$19)
    5156                            .dwattr $C$DW$497, DW_AT_name("ccaType")
    5157                            .dwattr $C$DW$497, DW_AT_TI_symbol_name("ccaType")
    5158                            .dwattr $C$DW$497, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    5159                            .dwattr $C$DW$497, DW_AT_accessibility(DW_ACCESS_public)
    5160                            .dwattr $C$DW$497, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    5161                            .dwattr $C$DW$497, DW_AT_decl_line(0x295)
    5162                            .dwattr $C$DW$497, DW_AT_decl_column(0x09)
    5163                    
    5164                            .dwattr $C$DW$T$42, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/M
    5165                            .dwattr $C$DW$T$42, DW_AT_decl_line(0x285)
    5166                            .dwattr $C$DW$T$42, DW_AT_decl_column(0x01)
    5167                            .dwendtag $C$DW$T$42
    5168                    
    5169                    $C$DW$T$684     .dwtag  DW_TAG_typedef
    5170                            .dwattr $C$DW$T$684, DW_AT_name("macMRFSKPHYDesc_t")
    5171                            .dwattr $C$DW$T$684, DW_AT_type(*$C$DW$T$42)
    5172                            .dwattr $C$DW$T$684, DW_AT_language(DW_LANG_C)
    5173                            .dwattr $C$DW$T$684, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/
    5174                            .dwattr $C$DW$T$684, DW_AT_decl_line(0x296)
    5175                            .dwattr $C$DW$T$684, DW_AT_decl_column(0x03)
    5176                    
    5177                    
    5178                    $C$DW$T$43      .dwtag  DW_TAG_structure_type
    5179                            .dwattr $C$DW$T$43, DW_AT_byte_size(0x02)
    5180                    $C$DW$498       .dwtag  DW_TAG_member
    5181                            .dwattr $C$DW$498, DW_AT_type(*$C$DW$T$19)
    5182                            .dwattr $C$DW$498, DW_AT_name("event")
    5183                            .dwattr $C$DW$498, DW_AT_TI_symbol_name("event")
    5184                            .dwattr $C$DW$498, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5185                            .dwattr $C$DW$498, DW_AT_accessibility(DW_ACCESS_public)
    5186                            .dwattr $C$DW$498, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    5187                            .dwattr $C$DW$498, DW_AT_decl_line(0x2a6)
    5188                            .dwattr $C$DW$498, DW_AT_decl_column(0x0b)
    5189                    
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:20 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{3EBD5339-172C-4C2D-AFBF-B091C3B4C90F} PAGE   96

    5190                    $C$DW$499       .dwtag  DW_TAG_member
    5191                            .dwattr $C$DW$499, DW_AT_type(*$C$DW$T$19)
    5192                            .dwattr $C$DW$499, DW_AT_name("status")
    5193                            .dwattr $C$DW$499, DW_AT_TI_symbol_name("status")
    5194                            .dwattr $C$DW$499, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5195                            .dwattr $C$DW$499, DW_AT_accessibility(DW_ACCESS_public)
    5196                            .dwattr $C$DW$499, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    5197                            .dwattr $C$DW$499, DW_AT_decl_line(0x2a7)
    5198                            .dwattr $C$DW$499, DW_AT_decl_column(0x0b)
    5199                    
    5200                            .dwattr $C$DW$T$43, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/M
    5201                            .dwattr $C$DW$T$43, DW_AT_decl_line(0x2a5)
    5202                            .dwattr $C$DW$T$43, DW_AT_decl_column(0x01)
    5203                            .dwendtag $C$DW$T$43
    5204                    
    5205                    $C$DW$T$80      .dwtag  DW_TAG_typedef
    5206                            .dwattr $C$DW$T$80, DW_AT_name("macEventHdr_t")
    5207                            .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$43)
    5208                            .dwattr $C$DW$T$80, DW_AT_language(DW_LANG_C)
    5209                            .dwattr $C$DW$T$80, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/M
    5210                            .dwattr $C$DW$T$80, DW_AT_decl_line(0x2a8)
    5211                            .dwattr $C$DW$T$80, DW_AT_decl_column(0x03)
    5212                    
    5213                    
    5214                    $C$DW$T$44      .dwtag  DW_TAG_structure_type
    5215                            .dwattr $C$DW$T$44, DW_AT_byte_size(0x0b)
    5216                    $C$DW$500       .dwtag  DW_TAG_member
    5217                            .dwattr $C$DW$500, DW_AT_type(*$C$DW$T$20)
    5218                            .dwattr $C$DW$500, DW_AT_name("keySource")
    5219                            .dwattr $C$DW$500, DW_AT_TI_symbol_name("keySource")
    5220                            .dwattr $C$DW$500, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5221                            .dwattr $C$DW$500, DW_AT_accessibility(DW_ACCESS_public)
    5222                            .dwattr $C$DW$500, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    5223                            .dwattr $C$DW$500, DW_AT_decl_line(0x2ad)
    5224                            .dwattr $C$DW$500, DW_AT_decl_column(0x0b)
    5225                    
    5226                    $C$DW$501       .dwtag  DW_TAG_member
    5227                            .dwattr $C$DW$501, DW_AT_type(*$C$DW$T$19)
    5228                            .dwattr $C$DW$501, DW_AT_name("securityLevel")
    5229                            .dwattr $C$DW$501, DW_AT_TI_symbol_name("securityLevel")
    5230                            .dwattr $C$DW$501, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5231                            .dwattr $C$DW$501, DW_AT_accessibility(DW_ACCESS_public)
    5232                            .dwattr $C$DW$501, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    5233                            .dwattr $C$DW$501, DW_AT_decl_line(0x2ae)
    5234                            .dwattr $C$DW$501, DW_AT_decl_column(0x0b)
    5235                    
    5236                    $C$DW$502       .dwtag  DW_TAG_member
    5237                            .dwattr $C$DW$502, DW_AT_type(*$C$DW$T$19)
    5238                            .dwattr $C$DW$502, DW_AT_name("keyIdMode")
    5239                            .dwattr $C$DW$502, DW_AT_TI_symbol_name("keyIdMode")
    5240                            .dwattr $C$DW$502, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    5241                            .dwattr $C$DW$502, DW_AT_accessibility(DW_ACCESS_public)
    5242                            .dwattr $C$DW$502, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    5243                            .dwattr $C$DW$502, DW_AT_decl_line(0x2af)
    5244                            .dwattr $C$DW$502, DW_AT_decl_column(0x0b)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:20 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{3EBD5339-172C-4C2D-AFBF-B091C3B4C90F} PAGE   97

    5245                    
    5246                    $C$DW$503       .dwtag  DW_TAG_member
    5247                            .dwattr $C$DW$503, DW_AT_type(*$C$DW$T$19)
    5248                            .dwattr $C$DW$503, DW_AT_name("keyIndex")
    5249                            .dwattr $C$DW$503, DW_AT_TI_symbol_name("keyIndex")
    5250                            .dwattr $C$DW$503, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5251                            .dwattr $C$DW$503, DW_AT_accessibility(DW_ACCESS_public)
    5252                            .dwattr $C$DW$503, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    5253                            .dwattr $C$DW$503, DW_AT_decl_line(0x2b0)
    5254                            .dwattr $C$DW$503, DW_AT_decl_column(0x0b)
    5255                    
    5256                            .dwattr $C$DW$T$44, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/M
    5257                            .dwattr $C$DW$T$44, DW_AT_decl_line(0x2ac)
    5258                            .dwattr $C$DW$T$44, DW_AT_decl_column(0x01)
    5259                            .dwendtag $C$DW$T$44
    5260                    
    5261                    $C$DW$T$685     .dwtag  DW_TAG_typedef
    5262                            .dwattr $C$DW$T$685, DW_AT_name("macSec_t")
    5263                            .dwattr $C$DW$T$685, DW_AT_type(*$C$DW$T$44)
    5264                            .dwattr $C$DW$T$685, DW_AT_language(DW_LANG_C)
    5265                            .dwattr $C$DW$T$685, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/
    5266                            .dwattr $C$DW$T$685, DW_AT_decl_line(0x2b1)
    5267                            .dwattr $C$DW$T$685, DW_AT_decl_column(0x03)
    5268                    
    5269                    
    5270                    $C$DW$T$46      .dwtag  DW_TAG_structure_type
    5271                            .dwattr $C$DW$T$46, DW_AT_byte_size(0x0a)
    5272                    $C$DW$504       .dwtag  DW_TAG_member
    5273                            .dwattr $C$DW$504, DW_AT_type(*$C$DW$T$45)
    5274                            .dwattr $C$DW$504, DW_AT_name("lookupData")
    5275                            .dwattr $C$DW$504, DW_AT_TI_symbol_name("lookupData")
    5276                            .dwattr $C$DW$504, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5277                            .dwattr $C$DW$504, DW_AT_accessibility(DW_ACCESS_public)
    5278                            .dwattr $C$DW$504, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    5279                            .dwattr $C$DW$504, DW_AT_decl_line(0x2b6)
    5280                            .dwattr $C$DW$504, DW_AT_decl_column(0x16)
    5281                    
    5282                    $C$DW$505       .dwtag  DW_TAG_member
    5283                            .dwattr $C$DW$505, DW_AT_type(*$C$DW$T$19)
    5284                            .dwattr $C$DW$505, DW_AT_name("lookupDataSize")
    5285                            .dwattr $C$DW$505, DW_AT_TI_symbol_name("lookupDataSize")
    5286                            .dwattr $C$DW$505, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    5287                            .dwattr $C$DW$505, DW_AT_accessibility(DW_ACCESS_public)
    5288                            .dwattr $C$DW$505, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    5289                            .dwattr $C$DW$505, DW_AT_decl_line(0x2b7)
    5290                            .dwattr $C$DW$505, DW_AT_decl_column(0x16)
    5291                    
    5292                            .dwattr $C$DW$T$46, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/M
    5293                            .dwattr $C$DW$T$46, DW_AT_decl_line(0x2b5)
    5294                            .dwattr $C$DW$T$46, DW_AT_decl_column(0x01)
    5295                            .dwendtag $C$DW$T$46
    5296                    
    5297                    $C$DW$T$50      .dwtag  DW_TAG_typedef
    5298                            .dwattr $C$DW$T$50, DW_AT_name("keyIdLookupDescriptor_t")
    5299                            .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$46)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:20 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{3EBD5339-172C-4C2D-AFBF-B091C3B4C90F} PAGE   98

    5300                            .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
    5301                            .dwattr $C$DW$T$50, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/M
    5302                            .dwattr $C$DW$T$50, DW_AT_decl_line(0x2b8)
    5303                            .dwattr $C$DW$T$50, DW_AT_decl_column(0x03)
    5304                    
    5305                    $C$DW$T$51      .dwtag  DW_TAG_pointer_type
    5306                            .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$50)
    5307                            .dwattr $C$DW$T$51, DW_AT_address_class(0x20)
    5308                    
    5309                    
    5310                    $C$DW$T$176     .dwtag  DW_TAG_array_type
    5311                            .dwattr $C$DW$T$176, DW_AT_type(*$C$DW$T$50)
    5312                            .dwattr $C$DW$T$176, DW_AT_language(DW_LANG_C)
    5313                            .dwattr $C$DW$T$176, DW_AT_byte_size(0x0a)
    5314                    $C$DW$506       .dwtag  DW_TAG_subrange_type
    5315                            .dwattr $C$DW$506, DW_AT_upper_bound(0x00)
    5316                    
    5317                            .dwendtag $C$DW$T$176
    5318                    
    5319                    
    5320                    $C$DW$T$177     .dwtag  DW_TAG_array_type
    5321                            .dwattr $C$DW$T$177, DW_AT_type(*$C$DW$T$50)
    5322                            .dwattr $C$DW$T$177, DW_AT_language(DW_LANG_C)
    5323                            .dwattr $C$DW$T$177, DW_AT_byte_size(0x14)
    5324                    $C$DW$507       .dwtag  DW_TAG_subrange_type
    5325                            .dwattr $C$DW$507, DW_AT_upper_bound(0x01)
    5326                    
    5327                    $C$DW$508       .dwtag  DW_TAG_subrange_type
    5328                            .dwattr $C$DW$508, DW_AT_upper_bound(0x00)
    5329                    
    5330                            .dwendtag $C$DW$T$177
    5331                    
    5332                    
    5333                    $C$DW$T$48      .dwtag  DW_TAG_structure_type
    5334                            .dwattr $C$DW$T$48, DW_AT_byte_size(0x03)
    5335                    $C$DW$509       .dwtag  DW_TAG_member
    5336                            .dwattr $C$DW$509, DW_AT_type(*$C$DW$T$19)
    5337                            .dwattr $C$DW$509, DW_AT_name("deviceDescriptorHandle")
    5338                            .dwattr $C$DW$509, DW_AT_TI_symbol_name("deviceDescriptorHandle")
    5339                            .dwattr $C$DW$509, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5340                            .dwattr $C$DW$509, DW_AT_accessibility(DW_ACCESS_public)
    5341                            .dwattr $C$DW$509, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    5342                            .dwattr $C$DW$509, DW_AT_decl_line(0x2bd)
    5343                            .dwattr $C$DW$509, DW_AT_decl_column(0x16)
    5344                    
    5345                    $C$DW$510       .dwtag  DW_TAG_member
    5346                            .dwattr $C$DW$510, DW_AT_type(*$C$DW$T$47)
    5347                            .dwattr $C$DW$510, DW_AT_name("uniqueDevice")
    5348                            .dwattr $C$DW$510, DW_AT_TI_symbol_name("uniqueDevice")
    5349                            .dwattr $C$DW$510, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5350                            .dwattr $C$DW$510, DW_AT_accessibility(DW_ACCESS_public)
    5351                            .dwattr $C$DW$510, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    5352                            .dwattr $C$DW$510, DW_AT_decl_line(0x2be)
    5353                            .dwattr $C$DW$510, DW_AT_decl_column(0x16)
    5354                    
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:20 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{3EBD5339-172C-4C2D-AFBF-B091C3B4C90F} PAGE   99

    5355                    $C$DW$511       .dwtag  DW_TAG_member
    5356                            .dwattr $C$DW$511, DW_AT_type(*$C$DW$T$47)
    5357                            .dwattr $C$DW$511, DW_AT_name("blackListed")
    5358                            .dwattr $C$DW$511, DW_AT_TI_symbol_name("blackListed")
    5359                            .dwattr $C$DW$511, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5360                            .dwattr $C$DW$511, DW_AT_accessibility(DW_ACCESS_public)
    5361                            .dwattr $C$DW$511, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    5362                            .dwattr $C$DW$511, DW_AT_decl_line(0x2bf)
    5363                            .dwattr $C$DW$511, DW_AT_decl_column(0x16)
    5364                    
    5365                            .dwattr $C$DW$T$48, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/M
    5366                            .dwattr $C$DW$T$48, DW_AT_decl_line(0x2bc)
    5367                            .dwattr $C$DW$T$48, DW_AT_decl_column(0x01)
    5368                            .dwendtag $C$DW$T$48
    5369                    
    5370                    $C$DW$T$52      .dwtag  DW_TAG_typedef
    5371                            .dwattr $C$DW$T$52, DW_AT_name("keyDeviceDescriptor_t")
    5372                            .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$48)
    5373                            .dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
    5374                            .dwattr $C$DW$T$52, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/M
    5375                            .dwattr $C$DW$T$52, DW_AT_decl_line(0x2c0)
    5376                            .dwattr $C$DW$T$52, DW_AT_decl_column(0x03)
    5377                    
    5378                    $C$DW$T$53      .dwtag  DW_TAG_pointer_type
    5379                            .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$52)
    5380                            .dwattr $C$DW$T$53, DW_AT_address_class(0x20)
    5381                    
    5382                    
    5383                    $C$DW$T$178     .dwtag  DW_TAG_array_type
    5384                            .dwattr $C$DW$T$178, DW_AT_type(*$C$DW$T$52)
    5385                            .dwattr $C$DW$T$178, DW_AT_language(DW_LANG_C)
    5386                            .dwattr $C$DW$T$178, DW_AT_byte_size(0x09)
    5387                    $C$DW$512       .dwtag  DW_TAG_subrange_type
    5388                            .dwattr $C$DW$512, DW_AT_upper_bound(0x02)
    5389                    
    5390                            .dwendtag $C$DW$T$178
    5391                    
    5392                    
    5393                    $C$DW$T$179     .dwtag  DW_TAG_array_type
    5394                            .dwattr $C$DW$T$179, DW_AT_type(*$C$DW$T$52)
    5395                            .dwattr $C$DW$T$179, DW_AT_language(DW_LANG_C)
    5396                            .dwattr $C$DW$T$179, DW_AT_byte_size(0x12)
    5397                    $C$DW$513       .dwtag  DW_TAG_subrange_type
    5398                            .dwattr $C$DW$513, DW_AT_upper_bound(0x01)
    5399                    
    5400                    $C$DW$514       .dwtag  DW_TAG_subrange_type
    5401                            .dwattr $C$DW$514, DW_AT_upper_bound(0x02)
    5402                    
    5403                            .dwendtag $C$DW$T$179
    5404                    
    5405                    
    5406                    $C$DW$T$49      .dwtag  DW_TAG_structure_type
    5407                            .dwattr $C$DW$T$49, DW_AT_byte_size(0x02)
    5408                    $C$DW$515       .dwtag  DW_TAG_member
    5409                            .dwattr $C$DW$515, DW_AT_type(*$C$DW$T$19)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:20 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{3EBD5339-172C-4C2D-AFBF-B091C3B4C90F} PAGE  100

    5410                            .dwattr $C$DW$515, DW_AT_name("frameType")
    5411                            .dwattr $C$DW$515, DW_AT_TI_symbol_name("frameType")
    5412                            .dwattr $C$DW$515, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5413                            .dwattr $C$DW$515, DW_AT_accessibility(DW_ACCESS_public)
    5414                            .dwattr $C$DW$515, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    5415                            .dwattr $C$DW$515, DW_AT_decl_line(0x2c5)
    5416                            .dwattr $C$DW$515, DW_AT_decl_column(0x16)
    5417                    
    5418                    $C$DW$516       .dwtag  DW_TAG_member
    5419                            .dwattr $C$DW$516, DW_AT_type(*$C$DW$T$19)
    5420                            .dwattr $C$DW$516, DW_AT_name("cmdFrameId")
    5421                            .dwattr $C$DW$516, DW_AT_TI_symbol_name("cmdFrameId")
    5422                            .dwattr $C$DW$516, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5423                            .dwattr $C$DW$516, DW_AT_accessibility(DW_ACCESS_public)
    5424                            .dwattr $C$DW$516, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    5425                            .dwattr $C$DW$516, DW_AT_decl_line(0x2c6)
    5426                            .dwattr $C$DW$516, DW_AT_decl_column(0x16)
    5427                    
    5428                            .dwattr $C$DW$T$49, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/M
    5429                            .dwattr $C$DW$T$49, DW_AT_decl_line(0x2c4)
    5430                            .dwattr $C$DW$T$49, DW_AT_decl_column(0x01)
    5431                            .dwendtag $C$DW$T$49
    5432                    
    5433                    $C$DW$T$54      .dwtag  DW_TAG_typedef
    5434                            .dwattr $C$DW$T$54, DW_AT_name("keyUsageDescriptor_t")
    5435                            .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$49)
    5436                            .dwattr $C$DW$T$54, DW_AT_language(DW_LANG_C)
    5437                            .dwattr $C$DW$T$54, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/M
    5438                            .dwattr $C$DW$T$54, DW_AT_decl_line(0x2c7)
    5439                            .dwattr $C$DW$T$54, DW_AT_decl_column(0x03)
    5440                    
    5441                    $C$DW$T$55      .dwtag  DW_TAG_pointer_type
    5442                            .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$54)
    5443                            .dwattr $C$DW$T$55, DW_AT_address_class(0x20)
    5444                    
    5445                    
    5446                    $C$DW$T$180     .dwtag  DW_TAG_array_type
    5447                            .dwattr $C$DW$T$180, DW_AT_type(*$C$DW$T$54)
    5448                            .dwattr $C$DW$T$180, DW_AT_language(DW_LANG_C)
    5449                            .dwattr $C$DW$T$180, DW_AT_byte_size(0x04)
    5450                    $C$DW$517       .dwtag  DW_TAG_subrange_type
    5451                            .dwattr $C$DW$517, DW_AT_upper_bound(0x01)
    5452                    
    5453                            .dwendtag $C$DW$T$180
    5454                    
    5455                    
    5456                    $C$DW$T$181     .dwtag  DW_TAG_array_type
    5457                            .dwattr $C$DW$T$181, DW_AT_type(*$C$DW$T$54)
    5458                            .dwattr $C$DW$T$181, DW_AT_language(DW_LANG_C)
    5459                            .dwattr $C$DW$T$181, DW_AT_byte_size(0x08)
    5460                    $C$DW$518       .dwtag  DW_TAG_subrange_type
    5461                            .dwattr $C$DW$518, DW_AT_upper_bound(0x01)
    5462                    
    5463                    $C$DW$519       .dwtag  DW_TAG_subrange_type
    5464                            .dwattr $C$DW$519, DW_AT_upper_bound(0x01)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:20 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{3EBD5339-172C-4C2D-AFBF-B091C3B4C90F} PAGE  101

    5465                    
    5466                            .dwendtag $C$DW$T$181
    5467                    
    5468                    
    5469                    $C$DW$T$57      .dwtag  DW_TAG_structure_type
    5470                            .dwattr $C$DW$T$57, DW_AT_byte_size(0x2c)
    5471                    $C$DW$520       .dwtag  DW_TAG_member
    5472                            .dwattr $C$DW$520, DW_AT_type(*$C$DW$T$51)
    5473                            .dwattr $C$DW$520, DW_AT_name("keyIdLookupList")
    5474                            .dwattr $C$DW$520, DW_AT_TI_symbol_name("keyIdLookupList")
    5475                            .dwattr $C$DW$520, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5476                            .dwattr $C$DW$520, DW_AT_accessibility(DW_ACCESS_public)
    5477                            .dwattr $C$DW$520, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    5478                            .dwattr $C$DW$520, DW_AT_decl_line(0x2cc)
    5479                            .dwattr $C$DW$520, DW_AT_decl_column(0x1d)
    5480                    
    5481                    $C$DW$521       .dwtag  DW_TAG_member
    5482                            .dwattr $C$DW$521, DW_AT_type(*$C$DW$T$19)
    5483                            .dwattr $C$DW$521, DW_AT_name("keyIdLookupEntries")
    5484                            .dwattr $C$DW$521, DW_AT_TI_symbol_name("keyIdLookupEntries")
    5485                            .dwattr $C$DW$521, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5486                            .dwattr $C$DW$521, DW_AT_accessibility(DW_ACCESS_public)
    5487                            .dwattr $C$DW$521, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    5488                            .dwattr $C$DW$521, DW_AT_decl_line(0x2cd)
    5489                            .dwattr $C$DW$521, DW_AT_decl_column(0x1c)
    5490                    
    5491                    $C$DW$522       .dwtag  DW_TAG_member
    5492                            .dwattr $C$DW$522, DW_AT_type(*$C$DW$T$53)
    5493                            .dwattr $C$DW$522, DW_AT_name("keyDeviceList")
    5494                            .dwattr $C$DW$522, DW_AT_TI_symbol_name("keyDeviceList")
    5495                            .dwattr $C$DW$522, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5496                            .dwattr $C$DW$522, DW_AT_accessibility(DW_ACCESS_public)
    5497                            .dwattr $C$DW$522, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    5498                            .dwattr $C$DW$522, DW_AT_decl_line(0x2cf)
    5499                            .dwattr $C$DW$522, DW_AT_decl_column(0x1d)
    5500                    
    5501                    $C$DW$523       .dwtag  DW_TAG_member
    5502                            .dwattr $C$DW$523, DW_AT_type(*$C$DW$T$19)
    5503                            .dwattr $C$DW$523, DW_AT_name("keyDeviceListEntries")
    5504                            .dwattr $C$DW$523, DW_AT_TI_symbol_name("keyDeviceListEntries")
    5505                            .dwattr $C$DW$523, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5506                            .dwattr $C$DW$523, DW_AT_accessibility(DW_ACCESS_public)
    5507                            .dwattr $C$DW$523, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    5508                            .dwattr $C$DW$523, DW_AT_decl_line(0x2d2)
    5509                            .dwattr $C$DW$523, DW_AT_decl_column(0x1c)
    5510                    
    5511                    $C$DW$524       .dwtag  DW_TAG_member
    5512                            .dwattr $C$DW$524, DW_AT_type(*$C$DW$T$55)
    5513                            .dwattr $C$DW$524, DW_AT_name("keyUsageList")
    5514                            .dwattr $C$DW$524, DW_AT_TI_symbol_name("keyUsageList")
    5515                            .dwattr $C$DW$524, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5516                            .dwattr $C$DW$524, DW_AT_accessibility(DW_ACCESS_public)
    5517                            .dwattr $C$DW$524, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    5518                            .dwattr $C$DW$524, DW_AT_decl_line(0x2d4)
    5519                            .dwattr $C$DW$524, DW_AT_decl_column(0x1d)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:20 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{3EBD5339-172C-4C2D-AFBF-B091C3B4C90F} PAGE  102

    5520                    
    5521                    $C$DW$525       .dwtag  DW_TAG_member
    5522                            .dwattr $C$DW$525, DW_AT_type(*$C$DW$T$19)
    5523                            .dwattr $C$DW$525, DW_AT_name("keyUsageListEntries")
    5524                            .dwattr $C$DW$525, DW_AT_TI_symbol_name("keyUsageListEntries")
    5525                            .dwattr $C$DW$525, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    5526                            .dwattr $C$DW$525, DW_AT_accessibility(DW_ACCESS_public)
    5527                            .dwattr $C$DW$525, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    5528                            .dwattr $C$DW$525, DW_AT_decl_line(0x2d6)
    5529                            .dwattr $C$DW$525, DW_AT_decl_column(0x1c)
    5530                    
    5531                    $C$DW$526       .dwtag  DW_TAG_member
    5532                            .dwattr $C$DW$526, DW_AT_type(*$C$DW$T$56)
    5533                            .dwattr $C$DW$526, DW_AT_name("key")
    5534                            .dwattr $C$DW$526, DW_AT_TI_symbol_name("key")
    5535                            .dwattr $C$DW$526, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    5536                            .dwattr $C$DW$526, DW_AT_accessibility(DW_ACCESS_public)
    5537                            .dwattr $C$DW$526, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    5538                            .dwattr $C$DW$526, DW_AT_decl_line(0x2d8)
    5539                            .dwattr $C$DW$526, DW_AT_decl_column(0x1c)
    5540                    
    5541                    $C$DW$527       .dwtag  DW_TAG_member
    5542                            .dwattr $C$DW$527, DW_AT_type(*$C$DW$T$41)
    5543                            .dwattr $C$DW$527, DW_AT_name("frameCounter")
    5544                            .dwattr $C$DW$527, DW_AT_TI_symbol_name("frameCounter")
    5545                            .dwattr $C$DW$527, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    5546                            .dwattr $C$DW$527, DW_AT_accessibility(DW_ACCESS_public)
    5547                            .dwattr $C$DW$527, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    5548                            .dwattr $C$DW$527, DW_AT_decl_line(0x2d9)
    5549                            .dwattr $C$DW$527, DW_AT_decl_column(0x1c)
    5550                    
    5551                            .dwattr $C$DW$T$57, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/M
    5552                            .dwattr $C$DW$T$57, DW_AT_decl_line(0x2cb)
    5553                            .dwattr $C$DW$T$57, DW_AT_decl_column(0x01)
    5554                            .dwendtag $C$DW$T$57
    5555                    
    5556                    $C$DW$T$70      .dwtag  DW_TAG_typedef
    5557                            .dwattr $C$DW$T$70, DW_AT_name("keyDescriptor_t")
    5558                            .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$57)
    5559                            .dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)
    5560                            .dwattr $C$DW$T$70, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/M
    5561                            .dwattr $C$DW$T$70, DW_AT_decl_line(0x2dc)
    5562                            .dwattr $C$DW$T$70, DW_AT_decl_column(0x03)
    5563                    
    5564                    $C$DW$T$71      .dwtag  DW_TAG_pointer_type
    5565                            .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$70)
    5566                            .dwattr $C$DW$T$71, DW_AT_address_class(0x20)
    5567                    
    5568                    
    5569                    $C$DW$T$175     .dwtag  DW_TAG_array_type
    5570                            .dwattr $C$DW$T$175, DW_AT_type(*$C$DW$T$70)
    5571                            .dwattr $C$DW$T$175, DW_AT_language(DW_LANG_C)
    5572                            .dwattr $C$DW$T$175, DW_AT_byte_size(0x58)
    5573                    $C$DW$528       .dwtag  DW_TAG_subrange_type
    5574                            .dwattr $C$DW$528, DW_AT_upper_bound(0x01)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:20 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{3EBD5339-172C-4C2D-AFBF-B091C3B4C90F} PAGE  103

    5575                    
    5576                            .dwendtag $C$DW$T$175
    5577                    
    5578                    
    5579                    $C$DW$T$59      .dwtag  DW_TAG_structure_type
    5580                            .dwattr $C$DW$T$59, DW_AT_byte_size(0x18)
    5581                    $C$DW$529       .dwtag  DW_TAG_member
    5582                            .dwattr $C$DW$529, DW_AT_type(*$C$DW$T$32)
    5583                            .dwattr $C$DW$529, DW_AT_name("panID")
    5584                            .dwattr $C$DW$529, DW_AT_TI_symbol_name("panID")
    5585                            .dwattr $C$DW$529, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5586                            .dwattr $C$DW$529, DW_AT_accessibility(DW_ACCESS_public)
    5587                            .dwattr $C$DW$529, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    5588                            .dwattr $C$DW$529, DW_AT_decl_line(0x2e1)
    5589                            .dwattr $C$DW$529, DW_AT_decl_column(0x16)
    5590                    
    5591                    $C$DW$530       .dwtag  DW_TAG_member
    5592                            .dwattr $C$DW$530, DW_AT_type(*$C$DW$T$32)
    5593                            .dwattr $C$DW$530, DW_AT_name("shortAddress")
    5594                            .dwattr $C$DW$530, DW_AT_TI_symbol_name("shortAddress")
    5595                            .dwattr $C$DW$530, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5596                            .dwattr $C$DW$530, DW_AT_accessibility(DW_ACCESS_public)
    5597                            .dwattr $C$DW$530, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    5598                            .dwattr $C$DW$530, DW_AT_decl_line(0x2e2)
    5599                            .dwattr $C$DW$530, DW_AT_decl_column(0x16)
    5600                    
    5601                    $C$DW$531       .dwtag  DW_TAG_member
    5602                            .dwattr $C$DW$531, DW_AT_type(*$C$DW$T$21)
    5603                            .dwattr $C$DW$531, DW_AT_name("extAddress")
    5604                            .dwattr $C$DW$531, DW_AT_TI_symbol_name("extAddress")
    5605                            .dwattr $C$DW$531, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5606                            .dwattr $C$DW$531, DW_AT_accessibility(DW_ACCESS_public)
    5607                            .dwattr $C$DW$531, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    5608                            .dwattr $C$DW$531, DW_AT_decl_line(0x2e3)
    5609                            .dwattr $C$DW$531, DW_AT_decl_column(0x16)
    5610                    
    5611                    $C$DW$532       .dwtag  DW_TAG_member
    5612                            .dwattr $C$DW$532, DW_AT_type(*$C$DW$T$58)
    5613                            .dwattr $C$DW$532, DW_AT_name("frameCounter")
    5614                            .dwattr $C$DW$532, DW_AT_TI_symbol_name("frameCounter")
    5615                            .dwattr $C$DW$532, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5616                            .dwattr $C$DW$532, DW_AT_accessibility(DW_ACCESS_public)
    5617                            .dwattr $C$DW$532, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    5618                            .dwattr $C$DW$532, DW_AT_decl_line(0x2e7)
    5619                            .dwattr $C$DW$532, DW_AT_decl_column(0x16)
    5620                    
    5621                    $C$DW$533       .dwtag  DW_TAG_member
    5622                            .dwattr $C$DW$533, DW_AT_type(*$C$DW$T$47)
    5623                            .dwattr $C$DW$533, DW_AT_name("exempt")
    5624                            .dwattr $C$DW$533, DW_AT_TI_symbol_name("exempt")
    5625                            .dwattr $C$DW$533, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    5626                            .dwattr $C$DW$533, DW_AT_accessibility(DW_ACCESS_public)
    5627                            .dwattr $C$DW$533, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    5628                            .dwattr $C$DW$533, DW_AT_decl_line(0x2eb)
    5629                            .dwattr $C$DW$533, DW_AT_decl_column(0x16)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:20 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{3EBD5339-172C-4C2D-AFBF-B091C3B4C90F} PAGE  104

    5630                    
    5631                            .dwattr $C$DW$T$59, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/M
    5632                            .dwattr $C$DW$T$59, DW_AT_decl_line(0x2e0)
    5633                            .dwattr $C$DW$T$59, DW_AT_decl_column(0x01)
    5634                            .dwendtag $C$DW$T$59
    5635                    
    5636                    $C$DW$T$65      .dwtag  DW_TAG_typedef
    5637                            .dwattr $C$DW$T$65, DW_AT_name("deviceDescriptor_t")
    5638                            .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$59)
    5639                            .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
    5640                            .dwattr $C$DW$T$65, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/M
    5641                            .dwattr $C$DW$T$65, DW_AT_decl_line(0x2ed)
    5642                            .dwattr $C$DW$T$65, DW_AT_decl_column(0x03)
    5643                    
    5644                    
    5645                    $C$DW$T$182     .dwtag  DW_TAG_array_type
    5646                            .dwattr $C$DW$T$182, DW_AT_type(*$C$DW$T$65)
    5647                            .dwattr $C$DW$T$182, DW_AT_language(DW_LANG_C)
    5648                            .dwattr $C$DW$T$182, DW_AT_byte_size(0x48)
    5649                    $C$DW$534       .dwtag  DW_TAG_subrange_type
    5650                            .dwattr $C$DW$534, DW_AT_upper_bound(0x02)
    5651                    
    5652                            .dwendtag $C$DW$T$182
    5653                    
    5654                    
    5655                    $C$DW$T$60      .dwtag  DW_TAG_structure_type
    5656                            .dwattr $C$DW$T$60, DW_AT_byte_size(0x04)
    5657                    $C$DW$535       .dwtag  DW_TAG_member
    5658                            .dwattr $C$DW$535, DW_AT_type(*$C$DW$T$19)
    5659                            .dwattr $C$DW$535, DW_AT_name("frameType")
    5660                            .dwattr $C$DW$535, DW_AT_TI_symbol_name("frameType")
    5661                            .dwattr $C$DW$535, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5662                            .dwattr $C$DW$535, DW_AT_accessibility(DW_ACCESS_public)
    5663                            .dwattr $C$DW$535, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    5664                            .dwattr $C$DW$535, DW_AT_decl_line(0x2f2)
    5665                            .dwattr $C$DW$535, DW_AT_decl_column(0x16)
    5666                    
    5667                    $C$DW$536       .dwtag  DW_TAG_member
