TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:22 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{298C6C55-A6D8-4825-9CB5-B337223AA8E5} PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                        PC v16.9.4.LTS *
       3                    ;* Date/Time created: Sat Nov 18 18:46:22 2017                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../Application/MAC/HAL/target/hal_ccm.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v16.9.4.LTS Copyright (c) 1996-20
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Kevin\workspace_v7\sensor_cc1310lp\sensor_cc1310lp"
      13                    
      14                    $C$DW$1 .dwtag  DW_TAG_subprogram

     742                            .dwattr $C$DW$84, DW_AT_name("FAPI_ERASE_BANK")
     743                            .dwattr $C$DW$84, DW_AT_const_value(0x08)
     744                            .dwattr $C$DW$84, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/cc
     745                            .dwattr $C$DW$84, DW_AT_decl_line(0xa8)
     746                            .dwattr $C$DW$84, DW_AT_decl_column(0x05)
     747                    
     748                    $C$DW$85        .dwtag  DW_TAG_enumerator
     749                            .dwattr $C$DW$85, DW_AT_name("FAPI_VALIDATE_SECTOR")
     750                            .dwattr $C$DW$85, DW_AT_const_value(0x0e)
     751                            .dwattr $C$DW$85, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/cc
     752                            .dwattr $C$DW$85, DW_AT_decl_line(0xa9)
     753                            .dwattr $C$DW$85, DW_AT_decl_column(0x05)
     754                    
     755                    $C$DW$86        .dwtag  DW_TAG_enumerator
     756                            .dwattr $C$DW$86, DW_AT_name("FAPI_CLEAR_STATUS")
     757                            .dwattr $C$DW$86, DW_AT_const_value(0x10)
     758                            .dwattr $C$DW$86, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/cc
     759                            .dwattr $C$DW$86, DW_AT_decl_line(0xaa)
     760                            .dwattr $C$DW$86, DW_AT_decl_column(0x05)
     761                    
     762                    $C$DW$87        .dwtag  DW_TAG_enumerator
     763                            .dwattr $C$DW$87, DW_AT_name("FAPI_PROGRAM_RESUME")
     764                            .dwattr $C$DW$87, DW_AT_const_value(0x14)
     765                            .dwattr $C$DW$87, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/cc
     766                            .dwattr $C$DW$87, DW_AT_decl_line(0xab)
     767                            .dwattr $C$DW$87, DW_AT_decl_column(0x05)
     768                    
     769                    $C$DW$88        .dwtag  DW_TAG_enumerator
     770                            .dwattr $C$DW$88, DW_AT_name("FAPI_ERASE_RESUME")
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:22 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{298C6C55-A6D8-4825-9CB5-B337223AA8E5} PAGE   15

     771                            .dwattr $C$DW$88, DW_AT_const_value(0x16)
     772                            .dwattr $C$DW$88, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/cc
     773                            .dwattr $C$DW$88, DW_AT_decl_line(0xac)
     774                            .dwattr $C$DW$88, DW_AT_decl_column(0x05)
     775                    
     776                    $C$DW$89        .dwtag  DW_TAG_enumerator
     777                            .dwattr $C$DW$89, DW_AT_name("FAPI_CLEAR_MORE")
     778                            .dwattr $C$DW$89, DW_AT_const_value(0x18)
     779                            .dwattr $C$DW$89, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/cc
     780                            .dwattr $C$DW$89, DW_AT_decl_line(0xad)
     781                            .dwattr $C$DW$89, DW_AT_decl_column(0x05)
     782                    
     783                    $C$DW$90        .dwtag  DW_TAG_enumerator
     784                            .dwattr $C$DW$90, DW_AT_name("FAPI_PROGRAM_SECTOR")
     785                            .dwattr $C$DW$90, DW_AT_const_value(0x20)
     786                            .dwattr $C$DW$90, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/cc
     787                            .dwattr $C$DW$90, DW_AT_decl_line(0xae)
     788                            .dwattr $C$DW$90, DW_AT_decl_column(0x05)
     789                    
     790                    $C$DW$91        .dwtag  DW_TAG_enumerator
     791                            .dwattr $C$DW$91, DW_AT_name("FAPI_ERASE_OTP")
     792                            .dwattr $C$DW$91, DW_AT_const_value(0x30)
     793                            .dwattr $C$DW$91, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/cc
     794                            .dwattr $C$DW$91, DW_AT_decl_line(0xaf)
     795                            .dwattr $C$DW$91, DW_AT_decl_column(0x05)
     796                    
     797                            .dwattr $C$DW$T$171, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices
     798                            .dwattr $C$DW$T$171, DW_AT_decl_line(0xa5)
     799                            .dwattr $C$DW$T$171, DW_AT_decl_column(0x01)
     800                            .dwendtag $C$DW$T$171
     801                    
     802                    $C$DW$T$172     .dwtag  DW_TAG_typedef
     803                            .dwattr $C$DW$T$172, DW_AT_name("tFlashStateCommandsType")
     804                            .dwattr $C$DW$T$172, DW_AT_type(*$C$DW$T$171)
     805                            .dwattr $C$DW$T$172, DW_AT_language(DW_LANG_C)
     806                            .dwattr $C$DW$T$172, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices
     807                            .dwattr $C$DW$T$172, DW_AT_decl_line(0xb0)
     808                            .dwattr $C$DW$T$172, DW_AT_decl_column(0x03)
     809                    
     810                    
     811                    $C$DW$T$19      .dwtag  DW_TAG_structure_type
     812                            .dwattr $C$DW$T$19, DW_AT_byte_size(0x08)
     813                    $C$DW$92        .dwtag  DW_TAG_member
     814                            .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$10)
     815                            .dwattr $C$DW$92, DW_AT_name("quot")
     816                            .dwattr $C$DW$92, DW_AT_TI_symbol_name("quot")
     817                            .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     818                            .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
     819                            .dwattr $C$DW$92, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/st
     820                            .dwattr $C$DW$92, DW_AT_decl_line(0x5c)
     821                            .dwattr $C$DW$92, DW_AT_decl_column(0x16)
     822                    
     823                    $C$DW$93        .dwtag  DW_TAG_member
     824                            .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$10)
     825                            .dwattr $C$DW$93, DW_AT_name("rem")
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:22 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{298C6C55-A6D8-4825-9CB5-B337223AA8E5} PAGE   16

     826                            .dwattr $C$DW$93, DW_AT_TI_symbol_name("rem")
     827                            .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     828                            .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
     829                            .dwattr $C$DW$93, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/st
     830                            .dwattr $C$DW$93, DW_AT_decl_line(0x5c)
     831                            .dwattr $C$DW$93, DW_AT_decl_column(0x1c)
     832                    
     833                            .dwattr $C$DW$T$19, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/
     834                            .dwattr $C$DW$T$19, DW_AT_decl_line(0x5c)
     835                            .dwattr $C$DW$T$19, DW_AT_decl_column(0x10)
     836                            .dwendtag $C$DW$T$19
     837                    
     838                    $C$DW$T$173     .dwtag  DW_TAG_typedef
     839                            .dwattr $C$DW$T$173, DW_AT_name("div_t")
     840                            .dwattr $C$DW$T$173, DW_AT_type(*$C$DW$T$19)
     841                            .dwattr $C$DW$T$173, DW_AT_language(DW_LANG_C)
     842                            .dwattr $C$DW$T$173, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include
     843                            .dwattr $C$DW$T$173, DW_AT_decl_line(0x5c)
     844                            .dwattr $C$DW$T$173, DW_AT_decl_column(0x23)
     845                    
     846                    
     847                    $C$DW$T$20      .dwtag  DW_TAG_structure_type
     848                            .dwattr $C$DW$T$20, DW_AT_byte_size(0x08)
     849                    $C$DW$94        .dwtag  DW_TAG_member
     850                            .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$10)
     851                            .dwattr $C$DW$94, DW_AT_name("quot")
     852                            .dwattr $C$DW$94, DW_AT_TI_symbol_name("quot")
     853                            .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     854                            .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
     855                            .dwattr $C$DW$94, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/st
     856                            .dwattr $C$DW$94, DW_AT_decl_line(0x5e)
     857                            .dwattr $C$DW$94, DW_AT_decl_column(0x16)
     858                    
     859                    $C$DW$95        .dwtag  DW_TAG_member
     860                            .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$10)
     861                            .dwattr $C$DW$95, DW_AT_name("rem")
     862                            .dwattr $C$DW$95, DW_AT_TI_symbol_name("rem")
     863                            .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     864                            .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
     865                            .dwattr $C$DW$95, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/st
     866                            .dwattr $C$DW$95, DW_AT_decl_line(0x5e)
     867                            .dwattr $C$DW$95, DW_AT_decl_column(0x1c)
     868                    
     869                            .dwattr $C$DW$T$20, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/
     870                            .dwattr $C$DW$T$20, DW_AT_decl_line(0x5e)
     871                            .dwattr $C$DW$T$20, DW_AT_decl_column(0x10)
     872                            .dwendtag $C$DW$T$20
     873                    
     874                    $C$DW$T$174     .dwtag  DW_TAG_typedef
     875                            .dwattr $C$DW$T$174, DW_AT_name("ldiv_t")
     876                            .dwattr $C$DW$T$174, DW_AT_type(*$C$DW$T$20)
     877                            .dwattr $C$DW$T$174, DW_AT_language(DW_LANG_C)
     878                            .dwattr $C$DW$T$174, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include
     879                            .dwattr $C$DW$T$174, DW_AT_decl_line(0x5e)
     880                            .dwattr $C$DW$T$174, DW_AT_decl_column(0x23)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:22 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{298C6C55-A6D8-4825-9CB5-B337223AA8E5} PAGE   17

     881                    
     882                    
     883                    $C$DW$T$21      .dwtag  DW_TAG_structure_type
     884                            .dwattr $C$DW$T$21, DW_AT_byte_size(0x10)
     885                    $C$DW$96        .dwtag  DW_TAG_member
     886                            .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$14)
     887                            .dwattr $C$DW$96, DW_AT_name("quot")
     888                            .dwattr $C$DW$96, DW_AT_TI_symbol_name("quot")
     889                            .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     890                            .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
     891                            .dwattr $C$DW$96, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/st
     892                            .dwattr $C$DW$96, DW_AT_decl_line(0x61)
     893                            .dwattr $C$DW$96, DW_AT_decl_column(0x1c)
     894                    
     895                    $C$DW$97        .dwtag  DW_TAG_member
     896                            .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$14)
     897                            .dwattr $C$DW$97, DW_AT_name("rem")
     898                            .dwattr $C$DW$97, DW_AT_TI_symbol_name("rem")
     899                            .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     900                            .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
     901                            .dwattr $C$DW$97, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/st
     902                            .dwattr $C$DW$97, DW_AT_decl_line(0x61)
     903                            .dwattr $C$DW$97, DW_AT_decl_column(0x22)
     904                    
     905                            .dwattr $C$DW$T$21, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/
     906                            .dwattr $C$DW$T$21, DW_AT_decl_line(0x61)
     907                            .dwattr $C$DW$T$21, DW_AT_decl_column(0x10)
     908                            .dwendtag $C$DW$T$21
     909                    
     910                    $C$DW$T$175     .dwtag  DW_TAG_typedef
     911                            .dwattr $C$DW$T$175, DW_AT_name("lldiv_t")
     912                            .dwattr $C$DW$T$175, DW_AT_type(*$C$DW$T$21)
     913                            .dwattr $C$DW$T$175, DW_AT_language(DW_LANG_C)
     914                            .dwattr $C$DW$T$175, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include
     915                            .dwattr $C$DW$T$175, DW_AT_decl_line(0x61)
     916                            .dwattr $C$DW$T$175, DW_AT_decl_column(0x29)
     917                    
     918                    
     919                    $C$DW$T$26      .dwtag  DW_TAG_structure_type
     920                            .dwattr $C$DW$T$26, DW_AT_byte_size(0x08)
     921                    $C$DW$98        .dwtag  DW_TAG_member
     922                            .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$24)
     923                            .dwattr $C$DW$98, DW_AT_name("pointerStack")
     924                            .dwattr $C$DW$98, DW_AT_TI_symbol_name("pointerStack")
     925                            .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     926                            .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
     927                            .dwattr $C$DW$98, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stack
     928                            .dwattr $C$DW$98, DW_AT_decl_line(0x3f5)
     929                            .dwattr $C$DW$98, DW_AT_decl_column(0x16)
     930                    
     931                    $C$DW$99        .dwtag  DW_TAG_member
     932                            .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$25)
     933                            .dwattr $C$DW$99, DW_AT_name("directAPI")
     934                            .dwattr $C$DW$99, DW_AT_TI_symbol_name("directAPI")
     935                            .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:22 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{298C6C55-A6D8-4825-9CB5-B337223AA8E5} PAGE   18

     936                            .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
     937                            .dwattr $C$DW$99, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stack
     938                            .dwattr $C$DW$99, DW_AT_decl_line(0x3f6)
     939                            .dwattr $C$DW$99, DW_AT_decl_column(0x15)
     940                    
     941                            .dwattr $C$DW$T$26, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154sta
     942                            .dwattr $C$DW$T$26, DW_AT_decl_line(0x3f4)
     943                            .dwattr $C$DW$T$26, DW_AT_decl_column(0x01)
     944                            .dwendtag $C$DW$T$26
     945                    
     946                    $C$DW$T$28      .dwtag  DW_TAG_typedef
     947                            .dwattr $C$DW$T$28, DW_AT_name("icall_directAPIMsg_t")
     948                            .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$26)
     949                            .dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
     950                            .dwattr $C$DW$T$28, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154sta
     951                            .dwattr $C$DW$T$28, DW_AT_decl_line(0x3f7)
     952                            .dwattr $C$DW$T$28, DW_AT_decl_column(0x03)
     953                    
     954                    
     955                    $C$DW$T$29      .dwtag  DW_TAG_structure_type
     956                            .dwattr $C$DW$T$29, DW_AT_byte_size(0x14)
     957                    $C$DW$100       .dwtag  DW_TAG_member
     958                            .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$27)
     959                            .dwattr $C$DW$100, DW_AT_name("hdr")
     960                            .dwattr $C$DW$100, DW_AT_TI_symbol_name("hdr")
     961                            .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     962                            .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
     963                            .dwattr $C$DW$100, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
     964                            .dwattr $C$DW$100, DW_AT_decl_line(0x3fb)
     965                            .dwattr $C$DW$100, DW_AT_decl_column(0x10)
     966                    
     967                    $C$DW$101       .dwtag  DW_TAG_member
     968                            .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$28)
     969                            .dwattr $C$DW$101, DW_AT_name("msg")
     970                            .dwattr $C$DW$101, DW_AT_TI_symbol_name("msg")
     971                            .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     972                            .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
     973                            .dwattr $C$DW$101, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
     974                            .dwattr $C$DW$101, DW_AT_decl_line(0x3fc)
     975                            .dwattr $C$DW$101, DW_AT_decl_column(0x1a)
     976                    
     977                            .dwattr $C$DW$T$29, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154sta
     978                            .dwattr $C$DW$T$29, DW_AT_decl_line(0x3fa)
     979                            .dwattr $C$DW$T$29, DW_AT_decl_column(0x01)
     980                            .dwendtag $C$DW$T$29
     981                    
     982                    $C$DW$T$176     .dwtag  DW_TAG_typedef
     983                            .dwattr $C$DW$T$176, DW_AT_name("icallLiteMsg_t")
     984                            .dwattr $C$DW$T$176, DW_AT_type(*$C$DW$T$29)
     985                            .dwattr $C$DW$T$176, DW_AT_language(DW_LANG_C)
     986                            .dwattr $C$DW$T$176, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154st
     987                            .dwattr $C$DW$T$176, DW_AT_decl_line(0x3fd)
     988                            .dwattr $C$DW$T$176, DW_AT_decl_column(0x03)
     989                    
     990                    
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:22 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{298C6C55-A6D8-4825-9CB5-B337223AA8E5} PAGE   19

     991                    $C$DW$T$31      .dwtag  DW_TAG_structure_type
     992                            .dwattr $C$DW$T$31, DW_AT_byte_size(0x02)
     993                    $C$DW$102       .dwtag  DW_TAG_member
     994                            .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$30)
     995                            .dwattr $C$DW$102, DW_AT_name("event")
     996                            .dwattr $C$DW$102, DW_AT_TI_symbol_name("event")
     997                            .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     998                            .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
     999                            .dwattr $C$DW$102, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    1000                            .dwattr $C$DW$102, DW_AT_decl_line(0x79)
    1001                            .dwattr $C$DW$102, DW_AT_decl_column(0x0a)
    1002                    
    1003                    $C$DW$103       .dwtag  DW_TAG_member
    1004                            .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$30)
    1005                            .dwattr $C$DW$103, DW_AT_name("status")
    1006                            .dwattr $C$DW$103, DW_AT_TI_symbol_name("status")
    1007                            .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1008                            .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1009                            .dwattr $C$DW$103, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    1010                            .dwattr $C$DW$103, DW_AT_decl_line(0x7a)
    1011                            .dwattr $C$DW$103, DW_AT_decl_column(0x0a)
    1012                    
    1013                            .dwattr $C$DW$T$31, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/M
    1014                            .dwattr $C$DW$T$31, DW_AT_decl_line(0x78)
    1015                            .dwattr $C$DW$T$31, DW_AT_decl_column(0x01)
    1016                            .dwendtag $C$DW$T$31
    1017                    
    1018                    $C$DW$T$177     .dwtag  DW_TAG_typedef
    1019                            .dwattr $C$DW$T$177, DW_AT_name("osal_event_hdr_t")
    1020                            .dwattr $C$DW$T$177, DW_AT_type(*$C$DW$T$31)
    1021                            .dwattr $C$DW$T$177, DW_AT_language(DW_LANG_C)
    1022                            .dwattr $C$DW$T$177, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/
    1023                            .dwattr $C$DW$T$177, DW_AT_decl_line(0x7b)
    1024                            .dwattr $C$DW$T$177, DW_AT_decl_column(0x03)
    1025                    
    1026                    
    1027                    $C$DW$T$32      .dwtag  DW_TAG_structure_type
    1028                            .dwattr $C$DW$T$32, DW_AT_byte_size(0x0a)
    1029                    $C$DW$104       .dwtag  DW_TAG_member
    1030                            .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$87)
    1031                            .dwattr $C$DW$104, DW_AT_name("addr")
    1032                            .dwattr $C$DW$104, DW_AT_TI_symbol_name("addr")
    1033                            .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1034                            .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1035                            .dwattr $C$DW$104, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/Se
    1036                            .dwattr $C$DW$104, DW_AT_decl_line(0x52)
    1037                            .dwattr $C$DW$104, DW_AT_decl_column(0x05)
    1038                    
    1039                    $C$DW$105       .dwtag  DW_TAG_member
    1040                            .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$30)
    1041                            .dwattr $C$DW$105, DW_AT_name("addrMode")
    1042                            .dwattr $C$DW$105, DW_AT_TI_symbol_name("addrMode")
    1043                            .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1044                            .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1045                            .dwattr $C$DW$105, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/Se
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:22 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{298C6C55-A6D8-4825-9CB5-B337223AA8E5} PAGE   20

    1046                            .dwattr $C$DW$105, DW_AT_decl_line(0x53)
    1047                            .dwattr $C$DW$105, DW_AT_decl_column(0x11)
    1048                    
    1049                            .dwattr $C$DW$T$32, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/S
    1050                            .dwattr $C$DW$T$32, DW_AT_decl_line(0x4d)
    1051                            .dwattr $C$DW$T$32, DW_AT_decl_column(0x01)
    1052                            .dwendtag $C$DW$T$32
    1053                    
    1054                    $C$DW$T$178     .dwtag  DW_TAG_typedef
    1055                            .dwattr $C$DW$T$178, DW_AT_name("sAddr_t")
    1056                            .dwattr $C$DW$T$178, DW_AT_type(*$C$DW$T$32)
    1057                            .dwattr $C$DW$T$178, DW_AT_language(DW_LANG_C)
    1058                            .dwattr $C$DW$T$178, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/
    1059                            .dwattr $C$DW$T$178, DW_AT_decl_line(0x54)
    1060                            .dwattr $C$DW$T$178, DW_AT_decl_column(0x03)
    1061                    
    1062                    
    1063                    $C$DW$T$34      .dwtag  DW_TAG_structure_type
    1064                            .dwattr $C$DW$T$34, DW_AT_byte_size(0x0a)
    1065                    $C$DW$106       .dwtag  DW_TAG_member
    1066                            .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$90)
    1067                            .dwattr $C$DW$106, DW_AT_name("addr")
    1068                            .dwattr $C$DW$106, DW_AT_TI_symbol_name("addr")
    1069                            .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1070                            .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1071                            .dwattr $C$DW$106, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    1072                            .dwattr $C$DW$106, DW_AT_decl_line(0x139)
    1073                            .dwattr $C$DW$106, DW_AT_decl_column(0x05)
    1074                    
    1075                    $C$DW$107       .dwtag  DW_TAG_member
    1076                            .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$33)
    1077                            .dwattr $C$DW$107, DW_AT_name("addrMode")
    1078                            .dwattr $C$DW$107, DW_AT_TI_symbol_name("addrMode")
    1079                            .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1080                            .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1081                            .dwattr $C$DW$107, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    1082                            .dwattr $C$DW$107, DW_AT_decl_line(0x13a)
    1083                            .dwattr $C$DW$107, DW_AT_decl_column(0x08)
    1084                    
    1085                            .dwattr $C$DW$T$34, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154sta
    1086                            .dwattr $C$DW$T$34, DW_AT_decl_line(0x134)
    1087                            .dwattr $C$DW$T$34, DW_AT_decl_column(0x01)
    1088                            .dwendtag $C$DW$T$34
    1089                    
    1090                    $C$DW$T$179     .dwtag  DW_TAG_typedef
    1091                            .dwattr $C$DW$T$179, DW_AT_name("zAddrType_t")
    1092                            .dwattr $C$DW$T$179, DW_AT_type(*$C$DW$T$34)
    1093                            .dwattr $C$DW$T$179, DW_AT_language(DW_LANG_C)
    1094                            .dwattr $C$DW$T$179, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154st
    1095                            .dwattr $C$DW$T$179, DW_AT_decl_line(0x13b)
    1096                            .dwattr $C$DW$T$179, DW_AT_decl_column(0x03)
    1097                    
    1098                    
    1099                    $C$DW$T$37      .dwtag  DW_TAG_structure_type
    1100                            .dwattr $C$DW$T$37, DW_AT_byte_size(0x0c)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:22 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{298C6C55-A6D8-4825-9CB5-B337223AA8E5} PAGE   21

    1101                    $C$DW$108       .dwtag  DW_TAG_member
    1102                            .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$30)
    1103                            .dwattr $C$DW$108, DW_AT_name("txCounter")
    1104                            .dwattr $C$DW$108, DW_AT_TI_symbol_name("txCounter")
    1105                            .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1106                            .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1107                            .dwattr $C$DW$108, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    1108                            .dwattr $C$DW$108, DW_AT_decl_line(0x198)
    1109                            .dwattr $C$DW$108, DW_AT_decl_column(0x0a)
    1110                    
    1111                    $C$DW$109       .dwtag  DW_TAG_member
    1112                            .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$30)
    1113                            .dwattr $C$DW$109, DW_AT_name("txCost")
    1114                            .dwattr $C$DW$109, DW_AT_TI_symbol_name("txCost")
    1115                            .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1116                            .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1117                            .dwattr $C$DW$109, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    1118                            .dwattr $C$DW$109, DW_AT_decl_line(0x199)
    1119                            .dwattr $C$DW$109, DW_AT_decl_column(0x0a)
    1120                    
    1121                    $C$DW$110       .dwtag  DW_TAG_member
    1122                            .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$30)
    1123                            .dwattr $C$DW$110, DW_AT_name("rxLqi")
    1124                            .dwattr $C$DW$110, DW_AT_TI_symbol_name("rxLqi")
    1125                            .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1126                            .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1127                            .dwattr $C$DW$110, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    1128                            .dwattr $C$DW$110, DW_AT_decl_line(0x19b)
    1129                            .dwattr $C$DW$110, DW_AT_decl_column(0x0a)
    1130                    
    1131                    $C$DW$111       .dwtag  DW_TAG_member
    1132                            .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$30)
    1133                            .dwattr $C$DW$111, DW_AT_name("inKeySeqNum")
    1134                            .dwattr $C$DW$111, DW_AT_TI_symbol_name("inKeySeqNum")
    1135                            .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1136                            .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1137                            .dwattr $C$DW$111, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    1138                            .dwattr $C$DW$111, DW_AT_decl_line(0x19d)
    1139                            .dwattr $C$DW$111, DW_AT_decl_column(0x0a)
    1140                    
    1141                    $C$DW$112       .dwtag  DW_TAG_member
    1142                            .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$35)
    1143                            .dwattr $C$DW$112, DW_AT_name("inFrmCntr")
    1144                            .dwattr $C$DW$112, DW_AT_TI_symbol_name("inFrmCntr")
    1145                            .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1146                            .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1147                            .dwattr $C$DW$112, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    1148                            .dwattr $C$DW$112, DW_AT_decl_line(0x19e)
    1149                            .dwattr $C$DW$112, DW_AT_decl_column(0x0a)
    1150                    
    1151                    $C$DW$113       .dwtag  DW_TAG_member
    1152                            .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$36)
    1153                            .dwattr $C$DW$113, DW_AT_name("txFailure")
    1154                            .dwattr $C$DW$113, DW_AT_TI_symbol_name("txFailure")
    1155                            .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:22 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{298C6C55-A6D8-4825-9CB5-B337223AA8E5} PAGE   22

    1156                            .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1157                            .dwattr $C$DW$113, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    1158                            .dwattr $C$DW$113, DW_AT_decl_line(0x19f)
    1159                            .dwattr $C$DW$113, DW_AT_decl_column(0x0a)
    1160                    
    1161                            .dwattr $C$DW$T$37, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154sta
    1162                            .dwattr $C$DW$T$37, DW_AT_decl_line(0x197)
    1163                            .dwattr $C$DW$T$37, DW_AT_decl_column(0x01)
    1164                            .dwendtag $C$DW$T$37
    1165                    
    1166                    $C$DW$T$180     .dwtag  DW_TAG_typedef
    1167                            .dwattr $C$DW$T$180, DW_AT_name("linkInfo_t")
    1168                            .dwattr $C$DW$T$180, DW_AT_type(*$C$DW$T$37)
    1169                            .dwattr $C$DW$T$180, DW_AT_language(DW_LANG_C)
    1170                            .dwattr $C$DW$T$180, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154st
    1171                            .dwattr $C$DW$T$180, DW_AT_decl_line(0x1a0)
    1172                            .dwattr $C$DW$T$180, DW_AT_decl_column(0x03)
    1173                    
    1174                    
    1175                    $C$DW$T$78      .dwtag  DW_TAG_structure_type
    1176                            .dwattr $C$DW$T$78, DW_AT_byte_size(0x4c)
    1177                    $C$DW$114       .dwtag  DW_TAG_member
    1178                            .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$42)
    1179                            .dwattr $C$DW$114, DW_AT_name("Crc32")
    1180                            .dwattr $C$DW$114, DW_AT_TI_symbol_name("Crc32")
    1181                            .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1182                            .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1183                            .dwattr $C$DW$114, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    1184                            .dwattr $C$DW$114, DW_AT_decl_line(0x76)
    1185                            .dwattr $C$DW$114, DW_AT_decl_column(0x25)
    1186                    
    1187                    $C$DW$115       .dwtag  DW_TAG_member
    1188                            .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$45)
    1189                            .dwattr $C$DW$115, DW_AT_name("FlashGetSize")
    1190                            .dwattr $C$DW$115, DW_AT_TI_symbol_name("FlashGetSize")
    1191                            .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1192                            .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1193                            .dwattr $C$DW$115, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    1194                            .dwattr $C$DW$115, DW_AT_decl_line(0x77)
    1195                            .dwattr $C$DW$115, DW_AT_decl_column(0x25)
    1196                    
    1197                    $C$DW$116       .dwtag  DW_TAG_member
    1198                            .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$46)
    1199                            .dwattr $C$DW$116, DW_AT_name("GetChipId")
    1200                            .dwattr $C$DW$116, DW_AT_TI_symbol_name("GetChipId")
    1201                            .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1202                            .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1203                            .dwattr $C$DW$116, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    1204                            .dwattr $C$DW$116, DW_AT_decl_line(0x78)
    1205                            .dwattr $C$DW$116, DW_AT_decl_column(0x25)
    1206                    
    1207                    $C$DW$117       .dwtag  DW_TAG_member
    1208                            .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$49)
    1209                            .dwattr $C$DW$117, DW_AT_name("ReservedLocation1")
    1210                            .dwattr $C$DW$117, DW_AT_TI_symbol_name("ReservedLocation1")
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:22 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{298C6C55-A6D8-4825-9CB5-B337223AA8E5} PAGE   23

    1211                            .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1212                            .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1213                            .dwattr $C$DW$117, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    1214                            .dwattr $C$DW$117, DW_AT_decl_line(0x79)
    1215                            .dwattr $C$DW$117, DW_AT_decl_column(0x25)
    1216                    
    1217                    $C$DW$118       .dwtag  DW_TAG_member
    1218                            .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$50)
    1219                            .dwattr $C$DW$118, DW_AT_name("ReservedLocation2")
    1220                            .dwattr $C$DW$118, DW_AT_TI_symbol_name("ReservedLocation2")
    1221                            .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1222                            .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1223                            .dwattr $C$DW$118, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    1224                            .dwattr $C$DW$118, DW_AT_decl_line(0x7a)
    1225                            .dwattr $C$DW$118, DW_AT_decl_column(0x25)
    1226                    
    1227                    $C$DW$119       .dwtag  DW_TAG_member
    1228                            .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$51)
    1229                            .dwattr $C$DW$119, DW_AT_name("ReservedLocation3")
    1230                            .dwattr $C$DW$119, DW_AT_TI_symbol_name("ReservedLocation3")
    1231                            .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1232                            .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1233                            .dwattr $C$DW$119, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    1234                            .dwattr $C$DW$119, DW_AT_decl_line(0x7b)
    1235                            .dwattr $C$DW$119, DW_AT_decl_column(0x25)
    1236                    
    1237                    $C$DW$120       .dwtag  DW_TAG_member
    1238                            .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$54)
    1239                            .dwattr $C$DW$120, DW_AT_name("ResetDevice")
    1240                            .dwattr $C$DW$120, DW_AT_TI_symbol_name("ResetDevice")
    1241                            .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1242                            .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1243                            .dwattr $C$DW$120, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    1244                            .dwattr $C$DW$120, DW_AT_decl_line(0x7c)
    1245                            .dwattr $C$DW$120, DW_AT_decl_column(0x25)
    1246                    
    1247                    $C$DW$121       .dwtag  DW_TAG_member
    1248                            .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$59)
    1249                            .dwattr $C$DW$121, DW_AT_name("Fletcher32")
    1250                            .dwattr $C$DW$121, DW_AT_TI_symbol_name("Fletcher32")
    1251                            .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1252                            .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1253                            .dwattr $C$DW$121, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    1254                            .dwattr $C$DW$121, DW_AT_decl_line(0x7d)
    1255                            .dwattr $C$DW$121, DW_AT_decl_column(0x25)
    1256                    
    1257                    $C$DW$122       .dwtag  DW_TAG_member
    1258                            .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$63)
    1259                            .dwattr $C$DW$122, DW_AT_name("MinValue")
    1260                            .dwattr $C$DW$122, DW_AT_TI_symbol_name("MinValue")
    1261                            .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1262                            .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1263                            .dwattr $C$DW$122, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    1264                            .dwattr $C$DW$122, DW_AT_decl_line(0x7e)
    1265                            .dwattr $C$DW$122, DW_AT_decl_column(0x25)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:22 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{298C6C55-A6D8-4825-9CB5-B337223AA8E5} PAGE   24

    1266                    
    1267                    $C$DW$123       .dwtag  DW_TAG_member
    1268                            .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$64)
    1269                            .dwattr $C$DW$123, DW_AT_name("MaxValue")
    1270                            .dwattr $C$DW$123, DW_AT_TI_symbol_name("MaxValue")
    1271                            .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1272                            .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1273                            .dwattr $C$DW$123, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    1274                            .dwattr $C$DW$123, DW_AT_decl_line(0x7f)
    1275                            .dwattr $C$DW$123, DW_AT_decl_column(0x25)
    1276                    
    1277                    $C$DW$124       .dwtag  DW_TAG_member
    1278                            .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$65)
    1279                            .dwattr $C$DW$124, DW_AT_name("MeanValue")
    1280                            .dwattr $C$DW$124, DW_AT_TI_symbol_name("MeanValue")
    1281                            .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    1282                            .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1283                            .dwattr $C$DW$124, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    1284                            .dwattr $C$DW$124, DW_AT_decl_line(0x80)
    1285                            .dwattr $C$DW$124, DW_AT_decl_column(0x25)
    1286                    
    1287                    $C$DW$125       .dwtag  DW_TAG_member
    1288                            .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$66)
    1289                            .dwattr $C$DW$125, DW_AT_name("StandDeviationValue")
    1290                            .dwattr $C$DW$125, DW_AT_TI_symbol_name("StandDeviationValue")
    1291                            .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    1292                            .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1293                            .dwattr $C$DW$125, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    1294                            .dwattr $C$DW$125, DW_AT_decl_line(0x81)
    1295                            .dwattr $C$DW$125, DW_AT_decl_column(0x25)
    1296                    
    1297                    $C$DW$126       .dwtag  DW_TAG_member
    1298                            .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$69)
    1299                            .dwattr $C$DW$126, DW_AT_name("ReservedLocation4")
    1300                            .dwattr $C$DW$126, DW_AT_TI_symbol_name("ReservedLocation4")
    1301                            .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    1302                            .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1303                            .dwattr $C$DW$126, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    1304                            .dwattr $C$DW$126, DW_AT_decl_line(0x82)
    1305                            .dwattr $C$DW$126, DW_AT_decl_column(0x25)
    1306                    
    1307                    $C$DW$127       .dwtag  DW_TAG_member
    1308                            .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$70)
    1309                            .dwattr $C$DW$127, DW_AT_name("ReservedLocation5")
    1310                            .dwattr $C$DW$127, DW_AT_TI_symbol_name("ReservedLocation5")
    1311                            .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    1312                            .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1313                            .dwattr $C$DW$127, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    1314                            .dwattr $C$DW$127, DW_AT_decl_line(0x83)
    1315                            .dwattr $C$DW$127, DW_AT_decl_column(0x25)
    1316                    
    1317                    $C$DW$128       .dwtag  DW_TAG_member
    1318                            .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$71)
    1319                            .dwattr $C$DW$128, DW_AT_name("HFSourceSafeSwitch")
    1320                            .dwattr $C$DW$128, DW_AT_TI_symbol_name("HFSourceSafeSwitch")
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:22 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{298C6C55-A6D8-4825-9CB5-B337223AA8E5} PAGE   25

    1321                            .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    1322                            .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1323                            .dwattr $C$DW$128, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    1324                            .dwattr $C$DW$128, DW_AT_decl_line(0x84)
    1325                            .dwattr $C$DW$128, DW_AT_decl_column(0x25)
    1326                    
    1327                    $C$DW$129       .dwtag  DW_TAG_member
    1328                            .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$74)
    1329                            .dwattr $C$DW$129, DW_AT_name("SelectCompAInput")
    1330                            .dwattr $C$DW$129, DW_AT_TI_symbol_name("SelectCompAInput")
    1331                            .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    1332                            .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1333                            .dwattr $C$DW$129, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    1334                            .dwattr $C$DW$129, DW_AT_decl_line(0x85)
    1335                            .dwattr $C$DW$129, DW_AT_decl_column(0x25)
    1336                    
    1337                    $C$DW$130       .dwtag  DW_TAG_member
    1338                            .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$75)
    1339                            .dwattr $C$DW$130, DW_AT_name("SelectCompARef")
    1340                            .dwattr $C$DW$130, DW_AT_TI_symbol_name("SelectCompARef")
    1341                            .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    1342                            .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1343                            .dwattr $C$DW$130, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    1344                            .dwattr $C$DW$130, DW_AT_decl_line(0x86)
    1345                            .dwattr $C$DW$130, DW_AT_decl_column(0x25)
    1346                    
    1347                    $C$DW$131       .dwtag  DW_TAG_member
    1348                            .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$76)
    1349                            .dwattr $C$DW$131, DW_AT_name("SelectADCCompBInput")
    1350                            .dwattr $C$DW$131, DW_AT_TI_symbol_name("SelectADCCompBInput")
    1351                            .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    1352                            .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1353                            .dwattr $C$DW$131, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    1354                            .dwattr $C$DW$131, DW_AT_decl_line(0x87)
    1355                            .dwattr $C$DW$131, DW_AT_decl_column(0x25)
    1356                    
    1357                    $C$DW$132       .dwtag  DW_TAG_member
    1358                            .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$77)
    1359                            .dwattr $C$DW$132, DW_AT_name("SelectCompBRef")
    1360                            .dwattr $C$DW$132, DW_AT_TI_symbol_name("SelectCompBRef")
    1361                            .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    1362                            .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1363                            .dwattr $C$DW$132, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    1364                            .dwattr $C$DW$132, DW_AT_decl_line(0x88)
    1365                            .dwattr $C$DW$132, DW_AT_decl_column(0x25)
    1366                    
    1367                            .dwattr $C$DW$T$78, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\
    1368                            .dwattr $C$DW$T$78, DW_AT_decl_line(0x75)
    1369                            .dwattr $C$DW$T$78, DW_AT_decl_column(0x01)
    1370                            .dwendtag $C$DW$T$78
    1371                    
    1372                    $C$DW$T$181     .dwtag  DW_TAG_typedef
    1373                            .dwattr $C$DW$T$181, DW_AT_name("HARD_API_T")
    1374                            .dwattr $C$DW$T$181, DW_AT_type(*$C$DW$T$78)
    1375                            .dwattr $C$DW$T$181, DW_AT_language(DW_LANG_C)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:22 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{298C6C55-A6D8-4825-9CB5-B337223AA8E5} PAGE   26

    1376                            .dwattr $C$DW$T$181, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices
    1377                            .dwattr $C$DW$T$181, DW_AT_decl_line(0x89)
    1378                            .dwattr $C$DW$T$181, DW_AT_decl_column(0x03)
    1379                    
    1380                    
    1381                    $C$DW$T$83      .dwtag  DW_TAG_union_type
    1382                            .dwattr $C$DW$T$83, DW_AT_byte_size(0x02)
    1383                    $C$DW$133       .dwtag  DW_TAG_member
    1384                            .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$80)
    1385                            .dwattr $C$DW$133, DW_AT_name("entityId")
    1386                            .dwattr $C$DW$133, DW_AT_TI_symbol_name("entityId")
    1387                            .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1388                            .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1389                            .dwattr $C$DW$133, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    1390                            .dwattr $C$DW$133, DW_AT_decl_line(0x1fe)
    1391                            .dwattr $C$DW$133, DW_AT_decl_column(0x14)
    1392                    
    1393                    $C$DW$134       .dwtag  DW_TAG_member
    1394                            .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$82)
    1395                            .dwattr $C$DW$134, DW_AT_name("servId")
    1396                            .dwattr $C$DW$134, DW_AT_TI_symbol_name("servId")
    1397                            .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1398                            .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1399                            .dwattr $C$DW$134, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    1400                            .dwattr $C$DW$134, DW_AT_decl_line(0x200)
    1401                            .dwattr $C$DW$134, DW_AT_decl_column(0x17)
    1402                    
    1403                            .dwattr $C$DW$T$83, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154sta
    1404                            .dwattr $C$DW$T$83, DW_AT_decl_line(0x1fc)
    1405                            .dwattr $C$DW$T$83, DW_AT_decl_column(0x03)
    1406                            .dwendtag $C$DW$T$83
    1407                    
    1408                    
    1409                    $C$DW$T$84      .dwtag  DW_TAG_union_type
    1410                            .dwattr $C$DW$T$84, DW_AT_byte_size(0x02)
    1411                    $C$DW$135       .dwtag  DW_TAG_member
    1412                            .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$82)
    1413                            .dwattr $C$DW$135, DW_AT_name("servId")
    1414                            .dwattr $C$DW$135, DW_AT_TI_symbol_name("servId")
    1415                            .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1416                            .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1417                            .dwattr $C$DW$135, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    1418                            .dwattr $C$DW$135, DW_AT_decl_line(0x211)
    1419                            .dwattr $C$DW$135, DW_AT_decl_column(0x17)
    1420                    
    1421                    $C$DW$136       .dwtag  DW_TAG_member
    1422                            .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$80)
    1423                            .dwattr $C$DW$136, DW_AT_name("entityId")
    1424                            .dwattr $C$DW$136, DW_AT_TI_symbol_name("entityId")
    1425                            .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1426                            .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1427                            .dwattr $C$DW$136, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    1428                            .dwattr $C$DW$136, DW_AT_decl_line(0x213)
    1429                            .dwattr $C$DW$136, DW_AT_decl_column(0x14)
    1430                    
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:22 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{298C6C55-A6D8-4825-9CB5-B337223AA8E5} PAGE   27

    1431                            .dwattr $C$DW$T$84, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154sta
    1432                            .dwattr $C$DW$T$84, DW_AT_decl_line(0x20f)
    1433                            .dwattr $C$DW$T$84, DW_AT_decl_column(0x03)
    1434                            .dwendtag $C$DW$T$84
    1435                    
    1436                    
    1437                    $C$DW$T$87      .dwtag  DW_TAG_union_type
    1438                            .dwattr $C$DW$T$87, DW_AT_byte_size(0x08)
    1439                    $C$DW$137       .dwtag  DW_TAG_member
    1440                            .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$36)
    1441                            .dwattr $C$DW$137, DW_AT_name("shortAddr")
    1442                            .dwattr $C$DW$137, DW_AT_TI_symbol_name("shortAddr")
    1443                            .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1444                            .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1445                            .dwattr $C$DW$137, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/Se
    1446                            .dwattr $C$DW$137, DW_AT_decl_line(0x50)
    1447                            .dwattr $C$DW$137, DW_AT_decl_column(0x11)
    1448                    
    1449                    $C$DW$138       .dwtag  DW_TAG_member
    1450                            .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$86)
    1451                            .dwattr $C$DW$138, DW_AT_name("extAddr")
    1452                            .dwattr $C$DW$138, DW_AT_TI_symbol_name("extAddr")
    1453                            .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1454                            .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1455                            .dwattr $C$DW$138, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/Se
    1456                            .dwattr $C$DW$138, DW_AT_decl_line(0x51)
    1457                            .dwattr $C$DW$138, DW_AT_decl_column(0x11)
    1458                    
    1459                            .dwattr $C$DW$T$87, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/S
    1460                            .dwattr $C$DW$T$87, DW_AT_decl_line(0x4f)
    1461                            .dwattr $C$DW$T$87, DW_AT_decl_column(0x03)
    1462                            .dwendtag $C$DW$T$87
    1463                    
    1464                    
    1465                    $C$DW$T$90      .dwtag  DW_TAG_union_type
    1466                            .dwattr $C$DW$T$90, DW_AT_byte_size(0x08)
    1467                    $C$DW$139       .dwtag  DW_TAG_member
    1468                            .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$36)
    1469                            .dwattr $C$DW$139, DW_AT_name("shortAddr")
    1470                            .dwattr $C$DW$139, DW_AT_TI_symbol_name("shortAddr")
    1471                            .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1472                            .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1473                            .dwattr $C$DW$139, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    1474                            .dwattr $C$DW$139, DW_AT_decl_line(0x137)
    1475                            .dwattr $C$DW$139, DW_AT_decl_column(0x11)
    1476                    
    1477                    $C$DW$140       .dwtag  DW_TAG_member
    1478                            .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$89)
    1479                            .dwattr $C$DW$140, DW_AT_name("extAddr")
    1480                            .dwattr $C$DW$140, DW_AT_TI_symbol_name("extAddr")
    1481                            .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1482                            .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1483                            .dwattr $C$DW$140, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    1484                            .dwattr $C$DW$140, DW_AT_decl_line(0x138)
    1485                            .dwattr $C$DW$140, DW_AT_decl_column(0x11)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:22 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{298C6C55-A6D8-4825-9CB5-B337223AA8E5} PAGE   28

    1486                    
    1487                            .dwattr $C$DW$T$90, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154sta
    1488                            .dwattr $C$DW$T$90, DW_AT_decl_line(0x136)
    1489                            .dwattr $C$DW$T$90, DW_AT_decl_column(0x03)
    1490                            .dwendtag $C$DW$T$90
    1491                    
    1492                    
    1493                    $C$DW$T$91      .dwtag  DW_TAG_structure_type
    1494                            .dwattr $C$DW$T$91, DW_AT_name("_ICall_LiteCmdStatus_")
    1495                            .dwattr $C$DW$T$91, DW_AT_byte_size(0x01)
    1496                    $C$DW$141       .dwtag  DW_TAG_member
    1497                            .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$79)
    1498                            .dwattr $C$DW$141, DW_AT_name("cmdId")
    1499                            .dwattr $C$DW$141, DW_AT_TI_symbol_name("cmdId")
    1500                            .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1501                            .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1502                            .dwattr $C$DW$141, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    1503                            .dwattr $C$DW$141, DW_AT_decl_line(0x3f0)
    1504                            .dwattr $C$DW$141, DW_AT_decl_column(0x11)
    1505                    
    1506                            .dwattr $C$DW$T$91, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154sta
    1507                            .dwattr $C$DW$T$91, DW_AT_decl_line(0x3ee)
    1508                            .dwattr $C$DW$T$91, DW_AT_decl_column(0x10)
    1509                            .dwendtag $C$DW$T$91
    1510                    
    1511                    $C$DW$T$182     .dwtag  DW_TAG_typedef
    1512                            .dwattr $C$DW$T$182, DW_AT_name("ICall_LiteCmdStatus")
    1513                            .dwattr $C$DW$T$182, DW_AT_type(*$C$DW$T$91)
    1514                            .dwattr $C$DW$T$182, DW_AT_language(DW_LANG_C)
    1515                            .dwattr $C$DW$T$182, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154st
    1516                            .dwattr $C$DW$T$182, DW_AT_decl_line(0x3f1)
    1517                            .dwattr $C$DW$T$182, DW_AT_decl_column(0x03)
    1518                    
    1519                    $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    1520                            .dwattr $C$DW$T$2, DW_AT_name("void")
    1521                    
    1522                    $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    1523                            .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
    1524                            .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
    1525                    
    1526                    $C$DW$T$183     .dwtag  DW_TAG_typedef
    1527                            .dwattr $C$DW$T$183, DW_AT_name("ICall_Semaphore")
    1528                            .dwattr $C$DW$T$183, DW_AT_type(*$C$DW$T$3)
    1529                            .dwattr $C$DW$T$183, DW_AT_language(DW_LANG_C)
    1530                            .dwattr $C$DW$T$183, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154st
    1531                            .dwattr $C$DW$T$183, DW_AT_decl_line(0x1ac)
    1532                            .dwattr $C$DW$T$183, DW_AT_decl_column(0x0f)
    1533                    
    1534                    $C$DW$T$105     .dwtag  DW_TAG_typedef
    1535                            .dwattr $C$DW$T$105, DW_AT_name("ICall_SyncHandle")
    1536                            .dwattr $C$DW$T$105, DW_AT_type(*$C$DW$T$3)
    1537                            .dwattr $C$DW$T$105, DW_AT_language(DW_LANG_C)
    1538                            .dwattr $C$DW$T$105, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154st
    1539                            .dwattr $C$DW$T$105, DW_AT_decl_line(0x1aa)
    1540                            .dwattr $C$DW$T$105, DW_AT_decl_column(0x0f)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:22 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{298C6C55-A6D8-4825-9CB5-B337223AA8E5} PAGE   29

    1541                    
    1542                    $C$DW$T$150     .dwtag  DW_TAG_typedef
    1543                            .dwattr $C$DW$T$150, DW_AT_name("ICall_TimerID")
    1544                            .dwattr $C$DW$T$150, DW_AT_type(*$C$DW$T$3)
    1545                            .dwattr $C$DW$T$150, DW_AT_language(DW_LANG_C)
    1546                            .dwattr $C$DW$T$150, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154st
    1547                            .dwattr $C$DW$T$150, DW_AT_decl_line(0x1b7)
    1548                            .dwattr $C$DW$T$150, DW_AT_decl_column(0x0f)
    1549                    
    1550                    $C$DW$T$184     .dwtag  DW_TAG_typedef
    1551                            .dwattr $C$DW$T$184, DW_AT_name("osal_msg_q_t")
    1552                            .dwattr $C$DW$T$184, DW_AT_type(*$C$DW$T$3)
    1553                            .dwattr $C$DW$T$184, DW_AT_language(DW_LANG_C)
    1554                            .dwattr $C$DW$T$184, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/
    1555                            .dwattr $C$DW$T$184, DW_AT_decl_line(0x7d)
    1556                            .dwattr $C$DW$T$184, DW_AT_decl_column(0x10)
    1557                    
    1558                    
    1559                    $C$DW$T$52      .dwtag  DW_TAG_subroutine_type
    1560                            .dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
    1561                            .dwendtag $C$DW$T$52
    1562                    
    1563                    $C$DW$T$53      .dwtag  DW_TAG_pointer_type
    1564                            .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$52)
    1565                            .dwattr $C$DW$T$53, DW_AT_address_class(0x20)
    1566                    
    1567                    $C$DW$T$166     .dwtag  DW_TAG_typedef
    1568                            .dwattr $C$DW$T$166, DW_AT_name("APPASRTINTF_callAssrtHndler")
    1569                            .dwattr $C$DW$T$166, DW_AT_type(*$C$DW$T$53)
    1570                            .dwattr $C$DW$T$166, DW_AT_language(DW_LANG_C)
    1571                            .dwattr $C$DW$T$166, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154st
    1572                            .dwattr $C$DW$T$166, DW_AT_decl_line(0x43)
    1573                            .dwattr $C$DW$T$166, DW_AT_decl_column(0x10)
    1574                    
    1575                    $C$DW$T$71      .dwtag  DW_TAG_typedef
    1576                            .dwattr $C$DW$T$71, DW_AT_name("FPTR_HFSOURCESAFESWITCH_T")
    1577                            .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$53)
    1578                            .dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
    1579                            .dwattr $C$DW$T$71, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\
    1580                            .dwattr $C$DW$T$71, DW_AT_decl_line(0x5f)
    1581                            .dwattr $C$DW$T$71, DW_AT_decl_column(0x19)
    1582                    
    1583                    $C$DW$T$54      .dwtag  DW_TAG_typedef
    1584                            .dwattr $C$DW$T$54, DW_AT_name("FPTR_RESETDEV_T")
    1585                            .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$53)
    1586                            .dwattr $C$DW$T$54, DW_AT_language(DW_LANG_C)
    1587                            .dwattr $C$DW$T$54, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\
    1588                            .dwattr $C$DW$T$54, DW_AT_decl_line(0x4d)
    1589                            .dwattr $C$DW$T$54, DW_AT_decl_column(0x19)
    1590                    
    1591                    $C$DW$T$185     .dwtag  DW_TAG_typedef
    1592                            .dwattr $C$DW$T$185, DW_AT_name("FPTR_VOID_VOID_T")
    1593                            .dwattr $C$DW$T$185, DW_AT_type(*$C$DW$T$53)
    1594                            .dwattr $C$DW$T$185, DW_AT_language(DW_LANG_C)
    1595                            .dwattr $C$DW$T$185, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:22 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{298C6C55-A6D8-4825-9CB5-B337223AA8E5} PAGE   30

    1596                            .dwattr $C$DW$T$185, DW_AT_decl_line(0x33)
    1597                            .dwattr $C$DW$T$185, DW_AT_decl_column(0x11)
    1598                    
    1599                    $C$DW$T$186     .dwtag  DW_TAG_typedef
    1600                            .dwattr $C$DW$T$186, DW_AT_name("__TI_atexit_fn")
    1601                            .dwattr $C$DW$T$186, DW_AT_type(*$C$DW$T$53)
    1602                            .dwattr $C$DW$T$186, DW_AT_language(DW_LANG_C)
    1603                            .dwattr $C$DW$T$186, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include
    1604                            .dwattr $C$DW$T$186, DW_AT_decl_line(0xb9)
    1605                            .dwattr $C$DW$T$186, DW_AT_decl_column(0x14)
    1606                    
    1607                    
    1608                    $C$DW$T$67      .dwtag  DW_TAG_subroutine_type
    1609                            .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
    1610                    $C$DW$142       .dwtag  DW_TAG_formal_parameter
    1611                            .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$22)
    1612                    
    1613                            .dwendtag $C$DW$T$67
    1614                    
    1615                    $C$DW$T$68      .dwtag  DW_TAG_pointer_type
    1616                            .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$67)
    1617                            .dwattr $C$DW$T$68, DW_AT_address_class(0x20)
    1618                    
    1619                    $C$DW$T$69      .dwtag  DW_TAG_typedef
    1620                            .dwattr $C$DW$T$69, DW_AT_name("FPTR_RESERVED4_T")
    1621                            .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$68)
    1622                            .dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
    1623                            .dwattr $C$DW$T$69, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\
    1624                            .dwattr $C$DW$T$69, DW_AT_decl_line(0x61)
    1625                            .dwattr $C$DW$T$69, DW_AT_decl_column(0x19)
    1626                    
    1627                    $C$DW$T$70      .dwtag  DW_TAG_typedef
    1628                            .dwattr $C$DW$T$70, DW_AT_name("FPTR_RESERVED5_T")
    1629                            .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$68)
    1630                            .dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)
    1631                            .dwattr $C$DW$T$70, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\
    1632                            .dwattr $C$DW$T$70, DW_AT_decl_line(0x63)
    1633                            .dwattr $C$DW$T$70, DW_AT_decl_column(0x19)
    1634                    
    1635                    
    1636                    $C$DW$T$72      .dwtag  DW_TAG_subroutine_type
    1637                            .dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
    1638                    $C$DW$143       .dwtag  DW_TAG_formal_parameter
    1639                            .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$38)
    1640                    
    1641                            .dwendtag $C$DW$T$72
    1642                    
    1643                    $C$DW$T$73      .dwtag  DW_TAG_pointer_type
    1644                            .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$72)
    1645                            .dwattr $C$DW$T$73, DW_AT_address_class(0x20)
    1646                    
    1647                    $C$DW$T$76      .dwtag  DW_TAG_typedef
    1648                            .dwattr $C$DW$T$76, DW_AT_name("FPTR_ADCCOMPBIN_T")
    1649                            .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$73)
    1650                            .dwattr $C$DW$T$76, DW_AT_language(DW_LANG_C)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:22 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{298C6C55-A6D8-4825-9CB5-B337223AA8E5} PAGE   31

    1651                            .dwattr $C$DW$T$76, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\
    1652                            .dwattr $C$DW$T$76, DW_AT_decl_line(0x69)
    1653                            .dwattr $C$DW$T$76, DW_AT_decl_column(0x19)
    1654                    
    1655                    $C$DW$T$74      .dwtag  DW_TAG_typedef
    1656                            .dwattr $C$DW$T$74, DW_AT_name("FPTR_COMPAIN_T")
    1657                            .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$73)
    1658                            .dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
    1659                            .dwattr $C$DW$T$74, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\
    1660                            .dwattr $C$DW$T$74, DW_AT_decl_line(0x65)
    1661                            .dwattr $C$DW$T$74, DW_AT_decl_column(0x19)
    1662                    
    1663                    $C$DW$T$75      .dwtag  DW_TAG_typedef
    1664                            .dwattr $C$DW$T$75, DW_AT_name("FPTR_COMPAREF_T")
    1665                            .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$73)
    1666                            .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    1667                            .dwattr $C$DW$T$75, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\
    1668                            .dwattr $C$DW$T$75, DW_AT_decl_line(0x67)
    1669                            .dwattr $C$DW$T$75, DW_AT_decl_column(0x19)
    1670                    
    1671                    $C$DW$T$77      .dwtag  DW_TAG_typedef
    1672                            .dwattr $C$DW$T$77, DW_AT_name("FPTR_COMPBREF_T")
    1673                            .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$73)
    1674                            .dwattr $C$DW$T$77, DW_AT_language(DW_LANG_C)
    1675                            .dwattr $C$DW$T$77, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\
    1676                            .dwattr $C$DW$T$77, DW_AT_decl_line(0x6b)
    1677                            .dwattr $C$DW$T$77, DW_AT_decl_column(0x19)
    1678                    
    1679                    $C$DW$T$187     .dwtag  DW_TAG_typedef
    1680                            .dwattr $C$DW$T$187, DW_AT_name("FPTR_VOID_UINT8_T")
    1681                            .dwattr $C$DW$T$187, DW_AT_type(*$C$DW$T$73)
    1682                            .dwattr $C$DW$T$187, DW_AT_language(DW_LANG_C)
    1683                            .dwattr $C$DW$T$187, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices
    1684                            .dwattr $C$DW$T$187, DW_AT_decl_line(0x34)
    1685                            .dwattr $C$DW$T$187, DW_AT_decl_column(0x11)
    1686                    
    1687                    
    1688                    $C$DW$T$95      .dwtag  DW_TAG_subroutine_type
    1689                            .dwattr $C$DW$T$95, DW_AT_language(DW_LANG_C)
    1690                    $C$DW$144       .dwtag  DW_TAG_formal_parameter
    1691                            .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$93)
    1692                    
    1693                            .dwendtag $C$DW$T$95
    1694                    
    1695                    $C$DW$T$96      .dwtag  DW_TAG_pointer_type
    1696                            .dwattr $C$DW$T$96, DW_AT_type(*$C$DW$T$95)
    1697                            .dwattr $C$DW$T$96, DW_AT_address_class(0x20)
    1698                    
    1699                    
    1700                    $C$DW$T$128     .dwtag  DW_TAG_subroutine_type
    1701                            .dwattr $C$DW$T$128, DW_AT_language(DW_LANG_C)
    1702                    $C$DW$145       .dwtag  DW_TAG_formal_parameter
    1703                            .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$126)
    1704                    
    1705                    $C$DW$146       .dwtag  DW_TAG_formal_parameter
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:22 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{298C6C55-A6D8-4825-9CB5-B337223AA8E5} PAGE   32

    1706                            .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$127)
    1707                    
    1708                            .dwendtag $C$DW$T$128
    1709                    
    1710                    $C$DW$T$129     .dwtag  DW_TAG_pointer_type
    1711                            .dwattr $C$DW$T$129, DW_AT_type(*$C$DW$T$128)
    1712                            .dwattr $C$DW$T$129, DW_AT_address_class(0x20)
    1713                    
    1714                    $C$DW$T$130     .dwtag  DW_TAG_typedef
    1715                            .dwattr $C$DW$T$130, DW_AT_name("ICall_PwrNotifyFn")
    1716                            .dwattr $C$DW$T$130, DW_AT_type(*$C$DW$T$129)
    1717                            .dwattr $C$DW$T$130, DW_AT_language(DW_LANG_C)
    1718                            .dwattr $C$DW$T$130, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154st
    1719                            .dwattr $C$DW$T$130, DW_AT_decl_line(0x333)
    1720                            .dwattr $C$DW$T$130, DW_AT_decl_column(0x10)
    1721                    
    1722                    
    1723                    $C$DW$T$144     .dwtag  DW_TAG_subroutine_type
    1724                            .dwattr $C$DW$T$144, DW_AT_language(DW_LANG_C)
    1725                    $C$DW$147       .dwtag  DW_TAG_formal_parameter
    1726                            .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$140)
    1727                    
    1728                            .dwendtag $C$DW$T$144
    1729                    
    1730                    $C$DW$T$145     .dwtag  DW_TAG_pointer_type
    1731                            .dwattr $C$DW$T$145, DW_AT_type(*$C$DW$T$144)
    1732                            .dwattr $C$DW$T$145, DW_AT_address_class(0x20)
    1733                    
    1734                    $C$DW$T$146     .dwtag  DW_TAG_typedef
    1735                            .dwattr $C$DW$T$146, DW_AT_name("ICall_LeaveCS")
    1736                            .dwattr $C$DW$T$146, DW_AT_type(*$C$DW$T$145)
    1737                            .dwattr $C$DW$T$146, DW_AT_language(DW_LANG_C)
    1738                            .dwattr $C$DW$T$146, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154st
    1739                            .dwattr $C$DW$T$146, DW_AT_decl_line(0x37e)
    1740                            .dwattr $C$DW$T$146, DW_AT_decl_column(0x10)
    1741                    
    1742                    
    1743                    $C$DW$T$151     .dwtag  DW_TAG_subroutine_type
    1744                            .dwattr $C$DW$T$151, DW_AT_language(DW_LANG_C)
    1745                    $C$DW$148       .dwtag  DW_TAG_formal_parameter
    1746                            .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$3)
    1747                    
    1748                            .dwendtag $C$DW$T$151
    1749                    
    1750                    $C$DW$T$152     .dwtag  DW_TAG_pointer_type
    1751                            .dwattr $C$DW$T$152, DW_AT_type(*$C$DW$T$151)
    1752                            .dwattr $C$DW$T$152, DW_AT_address_class(0x20)
    1753                    
    1754                    $C$DW$T$153     .dwtag  DW_TAG_typedef
    1755                            .dwattr $C$DW$T$153, DW_AT_name("ICall_TimerCback")
    1756                            .dwattr $C$DW$T$153, DW_AT_type(*$C$DW$T$152)
    1757                            .dwattr $C$DW$T$153, DW_AT_language(DW_LANG_C)
    1758                            .dwattr $C$DW$T$153, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154st
    1759                            .dwattr $C$DW$T$153, DW_AT_decl_line(0x1c8)
    1760                            .dwattr $C$DW$T$153, DW_AT_decl_column(0x10)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:22 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{298C6C55-A6D8-4825-9CB5-B337223AA8E5} PAGE   33

    1761                    
    1762                    $C$DW$T$188     .dwtag  DW_TAG_typedef
    1763                            .dwattr $C$DW$T$188, DW_AT_name("osal_highres_timer_cback_t")
    1764                            .dwattr $C$DW$T$188, DW_AT_type(*$C$DW$T$152)
    1765                            .dwattr $C$DW$T$188, DW_AT_language(DW_LANG_C)
    1766                            .dwattr $C$DW$T$188, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/
    1767                            .dwattr $C$DW$T$188, DW_AT_decl_line(0x81)
    1768                            .dwattr $C$DW$T$188, DW_AT_decl_column(0x10)
    1769                    
    1770                    $C$DW$T$189     .dwtag  DW_TAG_typedef
    1771                            .dwattr $C$DW$T$189, DW_AT_name("osal_icallMsg_hook_t")
    1772                            .dwattr $C$DW$T$189, DW_AT_type(*$C$DW$T$152)
    1773                            .dwattr $C$DW$T$189, DW_AT_language(DW_LANG_C)
    1774                            .dwattr $C$DW$T$189, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/
    1775                            .dwattr $C$DW$T$189, DW_AT_decl_line(0x85)
    1776                            .dwattr $C$DW$T$189, DW_AT_decl_column(0x10)
    1777                    
    1778                    $C$DW$T$160     .dwtag  DW_TAG_const_type
    1779                            .dwattr $C$DW$T$160, DW_AT_type(*$C$DW$T$2)
    1780                    
    1781                    $C$DW$T$161     .dwtag  DW_TAG_pointer_type
    1782                            .dwattr $C$DW$T$161, DW_AT_type(*$C$DW$T$160)
    1783                            .dwattr $C$DW$T$161, DW_AT_address_class(0x20)
    1784                    
    1785                    
    1786                    $C$DW$T$190     .dwtag  DW_TAG_subroutine_type
    1787                            .dwattr $C$DW$T$190, DW_AT_language(DW_LANG_C)
    1788                    $C$DW$149       .dwtag  DW_TAG_formal_parameter
    1789                            .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$30)
    1790                    
    1791                    $C$DW$150       .dwtag  DW_TAG_formal_parameter
    1792                            .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$30)
    1793                    
    1794                            .dwendtag $C$DW$T$190
    1795                    
    1796                    $C$DW$T$191     .dwtag  DW_TAG_pointer_type
    1797                            .dwattr $C$DW$T$191, DW_AT_type(*$C$DW$T$190)
    1798                            .dwattr $C$DW$T$191, DW_AT_address_class(0x20)
    1799                    
    1800                    $C$DW$T$192     .dwtag  DW_TAG_typedef
    1801                            .dwattr $C$DW$T$192, DW_AT_name("assertCback_t")
    1802                            .dwattr $C$DW$T$192, DW_AT_type(*$C$DW$T$191)
    1803                            .dwattr $C$DW$T$192, DW_AT_language(DW_LANG_C)
    1804                            .dwattr $C$DW$T$192, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154st
    1805                            .dwattr $C$DW$T$192, DW_AT_decl_line(0xd3)
    1806                            .dwattr $C$DW$T$192, DW_AT_decl_column(0x10)
    1807                    
    1808                    
    1809                    $C$DW$T$196     .dwtag  DW_TAG_subroutine_type
    1810                            .dwattr $C$DW$T$196, DW_AT_language(DW_LANG_C)
    1811                    $C$DW$151       .dwtag  DW_TAG_formal_parameter
    1812                            .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$195)
    1813                    
    1814                    $C$DW$152       .dwtag  DW_TAG_formal_parameter
    1815                            .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$3)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:22 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{298C6C55-A6D8-4825-9CB5-B337223AA8E5} PAGE   34

    1816                    
    1817                            .dwendtag $C$DW$T$196
    1818                    
    1819                    $C$DW$T$197     .dwtag  DW_TAG_pointer_type
    1820                            .dwattr $C$DW$T$197, DW_AT_type(*$C$DW$T$196)
    1821                            .dwattr $C$DW$T$197, DW_AT_address_class(0x20)
    1822                    
    1823                    $C$DW$T$198     .dwtag  DW_TAG_typedef
    1824                            .dwattr $C$DW$T$198, DW_AT_name("ICall_RemoteTaskEntry")
    1825                            .dwattr $C$DW$T$198, DW_AT_type(*$C$DW$T$197)
    1826                            .dwattr $C$DW$T$198, DW_AT_language(DW_LANG_C)
    1827                            .dwattr $C$DW$T$198, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154st
    1828                            .dwattr $C$DW$T$198, DW_AT_decl_line(0x39b)
    1829                            .dwattr $C$DW$T$198, DW_AT_decl_column(0x10)
    1830                    
    1831                    $C$DW$T$4       .dwtag  DW_TAG_base_type
    1832                            .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    1833                            .dwattr $C$DW$T$4, DW_AT_name("bool")
    1834                            .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    1835                    
    1836                    $C$DW$T$5       .dwtag  DW_TAG_base_type
    1837                            .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    1838                            .dwattr $C$DW$T$5, DW_AT_name("signed char")
    1839                            .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    1840                    
    1841                    $C$DW$T$199     .dwtag  DW_TAG_typedef
    1842                            .dwattr $C$DW$T$199, DW_AT_name("int8")
    1843                            .dwattr $C$DW$T$199, DW_AT_type(*$C$DW$T$5)
    1844                            .dwattr $C$DW$T$199, DW_AT_language(DW_LANG_C)
    1845                            .dwattr $C$DW$T$199, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\ti154st
    1846                            .dwattr $C$DW$T$199, DW_AT_decl_line(0x38)
    1847                            .dwattr $C$DW$T$199, DW_AT_decl_column(0x19)
    1848                    
    1849                    $C$DW$T$200     .dwtag  DW_TAG_typedef
    1850                            .dwattr $C$DW$T$200, DW_AT_name("int8_t")
    1851                            .dwattr $C$DW$T$200, DW_AT_type(*$C$DW$T$5)
    1852                            .dwattr $C$DW$T$200, DW_AT_language(DW_LANG_C)
    1853                            .dwattr $C$DW$T$200, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include
    1854                            .dwattr $C$DW$T$200, DW_AT_decl_line(0x2a)
    1855                            .dwattr $C$DW$T$200, DW_AT_decl_column(0x1d)
    1856                    
    1857                    $C$DW$T$201     .dwtag  DW_TAG_typedef
    1858                            .dwattr $C$DW$T$201, DW_AT_name("int_least8_t")
    1859                            .dwattr $C$DW$T$201, DW_AT_type(*$C$DW$T$200)
    1860                            .dwattr $C$DW$T$201, DW_AT_language(DW_LANG_C)
    1861                            .dwattr $C$DW$T$201, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include
    1862                            .dwattr $C$DW$T$201, DW_AT_decl_line(0x37)
    1863                            .dwattr $C$DW$T$201, DW_AT_decl_column(0x17)
    1864                    
    1865                    $C$DW$T$6       .dwtag  DW_TAG_base_type
    1866                            .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    1867                            .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    1868                            .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    1869                    
    1870                    $C$DW$T$30      .dwtag  DW_TAG_typedef
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:22 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{298C6C55-A6D8-4825-9CB5-B337223AA8E5} PAGE   35

    1871                            .dwattr $C$DW$T$30, DW_AT_name("uint8")
    1872                            .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$6)
    1873                            .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    1874                            .dwattr $C$DW$T$30, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\ti154sta
    1875                            .dwattr $C$DW$T$30, DW_AT_decl_line(0x39)
    1876                            .dwattr $C$DW$T$30, DW_AT_decl_column(0x19)
    1877                    
    1878                    $C$DW$T$207     .dwtag  DW_TAG_typedef
    1879                            .dwattr $C$DW$T$207, DW_AT_name("Status_t")
    1880                            .dwattr $C$DW$T$207, DW_AT_type(*$C$DW$T$30)
    1881                            .dwattr $C$DW$T$207, DW_AT_language(DW_LANG_C)
    1882                            .dwattr $C$DW$T$207, DW_AT_decl_file("C:\Users\Kevin\workspace_v7\sensor_cc1310lp\Application\
    1883                            .dwattr $C$DW$T$207, DW_AT_decl_line(0x77)
    1884                            .dwattr $C$DW$T$207, DW_AT_decl_column(0x0f)
    1885                    
    1886                    $C$DW$T$208     .dwtag  DW_TAG_typedef
    1887                            .dwattr $C$DW$T$208, DW_AT_name("ZStatus_t")
    1888                            .dwattr $C$DW$T$208, DW_AT_type(*$C$DW$T$207)
    1889                            .dwattr $C$DW$T$208, DW_AT_language(DW_LANG_C)
    1890                            .dwattr $C$DW$T$208, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154st
    1891                            .dwattr $C$DW$T$208, DW_AT_decl_line(0x194)
    1892                            .dwattr $C$DW$T$208, DW_AT_decl_column(0x12)
    1893                    
    1894                    
    1895                    $C$DW$T$85      .dwtag  DW_TAG_array_type
    1896                            .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$30)
    1897                            .dwattr $C$DW$T$85, DW_AT_language(DW_LANG_C)
    1898                            .dwattr $C$DW$T$85, DW_AT_byte_size(0x08)
    1899                    $C$DW$153       .dwtag  DW_TAG_subrange_type
    1900                            .dwattr $C$DW$153, DW_AT_upper_bound(0x07)
    1901                    
    1902                            .dwendtag $C$DW$T$85
    1903                    
    1904                    $C$DW$T$86      .dwtag  DW_TAG_typedef
    1905                            .dwattr $C$DW$T$86, DW_AT_name("sAddrExt_t")
    1906                            .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$85)
    1907                            .dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)
    1908                            .dwattr $C$DW$T$86, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/S
    1909                            .dwattr $C$DW$T$86, DW_AT_decl_line(0x49)
    1910                            .dwattr $C$DW$T$86, DW_AT_decl_column(0x0f)
    1911                    
    1912                    $C$DW$T$202     .dwtag  DW_TAG_pointer_type
    1913                            .dwattr $C$DW$T$202, DW_AT_type(*$C$DW$T$30)
    1914                            .dwattr $C$DW$T$202, DW_AT_address_class(0x20)
    1915                    
    1916                    $C$DW$T$209     .dwtag  DW_TAG_const_type
    1917                            .dwattr $C$DW$T$209, DW_AT_type(*$C$DW$T$202)
    1918                    
    1919                    $C$DW$T$33      .dwtag  DW_TAG_typedef
    1920                            .dwattr $C$DW$T$33, DW_AT_name("byte")
    1921                            .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$30)
    1922                            .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    1923                            .dwattr $C$DW$T$33, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154sta
    1924                            .dwattr $C$DW$T$33, DW_AT_decl_line(0x122)
    1925                            .dwattr $C$DW$T$33, DW_AT_decl_column(0x11)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:22 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{298C6C55-A6D8-4825-9CB5-B337223AA8E5} PAGE   36

    1926                    
    1927                    
    1928                    $C$DW$T$88      .dwtag  DW_TAG_array_type
    1929                            .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$33)
    1930                            .dwattr $C$DW$T$88, DW_AT_language(DW_LANG_C)
    1931                            .dwattr $C$DW$T$88, DW_AT_byte_size(0x08)
    1932                    $C$DW$154       .dwtag  DW_TAG_subrange_type
    1933                            .dwattr $C$DW$154, DW_AT_upper_bound(0x07)
    1934                    
    1935                            .dwendtag $C$DW$T$88
    1936                    
    1937                    $C$DW$T$89      .dwtag  DW_TAG_typedef
    1938                            .dwattr $C$DW$T$89, DW_AT_name("ZLongAddr_t")
    1939                            .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$88)
    1940                            .dwattr $C$DW$T$89, DW_AT_language(DW_LANG_C)
    1941                            .dwattr $C$DW$T$89, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154sta
    1942                            .dwattr $C$DW$T$89, DW_AT_decl_line(0x131)
    1943                            .dwattr $C$DW$T$89, DW_AT_decl_column(0x0e)
    1944                    
    1945                    $C$DW$T$211     .dwtag  DW_TAG_const_type
    1946                            .dwattr $C$DW$T$211, DW_AT_type(*$C$DW$T$30)
    1947                    
    1948                    $C$DW$T$38      .dwtag  DW_TAG_typedef
    1949                            .dwattr $C$DW$T$38, DW_AT_name("uint8_t")
    1950                            .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$6)
    1951                            .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    1952                            .dwattr $C$DW$T$38, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/
    1953                            .dwattr $C$DW$T$38, DW_AT_decl_line(0x2b)
    1954                            .dwattr $C$DW$T$38, DW_AT_decl_column(0x1c)
    1955                    
    1956                    $C$DW$T$39      .dwtag  DW_TAG_pointer_type
    1957                            .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$38)
    1958                            .dwattr $C$DW$T$39, DW_AT_address_class(0x20)
    1959                    
    1960                    $C$DW$T$212     .dwtag  DW_TAG_volatile_type
    1961                            .dwattr $C$DW$T$212, DW_AT_type(*$C$DW$T$38)
    1962                    
