TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:22 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{5FC2008A-5F32-4C25-9FE7-4FDE3869A457} PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                        PC v16.9.4.LTS *
       3                    ;* Date/Time created: Sat Nov 18 18:46:22 2017                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../Application/MAC/HAL/target/hal_aes.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v16.9.4.LTS Copyright (c) 1996-20
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Kevin\workspace_v7\sensor_cc1310lp\sensor_cc1310lp"
      13                    
      14                    $C$DW$1 .dwtag  DW_TAG_subprogram

     824                            .dwattr $C$DW$58, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/cc
     825                            .dwattr $C$DW$58, DW_AT_decl_line(0xa8)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:22 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{5FC2008A-5F32-4C25-9FE7-4FDE3869A457} PAGE   16

     826                            .dwattr $C$DW$58, DW_AT_decl_column(0x05)
     827                    
     828                    $C$DW$59        .dwtag  DW_TAG_enumerator
     829                            .dwattr $C$DW$59, DW_AT_name("FAPI_VALIDATE_SECTOR")
     830                            .dwattr $C$DW$59, DW_AT_const_value(0x0e)
     831                            .dwattr $C$DW$59, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/cc
     832                            .dwattr $C$DW$59, DW_AT_decl_line(0xa9)
     833                            .dwattr $C$DW$59, DW_AT_decl_column(0x05)
     834                    
     835                    $C$DW$60        .dwtag  DW_TAG_enumerator
     836                            .dwattr $C$DW$60, DW_AT_name("FAPI_CLEAR_STATUS")
     837                            .dwattr $C$DW$60, DW_AT_const_value(0x10)
     838                            .dwattr $C$DW$60, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/cc
     839                            .dwattr $C$DW$60, DW_AT_decl_line(0xaa)
     840                            .dwattr $C$DW$60, DW_AT_decl_column(0x05)
     841                    
     842                    $C$DW$61        .dwtag  DW_TAG_enumerator
     843                            .dwattr $C$DW$61, DW_AT_name("FAPI_PROGRAM_RESUME")
     844                            .dwattr $C$DW$61, DW_AT_const_value(0x14)
     845                            .dwattr $C$DW$61, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/cc
     846                            .dwattr $C$DW$61, DW_AT_decl_line(0xab)
     847                            .dwattr $C$DW$61, DW_AT_decl_column(0x05)
     848                    
     849                    $C$DW$62        .dwtag  DW_TAG_enumerator
     850                            .dwattr $C$DW$62, DW_AT_name("FAPI_ERASE_RESUME")
     851                            .dwattr $C$DW$62, DW_AT_const_value(0x16)
     852                            .dwattr $C$DW$62, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/cc
     853                            .dwattr $C$DW$62, DW_AT_decl_line(0xac)
     854                            .dwattr $C$DW$62, DW_AT_decl_column(0x05)
     855                    
     856                    $C$DW$63        .dwtag  DW_TAG_enumerator
     857                            .dwattr $C$DW$63, DW_AT_name("FAPI_CLEAR_MORE")
     858                            .dwattr $C$DW$63, DW_AT_const_value(0x18)
     859                            .dwattr $C$DW$63, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/cc
     860                            .dwattr $C$DW$63, DW_AT_decl_line(0xad)
     861                            .dwattr $C$DW$63, DW_AT_decl_column(0x05)
     862                    
     863                    $C$DW$64        .dwtag  DW_TAG_enumerator
     864                            .dwattr $C$DW$64, DW_AT_name("FAPI_PROGRAM_SECTOR")
     865                            .dwattr $C$DW$64, DW_AT_const_value(0x20)
     866                            .dwattr $C$DW$64, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/cc
     867                            .dwattr $C$DW$64, DW_AT_decl_line(0xae)
     868                            .dwattr $C$DW$64, DW_AT_decl_column(0x05)
     869                    
     870                    $C$DW$65        .dwtag  DW_TAG_enumerator
     871                            .dwattr $C$DW$65, DW_AT_name("FAPI_ERASE_OTP")
     872                            .dwattr $C$DW$65, DW_AT_const_value(0x30)
     873                            .dwattr $C$DW$65, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/cc
     874                            .dwattr $C$DW$65, DW_AT_decl_line(0xaf)
     875                            .dwattr $C$DW$65, DW_AT_decl_column(0x05)
     876                    
     877                            .dwattr $C$DW$T$171, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices
     878                            .dwattr $C$DW$T$171, DW_AT_decl_line(0xa5)
     879                            .dwattr $C$DW$T$171, DW_AT_decl_column(0x01)
     880                            .dwendtag $C$DW$T$171
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:22 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{5FC2008A-5F32-4C25-9FE7-4FDE3869A457} PAGE   17

     881                    
     882                    $C$DW$T$172     .dwtag  DW_TAG_typedef
     883                            .dwattr $C$DW$T$172, DW_AT_name("tFlashStateCommandsType")
     884                            .dwattr $C$DW$T$172, DW_AT_type(*$C$DW$T$171)
     885                            .dwattr $C$DW$T$172, DW_AT_language(DW_LANG_C)
     886                            .dwattr $C$DW$T$172, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices
     887                            .dwattr $C$DW$T$172, DW_AT_decl_line(0xb0)
     888                            .dwattr $C$DW$T$172, DW_AT_decl_column(0x03)
     889                    
     890                    
     891                    $C$DW$T$19      .dwtag  DW_TAG_structure_type
     892                            .dwattr $C$DW$T$19, DW_AT_byte_size(0x08)
     893                    $C$DW$66        .dwtag  DW_TAG_member
     894                            .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$10)
     895                            .dwattr $C$DW$66, DW_AT_name("quot")
     896                            .dwattr $C$DW$66, DW_AT_TI_symbol_name("quot")
     897                            .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     898                            .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     899                            .dwattr $C$DW$66, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/st
     900                            .dwattr $C$DW$66, DW_AT_decl_line(0x5c)
     901                            .dwattr $C$DW$66, DW_AT_decl_column(0x16)
     902                    
     903                    $C$DW$67        .dwtag  DW_TAG_member
     904                            .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$10)
     905                            .dwattr $C$DW$67, DW_AT_name("rem")
     906                            .dwattr $C$DW$67, DW_AT_TI_symbol_name("rem")
     907                            .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     908                            .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
     909                            .dwattr $C$DW$67, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/st
     910                            .dwattr $C$DW$67, DW_AT_decl_line(0x5c)
     911                            .dwattr $C$DW$67, DW_AT_decl_column(0x1c)
     912                    
     913                            .dwattr $C$DW$T$19, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/
     914                            .dwattr $C$DW$T$19, DW_AT_decl_line(0x5c)
     915                            .dwattr $C$DW$T$19, DW_AT_decl_column(0x10)
     916                            .dwendtag $C$DW$T$19
     917                    
     918                    $C$DW$T$173     .dwtag  DW_TAG_typedef
     919                            .dwattr $C$DW$T$173, DW_AT_name("div_t")
     920                            .dwattr $C$DW$T$173, DW_AT_type(*$C$DW$T$19)
     921                            .dwattr $C$DW$T$173, DW_AT_language(DW_LANG_C)
     922                            .dwattr $C$DW$T$173, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include
     923                            .dwattr $C$DW$T$173, DW_AT_decl_line(0x5c)
     924                            .dwattr $C$DW$T$173, DW_AT_decl_column(0x23)
     925                    
     926                    
     927                    $C$DW$T$20      .dwtag  DW_TAG_structure_type
     928                            .dwattr $C$DW$T$20, DW_AT_byte_size(0x08)
     929                    $C$DW$68        .dwtag  DW_TAG_member
     930                            .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$10)
     931                            .dwattr $C$DW$68, DW_AT_name("quot")
     932                            .dwattr $C$DW$68, DW_AT_TI_symbol_name("quot")
     933                            .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     934                            .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
     935                            .dwattr $C$DW$68, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/st
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:22 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{5FC2008A-5F32-4C25-9FE7-4FDE3869A457} PAGE   18

     936                            .dwattr $C$DW$68, DW_AT_decl_line(0x5e)
     937                            .dwattr $C$DW$68, DW_AT_decl_column(0x16)
     938                    
     939                    $C$DW$69        .dwtag  DW_TAG_member
     940                            .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$10)
     941                            .dwattr $C$DW$69, DW_AT_name("rem")
     942                            .dwattr $C$DW$69, DW_AT_TI_symbol_name("rem")
     943                            .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     944                            .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
     945                            .dwattr $C$DW$69, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/st
     946                            .dwattr $C$DW$69, DW_AT_decl_line(0x5e)
     947                            .dwattr $C$DW$69, DW_AT_decl_column(0x1c)
     948                    
     949                            .dwattr $C$DW$T$20, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/
     950                            .dwattr $C$DW$T$20, DW_AT_decl_line(0x5e)
     951                            .dwattr $C$DW$T$20, DW_AT_decl_column(0x10)
     952                            .dwendtag $C$DW$T$20
     953                    
     954                    $C$DW$T$174     .dwtag  DW_TAG_typedef
     955                            .dwattr $C$DW$T$174, DW_AT_name("ldiv_t")
     956                            .dwattr $C$DW$T$174, DW_AT_type(*$C$DW$T$20)
     957                            .dwattr $C$DW$T$174, DW_AT_language(DW_LANG_C)
     958                            .dwattr $C$DW$T$174, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include
     959                            .dwattr $C$DW$T$174, DW_AT_decl_line(0x5e)
     960                            .dwattr $C$DW$T$174, DW_AT_decl_column(0x23)
     961                    
     962                    
     963                    $C$DW$T$21      .dwtag  DW_TAG_structure_type
     964                            .dwattr $C$DW$T$21, DW_AT_byte_size(0x10)
     965                    $C$DW$70        .dwtag  DW_TAG_member
     966                            .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$14)
     967                            .dwattr $C$DW$70, DW_AT_name("quot")
     968                            .dwattr $C$DW$70, DW_AT_TI_symbol_name("quot")
     969                            .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     970                            .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
     971                            .dwattr $C$DW$70, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/st
     972                            .dwattr $C$DW$70, DW_AT_decl_line(0x61)
     973                            .dwattr $C$DW$70, DW_AT_decl_column(0x1c)
     974                    
     975                    $C$DW$71        .dwtag  DW_TAG_member
     976                            .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$14)
     977                            .dwattr $C$DW$71, DW_AT_name("rem")
     978                            .dwattr $C$DW$71, DW_AT_TI_symbol_name("rem")
     979                            .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     980                            .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
     981                            .dwattr $C$DW$71, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/st
     982                            .dwattr $C$DW$71, DW_AT_decl_line(0x61)
     983                            .dwattr $C$DW$71, DW_AT_decl_column(0x22)
     984                    
     985                            .dwattr $C$DW$T$21, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/
     986                            .dwattr $C$DW$T$21, DW_AT_decl_line(0x61)
     987                            .dwattr $C$DW$T$21, DW_AT_decl_column(0x10)
     988                            .dwendtag $C$DW$T$21
     989                    
     990                    $C$DW$T$175     .dwtag  DW_TAG_typedef
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:22 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{5FC2008A-5F32-4C25-9FE7-4FDE3869A457} PAGE   19

     991                            .dwattr $C$DW$T$175, DW_AT_name("lldiv_t")
     992                            .dwattr $C$DW$T$175, DW_AT_type(*$C$DW$T$21)
     993                            .dwattr $C$DW$T$175, DW_AT_language(DW_LANG_C)
     994                            .dwattr $C$DW$T$175, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include
     995                            .dwattr $C$DW$T$175, DW_AT_decl_line(0x61)
     996                            .dwattr $C$DW$T$175, DW_AT_decl_column(0x29)
     997                    
     998                    
     999                    $C$DW$T$26      .dwtag  DW_TAG_structure_type
    1000                            .dwattr $C$DW$T$26, DW_AT_byte_size(0x08)
    1001                    $C$DW$72        .dwtag  DW_TAG_member
    1002                            .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$24)
    1003                            .dwattr $C$DW$72, DW_AT_name("pointerStack")
    1004                            .dwattr $C$DW$72, DW_AT_TI_symbol_name("pointerStack")
    1005                            .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1006                            .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
    1007                            .dwattr $C$DW$72, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stack
    1008                            .dwattr $C$DW$72, DW_AT_decl_line(0x3f5)
    1009                            .dwattr $C$DW$72, DW_AT_decl_column(0x16)
    1010                    
    1011                    $C$DW$73        .dwtag  DW_TAG_member
    1012                            .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$25)
    1013                            .dwattr $C$DW$73, DW_AT_name("directAPI")
    1014                            .dwattr $C$DW$73, DW_AT_TI_symbol_name("directAPI")
    1015                            .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1016                            .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
    1017                            .dwattr $C$DW$73, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stack
    1018                            .dwattr $C$DW$73, DW_AT_decl_line(0x3f6)
    1019                            .dwattr $C$DW$73, DW_AT_decl_column(0x15)
    1020                    
    1021                            .dwattr $C$DW$T$26, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154sta
    1022                            .dwattr $C$DW$T$26, DW_AT_decl_line(0x3f4)
    1023                            .dwattr $C$DW$T$26, DW_AT_decl_column(0x01)
    1024                            .dwendtag $C$DW$T$26
    1025                    
    1026                    $C$DW$T$28      .dwtag  DW_TAG_typedef
    1027                            .dwattr $C$DW$T$28, DW_AT_name("icall_directAPIMsg_t")
    1028                            .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$26)
    1029                            .dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
    1030                            .dwattr $C$DW$T$28, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154sta
    1031                            .dwattr $C$DW$T$28, DW_AT_decl_line(0x3f7)
    1032                            .dwattr $C$DW$T$28, DW_AT_decl_column(0x03)
    1033                    
    1034                    
    1035                    $C$DW$T$29      .dwtag  DW_TAG_structure_type
    1036                            .dwattr $C$DW$T$29, DW_AT_byte_size(0x14)
    1037                    $C$DW$74        .dwtag  DW_TAG_member
    1038                            .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$27)
    1039                            .dwattr $C$DW$74, DW_AT_name("hdr")
    1040                            .dwattr $C$DW$74, DW_AT_TI_symbol_name("hdr")
    1041                            .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1042                            .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
    1043                            .dwattr $C$DW$74, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stack
    1044                            .dwattr $C$DW$74, DW_AT_decl_line(0x3fb)
    1045                            .dwattr $C$DW$74, DW_AT_decl_column(0x10)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:22 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{5FC2008A-5F32-4C25-9FE7-4FDE3869A457} PAGE   20

    1046                    
    1047                    $C$DW$75        .dwtag  DW_TAG_member
    1048                            .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$28)
    1049                            .dwattr $C$DW$75, DW_AT_name("msg")
    1050                            .dwattr $C$DW$75, DW_AT_TI_symbol_name("msg")
    1051                            .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1052                            .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
    1053                            .dwattr $C$DW$75, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stack
    1054                            .dwattr $C$DW$75, DW_AT_decl_line(0x3fc)
    1055                            .dwattr $C$DW$75, DW_AT_decl_column(0x1a)
    1056                    
    1057                            .dwattr $C$DW$T$29, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154sta
    1058                            .dwattr $C$DW$T$29, DW_AT_decl_line(0x3fa)
    1059                            .dwattr $C$DW$T$29, DW_AT_decl_column(0x01)
    1060                            .dwendtag $C$DW$T$29
    1061                    
    1062                    $C$DW$T$176     .dwtag  DW_TAG_typedef
    1063                            .dwattr $C$DW$T$176, DW_AT_name("icallLiteMsg_t")
    1064                            .dwattr $C$DW$T$176, DW_AT_type(*$C$DW$T$29)
    1065                            .dwattr $C$DW$T$176, DW_AT_language(DW_LANG_C)
    1066                            .dwattr $C$DW$T$176, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154st
    1067                            .dwattr $C$DW$T$176, DW_AT_decl_line(0x3fd)
    1068                            .dwattr $C$DW$T$176, DW_AT_decl_column(0x03)
    1069                    
    1070                    
    1071                    $C$DW$T$31      .dwtag  DW_TAG_structure_type
    1072                            .dwattr $C$DW$T$31, DW_AT_byte_size(0x02)
    1073                    $C$DW$76        .dwtag  DW_TAG_member
    1074                            .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$30)
    1075                            .dwattr $C$DW$76, DW_AT_name("event")
    1076                            .dwattr $C$DW$76, DW_AT_TI_symbol_name("event")
    1077                            .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1078                            .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1079                            .dwattr $C$DW$76, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MAC
    1080                            .dwattr $C$DW$76, DW_AT_decl_line(0x79)
    1081                            .dwattr $C$DW$76, DW_AT_decl_column(0x0a)
    1082                    
    1083                    $C$DW$77        .dwtag  DW_TAG_member
    1084                            .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$30)
    1085                            .dwattr $C$DW$77, DW_AT_name("status")
    1086                            .dwattr $C$DW$77, DW_AT_TI_symbol_name("status")
    1087                            .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1088                            .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1089                            .dwattr $C$DW$77, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MAC
    1090                            .dwattr $C$DW$77, DW_AT_decl_line(0x7a)
    1091                            .dwattr $C$DW$77, DW_AT_decl_column(0x0a)
    1092                    
    1093                            .dwattr $C$DW$T$31, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/M
    1094                            .dwattr $C$DW$T$31, DW_AT_decl_line(0x78)
    1095                            .dwattr $C$DW$T$31, DW_AT_decl_column(0x01)
    1096                            .dwendtag $C$DW$T$31
    1097                    
    1098                    $C$DW$T$177     .dwtag  DW_TAG_typedef
    1099                            .dwattr $C$DW$T$177, DW_AT_name("osal_event_hdr_t")
    1100                            .dwattr $C$DW$T$177, DW_AT_type(*$C$DW$T$31)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:22 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{5FC2008A-5F32-4C25-9FE7-4FDE3869A457} PAGE   21

    1101                            .dwattr $C$DW$T$177, DW_AT_language(DW_LANG_C)
    1102                            .dwattr $C$DW$T$177, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/
    1103                            .dwattr $C$DW$T$177, DW_AT_decl_line(0x7b)
    1104                            .dwattr $C$DW$T$177, DW_AT_decl_column(0x03)
    1105                    
    1106                    
    1107                    $C$DW$T$32      .dwtag  DW_TAG_structure_type
    1108                            .dwattr $C$DW$T$32, DW_AT_byte_size(0x0a)
    1109                    $C$DW$78        .dwtag  DW_TAG_member
    1110                            .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$87)
    1111                            .dwattr $C$DW$78, DW_AT_name("addr")
    1112                            .dwattr $C$DW$78, DW_AT_TI_symbol_name("addr")
    1113                            .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1114                            .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1115                            .dwattr $C$DW$78, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/Ser
    1116                            .dwattr $C$DW$78, DW_AT_decl_line(0x52)
    1117                            .dwattr $C$DW$78, DW_AT_decl_column(0x05)
    1118                    
    1119                    $C$DW$79        .dwtag  DW_TAG_member
    1120                            .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$30)
    1121                            .dwattr $C$DW$79, DW_AT_name("addrMode")
    1122                            .dwattr $C$DW$79, DW_AT_TI_symbol_name("addrMode")
    1123                            .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1124                            .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1125                            .dwattr $C$DW$79, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/Ser
    1126                            .dwattr $C$DW$79, DW_AT_decl_line(0x53)
    1127                            .dwattr $C$DW$79, DW_AT_decl_column(0x11)
    1128                    
    1129                            .dwattr $C$DW$T$32, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/S
    1130                            .dwattr $C$DW$T$32, DW_AT_decl_line(0x4d)
    1131                            .dwattr $C$DW$T$32, DW_AT_decl_column(0x01)
    1132                            .dwendtag $C$DW$T$32
    1133                    
    1134                    $C$DW$T$178     .dwtag  DW_TAG_typedef
    1135                            .dwattr $C$DW$T$178, DW_AT_name("sAddr_t")
    1136                            .dwattr $C$DW$T$178, DW_AT_type(*$C$DW$T$32)
    1137                            .dwattr $C$DW$T$178, DW_AT_language(DW_LANG_C)
    1138                            .dwattr $C$DW$T$178, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/
    1139                            .dwattr $C$DW$T$178, DW_AT_decl_line(0x54)
    1140                            .dwattr $C$DW$T$178, DW_AT_decl_column(0x03)
    1141                    
    1142                    
    1143                    $C$DW$T$34      .dwtag  DW_TAG_structure_type
    1144                            .dwattr $C$DW$T$34, DW_AT_byte_size(0x0a)
    1145                    $C$DW$80        .dwtag  DW_TAG_member
    1146                            .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$90)
    1147                            .dwattr $C$DW$80, DW_AT_name("addr")
    1148                            .dwattr $C$DW$80, DW_AT_TI_symbol_name("addr")
    1149                            .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1150                            .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1151                            .dwattr $C$DW$80, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stack
    1152                            .dwattr $C$DW$80, DW_AT_decl_line(0x139)
    1153                            .dwattr $C$DW$80, DW_AT_decl_column(0x05)
    1154                    
    1155                    $C$DW$81        .dwtag  DW_TAG_member
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:22 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{5FC2008A-5F32-4C25-9FE7-4FDE3869A457} PAGE   22

    1156                            .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$33)
    1157                            .dwattr $C$DW$81, DW_AT_name("addrMode")
    1158                            .dwattr $C$DW$81, DW_AT_TI_symbol_name("addrMode")
    1159                            .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1160                            .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1161                            .dwattr $C$DW$81, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stack
    1162                            .dwattr $C$DW$81, DW_AT_decl_line(0x13a)
    1163                            .dwattr $C$DW$81, DW_AT_decl_column(0x08)
    1164                    
    1165                            .dwattr $C$DW$T$34, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154sta
    1166                            .dwattr $C$DW$T$34, DW_AT_decl_line(0x134)
    1167                            .dwattr $C$DW$T$34, DW_AT_decl_column(0x01)
    1168                            .dwendtag $C$DW$T$34
    1169                    
    1170                    $C$DW$T$179     .dwtag  DW_TAG_typedef
    1171                            .dwattr $C$DW$T$179, DW_AT_name("zAddrType_t")
    1172                            .dwattr $C$DW$T$179, DW_AT_type(*$C$DW$T$34)
    1173                            .dwattr $C$DW$T$179, DW_AT_language(DW_LANG_C)
    1174                            .dwattr $C$DW$T$179, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154st
    1175                            .dwattr $C$DW$T$179, DW_AT_decl_line(0x13b)
    1176                            .dwattr $C$DW$T$179, DW_AT_decl_column(0x03)
    1177                    
    1178                    
    1179                    $C$DW$T$37      .dwtag  DW_TAG_structure_type
    1180                            .dwattr $C$DW$T$37, DW_AT_byte_size(0x0c)
    1181                    $C$DW$82        .dwtag  DW_TAG_member
    1182                            .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$30)
    1183                            .dwattr $C$DW$82, DW_AT_name("txCounter")
    1184                            .dwattr $C$DW$82, DW_AT_TI_symbol_name("txCounter")
    1185                            .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1186                            .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1187                            .dwattr $C$DW$82, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stack
    1188                            .dwattr $C$DW$82, DW_AT_decl_line(0x198)
    1189                            .dwattr $C$DW$82, DW_AT_decl_column(0x0a)
    1190                    
    1191                    $C$DW$83        .dwtag  DW_TAG_member
    1192                            .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$30)
    1193                            .dwattr $C$DW$83, DW_AT_name("txCost")
    1194                            .dwattr $C$DW$83, DW_AT_TI_symbol_name("txCost")
    1195                            .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1196                            .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1197                            .dwattr $C$DW$83, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stack
    1198                            .dwattr $C$DW$83, DW_AT_decl_line(0x199)
    1199                            .dwattr $C$DW$83, DW_AT_decl_column(0x0a)
    1200                    
    1201                    $C$DW$84        .dwtag  DW_TAG_member
    1202                            .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$30)
    1203                            .dwattr $C$DW$84, DW_AT_name("rxLqi")
    1204                            .dwattr $C$DW$84, DW_AT_TI_symbol_name("rxLqi")
    1205                            .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1206                            .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1207                            .dwattr $C$DW$84, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stack
    1208                            .dwattr $C$DW$84, DW_AT_decl_line(0x19b)
    1209                            .dwattr $C$DW$84, DW_AT_decl_column(0x0a)
    1210                    
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:22 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{5FC2008A-5F32-4C25-9FE7-4FDE3869A457} PAGE   23

    1211                    $C$DW$85        .dwtag  DW_TAG_member
    1212                            .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$30)
    1213                            .dwattr $C$DW$85, DW_AT_name("inKeySeqNum")
    1214                            .dwattr $C$DW$85, DW_AT_TI_symbol_name("inKeySeqNum")
    1215                            .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1216                            .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1217                            .dwattr $C$DW$85, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stack
    1218                            .dwattr $C$DW$85, DW_AT_decl_line(0x19d)
    1219                            .dwattr $C$DW$85, DW_AT_decl_column(0x0a)
    1220                    
    1221                    $C$DW$86        .dwtag  DW_TAG_member
    1222                            .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$35)
    1223                            .dwattr $C$DW$86, DW_AT_name("inFrmCntr")
    1224                            .dwattr $C$DW$86, DW_AT_TI_symbol_name("inFrmCntr")
    1225                            .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1226                            .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1227                            .dwattr $C$DW$86, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stack
    1228                            .dwattr $C$DW$86, DW_AT_decl_line(0x19e)
    1229                            .dwattr $C$DW$86, DW_AT_decl_column(0x0a)
    1230                    
    1231                    $C$DW$87        .dwtag  DW_TAG_member
    1232                            .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$36)
    1233                            .dwattr $C$DW$87, DW_AT_name("txFailure")
    1234                            .dwattr $C$DW$87, DW_AT_TI_symbol_name("txFailure")
    1235                            .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1236                            .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1237                            .dwattr $C$DW$87, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stack
    1238                            .dwattr $C$DW$87, DW_AT_decl_line(0x19f)
    1239                            .dwattr $C$DW$87, DW_AT_decl_column(0x0a)
    1240                    
    1241                            .dwattr $C$DW$T$37, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154sta
    1242                            .dwattr $C$DW$T$37, DW_AT_decl_line(0x197)
    1243                            .dwattr $C$DW$T$37, DW_AT_decl_column(0x01)
    1244                            .dwendtag $C$DW$T$37
    1245                    
    1246                    $C$DW$T$180     .dwtag  DW_TAG_typedef
    1247                            .dwattr $C$DW$T$180, DW_AT_name("linkInfo_t")
    1248                            .dwattr $C$DW$T$180, DW_AT_type(*$C$DW$T$37)
    1249                            .dwattr $C$DW$T$180, DW_AT_language(DW_LANG_C)
    1250                            .dwattr $C$DW$T$180, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154st
    1251                            .dwattr $C$DW$T$180, DW_AT_decl_line(0x1a0)
    1252                            .dwattr $C$DW$T$180, DW_AT_decl_column(0x03)
    1253                    
    1254                    
    1255                    $C$DW$T$78      .dwtag  DW_TAG_structure_type
    1256                            .dwattr $C$DW$T$78, DW_AT_byte_size(0x4c)
    1257                    $C$DW$88        .dwtag  DW_TAG_member
    1258                            .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$42)
    1259                            .dwattr $C$DW$88, DW_AT_name("Crc32")
    1260                            .dwattr $C$DW$88, DW_AT_TI_symbol_name("Crc32")
    1261                            .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1262                            .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1263                            .dwattr $C$DW$88, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\cc
    1264                            .dwattr $C$DW$88, DW_AT_decl_line(0x76)
    1265                            .dwattr $C$DW$88, DW_AT_decl_column(0x25)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:22 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{5FC2008A-5F32-4C25-9FE7-4FDE3869A457} PAGE   24

    1266                    
    1267                    $C$DW$89        .dwtag  DW_TAG_member
    1268                            .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$45)
    1269                            .dwattr $C$DW$89, DW_AT_name("FlashGetSize")
    1270                            .dwattr $C$DW$89, DW_AT_TI_symbol_name("FlashGetSize")
    1271                            .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1272                            .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1273                            .dwattr $C$DW$89, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\cc
    1274                            .dwattr $C$DW$89, DW_AT_decl_line(0x77)
    1275                            .dwattr $C$DW$89, DW_AT_decl_column(0x25)
    1276                    
    1277                    $C$DW$90        .dwtag  DW_TAG_member
    1278                            .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$46)
    1279                            .dwattr $C$DW$90, DW_AT_name("GetChipId")
    1280                            .dwattr $C$DW$90, DW_AT_TI_symbol_name("GetChipId")
    1281                            .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1282                            .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1283                            .dwattr $C$DW$90, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\cc
    1284                            .dwattr $C$DW$90, DW_AT_decl_line(0x78)
    1285                            .dwattr $C$DW$90, DW_AT_decl_column(0x25)
    1286                    
    1287                    $C$DW$91        .dwtag  DW_TAG_member
    1288                            .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$49)
    1289                            .dwattr $C$DW$91, DW_AT_name("ReservedLocation1")
    1290                            .dwattr $C$DW$91, DW_AT_TI_symbol_name("ReservedLocation1")
    1291                            .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1292                            .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1293                            .dwattr $C$DW$91, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\cc
    1294                            .dwattr $C$DW$91, DW_AT_decl_line(0x79)
    1295                            .dwattr $C$DW$91, DW_AT_decl_column(0x25)
    1296                    
    1297                    $C$DW$92        .dwtag  DW_TAG_member
    1298                            .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$50)
    1299                            .dwattr $C$DW$92, DW_AT_name("ReservedLocation2")
    1300                            .dwattr $C$DW$92, DW_AT_TI_symbol_name("ReservedLocation2")
    1301                            .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1302                            .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1303                            .dwattr $C$DW$92, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\cc
    1304                            .dwattr $C$DW$92, DW_AT_decl_line(0x7a)
    1305                            .dwattr $C$DW$92, DW_AT_decl_column(0x25)
    1306                    
    1307                    $C$DW$93        .dwtag  DW_TAG_member
    1308                            .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$51)
    1309                            .dwattr $C$DW$93, DW_AT_name("ReservedLocation3")
    1310                            .dwattr $C$DW$93, DW_AT_TI_symbol_name("ReservedLocation3")
    1311                            .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1312                            .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1313                            .dwattr $C$DW$93, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\cc
    1314                            .dwattr $C$DW$93, DW_AT_decl_line(0x7b)
    1315                            .dwattr $C$DW$93, DW_AT_decl_column(0x25)
    1316                    
    1317                    $C$DW$94        .dwtag  DW_TAG_member
    1318                            .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$54)
    1319                            .dwattr $C$DW$94, DW_AT_name("ResetDevice")
    1320                            .dwattr $C$DW$94, DW_AT_TI_symbol_name("ResetDevice")
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:22 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{5FC2008A-5F32-4C25-9FE7-4FDE3869A457} PAGE   25

    1321                            .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1322                            .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1323                            .dwattr $C$DW$94, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\cc
    1324                            .dwattr $C$DW$94, DW_AT_decl_line(0x7c)
    1325                            .dwattr $C$DW$94, DW_AT_decl_column(0x25)
    1326                    
    1327                    $C$DW$95        .dwtag  DW_TAG_member
    1328                            .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$59)
    1329                            .dwattr $C$DW$95, DW_AT_name("Fletcher32")
    1330                            .dwattr $C$DW$95, DW_AT_TI_symbol_name("Fletcher32")
    1331                            .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1332                            .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1333                            .dwattr $C$DW$95, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\cc
    1334                            .dwattr $C$DW$95, DW_AT_decl_line(0x7d)
    1335                            .dwattr $C$DW$95, DW_AT_decl_column(0x25)
    1336                    
    1337                    $C$DW$96        .dwtag  DW_TAG_member
    1338                            .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$63)
    1339                            .dwattr $C$DW$96, DW_AT_name("MinValue")
    1340                            .dwattr $C$DW$96, DW_AT_TI_symbol_name("MinValue")
    1341                            .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1342                            .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1343                            .dwattr $C$DW$96, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\cc
    1344                            .dwattr $C$DW$96, DW_AT_decl_line(0x7e)
    1345                            .dwattr $C$DW$96, DW_AT_decl_column(0x25)
    1346                    
    1347                    $C$DW$97        .dwtag  DW_TAG_member
    1348                            .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$64)
    1349                            .dwattr $C$DW$97, DW_AT_name("MaxValue")
    1350                            .dwattr $C$DW$97, DW_AT_TI_symbol_name("MaxValue")
    1351                            .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1352                            .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1353                            .dwattr $C$DW$97, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\cc
    1354                            .dwattr $C$DW$97, DW_AT_decl_line(0x7f)
    1355                            .dwattr $C$DW$97, DW_AT_decl_column(0x25)
    1356                    
    1357                    $C$DW$98        .dwtag  DW_TAG_member
    1358                            .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$65)
    1359                            .dwattr $C$DW$98, DW_AT_name("MeanValue")
    1360                            .dwattr $C$DW$98, DW_AT_TI_symbol_name("MeanValue")
    1361                            .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    1362                            .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1363                            .dwattr $C$DW$98, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\cc
    1364                            .dwattr $C$DW$98, DW_AT_decl_line(0x80)
    1365                            .dwattr $C$DW$98, DW_AT_decl_column(0x25)
    1366                    
    1367                    $C$DW$99        .dwtag  DW_TAG_member
    1368                            .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$66)
    1369                            .dwattr $C$DW$99, DW_AT_name("StandDeviationValue")
    1370                            .dwattr $C$DW$99, DW_AT_TI_symbol_name("StandDeviationValue")
    1371                            .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    1372                            .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1373                            .dwattr $C$DW$99, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\cc
    1374                            .dwattr $C$DW$99, DW_AT_decl_line(0x81)
    1375                            .dwattr $C$DW$99, DW_AT_decl_column(0x25)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:22 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{5FC2008A-5F32-4C25-9FE7-4FDE3869A457} PAGE   26

    1376                    
    1377                    $C$DW$100       .dwtag  DW_TAG_member
    1378                            .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$69)
    1379                            .dwattr $C$DW$100, DW_AT_name("ReservedLocation4")
    1380                            .dwattr $C$DW$100, DW_AT_TI_symbol_name("ReservedLocation4")
    1381                            .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    1382                            .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1383                            .dwattr $C$DW$100, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    1384                            .dwattr $C$DW$100, DW_AT_decl_line(0x82)
    1385                            .dwattr $C$DW$100, DW_AT_decl_column(0x25)
    1386                    
    1387                    $C$DW$101       .dwtag  DW_TAG_member
    1388                            .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$70)
    1389                            .dwattr $C$DW$101, DW_AT_name("ReservedLocation5")
    1390                            .dwattr $C$DW$101, DW_AT_TI_symbol_name("ReservedLocation5")
    1391                            .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    1392                            .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1393                            .dwattr $C$DW$101, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    1394                            .dwattr $C$DW$101, DW_AT_decl_line(0x83)
    1395                            .dwattr $C$DW$101, DW_AT_decl_column(0x25)
    1396                    
    1397                    $C$DW$102       .dwtag  DW_TAG_member
    1398                            .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$71)
    1399                            .dwattr $C$DW$102, DW_AT_name("HFSourceSafeSwitch")
    1400                            .dwattr $C$DW$102, DW_AT_TI_symbol_name("HFSourceSafeSwitch")
    1401                            .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    1402                            .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1403                            .dwattr $C$DW$102, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    1404                            .dwattr $C$DW$102, DW_AT_decl_line(0x84)
    1405                            .dwattr $C$DW$102, DW_AT_decl_column(0x25)
    1406                    
    1407                    $C$DW$103       .dwtag  DW_TAG_member
    1408                            .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$74)
    1409                            .dwattr $C$DW$103, DW_AT_name("SelectCompAInput")
    1410                            .dwattr $C$DW$103, DW_AT_TI_symbol_name("SelectCompAInput")
    1411                            .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    1412                            .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1413                            .dwattr $C$DW$103, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    1414                            .dwattr $C$DW$103, DW_AT_decl_line(0x85)
    1415                            .dwattr $C$DW$103, DW_AT_decl_column(0x25)
    1416                    
    1417                    $C$DW$104       .dwtag  DW_TAG_member
    1418                            .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$75)
    1419                            .dwattr $C$DW$104, DW_AT_name("SelectCompARef")
    1420                            .dwattr $C$DW$104, DW_AT_TI_symbol_name("SelectCompARef")
    1421                            .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    1422                            .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1423                            .dwattr $C$DW$104, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    1424                            .dwattr $C$DW$104, DW_AT_decl_line(0x86)
    1425                            .dwattr $C$DW$104, DW_AT_decl_column(0x25)
    1426                    
    1427                    $C$DW$105       .dwtag  DW_TAG_member
    1428                            .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$76)
    1429                            .dwattr $C$DW$105, DW_AT_name("SelectADCCompBInput")
    1430                            .dwattr $C$DW$105, DW_AT_TI_symbol_name("SelectADCCompBInput")
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:22 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{5FC2008A-5F32-4C25-9FE7-4FDE3869A457} PAGE   27

    1431                            .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    1432                            .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1433                            .dwattr $C$DW$105, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    1434                            .dwattr $C$DW$105, DW_AT_decl_line(0x87)
    1435                            .dwattr $C$DW$105, DW_AT_decl_column(0x25)
    1436                    
    1437                    $C$DW$106       .dwtag  DW_TAG_member
    1438                            .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$77)
    1439                            .dwattr $C$DW$106, DW_AT_name("SelectCompBRef")
    1440                            .dwattr $C$DW$106, DW_AT_TI_symbol_name("SelectCompBRef")
    1441                            .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    1442                            .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1443                            .dwattr $C$DW$106, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    1444                            .dwattr $C$DW$106, DW_AT_decl_line(0x88)
    1445                            .dwattr $C$DW$106, DW_AT_decl_column(0x25)
    1446                    
    1447                            .dwattr $C$DW$T$78, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\
    1448                            .dwattr $C$DW$T$78, DW_AT_decl_line(0x75)
    1449                            .dwattr $C$DW$T$78, DW_AT_decl_column(0x01)
    1450                            .dwendtag $C$DW$T$78
    1451                    
    1452                    $C$DW$T$181     .dwtag  DW_TAG_typedef
    1453                            .dwattr $C$DW$T$181, DW_AT_name("HARD_API_T")
    1454                            .dwattr $C$DW$T$181, DW_AT_type(*$C$DW$T$78)
    1455                            .dwattr $C$DW$T$181, DW_AT_language(DW_LANG_C)
    1456                            .dwattr $C$DW$T$181, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices
    1457                            .dwattr $C$DW$T$181, DW_AT_decl_line(0x89)
    1458                            .dwattr $C$DW$T$181, DW_AT_decl_column(0x03)
    1459                    
    1460                    
    1461                    $C$DW$T$83      .dwtag  DW_TAG_union_type
    1462                            .dwattr $C$DW$T$83, DW_AT_byte_size(0x02)
    1463                    $C$DW$107       .dwtag  DW_TAG_member
    1464                            .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$80)
    1465                            .dwattr $C$DW$107, DW_AT_name("entityId")
    1466                            .dwattr $C$DW$107, DW_AT_TI_symbol_name("entityId")
    1467                            .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1468                            .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1469                            .dwattr $C$DW$107, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    1470                            .dwattr $C$DW$107, DW_AT_decl_line(0x1fe)
    1471                            .dwattr $C$DW$107, DW_AT_decl_column(0x14)
    1472                    
    1473                    $C$DW$108       .dwtag  DW_TAG_member
    1474                            .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$82)
    1475                            .dwattr $C$DW$108, DW_AT_name("servId")
    1476                            .dwattr $C$DW$108, DW_AT_TI_symbol_name("servId")
    1477                            .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1478                            .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1479                            .dwattr $C$DW$108, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    1480                            .dwattr $C$DW$108, DW_AT_decl_line(0x200)
    1481                            .dwattr $C$DW$108, DW_AT_decl_column(0x17)
    1482                    
    1483                            .dwattr $C$DW$T$83, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154sta
    1484                            .dwattr $C$DW$T$83, DW_AT_decl_line(0x1fc)
    1485                            .dwattr $C$DW$T$83, DW_AT_decl_column(0x03)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:22 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{5FC2008A-5F32-4C25-9FE7-4FDE3869A457} PAGE   28

    1486                            .dwendtag $C$DW$T$83
    1487                    
    1488                    
    1489                    $C$DW$T$84      .dwtag  DW_TAG_union_type
    1490                            .dwattr $C$DW$T$84, DW_AT_byte_size(0x02)
    1491                    $C$DW$109       .dwtag  DW_TAG_member
    1492                            .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$82)
    1493                            .dwattr $C$DW$109, DW_AT_name("servId")
    1494                            .dwattr $C$DW$109, DW_AT_TI_symbol_name("servId")
    1495                            .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1496                            .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1497                            .dwattr $C$DW$109, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    1498                            .dwattr $C$DW$109, DW_AT_decl_line(0x211)
    1499                            .dwattr $C$DW$109, DW_AT_decl_column(0x17)
    1500                    
    1501                    $C$DW$110       .dwtag  DW_TAG_member
    1502                            .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$80)
    1503                            .dwattr $C$DW$110, DW_AT_name("entityId")
    1504                            .dwattr $C$DW$110, DW_AT_TI_symbol_name("entityId")
    1505                            .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1506                            .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1507                            .dwattr $C$DW$110, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    1508                            .dwattr $C$DW$110, DW_AT_decl_line(0x213)
    1509                            .dwattr $C$DW$110, DW_AT_decl_column(0x14)
    1510                    
    1511                            .dwattr $C$DW$T$84, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154sta
    1512                            .dwattr $C$DW$T$84, DW_AT_decl_line(0x20f)
    1513                            .dwattr $C$DW$T$84, DW_AT_decl_column(0x03)
    1514                            .dwendtag $C$DW$T$84
    1515                    
    1516                    
    1517                    $C$DW$T$87      .dwtag  DW_TAG_union_type
    1518                            .dwattr $C$DW$T$87, DW_AT_byte_size(0x08)
    1519                    $C$DW$111       .dwtag  DW_TAG_member
    1520                            .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$36)
    1521                            .dwattr $C$DW$111, DW_AT_name("shortAddr")
    1522                            .dwattr $C$DW$111, DW_AT_TI_symbol_name("shortAddr")
    1523                            .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1524                            .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1525                            .dwattr $C$DW$111, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/Se
    1526                            .dwattr $C$DW$111, DW_AT_decl_line(0x50)
    1527                            .dwattr $C$DW$111, DW_AT_decl_column(0x11)
    1528                    
    1529                    $C$DW$112       .dwtag  DW_TAG_member
    1530                            .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$86)
    1531                            .dwattr $C$DW$112, DW_AT_name("extAddr")
    1532                            .dwattr $C$DW$112, DW_AT_TI_symbol_name("extAddr")
    1533                            .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1534                            .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1535                            .dwattr $C$DW$112, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/Se
    1536                            .dwattr $C$DW$112, DW_AT_decl_line(0x51)
    1537                            .dwattr $C$DW$112, DW_AT_decl_column(0x11)
    1538                    
    1539                            .dwattr $C$DW$T$87, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/S
    1540                            .dwattr $C$DW$T$87, DW_AT_decl_line(0x4f)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:22 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{5FC2008A-5F32-4C25-9FE7-4FDE3869A457} PAGE   29

    1541                            .dwattr $C$DW$T$87, DW_AT_decl_column(0x03)
    1542                            .dwendtag $C$DW$T$87
    1543                    
    1544                    
    1545                    $C$DW$T$90      .dwtag  DW_TAG_union_type
    1546                            .dwattr $C$DW$T$90, DW_AT_byte_size(0x08)
    1547                    $C$DW$113       .dwtag  DW_TAG_member
    1548                            .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$36)
    1549                            .dwattr $C$DW$113, DW_AT_name("shortAddr")
    1550                            .dwattr $C$DW$113, DW_AT_TI_symbol_name("shortAddr")
    1551                            .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1552                            .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1553                            .dwattr $C$DW$113, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    1554                            .dwattr $C$DW$113, DW_AT_decl_line(0x137)
    1555                            .dwattr $C$DW$113, DW_AT_decl_column(0x11)
    1556                    
    1557                    $C$DW$114       .dwtag  DW_TAG_member
    1558                            .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$89)
    1559                            .dwattr $C$DW$114, DW_AT_name("extAddr")
    1560                            .dwattr $C$DW$114, DW_AT_TI_symbol_name("extAddr")
    1561                            .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1562                            .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1563                            .dwattr $C$DW$114, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    1564                            .dwattr $C$DW$114, DW_AT_decl_line(0x138)
    1565                            .dwattr $C$DW$114, DW_AT_decl_column(0x11)
    1566                    
    1567                            .dwattr $C$DW$T$90, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154sta
    1568                            .dwattr $C$DW$T$90, DW_AT_decl_line(0x136)
    1569                            .dwattr $C$DW$T$90, DW_AT_decl_column(0x03)
    1570                            .dwendtag $C$DW$T$90
    1571                    
    1572                    
    1573                    $C$DW$T$91      .dwtag  DW_TAG_structure_type
    1574                            .dwattr $C$DW$T$91, DW_AT_name("_ICall_LiteCmdStatus_")
    1575                            .dwattr $C$DW$T$91, DW_AT_byte_size(0x01)
    1576                    $C$DW$115       .dwtag  DW_TAG_member
    1577                            .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$79)
    1578                            .dwattr $C$DW$115, DW_AT_name("cmdId")
    1579                            .dwattr $C$DW$115, DW_AT_TI_symbol_name("cmdId")
    1580                            .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1581                            .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1582                            .dwattr $C$DW$115, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    1583                            .dwattr $C$DW$115, DW_AT_decl_line(0x3f0)
    1584                            .dwattr $C$DW$115, DW_AT_decl_column(0x11)
    1585                    
    1586                            .dwattr $C$DW$T$91, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154sta
    1587                            .dwattr $C$DW$T$91, DW_AT_decl_line(0x3ee)
    1588                            .dwattr $C$DW$T$91, DW_AT_decl_column(0x10)
    1589                            .dwendtag $C$DW$T$91
    1590                    
    1591                    $C$DW$T$182     .dwtag  DW_TAG_typedef
    1592                            .dwattr $C$DW$T$182, DW_AT_name("ICall_LiteCmdStatus")
    1593                            .dwattr $C$DW$T$182, DW_AT_type(*$C$DW$T$91)
    1594                            .dwattr $C$DW$T$182, DW_AT_language(DW_LANG_C)
    1595                            .dwattr $C$DW$T$182, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154st
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:22 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{5FC2008A-5F32-4C25-9FE7-4FDE3869A457} PAGE   30

    1596                            .dwattr $C$DW$T$182, DW_AT_decl_line(0x3f1)
    1597                            .dwattr $C$DW$T$182, DW_AT_decl_column(0x03)
    1598                    
    1599                    $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    1600                            .dwattr $C$DW$T$2, DW_AT_name("void")
    1601                    
    1602                    $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    1603                            .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
    1604                            .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
    1605                    
    1606                    $C$DW$T$183     .dwtag  DW_TAG_typedef
    1607                            .dwattr $C$DW$T$183, DW_AT_name("ICall_Semaphore")
    1608                            .dwattr $C$DW$T$183, DW_AT_type(*$C$DW$T$3)
    1609                            .dwattr $C$DW$T$183, DW_AT_language(DW_LANG_C)
    1610                            .dwattr $C$DW$T$183, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154st
    1611                            .dwattr $C$DW$T$183, DW_AT_decl_line(0x1ac)
    1612                            .dwattr $C$DW$T$183, DW_AT_decl_column(0x0f)
    1613                    
    1614                    $C$DW$T$105     .dwtag  DW_TAG_typedef
    1615                            .dwattr $C$DW$T$105, DW_AT_name("ICall_SyncHandle")
    1616                            .dwattr $C$DW$T$105, DW_AT_type(*$C$DW$T$3)
    1617                            .dwattr $C$DW$T$105, DW_AT_language(DW_LANG_C)
    1618                            .dwattr $C$DW$T$105, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154st
    1619                            .dwattr $C$DW$T$105, DW_AT_decl_line(0x1aa)
    1620                            .dwattr $C$DW$T$105, DW_AT_decl_column(0x0f)
    1621                    
    1622                    $C$DW$T$150     .dwtag  DW_TAG_typedef
    1623                            .dwattr $C$DW$T$150, DW_AT_name("ICall_TimerID")
    1624                            .dwattr $C$DW$T$150, DW_AT_type(*$C$DW$T$3)
    1625                            .dwattr $C$DW$T$150, DW_AT_language(DW_LANG_C)
    1626                            .dwattr $C$DW$T$150, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154st
    1627                            .dwattr $C$DW$T$150, DW_AT_decl_line(0x1b7)
    1628                            .dwattr $C$DW$T$150, DW_AT_decl_column(0x0f)
    1629                    
    1630                    $C$DW$T$184     .dwtag  DW_TAG_typedef
    1631                            .dwattr $C$DW$T$184, DW_AT_name("osal_msg_q_t")
    1632                            .dwattr $C$DW$T$184, DW_AT_type(*$C$DW$T$3)
    1633                            .dwattr $C$DW$T$184, DW_AT_language(DW_LANG_C)
    1634                            .dwattr $C$DW$T$184, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/
    1635                            .dwattr $C$DW$T$184, DW_AT_decl_line(0x7d)
    1636                            .dwattr $C$DW$T$184, DW_AT_decl_column(0x10)
    1637                    
    1638                    
    1639                    $C$DW$T$52      .dwtag  DW_TAG_subroutine_type
    1640                            .dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
    1641                            .dwendtag $C$DW$T$52
    1642                    
    1643                    $C$DW$T$53      .dwtag  DW_TAG_pointer_type
    1644                            .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$52)
    1645                            .dwattr $C$DW$T$53, DW_AT_address_class(0x20)
    1646                    
    1647                    $C$DW$T$166     .dwtag  DW_TAG_typedef
    1648                            .dwattr $C$DW$T$166, DW_AT_name("APPASRTINTF_callAssrtHndler")
    1649                            .dwattr $C$DW$T$166, DW_AT_type(*$C$DW$T$53)
    1650                            .dwattr $C$DW$T$166, DW_AT_language(DW_LANG_C)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:22 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{5FC2008A-5F32-4C25-9FE7-4FDE3869A457} PAGE   31

    1651                            .dwattr $C$DW$T$166, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154st
    1652                            .dwattr $C$DW$T$166, DW_AT_decl_line(0x43)
    1653                            .dwattr $C$DW$T$166, DW_AT_decl_column(0x10)
    1654                    
    1655                    $C$DW$T$71      .dwtag  DW_TAG_typedef
    1656                            .dwattr $C$DW$T$71, DW_AT_name("FPTR_HFSOURCESAFESWITCH_T")
    1657                            .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$53)
    1658                            .dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
    1659                            .dwattr $C$DW$T$71, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\
    1660                            .dwattr $C$DW$T$71, DW_AT_decl_line(0x5f)
    1661                            .dwattr $C$DW$T$71, DW_AT_decl_column(0x19)
    1662                    
    1663                    $C$DW$T$54      .dwtag  DW_TAG_typedef
    1664                            .dwattr $C$DW$T$54, DW_AT_name("FPTR_RESETDEV_T")
    1665                            .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$53)
    1666                            .dwattr $C$DW$T$54, DW_AT_language(DW_LANG_C)
    1667                            .dwattr $C$DW$T$54, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\
    1668                            .dwattr $C$DW$T$54, DW_AT_decl_line(0x4d)
    1669                            .dwattr $C$DW$T$54, DW_AT_decl_column(0x19)
    1670                    
    1671                    $C$DW$T$185     .dwtag  DW_TAG_typedef
    1672                            .dwattr $C$DW$T$185, DW_AT_name("FPTR_VOID_VOID_T")
    1673                            .dwattr $C$DW$T$185, DW_AT_type(*$C$DW$T$53)
    1674                            .dwattr $C$DW$T$185, DW_AT_language(DW_LANG_C)
    1675                            .dwattr $C$DW$T$185, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices
    1676                            .dwattr $C$DW$T$185, DW_AT_decl_line(0x33)
    1677                            .dwattr $C$DW$T$185, DW_AT_decl_column(0x11)
    1678                    
    1679                    $C$DW$T$186     .dwtag  DW_TAG_typedef
    1680                            .dwattr $C$DW$T$186, DW_AT_name("__TI_atexit_fn")
    1681                            .dwattr $C$DW$T$186, DW_AT_type(*$C$DW$T$53)
    1682                            .dwattr $C$DW$T$186, DW_AT_language(DW_LANG_C)
    1683                            .dwattr $C$DW$T$186, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include
    1684                            .dwattr $C$DW$T$186, DW_AT_decl_line(0xb9)
    1685                            .dwattr $C$DW$T$186, DW_AT_decl_column(0x14)
    1686                    
    1687                    
    1688                    $C$DW$T$67      .dwtag  DW_TAG_subroutine_type
    1689                            .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
    1690                    $C$DW$116       .dwtag  DW_TAG_formal_parameter
    1691                            .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$22)
    1692                    
    1693                            .dwendtag $C$DW$T$67
    1694                    
    1695                    $C$DW$T$68      .dwtag  DW_TAG_pointer_type
    1696                            .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$67)
    1697                            .dwattr $C$DW$T$68, DW_AT_address_class(0x20)
    1698                    
    1699                    $C$DW$T$69      .dwtag  DW_TAG_typedef
    1700                            .dwattr $C$DW$T$69, DW_AT_name("FPTR_RESERVED4_T")
    1701                            .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$68)
    1702                            .dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
    1703                            .dwattr $C$DW$T$69, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\
    1704                            .dwattr $C$DW$T$69, DW_AT_decl_line(0x61)
    1705                            .dwattr $C$DW$T$69, DW_AT_decl_column(0x19)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:22 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{5FC2008A-5F32-4C25-9FE7-4FDE3869A457} PAGE   32

    1706                    
    1707                    $C$DW$T$70      .dwtag  DW_TAG_typedef
    1708                            .dwattr $C$DW$T$70, DW_AT_name("FPTR_RESERVED5_T")
    1709                            .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$68)
    1710                            .dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)
    1711                            .dwattr $C$DW$T$70, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\
    1712                            .dwattr $C$DW$T$70, DW_AT_decl_line(0x63)
    1713                            .dwattr $C$DW$T$70, DW_AT_decl_column(0x19)
    1714                    
    1715                    
    1716                    $C$DW$T$72      .dwtag  DW_TAG_subroutine_type
    1717                            .dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
    1718                    $C$DW$117       .dwtag  DW_TAG_formal_parameter
    1719                            .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$38)
    1720                    
    1721                            .dwendtag $C$DW$T$72
    1722                    
    1723                    $C$DW$T$73      .dwtag  DW_TAG_pointer_type
    1724                            .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$72)
    1725                            .dwattr $C$DW$T$73, DW_AT_address_class(0x20)
    1726                    
    1727                    $C$DW$T$76      .dwtag  DW_TAG_typedef
    1728                            .dwattr $C$DW$T$76, DW_AT_name("FPTR_ADCCOMPBIN_T")
    1729                            .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$73)
    1730                            .dwattr $C$DW$T$76, DW_AT_language(DW_LANG_C)
    1731                            .dwattr $C$DW$T$76, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\
    1732                            .dwattr $C$DW$T$76, DW_AT_decl_line(0x69)
    1733                            .dwattr $C$DW$T$76, DW_AT_decl_column(0x19)
    1734                    
    1735                    $C$DW$T$74      .dwtag  DW_TAG_typedef
    1736                            .dwattr $C$DW$T$74, DW_AT_name("FPTR_COMPAIN_T")
    1737                            .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$73)
    1738                            .dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
    1739                            .dwattr $C$DW$T$74, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\
    1740                            .dwattr $C$DW$T$74, DW_AT_decl_line(0x65)
    1741                            .dwattr $C$DW$T$74, DW_AT_decl_column(0x19)
    1742                    
    1743                    $C$DW$T$75      .dwtag  DW_TAG_typedef
    1744                            .dwattr $C$DW$T$75, DW_AT_name("FPTR_COMPAREF_T")
    1745                            .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$73)
    1746                            .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    1747                            .dwattr $C$DW$T$75, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\
    1748                            .dwattr $C$DW$T$75, DW_AT_decl_line(0x67)
    1749                            .dwattr $C$DW$T$75, DW_AT_decl_column(0x19)
    1750                    
    1751                    $C$DW$T$77      .dwtag  DW_TAG_typedef
    1752                            .dwattr $C$DW$T$77, DW_AT_name("FPTR_COMPBREF_T")
    1753                            .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$73)
    1754                            .dwattr $C$DW$T$77, DW_AT_language(DW_LANG_C)
    1755                            .dwattr $C$DW$T$77, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\
    1756                            .dwattr $C$DW$T$77, DW_AT_decl_line(0x6b)
    1757                            .dwattr $C$DW$T$77, DW_AT_decl_column(0x19)
    1758                    
    1759                    $C$DW$T$187     .dwtag  DW_TAG_typedef
    1760                            .dwattr $C$DW$T$187, DW_AT_name("FPTR_VOID_UINT8_T")
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:22 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{5FC2008A-5F32-4C25-9FE7-4FDE3869A457} PAGE   33

    1761                            .dwattr $C$DW$T$187, DW_AT_type(*$C$DW$T$73)
    1762                            .dwattr $C$DW$T$187, DW_AT_language(DW_LANG_C)
    1763                            .dwattr $C$DW$T$187, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices
    1764                            .dwattr $C$DW$T$187, DW_AT_decl_line(0x34)
    1765                            .dwattr $C$DW$T$187, DW_AT_decl_column(0x11)
    1766                    
    1767                    
    1768                    $C$DW$T$95      .dwtag  DW_TAG_subroutine_type
    1769                            .dwattr $C$DW$T$95, DW_AT_language(DW_LANG_C)
    1770                    $C$DW$118       .dwtag  DW_TAG_formal_parameter
    1771                            .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$93)
    1772                    
    1773                            .dwendtag $C$DW$T$95
    1774                    
    1775                    $C$DW$T$96      .dwtag  DW_TAG_pointer_type
    1776                            .dwattr $C$DW$T$96, DW_AT_type(*$C$DW$T$95)
    1777                            .dwattr $C$DW$T$96, DW_AT_address_class(0x20)
    1778                    
    1779                    
    1780                    $C$DW$T$128     .dwtag  DW_TAG_subroutine_type
    1781                            .dwattr $C$DW$T$128, DW_AT_language(DW_LANG_C)
    1782                    $C$DW$119       .dwtag  DW_TAG_formal_parameter
    1783                            .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$126)
    1784                    
    1785                    $C$DW$120       .dwtag  DW_TAG_formal_parameter
    1786                            .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$127)
    1787                    
    1788                            .dwendtag $C$DW$T$128
    1789                    
    1790                    $C$DW$T$129     .dwtag  DW_TAG_pointer_type
    1791                            .dwattr $C$DW$T$129, DW_AT_type(*$C$DW$T$128)
    1792                            .dwattr $C$DW$T$129, DW_AT_address_class(0x20)
    1793                    
    1794                    $C$DW$T$130     .dwtag  DW_TAG_typedef
    1795                            .dwattr $C$DW$T$130, DW_AT_name("ICall_PwrNotifyFn")
    1796                            .dwattr $C$DW$T$130, DW_AT_type(*$C$DW$T$129)
    1797                            .dwattr $C$DW$T$130, DW_AT_language(DW_LANG_C)
    1798                            .dwattr $C$DW$T$130, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154st
    1799                            .dwattr $C$DW$T$130, DW_AT_decl_line(0x333)
    1800                            .dwattr $C$DW$T$130, DW_AT_decl_column(0x10)
    1801                    
    1802                    
    1803                    $C$DW$T$144     .dwtag  DW_TAG_subroutine_type
    1804                            .dwattr $C$DW$T$144, DW_AT_language(DW_LANG_C)
    1805                    $C$DW$121       .dwtag  DW_TAG_formal_parameter
    1806                            .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$140)
    1807                    
    1808                            .dwendtag $C$DW$T$144
    1809                    
    1810                    $C$DW$T$145     .dwtag  DW_TAG_pointer_type
    1811                            .dwattr $C$DW$T$145, DW_AT_type(*$C$DW$T$144)
    1812                            .dwattr $C$DW$T$145, DW_AT_address_class(0x20)
    1813                    
    1814                    $C$DW$T$146     .dwtag  DW_TAG_typedef
    1815                            .dwattr $C$DW$T$146, DW_AT_name("ICall_LeaveCS")
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:22 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{5FC2008A-5F32-4C25-9FE7-4FDE3869A457} PAGE   34

    1816                            .dwattr $C$DW$T$146, DW_AT_type(*$C$DW$T$145)
    1817                            .dwattr $C$DW$T$146, DW_AT_language(DW_LANG_C)
    1818                            .dwattr $C$DW$T$146, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154st
    1819                            .dwattr $C$DW$T$146, DW_AT_decl_line(0x37e)
    1820                            .dwattr $C$DW$T$146, DW_AT_decl_column(0x10)
    1821                    
    1822                    
    1823                    $C$DW$T$151     .dwtag  DW_TAG_subroutine_type
    1824                            .dwattr $C$DW$T$151, DW_AT_language(DW_LANG_C)
    1825                    $C$DW$122       .dwtag  DW_TAG_formal_parameter
    1826                            .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$3)
    1827                    
    1828                            .dwendtag $C$DW$T$151
    1829                    
    1830                    $C$DW$T$152     .dwtag  DW_TAG_pointer_type
    1831                            .dwattr $C$DW$T$152, DW_AT_type(*$C$DW$T$151)
    1832                            .dwattr $C$DW$T$152, DW_AT_address_class(0x20)
    1833                    
    1834                    $C$DW$T$153     .dwtag  DW_TAG_typedef
    1835                            .dwattr $C$DW$T$153, DW_AT_name("ICall_TimerCback")
    1836                            .dwattr $C$DW$T$153, DW_AT_type(*$C$DW$T$152)
    1837                            .dwattr $C$DW$T$153, DW_AT_language(DW_LANG_C)
    1838                            .dwattr $C$DW$T$153, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154st
    1839                            .dwattr $C$DW$T$153, DW_AT_decl_line(0x1c8)
    1840                            .dwattr $C$DW$T$153, DW_AT_decl_column(0x10)
    1841                    
    1842                    $C$DW$T$188     .dwtag  DW_TAG_typedef
    1843                            .dwattr $C$DW$T$188, DW_AT_name("osal_highres_timer_cback_t")
    1844                            .dwattr $C$DW$T$188, DW_AT_type(*$C$DW$T$152)
    1845                            .dwattr $C$DW$T$188, DW_AT_language(DW_LANG_C)
    1846                            .dwattr $C$DW$T$188, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/
    1847                            .dwattr $C$DW$T$188, DW_AT_decl_line(0x81)
    1848                            .dwattr $C$DW$T$188, DW_AT_decl_column(0x10)
    1849                    
    1850                    $C$DW$T$189     .dwtag  DW_TAG_typedef
    1851                            .dwattr $C$DW$T$189, DW_AT_name("osal_icallMsg_hook_t")
    1852                            .dwattr $C$DW$T$189, DW_AT_type(*$C$DW$T$152)
    1853                            .dwattr $C$DW$T$189, DW_AT_language(DW_LANG_C)
    1854                            .dwattr $C$DW$T$189, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/
    1855                            .dwattr $C$DW$T$189, DW_AT_decl_line(0x85)
    1856                            .dwattr $C$DW$T$189, DW_AT_decl_column(0x10)
    1857                    
    1858                    $C$DW$T$160     .dwtag  DW_TAG_const_type
    1859                            .dwattr $C$DW$T$160, DW_AT_type(*$C$DW$T$2)
    1860                    
    1861                    $C$DW$T$161     .dwtag  DW_TAG_pointer_type
    1862                            .dwattr $C$DW$T$161, DW_AT_type(*$C$DW$T$160)
    1863                            .dwattr $C$DW$T$161, DW_AT_address_class(0x20)
    1864                    
    1865                    
    1866                    $C$DW$T$192     .dwtag  DW_TAG_subroutine_type
    1867                            .dwattr $C$DW$T$192, DW_AT_language(DW_LANG_C)
    1868                    $C$DW$123       .dwtag  DW_TAG_formal_parameter
    1869                            .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$190)
    1870                    
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:22 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{5FC2008A-5F32-4C25-9FE7-4FDE3869A457} PAGE   35

    1871                    $C$DW$124       .dwtag  DW_TAG_formal_parameter
    1872                            .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$190)
    1873                    
    1874                            .dwendtag $C$DW$T$192
    1875                    
    1876                    $C$DW$T$193     .dwtag  DW_TAG_pointer_type
    1877                            .dwattr $C$DW$T$193, DW_AT_type(*$C$DW$T$192)
    1878                            .dwattr $C$DW$T$193, DW_AT_address_class(0x20)
    1879                    
    1880                    
    1881                    $C$DW$T$195     .dwtag  DW_TAG_subroutine_type
    1882                            .dwattr $C$DW$T$195, DW_AT_language(DW_LANG_C)
    1883                    $C$DW$125       .dwtag  DW_TAG_formal_parameter
    1884                            .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$30)
    1885                    
    1886                    $C$DW$126       .dwtag  DW_TAG_formal_parameter
    1887                            .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$30)
    1888                    
    1889                            .dwendtag $C$DW$T$195
    1890                    
    1891                    $C$DW$T$196     .dwtag  DW_TAG_pointer_type
    1892                            .dwattr $C$DW$T$196, DW_AT_type(*$C$DW$T$195)
    1893                            .dwattr $C$DW$T$196, DW_AT_address_class(0x20)
    1894                    
    1895                    $C$DW$T$197     .dwtag  DW_TAG_typedef
    1896                            .dwattr $C$DW$T$197, DW_AT_name("assertCback_t")
    1897                            .dwattr $C$DW$T$197, DW_AT_type(*$C$DW$T$196)
    1898                            .dwattr $C$DW$T$197, DW_AT_language(DW_LANG_C)
    1899                            .dwattr $C$DW$T$197, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154st
    1900                            .dwattr $C$DW$T$197, DW_AT_decl_line(0xd3)
    1901                            .dwattr $C$DW$T$197, DW_AT_decl_column(0x10)
    1902                    
    1903                    
    1904                    $C$DW$T$201     .dwtag  DW_TAG_subroutine_type
    1905                            .dwattr $C$DW$T$201, DW_AT_language(DW_LANG_C)
    1906                    $C$DW$127       .dwtag  DW_TAG_formal_parameter
    1907                            .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$200)
    1908                    
    1909                    $C$DW$128       .dwtag  DW_TAG_formal_parameter
    1910                            .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$3)
    1911                    
    1912                            .dwendtag $C$DW$T$201
    1913                    
    1914                    $C$DW$T$202     .dwtag  DW_TAG_pointer_type
    1915                            .dwattr $C$DW$T$202, DW_AT_type(*$C$DW$T$201)
    1916                            .dwattr $C$DW$T$202, DW_AT_address_class(0x20)
    1917                    
    1918                    $C$DW$T$203     .dwtag  DW_TAG_typedef
    1919                            .dwattr $C$DW$T$203, DW_AT_name("ICall_RemoteTaskEntry")
    1920                            .dwattr $C$DW$T$203, DW_AT_type(*$C$DW$T$202)
    1921                            .dwattr $C$DW$T$203, DW_AT_language(DW_LANG_C)
    1922                            .dwattr $C$DW$T$203, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154st
    1923                            .dwattr $C$DW$T$203, DW_AT_decl_line(0x39b)
    1924                            .dwattr $C$DW$T$203, DW_AT_decl_column(0x10)
    1925                    
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:22 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{5FC2008A-5F32-4C25-9FE7-4FDE3869A457} PAGE   36

    1926                    $C$DW$T$4       .dwtag  DW_TAG_base_type
    1927                            .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    1928                            .dwattr $C$DW$T$4, DW_AT_name("bool")
    1929                            .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    1930                    
    1931                    $C$DW$T$5       .dwtag  DW_TAG_base_type
    1932                            .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    1933                            .dwattr $C$DW$T$5, DW_AT_name("signed char")
    1934                            .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    1935                    
    1936                    $C$DW$T$204     .dwtag  DW_TAG_typedef
    1937                            .dwattr $C$DW$T$204, DW_AT_name("int8")
    1938                            .dwattr $C$DW$T$204, DW_AT_type(*$C$DW$T$5)
    1939                            .dwattr $C$DW$T$204, DW_AT_language(DW_LANG_C)
    1940                            .dwattr $C$DW$T$204, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\ti154st
    1941                            .dwattr $C$DW$T$204, DW_AT_decl_line(0x38)
    1942                            .dwattr $C$DW$T$204, DW_AT_decl_column(0x19)
    1943                    
    1944                    $C$DW$T$205     .dwtag  DW_TAG_typedef
    1945                            .dwattr $C$DW$T$205, DW_AT_name("int8_t")
    1946                            .dwattr $C$DW$T$205, DW_AT_type(*$C$DW$T$5)
    1947                            .dwattr $C$DW$T$205, DW_AT_language(DW_LANG_C)
    1948                            .dwattr $C$DW$T$205, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include
    1949                            .dwattr $C$DW$T$205, DW_AT_decl_line(0x2a)
    1950                            .dwattr $C$DW$T$205, DW_AT_decl_column(0x1d)
    1951                    
    1952                    $C$DW$T$206     .dwtag  DW_TAG_typedef
    1953                            .dwattr $C$DW$T$206, DW_AT_name("int_least8_t")
    1954                            .dwattr $C$DW$T$206, DW_AT_type(*$C$DW$T$205)
    1955                            .dwattr $C$DW$T$206, DW_AT_language(DW_LANG_C)
    1956                            .dwattr $C$DW$T$206, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include
    1957                            .dwattr $C$DW$T$206, DW_AT_decl_line(0x37)
    1958                            .dwattr $C$DW$T$206, DW_AT_decl_column(0x17)
    1959                    
    1960                    $C$DW$T$6       .dwtag  DW_TAG_base_type
    1961                            .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    1962                            .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    1963                            .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    1964                    
    1965                    $C$DW$T$30      .dwtag  DW_TAG_typedef
    1966                            .dwattr $C$DW$T$30, DW_AT_name("uint8")
    1967                            .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$6)
    1968                            .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    1969                            .dwattr $C$DW$T$30, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\ti154sta
    1970                            .dwattr $C$DW$T$30, DW_AT_decl_line(0x39)
    1971                            .dwattr $C$DW$T$30, DW_AT_decl_column(0x19)
    1972                    
    1973                    $C$DW$T$210     .dwtag  DW_TAG_typedef
    1974                            .dwattr $C$DW$T$210, DW_AT_name("Status_t")
    1975                            .dwattr $C$DW$T$210, DW_AT_type(*$C$DW$T$30)
    1976                            .dwattr $C$DW$T$210, DW_AT_language(DW_LANG_C)
    1977                            .dwattr $C$DW$T$210, DW_AT_decl_file("C:\Users\Kevin\workspace_v7\sensor_cc1310lp\Application\
    1978                            .dwattr $C$DW$T$210, DW_AT_decl_line(0x77)
    1979                            .dwattr $C$DW$T$210, DW_AT_decl_column(0x0f)
    1980                    
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:22 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{5FC2008A-5F32-4C25-9FE7-4FDE3869A457} PAGE   37

    1981                    $C$DW$T$211     .dwtag  DW_TAG_typedef
    1982                            .dwattr $C$DW$T$211, DW_AT_name("ZStatus_t")
    1983                            .dwattr $C$DW$T$211, DW_AT_type(*$C$DW$T$210)
    1984                            .dwattr $C$DW$T$211, DW_AT_language(DW_LANG_C)
    1985                            .dwattr $C$DW$T$211, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154st
    1986                            .dwattr $C$DW$T$211, DW_AT_decl_line(0x194)
    1987                            .dwattr $C$DW$T$211, DW_AT_decl_column(0x12)
    1988                    
    1989                    
    1990                    $C$DW$T$85      .dwtag  DW_TAG_array_type
    1991                            .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$30)
    1992                            .dwattr $C$DW$T$85, DW_AT_language(DW_LANG_C)
    1993                            .dwattr $C$DW$T$85, DW_AT_byte_size(0x08)
    1994                    $C$DW$129       .dwtag  DW_TAG_subrange_type
    1995                            .dwattr $C$DW$129, DW_AT_upper_bound(0x07)
    1996                    
    1997                            .dwendtag $C$DW$T$85
    1998                    
    1999                    $C$DW$T$86      .dwtag  DW_TAG_typedef
    2000                            .dwattr $C$DW$T$86, DW_AT_name("sAddrExt_t")
    2001                            .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$85)
    2002                            .dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)
    2003                            .dwattr $C$DW$T$86, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/S
    2004                            .dwattr $C$DW$T$86, DW_AT_decl_line(0x49)
    2005                            .dwattr $C$DW$T$86, DW_AT_decl_column(0x0f)
    2006                    
    2007                    $C$DW$T$190     .dwtag  DW_TAG_pointer_type
    2008                            .dwattr $C$DW$T$190, DW_AT_type(*$C$DW$T$30)
    2009                            .dwattr $C$DW$T$190, DW_AT_address_class(0x20)
    2010                    
    2011                    $C$DW$T$212     .dwtag  DW_TAG_const_type
    2012                            .dwattr $C$DW$T$212, DW_AT_type(*$C$DW$T$190)
    2013                    
    2014                    $C$DW$T$33      .dwtag  DW_TAG_typedef
    2015                            .dwattr $C$DW$T$33, DW_AT_name("byte")
    2016                            .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$30)
    2017                            .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    2018                            .dwattr $C$DW$T$33, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154sta
    2019                            .dwattr $C$DW$T$33, DW_AT_decl_line(0x122)
    2020                            .dwattr $C$DW$T$33, DW_AT_decl_column(0x11)
    2021                    
    2022                    
    2023                    $C$DW$T$88      .dwtag  DW_TAG_array_type
    2024                            .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$33)
    2025                            .dwattr $C$DW$T$88, DW_AT_language(DW_LANG_C)
    2026                            .dwattr $C$DW$T$88, DW_AT_byte_size(0x08)
    2027                    $C$DW$130       .dwtag  DW_TAG_subrange_type
    2028                            .dwattr $C$DW$130, DW_AT_upper_bound(0x07)
    2029                    
    2030                            .dwendtag $C$DW$T$88
    2031                    
    2032                    $C$DW$T$89      .dwtag  DW_TAG_typedef
    2033                            .dwattr $C$DW$T$89, DW_AT_name("ZLongAddr_t")
    2034                            .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$88)
    2035                            .dwattr $C$DW$T$89, DW_AT_language(DW_LANG_C)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:22 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{5FC2008A-5F32-4C25-9FE7-4FDE3869A457} PAGE   38

    2036                            .dwattr $C$DW$T$89, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154sta
    2037                            .dwattr $C$DW$T$89, DW_AT_decl_line(0x131)
    2038                            .dwattr $C$DW$T$89, DW_AT_decl_column(0x0e)
    2039                    
    2040                    $C$DW$T$38      .dwtag  DW_TAG_typedef
    2041                            .dwattr $C$DW$T$38, DW_AT_name("uint8_t")
    2042                            .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$6)
    2043                            .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    2044                            .dwattr $C$DW$T$38, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/
    2045                            .dwattr $C$DW$T$38, DW_AT_decl_line(0x2b)
