TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:23 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{A5A4F12E-54AA-4D32-B7C7-D7308E304018} PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                        PC v16.9.4.LTS *
       3                    ;* Date/Time created: Sat Nov 18 18:46:23 2017                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../Application/MAC/HAL/target/hal_trng_wrapper.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v16.9.4.LTS Copyright (c) 1996-20
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Kevin\workspace_v7\sensor_cc1310lp\sensor_cc1310lp"
      13                    
      14                    $C$DW$1 .dwtag  DW_TAG_subprogram

     279                            .dwpsn  file "../Application/MAC/HAL/target/hal_trng_wrapper.c",line 182,column 5,is_stmt,isa 
     280 0000002c 6008              STRNE     A1, [A2, #0]          ; [DPU_3_PIPE] |182|  ; [ORIG 16-BIT INS]
     281                    $C$DW$15        .dwtag  DW_TAG_TI_branch
     282                            .dwattr $C$DW$15, DW_AT_low_pc(0x00)
     283                            .dwattr $C$DW$15, DW_AT_TI_return
     284                    
     285 0000002e BD08              POP       {A4, PC}              ; [DPU_3_PIPE]  ; [ORIG 16-BIT INS]
     286                            .dwcfi  cfa_offset, 0
     287                            ; BRANCH OCCURS                  ; [] 
     288                            .dwattr $C$DW$11, DW_AT_TI_end_file("../Application/MAC/HAL/target/hal_trng_wrapper.c")
     289                            .dwattr $C$DW$11, DW_AT_TI_end_line(0xbb)
     290                            .dwattr $C$DW$11, DW_AT_TI_end_column(0x01)
     291                            .dwendentry
     292                            .dwendtag $C$DW$11
     293                    
     294                    ;******************************************************************************
     295                    ;* CONSTANT TABLE                                                             *
     296                    ;******************************************************************************
     297 0000000a                   .sect   ".text:HalTRNG_WaitForReady"
     298                            .align  4
     299 0000000a 800846C0  ||$C$CON1||:    .bits   1073905672,32
         0000000e 00004002 
     300                    ;******************************************************************************
     301                    ;* CONSTANT TABLE                                                             *
     302                    ;******************************************************************************
     303 0000001c                   .sect   ".text:HalTRNG_InitTRNG"
     304                            .align  4
     305 0000001c 425002A8  ||$C$CON2||:    .bits   1112539816,32
     306                            .align  4
     307 00000020 00000000! ||$C$CON3||:    .bits   lastTrngVal,32
     308                    ;******************************************************************************
     309                    ;* CONSTANT TABLE                                                             *
     310                    ;******************************************************************************
     311 00000030                   .sect   ".text:HalTRNG_GetTRNG"
     312                            .align  4
     313 00000030 40028008  ||$C$CON5||:    .bits   1073905672,32
     314                            .align  4
     315 00000034 100001CC  ||$C$CON6||:    .bits   268435916,32
     316                            .align  4
     317 00000038 DEADBEEF  ||$C$CON8||:    .bits   -559038737,32
     318                            .align  4
     319 0000003c 40028008  ||$C$CON9||:    .bits   1073905672,32
     320                            .align  4
     321 00000040 00000000! ||$C$CON10||:   .bits   lastTrngVal,32
     322                    ;*****************************************************************************
     323                    ;* UNDEFINED EXTERNAL REFERENCES                                             *
     324                    ;*****************************************************************************
     325                            .global NOROM_TRNGConfigure
     326                    
     327                    ;******************************************************************************
     328                    ;* BUILD ATTRIBUTES                                                           *
     329                    ;******************************************************************************
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:23 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{A5A4F12E-54AA-4D32-B7C7-D7308E304018} PAGE    7

     330                            .battr "aeabi", Tag_File, 1, Tag_ABI_PCS_wchar_t(2)
     331                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_rounding(0)
     332                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_denormal(0)
     333                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_exceptions(0)
     334                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_number_model(1)
     335                            .battr "aeabi", Tag_File, 1, Tag_ABI_enum_size(0)
     336                            .battr "aeabi", Tag_File, 1, Tag_ABI_optimization_goals(0)
     337                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_optimization_goals(0)
     338                            .battr "TI", Tag_File, 1, Tag_Bitfield_layout(2)
     339                            .battr "aeabi", Tag_File, 1, Tag_ABI_VFP_args(3)
     340                            .battr "TI", Tag_File, 1, Tag_FP_interface(1)
     341                    
     342                    ;******************************************************************************
     343                    ;* TYPE INFORMATION                                                           *
     344                    ;******************************************************************************
     345                    
     346                    $C$DW$T$60      .dwtag  DW_TAG_structure_type
     347                            .dwattr $C$DW$T$60, DW_AT_byte_size(0x4c)
     348                    $C$DW$16        .dwtag  DW_TAG_member
     349                            .dwattr $C$DW$16, DW_AT_type(*$C$DW$T$24)
     350                            .dwattr $C$DW$16, DW_AT_name("Crc32")
     351                            .dwattr $C$DW$16, DW_AT_TI_symbol_name("Crc32")
     352                            .dwattr $C$DW$16, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     353                            .dwattr $C$DW$16, DW_AT_accessibility(DW_ACCESS_public)
     354                            .dwattr $C$DW$16, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\cc
     355                            .dwattr $C$DW$16, DW_AT_decl_line(0x76)
     356                            .dwattr $C$DW$16, DW_AT_decl_column(0x25)
     357                    
     358                    $C$DW$17        .dwtag  DW_TAG_member
     359                            .dwattr $C$DW$17, DW_AT_type(*$C$DW$T$27)
     360                            .dwattr $C$DW$17, DW_AT_name("FlashGetSize")
     361                            .dwattr $C$DW$17, DW_AT_TI_symbol_name("FlashGetSize")
     362                            .dwattr $C$DW$17, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     363                            .dwattr $C$DW$17, DW_AT_accessibility(DW_ACCESS_public)
     364                            .dwattr $C$DW$17, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\cc
     365                            .dwattr $C$DW$17, DW_AT_decl_line(0x77)
     366                            .dwattr $C$DW$17, DW_AT_decl_column(0x25)
     367                    
     368                    $C$DW$18        .dwtag  DW_TAG_member
     369                            .dwattr $C$DW$18, DW_AT_type(*$C$DW$T$28)
     370                            .dwattr $C$DW$18, DW_AT_name("GetChipId")
     371                            .dwattr $C$DW$18, DW_AT_TI_symbol_name("GetChipId")
     372                            .dwattr $C$DW$18, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     373                            .dwattr $C$DW$18, DW_AT_accessibility(DW_ACCESS_public)
     374                            .dwattr $C$DW$18, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\cc
     375                            .dwattr $C$DW$18, DW_AT_decl_line(0x78)
     376                            .dwattr $C$DW$18, DW_AT_decl_column(0x25)
     377                    
     378                    $C$DW$19        .dwtag  DW_TAG_member
     379                            .dwattr $C$DW$19, DW_AT_type(*$C$DW$T$31)
     380                            .dwattr $C$DW$19, DW_AT_name("ReservedLocation1")
     381                            .dwattr $C$DW$19, DW_AT_TI_symbol_name("ReservedLocation1")
     382                            .dwattr $C$DW$19, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     383                            .dwattr $C$DW$19, DW_AT_accessibility(DW_ACCESS_public)
     384                            .dwattr $C$DW$19, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\cc
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:23 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{A5A4F12E-54AA-4D32-B7C7-D7308E304018} PAGE    8

     385                            .dwattr $C$DW$19, DW_AT_decl_line(0x79)
     386                            .dwattr $C$DW$19, DW_AT_decl_column(0x25)
     387                    
     388                    $C$DW$20        .dwtag  DW_TAG_member
     389                            .dwattr $C$DW$20, DW_AT_type(*$C$DW$T$32)
     390                            .dwattr $C$DW$20, DW_AT_name("ReservedLocation2")
     391                            .dwattr $C$DW$20, DW_AT_TI_symbol_name("ReservedLocation2")
     392                            .dwattr $C$DW$20, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     393                            .dwattr $C$DW$20, DW_AT_accessibility(DW_ACCESS_public)
     394                            .dwattr $C$DW$20, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\cc
     395                            .dwattr $C$DW$20, DW_AT_decl_line(0x7a)
     396                            .dwattr $C$DW$20, DW_AT_decl_column(0x25)
     397                    
     398                    $C$DW$21        .dwtag  DW_TAG_member
     399                            .dwattr $C$DW$21, DW_AT_type(*$C$DW$T$33)
     400                            .dwattr $C$DW$21, DW_AT_name("ReservedLocation3")
     401                            .dwattr $C$DW$21, DW_AT_TI_symbol_name("ReservedLocation3")
     402                            .dwattr $C$DW$21, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
     403                            .dwattr $C$DW$21, DW_AT_accessibility(DW_ACCESS_public)
     404                            .dwattr $C$DW$21, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\cc
     405                            .dwattr $C$DW$21, DW_AT_decl_line(0x7b)
     406                            .dwattr $C$DW$21, DW_AT_decl_column(0x25)
     407                    
     408                    $C$DW$22        .dwtag  DW_TAG_member
     409                            .dwattr $C$DW$22, DW_AT_type(*$C$DW$T$36)
     410                            .dwattr $C$DW$22, DW_AT_name("ResetDevice")
     411                            .dwattr $C$DW$22, DW_AT_TI_symbol_name("ResetDevice")
     412                            .dwattr $C$DW$22, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
     413                            .dwattr $C$DW$22, DW_AT_accessibility(DW_ACCESS_public)
     414                            .dwattr $C$DW$22, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\cc
     415                            .dwattr $C$DW$22, DW_AT_decl_line(0x7c)
     416                            .dwattr $C$DW$22, DW_AT_decl_column(0x25)
     417                    
     418                    $C$DW$23        .dwtag  DW_TAG_member
     419                            .dwattr $C$DW$23, DW_AT_type(*$C$DW$T$41)
     420                            .dwattr $C$DW$23, DW_AT_name("Fletcher32")
     421                            .dwattr $C$DW$23, DW_AT_TI_symbol_name("Fletcher32")
     422                            .dwattr $C$DW$23, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
     423                            .dwattr $C$DW$23, DW_AT_accessibility(DW_ACCESS_public)
     424                            .dwattr $C$DW$23, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\cc
     425                            .dwattr $C$DW$23, DW_AT_decl_line(0x7d)
     426                            .dwattr $C$DW$23, DW_AT_decl_column(0x25)
     427                    
     428                    $C$DW$24        .dwtag  DW_TAG_member
     429                            .dwattr $C$DW$24, DW_AT_type(*$C$DW$T$45)
     430                            .dwattr $C$DW$24, DW_AT_name("MinValue")
     431                            .dwattr $C$DW$24, DW_AT_TI_symbol_name("MinValue")
     432                            .dwattr $C$DW$24, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
     433                            .dwattr $C$DW$24, DW_AT_accessibility(DW_ACCESS_public)
     434                            .dwattr $C$DW$24, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\cc
     435                            .dwattr $C$DW$24, DW_AT_decl_line(0x7e)
     436                            .dwattr $C$DW$24, DW_AT_decl_column(0x25)
     437                    
     438                    $C$DW$25        .dwtag  DW_TAG_member
     439                            .dwattr $C$DW$25, DW_AT_type(*$C$DW$T$46)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:23 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{A5A4F12E-54AA-4D32-B7C7-D7308E304018} PAGE    9

     440                            .dwattr $C$DW$25, DW_AT_name("MaxValue")
     441                            .dwattr $C$DW$25, DW_AT_TI_symbol_name("MaxValue")
     442                            .dwattr $C$DW$25, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
     443                            .dwattr $C$DW$25, DW_AT_accessibility(DW_ACCESS_public)
     444                            .dwattr $C$DW$25, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\cc
     445                            .dwattr $C$DW$25, DW_AT_decl_line(0x7f)
     446                            .dwattr $C$DW$25, DW_AT_decl_column(0x25)
     447                    
     448                    $C$DW$26        .dwtag  DW_TAG_member
     449                            .dwattr $C$DW$26, DW_AT_type(*$C$DW$T$47)
     450                            .dwattr $C$DW$26, DW_AT_name("MeanValue")
     451                            .dwattr $C$DW$26, DW_AT_TI_symbol_name("MeanValue")
     452                            .dwattr $C$DW$26, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
     453                            .dwattr $C$DW$26, DW_AT_accessibility(DW_ACCESS_public)
     454                            .dwattr $C$DW$26, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\cc
     455                            .dwattr $C$DW$26, DW_AT_decl_line(0x80)
     456                            .dwattr $C$DW$26, DW_AT_decl_column(0x25)
     457                    
     458                    $C$DW$27        .dwtag  DW_TAG_member
     459                            .dwattr $C$DW$27, DW_AT_type(*$C$DW$T$48)
     460                            .dwattr $C$DW$27, DW_AT_name("StandDeviationValue")
     461                            .dwattr $C$DW$27, DW_AT_TI_symbol_name("StandDeviationValue")
     462                            .dwattr $C$DW$27, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
     463                            .dwattr $C$DW$27, DW_AT_accessibility(DW_ACCESS_public)
     464                            .dwattr $C$DW$27, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\cc
     465                            .dwattr $C$DW$27, DW_AT_decl_line(0x81)
     466                            .dwattr $C$DW$27, DW_AT_decl_column(0x25)
     467                    
     468                    $C$DW$28        .dwtag  DW_TAG_member
     469                            .dwattr $C$DW$28, DW_AT_type(*$C$DW$T$51)
     470                            .dwattr $C$DW$28, DW_AT_name("ReservedLocation4")
     471                            .dwattr $C$DW$28, DW_AT_TI_symbol_name("ReservedLocation4")
     472                            .dwattr $C$DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
     473                            .dwattr $C$DW$28, DW_AT_accessibility(DW_ACCESS_public)
     474                            .dwattr $C$DW$28, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\cc
     475                            .dwattr $C$DW$28, DW_AT_decl_line(0x82)
     476                            .dwattr $C$DW$28, DW_AT_decl_column(0x25)
     477                    
     478                    $C$DW$29        .dwtag  DW_TAG_member
     479                            .dwattr $C$DW$29, DW_AT_type(*$C$DW$T$52)
     480                            .dwattr $C$DW$29, DW_AT_name("ReservedLocation5")
     481                            .dwattr $C$DW$29, DW_AT_TI_symbol_name("ReservedLocation5")
     482                            .dwattr $C$DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
     483                            .dwattr $C$DW$29, DW_AT_accessibility(DW_ACCESS_public)
     484                            .dwattr $C$DW$29, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\cc
     485                            .dwattr $C$DW$29, DW_AT_decl_line(0x83)
     486                            .dwattr $C$DW$29, DW_AT_decl_column(0x25)
     487                    
     488                    $C$DW$30        .dwtag  DW_TAG_member
     489                            .dwattr $C$DW$30, DW_AT_type(*$C$DW$T$53)
     490                            .dwattr $C$DW$30, DW_AT_name("HFSourceSafeSwitch")
     491                            .dwattr $C$DW$30, DW_AT_TI_symbol_name("HFSourceSafeSwitch")
     492                            .dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
     493                            .dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
     494                            .dwattr $C$DW$30, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\cc
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:23 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{A5A4F12E-54AA-4D32-B7C7-D7308E304018} PAGE   10

     495                            .dwattr $C$DW$30, DW_AT_decl_line(0x84)
     496                            .dwattr $C$DW$30, DW_AT_decl_column(0x25)
     497                    
     498                    $C$DW$31        .dwtag  DW_TAG_member
     499                            .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$56)
     500                            .dwattr $C$DW$31, DW_AT_name("SelectCompAInput")
     501                            .dwattr $C$DW$31, DW_AT_TI_symbol_name("SelectCompAInput")
     502                            .dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
     503                            .dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
     504                            .dwattr $C$DW$31, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\cc
     505                            .dwattr $C$DW$31, DW_AT_decl_line(0x85)
     506                            .dwattr $C$DW$31, DW_AT_decl_column(0x25)
     507                    
     508                    $C$DW$32        .dwtag  DW_TAG_member
     509                            .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$57)
     510                            .dwattr $C$DW$32, DW_AT_name("SelectCompARef")
     511                            .dwattr $C$DW$32, DW_AT_TI_symbol_name("SelectCompARef")
     512                            .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
     513                            .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
     514                            .dwattr $C$DW$32, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\cc
     515                            .dwattr $C$DW$32, DW_AT_decl_line(0x86)
     516                            .dwattr $C$DW$32, DW_AT_decl_column(0x25)
     517                    
     518                    $C$DW$33        .dwtag  DW_TAG_member
     519                            .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$58)
     520                            .dwattr $C$DW$33, DW_AT_name("SelectADCCompBInput")
     521                            .dwattr $C$DW$33, DW_AT_TI_symbol_name("SelectADCCompBInput")
     522                            .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
     523                            .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
     524                            .dwattr $C$DW$33, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\cc
     525                            .dwattr $C$DW$33, DW_AT_decl_line(0x87)
     526                            .dwattr $C$DW$33, DW_AT_decl_column(0x25)
     527                    
     528                    $C$DW$34        .dwtag  DW_TAG_member
     529                            .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$59)
     530                            .dwattr $C$DW$34, DW_AT_name("SelectCompBRef")
     531                            .dwattr $C$DW$34, DW_AT_TI_symbol_name("SelectCompBRef")
     532                            .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
     533                            .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
     534                            .dwattr $C$DW$34, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\cc
     535                            .dwattr $C$DW$34, DW_AT_decl_line(0x88)
     536                            .dwattr $C$DW$34, DW_AT_decl_column(0x25)
     537                    
     538                            .dwattr $C$DW$T$60, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\
     539                            .dwattr $C$DW$T$60, DW_AT_decl_line(0x75)
     540                            .dwattr $C$DW$T$60, DW_AT_decl_column(0x01)
     541                            .dwendtag $C$DW$T$60
     542                    
     543                    $C$DW$T$61      .dwtag  DW_TAG_typedef
     544                            .dwattr $C$DW$T$61, DW_AT_name("HARD_API_T")
     545                            .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$60)
     546                            .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
     547                            .dwattr $C$DW$T$61, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\
     548                            .dwattr $C$DW$T$61, DW_AT_decl_line(0x89)
     549                            .dwattr $C$DW$T$61, DW_AT_decl_column(0x03)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:23 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{A5A4F12E-54AA-4D32-B7C7-D7308E304018} PAGE   11

     550                    
     551                    $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
     552                            .dwattr $C$DW$T$2, DW_AT_name("void")
     553                    
     554                    
     555                    $C$DW$T$34      .dwtag  DW_TAG_subroutine_type
     556                            .dwattr $C$DW$T$34, DW_AT_language(DW_LANG_C)
     557                            .dwendtag $C$DW$T$34
     558                    
     559                    $C$DW$T$35      .dwtag  DW_TAG_pointer_type
     560                            .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$34)
     561                            .dwattr $C$DW$T$35, DW_AT_address_class(0x20)
     562                    
     563                    $C$DW$T$53      .dwtag  DW_TAG_typedef
     564                            .dwattr $C$DW$T$53, DW_AT_name("FPTR_HFSOURCESAFESWITCH_T")
     565                            .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$35)
     566                            .dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
     567                            .dwattr $C$DW$T$53, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\
     568                            .dwattr $C$DW$T$53, DW_AT_decl_line(0x5f)
     569                            .dwattr $C$DW$T$53, DW_AT_decl_column(0x19)
     570                    
     571                    $C$DW$T$36      .dwtag  DW_TAG_typedef
     572                            .dwattr $C$DW$T$36, DW_AT_name("FPTR_RESETDEV_T")
     573                            .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$35)
     574                            .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
     575                            .dwattr $C$DW$T$36, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\
     576                            .dwattr $C$DW$T$36, DW_AT_decl_line(0x4d)
     577                            .dwattr $C$DW$T$36, DW_AT_decl_column(0x19)
     578                    
     579                    $C$DW$T$62      .dwtag  DW_TAG_typedef
     580                            .dwattr $C$DW$T$62, DW_AT_name("FPTR_VOID_VOID_T")
     581                            .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$35)
     582                            .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
