TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:17 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{D5117D28-3097-44CE-B654-78C5C428E8EA} PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                        PC v16.9.4.LTS *
       3                    ;* Date/Time created: Sat Nov 18 18:46:17 2017                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../Application/ICall/icall_cc2650.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v16.9.4.LTS Copyright (c) 1996-20
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Kevin\workspace_v7\sensor_cc1310lp\sensor_cc1310lp"
      13                    
      14                    $C$DW$1 .dwtag  DW_TAG_subprogram

    1653                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_optimization_goals(0)
    1654                            .battr "TI", Tag_File, 1, Tag_Bitfield_layout(2)
    1655                            .battr "aeabi", Tag_File, 1, Tag_ABI_VFP_args(3)
    1656                            .battr "TI", Tag_File, 1, Tag_FP_interface(1)
    1657                    
    1658                    ;******************************************************************************
    1659                    ;* TYPE INFORMATION                                                           *
    1660                    ;******************************************************************************
    1661                    
    1662                    $C$DW$T$152     .dwtag  DW_TAG_enumeration_type
    1663                            .dwattr $C$DW$T$152, DW_AT_byte_size(0x01)
    1664                    $C$DW$113       .dwtag  DW_TAG_enumerator
    1665                            .dwattr $C$DW$113, DW_AT_name("ICALL_RTI_APP_CMD_EVENT")
    1666                            .dwattr $C$DW$113, DW_AT_const_value(0xe0)
    1667                            .dwattr $C$DW$113, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\ti154stac
    1668                            .dwattr $C$DW$113, DW_AT_decl_line(0x3de)
    1669                            .dwattr $C$DW$113, DW_AT_decl_column(0x04)
    1670                    
    1671                    $C$DW$114       .dwtag  DW_TAG_enumerator
    1672                            .dwattr $C$DW$114, DW_AT_name("ICALL_RTI_STACK_CMD_EVENT")
    1673                            .dwattr $C$DW$114, DW_AT_const_value(0xe1)
    1674                            .dwattr $C$DW$114, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\ti154stac
    1675                            .dwattr $C$DW$114, DW_AT_decl_line(0x3e0)
    1676                            .dwattr $C$DW$114, DW_AT_decl_column(0x04)
    1677                    
    1678                    $C$DW$115       .dwtag  DW_TAG_enumerator
    1679                            .dwattr $C$DW$115, DW_AT_name("ICALL_RTI_APP_ASYNC_CMD_EVENT")
    1680                            .dwattr $C$DW$115, DW_AT_const_value(0xe2)
    1681                            .dwattr $C$DW$115, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\ti154stac
    1682                            .dwattr $C$DW$115, DW_AT_decl_line(0x3e2)
    1683                            .dwattr $C$DW$115, DW_AT_decl_column(0x04)
    1684                    
    1685                    $C$DW$116       .dwtag  DW_TAG_enumerator
    1686                            .dwattr $C$DW$116, DW_AT_name("ICALL_RTI_APP_SYNC_CMD_EVENT")
    1687                            .dwattr $C$DW$116, DW_AT_const_value(0xe3)
    1688                            .dwattr $C$DW$116, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\ti154stac
    1689                            .dwattr $C$DW$116, DW_AT_decl_line(0x3e4)
    1690                            .dwattr $C$DW$116, DW_AT_decl_column(0x04)
    1691                    
    1692                    $C$DW$117       .dwtag  DW_TAG_enumerator
    1693                            .dwattr $C$DW$117, DW_AT_name("ICALL_RCN_APP_ASYNC_CMD_EVENT")
    1694                            .dwattr $C$DW$117, DW_AT_const_value(0xe4)
    1695                            .dwattr $C$DW$117, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\ti154stac
    1696                            .dwattr $C$DW$117, DW_AT_decl_line(0x3e6)
    1697                            .dwattr $C$DW$117, DW_AT_decl_column(0x04)
    1698                    
    1699                    $C$DW$118       .dwtag  DW_TAG_enumerator
    1700                            .dwattr $C$DW$118, DW_AT_name("ICALL_RCN_APP_SYNC_CMD_EVENT")
    1701                            .dwattr $C$DW$118, DW_AT_const_value(0xe5)
    1702                            .dwattr $C$DW$118, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\ti154stac
    1703                            .dwattr $C$DW$118, DW_AT_decl_line(0x3e8)
    1704                            .dwattr $C$DW$118, DW_AT_decl_column(0x04)
    1705                    
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:17 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{D5117D28-3097-44CE-B654-78C5C428E8EA} PAGE   32

    1706                            .dwattr $C$DW$T$152, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\ti154st
    1707                            .dwattr $C$DW$T$152, DW_AT_decl_line(0x3dc)
    1708                            .dwattr $C$DW$T$152, DW_AT_decl_column(0x01)
    1709                            .dwendtag $C$DW$T$152
    1710                    
    1711                    $C$DW$T$153     .dwtag  DW_TAG_typedef
    1712                            .dwattr $C$DW$T$153, DW_AT_name("ICall_RemotiCmdEvent_t")
    1713                            .dwattr $C$DW$T$153, DW_AT_type(*$C$DW$T$152)
    1714                            .dwattr $C$DW$T$153, DW_AT_language(DW_LANG_C)
    1715                            .dwattr $C$DW$T$153, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\ti154st
    1716                            .dwattr $C$DW$T$153, DW_AT_decl_line(0x3e9)
    1717                            .dwattr $C$DW$T$153, DW_AT_decl_column(0x02)
    1718                    
    1719                    
    1720                    $C$DW$T$19      .dwtag  DW_TAG_structure_type
    1721                            .dwattr $C$DW$T$19, DW_AT_byte_size(0x08)
    1722                    $C$DW$119       .dwtag  DW_TAG_member
    1723                            .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$10)
    1724                            .dwattr $C$DW$119, DW_AT_name("quot")
    1725                            .dwattr $C$DW$119, DW_AT_TI_symbol_name("quot")
    1726                            .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1727                            .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1728                            .dwattr $C$DW$119, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/s
    1729                            .dwattr $C$DW$119, DW_AT_decl_line(0x5c)
    1730                            .dwattr $C$DW$119, DW_AT_decl_column(0x16)
    1731                    
    1732                    $C$DW$120       .dwtag  DW_TAG_member
    1733                            .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$10)
    1734                            .dwattr $C$DW$120, DW_AT_name("rem")
    1735                            .dwattr $C$DW$120, DW_AT_TI_symbol_name("rem")
    1736                            .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1737                            .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1738                            .dwattr $C$DW$120, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/s
    1739                            .dwattr $C$DW$120, DW_AT_decl_line(0x5c)
    1740                            .dwattr $C$DW$120, DW_AT_decl_column(0x1c)
    1741                    
    1742                            .dwattr $C$DW$T$19, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/
    1743                            .dwattr $C$DW$T$19, DW_AT_decl_line(0x5c)
    1744                            .dwattr $C$DW$T$19, DW_AT_decl_column(0x10)
    1745                            .dwendtag $C$DW$T$19
    1746                    
    1747                    $C$DW$T$154     .dwtag  DW_TAG_typedef
    1748                            .dwattr $C$DW$T$154, DW_AT_name("div_t")
    1749                            .dwattr $C$DW$T$154, DW_AT_type(*$C$DW$T$19)
    1750                            .dwattr $C$DW$T$154, DW_AT_language(DW_LANG_C)
    1751                            .dwattr $C$DW$T$154, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include
    1752                            .dwattr $C$DW$T$154, DW_AT_decl_line(0x5c)
    1753                            .dwattr $C$DW$T$154, DW_AT_decl_column(0x23)
    1754                    
    1755                    
    1756                    $C$DW$T$20      .dwtag  DW_TAG_structure_type
    1757                            .dwattr $C$DW$T$20, DW_AT_byte_size(0x08)
    1758                    $C$DW$121       .dwtag  DW_TAG_member
    1759                            .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$10)
    1760                            .dwattr $C$DW$121, DW_AT_name("quot")
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:17 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{D5117D28-3097-44CE-B654-78C5C428E8EA} PAGE   33

    1761                            .dwattr $C$DW$121, DW_AT_TI_symbol_name("quot")
    1762                            .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1763                            .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1764                            .dwattr $C$DW$121, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/s
    1765                            .dwattr $C$DW$121, DW_AT_decl_line(0x5e)
    1766                            .dwattr $C$DW$121, DW_AT_decl_column(0x16)
    1767                    
    1768                    $C$DW$122       .dwtag  DW_TAG_member
    1769                            .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$10)
    1770                            .dwattr $C$DW$122, DW_AT_name("rem")
    1771                            .dwattr $C$DW$122, DW_AT_TI_symbol_name("rem")
    1772                            .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1773                            .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1774                            .dwattr $C$DW$122, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/s
    1775                            .dwattr $C$DW$122, DW_AT_decl_line(0x5e)
    1776                            .dwattr $C$DW$122, DW_AT_decl_column(0x1c)
    1777                    
    1778                            .dwattr $C$DW$T$20, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/
    1779                            .dwattr $C$DW$T$20, DW_AT_decl_line(0x5e)
    1780                            .dwattr $C$DW$T$20, DW_AT_decl_column(0x10)
    1781                            .dwendtag $C$DW$T$20
    1782                    
    1783                    $C$DW$T$155     .dwtag  DW_TAG_typedef
    1784                            .dwattr $C$DW$T$155, DW_AT_name("ldiv_t")
    1785                            .dwattr $C$DW$T$155, DW_AT_type(*$C$DW$T$20)
    1786                            .dwattr $C$DW$T$155, DW_AT_language(DW_LANG_C)
    1787                            .dwattr $C$DW$T$155, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include
    1788                            .dwattr $C$DW$T$155, DW_AT_decl_line(0x5e)
    1789                            .dwattr $C$DW$T$155, DW_AT_decl_column(0x23)
    1790                    
    1791                    
    1792                    $C$DW$T$21      .dwtag  DW_TAG_structure_type
    1793                            .dwattr $C$DW$T$21, DW_AT_byte_size(0x10)
    1794                    $C$DW$123       .dwtag  DW_TAG_member
    1795                            .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$14)
    1796                            .dwattr $C$DW$123, DW_AT_name("quot")
    1797                            .dwattr $C$DW$123, DW_AT_TI_symbol_name("quot")
    1798                            .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1799                            .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1800                            .dwattr $C$DW$123, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/s
    1801                            .dwattr $C$DW$123, DW_AT_decl_line(0x61)
    1802                            .dwattr $C$DW$123, DW_AT_decl_column(0x1c)
    1803                    
    1804                    $C$DW$124       .dwtag  DW_TAG_member
    1805                            .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$14)
    1806                            .dwattr $C$DW$124, DW_AT_name("rem")
    1807                            .dwattr $C$DW$124, DW_AT_TI_symbol_name("rem")
    1808                            .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1809                            .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1810                            .dwattr $C$DW$124, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/s
    1811                            .dwattr $C$DW$124, DW_AT_decl_line(0x61)
    1812                            .dwattr $C$DW$124, DW_AT_decl_column(0x22)
    1813                    
    1814                            .dwattr $C$DW$T$21, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/
    1815                            .dwattr $C$DW$T$21, DW_AT_decl_line(0x61)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:17 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{D5117D28-3097-44CE-B654-78C5C428E8EA} PAGE   34

    1816                            .dwattr $C$DW$T$21, DW_AT_decl_column(0x10)
    1817                            .dwendtag $C$DW$T$21
    1818                    
    1819                    $C$DW$T$156     .dwtag  DW_TAG_typedef
    1820                            .dwattr $C$DW$T$156, DW_AT_name("lldiv_t")
    1821                            .dwattr $C$DW$T$156, DW_AT_type(*$C$DW$T$21)
    1822                            .dwattr $C$DW$T$156, DW_AT_language(DW_LANG_C)
    1823                            .dwattr $C$DW$T$156, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include
    1824                            .dwattr $C$DW$T$156, DW_AT_decl_line(0x61)
    1825                            .dwattr $C$DW$T$156, DW_AT_decl_column(0x29)
    1826                    
    1827                    
    1828                    $C$DW$T$26      .dwtag  DW_TAG_structure_type
    1829                            .dwattr $C$DW$T$26, DW_AT_byte_size(0x08)
    1830                    $C$DW$125       .dwtag  DW_TAG_member
    1831                            .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$24)
    1832                            .dwattr $C$DW$125, DW_AT_name("pointerStack")
    1833                            .dwattr $C$DW$125, DW_AT_TI_symbol_name("pointerStack")
    1834                            .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1835                            .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1836                            .dwattr $C$DW$125, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\ti154stac
    1837                            .dwattr $C$DW$125, DW_AT_decl_line(0x3f5)
    1838                            .dwattr $C$DW$125, DW_AT_decl_column(0x16)
    1839                    
    1840                    $C$DW$126       .dwtag  DW_TAG_member
    1841                            .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$25)
    1842                            .dwattr $C$DW$126, DW_AT_name("directAPI")
    1843                            .dwattr $C$DW$126, DW_AT_TI_symbol_name("directAPI")
    1844                            .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1845                            .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1846                            .dwattr $C$DW$126, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\ti154stac
    1847                            .dwattr $C$DW$126, DW_AT_decl_line(0x3f6)
    1848                            .dwattr $C$DW$126, DW_AT_decl_column(0x15)
    1849                    
    1850                            .dwattr $C$DW$T$26, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\ti154sta
    1851                            .dwattr $C$DW$T$26, DW_AT_decl_line(0x3f4)
    1852                            .dwattr $C$DW$T$26, DW_AT_decl_column(0x01)
    1853                            .dwendtag $C$DW$T$26
    1854                    
    1855                    $C$DW$T$28      .dwtag  DW_TAG_typedef
    1856                            .dwattr $C$DW$T$28, DW_AT_name("icall_directAPIMsg_t")
    1857                            .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$26)
    1858                            .dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
    1859                            .dwattr $C$DW$T$28, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\ti154sta
    1860                            .dwattr $C$DW$T$28, DW_AT_decl_line(0x3f7)
    1861                            .dwattr $C$DW$T$28, DW_AT_decl_column(0x03)
    1862                    
    1863                    
    1864                    $C$DW$T$29      .dwtag  DW_TAG_structure_type
    1865                            .dwattr $C$DW$T$29, DW_AT_byte_size(0x14)
    1866                    $C$DW$127       .dwtag  DW_TAG_member
    1867                            .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$27)
    1868                            .dwattr $C$DW$127, DW_AT_name("hdr")
    1869                            .dwattr $C$DW$127, DW_AT_TI_symbol_name("hdr")
    1870                            .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:17 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{D5117D28-3097-44CE-B654-78C5C428E8EA} PAGE   35

    1871                            .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1872                            .dwattr $C$DW$127, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\ti154stac
    1873                            .dwattr $C$DW$127, DW_AT_decl_line(0x3fb)
    1874                            .dwattr $C$DW$127, DW_AT_decl_column(0x10)
    1875                    
    1876                    $C$DW$128       .dwtag  DW_TAG_member
    1877                            .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$28)
    1878                            .dwattr $C$DW$128, DW_AT_name("msg")
    1879                            .dwattr $C$DW$128, DW_AT_TI_symbol_name("msg")
    1880                            .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1881                            .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1882                            .dwattr $C$DW$128, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\ti154stac
    1883                            .dwattr $C$DW$128, DW_AT_decl_line(0x3fc)
    1884                            .dwattr $C$DW$128, DW_AT_decl_column(0x1a)
    1885                    
    1886                            .dwattr $C$DW$T$29, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\ti154sta
    1887                            .dwattr $C$DW$T$29, DW_AT_decl_line(0x3fa)
    1888                            .dwattr $C$DW$T$29, DW_AT_decl_column(0x01)
    1889                            .dwendtag $C$DW$T$29
    1890                    
    1891                    $C$DW$T$157     .dwtag  DW_TAG_typedef
    1892                            .dwattr $C$DW$T$157, DW_AT_name("icallLiteMsg_t")
    1893                            .dwattr $C$DW$T$157, DW_AT_type(*$C$DW$T$29)
    1894                            .dwattr $C$DW$T$157, DW_AT_language(DW_LANG_C)
    1895                            .dwattr $C$DW$T$157, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\ti154st
    1896                            .dwattr $C$DW$T$157, DW_AT_decl_line(0x3fd)
    1897                            .dwattr $C$DW$T$157, DW_AT_decl_column(0x03)
    1898                    
    1899                    
    1900                    $C$DW$T$36      .dwtag  DW_TAG_union_type
    1901                            .dwattr $C$DW$T$36, DW_AT_byte_size(0x02)
    1902                    $C$DW$129       .dwtag  DW_TAG_member
    1903                            .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$32)
    1904                            .dwattr $C$DW$129, DW_AT_name("entityId")
    1905                            .dwattr $C$DW$129, DW_AT_TI_symbol_name("entityId")
    1906                            .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1907                            .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1908                            .dwattr $C$DW$129, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\ti154stac
    1909                            .dwattr $C$DW$129, DW_AT_decl_line(0x1fe)
    1910                            .dwattr $C$DW$129, DW_AT_decl_column(0x14)
    1911                    
    1912                    $C$DW$130       .dwtag  DW_TAG_member
    1913                            .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$35)
    1914                            .dwattr $C$DW$130, DW_AT_name("servId")
    1915                            .dwattr $C$DW$130, DW_AT_TI_symbol_name("servId")
    1916                            .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1917                            .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1918                            .dwattr $C$DW$130, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\ti154stac
    1919                            .dwattr $C$DW$130, DW_AT_decl_line(0x200)
    1920                            .dwattr $C$DW$130, DW_AT_decl_column(0x17)
    1921                    
    1922                            .dwattr $C$DW$T$36, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\ti154sta
    1923                            .dwattr $C$DW$T$36, DW_AT_decl_line(0x1fc)
    1924                            .dwattr $C$DW$T$36, DW_AT_decl_column(0x03)
    1925                            .dwendtag $C$DW$T$36
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:17 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{D5117D28-3097-44CE-B654-78C5C428E8EA} PAGE   36

    1926                    
    1927                    
    1928                    $C$DW$T$37      .dwtag  DW_TAG_union_type
    1929                            .dwattr $C$DW$T$37, DW_AT_byte_size(0x02)
    1930                    $C$DW$131       .dwtag  DW_TAG_member
    1931                            .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$35)
    1932                            .dwattr $C$DW$131, DW_AT_name("servId")
    1933                            .dwattr $C$DW$131, DW_AT_TI_symbol_name("servId")
    1934                            .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1935                            .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1936                            .dwattr $C$DW$131, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\ti154stac
    1937                            .dwattr $C$DW$131, DW_AT_decl_line(0x211)
    1938                            .dwattr $C$DW$131, DW_AT_decl_column(0x17)
    1939                    
    1940                    $C$DW$132       .dwtag  DW_TAG_member
    1941                            .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$32)
    1942                            .dwattr $C$DW$132, DW_AT_name("entityId")
    1943                            .dwattr $C$DW$132, DW_AT_TI_symbol_name("entityId")
    1944                            .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1945                            .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1946                            .dwattr $C$DW$132, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\ti154stac
    1947                            .dwattr $C$DW$132, DW_AT_decl_line(0x213)
    1948                            .dwattr $C$DW$132, DW_AT_decl_column(0x14)
    1949                    
    1950                            .dwattr $C$DW$T$37, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\ti154sta
    1951                            .dwattr $C$DW$T$37, DW_AT_decl_line(0x20f)
    1952                            .dwattr $C$DW$T$37, DW_AT_decl_column(0x03)
    1953                            .dwendtag $C$DW$T$37
    1954                    
    1955                    
    1956                    $C$DW$T$38      .dwtag  DW_TAG_structure_type
    1957                            .dwattr $C$DW$T$38, DW_AT_name(".ggroup1")
    1958                            .dwattr $C$DW$T$38, DW_AT_byte_size(0x08)
    1959                    $C$DW$133       .dwtag  DW_TAG_member
    1960                            .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$6)
    1961                            .dwattr $C$DW$133, DW_AT_name("ICallPlatform_pwrActivityCount")
    1962                            .dwattr $C$DW$133, DW_AT_TI_symbol_name("ICallPlatform_pwrActivityCount")
    1963                            .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1964                            .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1965                    
    1966                    $C$DW$134       .dwtag  DW_TAG_member
    1967                            .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$11)
    1968                            .dwattr $C$DW$134, DW_AT_name("ICallPlatform_pwrCfgACAction")
    1969                            .dwattr $C$DW$134, DW_AT_TI_symbol_name("ICallPlatform_pwrCfgACAction")
    1970                            .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1971                            .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1972                    
    1973                            .dwendtag $C$DW$T$38
    1974                    
    1975                    
    1976                    $C$DW$T$39      .dwtag  DW_TAG_structure_type
    1977                            .dwattr $C$DW$T$39, DW_AT_name("ClockP_FreqHz")
    1978                            .dwattr $C$DW$T$39, DW_AT_byte_size(0x08)
    1979                    $C$DW$135       .dwtag  DW_TAG_member
    1980                            .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$22)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:17 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{D5117D28-3097-44CE-B654-78C5C428E8EA} PAGE   37

    1981                            .dwattr $C$DW$135, DW_AT_name("hi")
    1982                            .dwattr $C$DW$135, DW_AT_TI_symbol_name("hi")
    1983                            .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1984                            .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1985                            .dwattr $C$DW$135, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/d
    1986                            .dwattr $C$DW$135, DW_AT_decl_line(0x5c)
    1987                            .dwattr $C$DW$135, DW_AT_decl_column(0x0e)
    1988                    
    1989                    $C$DW$136       .dwtag  DW_TAG_member
    1990                            .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$22)
    1991                            .dwattr $C$DW$136, DW_AT_name("lo")
    1992                            .dwattr $C$DW$136, DW_AT_TI_symbol_name("lo")
    1993                            .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1994                            .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1995                            .dwattr $C$DW$136, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/d
    1996                            .dwattr $C$DW$136, DW_AT_decl_line(0x5d)
    1997                            .dwattr $C$DW$136, DW_AT_decl_column(0x0e)
    1998                    
    1999                            .dwattr $C$DW$T$39, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/
    2000                            .dwattr $C$DW$T$39, DW_AT_decl_line(0x5b)
    2001                            .dwattr $C$DW$T$39, DW_AT_decl_column(0x10)
    2002                            .dwendtag $C$DW$T$39
    2003                    
    2004                    $C$DW$T$159     .dwtag  DW_TAG_typedef
    2005                            .dwattr $C$DW$T$159, DW_AT_name("ClockP_FreqHz")
    2006                            .dwattr $C$DW$T$159, DW_AT_type(*$C$DW$T$39)
    2007                            .dwattr $C$DW$T$159, DW_AT_language(DW_LANG_C)
    2008                            .dwattr $C$DW$T$159, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers
    2009                            .dwattr $C$DW$T$159, DW_AT_decl_line(0x5e)
    2010                            .dwattr $C$DW$T$159, DW_AT_decl_column(0x03)
    2011                    
    2012                    
    2013                    $C$DW$T$42      .dwtag  DW_TAG_structure_type
    2014                            .dwattr $C$DW$T$42, DW_AT_name("ClockP_Params")
    2015                            .dwattr $C$DW$T$42, DW_AT_byte_size(0x0c)
    2016                    $C$DW$137       .dwtag  DW_TAG_member
    2017                            .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$40)
    2018                            .dwattr $C$DW$137, DW_AT_name("startFlag")
    2019                            .dwattr $C$DW$137, DW_AT_TI_symbol_name("startFlag")
    2020                            .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2021                            .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    2022                            .dwattr $C$DW$137, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/d
    2023                            .dwattr $C$DW$137, DW_AT_decl_line(0x8d)
    2024                            .dwattr $C$DW$137, DW_AT_decl_column(0x0f)
    2025                    
    2026                    $C$DW$138       .dwtag  DW_TAG_member
    2027                            .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$22)
    2028                            .dwattr $C$DW$138, DW_AT_name("period")
    2029                            .dwattr $C$DW$138, DW_AT_TI_symbol_name("period")
    2030                            .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2031                            .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    2032                            .dwattr $C$DW$138, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/d
    2033                            .dwattr $C$DW$138, DW_AT_decl_line(0x8e)
    2034                            .dwattr $C$DW$138, DW_AT_decl_column(0x0f)
    2035                    
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:17 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{D5117D28-3097-44CE-B654-78C5C428E8EA} PAGE   38

    2036                    $C$DW$139       .dwtag  DW_TAG_member
    2037                            .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$41)
    2038                            .dwattr $C$DW$139, DW_AT_name("arg")
    2039                            .dwattr $C$DW$139, DW_AT_TI_symbol_name("arg")
    2040                            .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2041                            .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    2042                            .dwattr $C$DW$139, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/d
    2043                            .dwattr $C$DW$139, DW_AT_decl_line(0x8f)
    2044                            .dwattr $C$DW$139, DW_AT_decl_column(0x0f)
    2045                    
    2046                            .dwattr $C$DW$T$42, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/
    2047                            .dwattr $C$DW$T$42, DW_AT_decl_line(0x8c)
    2048                            .dwattr $C$DW$T$42, DW_AT_decl_column(0x10)
    2049                            .dwendtag $C$DW$T$42
    2050                    
    2051                    $C$DW$T$160     .dwtag  DW_TAG_typedef
    2052                            .dwattr $C$DW$T$160, DW_AT_name("ClockP_Params")
    2053                            .dwattr $C$DW$T$160, DW_AT_type(*$C$DW$T$42)
    2054                            .dwattr $C$DW$T$160, DW_AT_language(DW_LANG_C)
    2055                            .dwattr $C$DW$T$160, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers
    2056                            .dwattr $C$DW$T$160, DW_AT_decl_line(0x90)
    2057                            .dwattr $C$DW$T$160, DW_AT_decl_column(0x03)
    2058                    
    2059                    
    2060                    $C$DW$T$161     .dwtag  DW_TAG_enumeration_type
    2061                            .dwattr $C$DW$T$161, DW_AT_name("ClockP_Status")
    2062                            .dwattr $C$DW$T$161, DW_AT_byte_size(0x01)
    2063                    $C$DW$140       .dwtag  DW_TAG_enumerator
    2064                            .dwattr $C$DW$140, DW_AT_name("ClockP_OK")
    2065                            .dwattr $C$DW$140, DW_AT_const_value(0x00)
    2066                            .dwattr $C$DW$140, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/d
    2067                            .dwattr $C$DW$140, DW_AT_decl_line(0x64)
    2068                            .dwattr $C$DW$140, DW_AT_decl_column(0x05)
    2069                    
    2070                    $C$DW$141       .dwtag  DW_TAG_enumerator
    2071                            .dwattr $C$DW$141, DW_AT_name("ClockP_FAILURE")
    2072                            .dwattr $C$DW$141, DW_AT_const_value(-1)
    2073                            .dwattr $C$DW$141, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/d
    2074                            .dwattr $C$DW$141, DW_AT_decl_line(0x65)
    2075                            .dwattr $C$DW$141, DW_AT_decl_column(0x05)
    2076                    
    2077                            .dwattr $C$DW$T$161, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers
    2078                            .dwattr $C$DW$T$161, DW_AT_decl_line(0x63)
    2079                            .dwattr $C$DW$T$161, DW_AT_decl_column(0x0e)
    2080                            .dwendtag $C$DW$T$161
    2081                    
    2082                    $C$DW$T$162     .dwtag  DW_TAG_typedef
    2083                            .dwattr $C$DW$T$162, DW_AT_name("ClockP_Status")
    2084                            .dwattr $C$DW$T$162, DW_AT_type(*$C$DW$T$161)
    2085                            .dwattr $C$DW$T$162, DW_AT_language(DW_LANG_C)
    2086                            .dwattr $C$DW$T$162, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers
    2087                            .dwattr $C$DW$T$162, DW_AT_decl_line(0x66)
    2088                            .dwattr $C$DW$T$162, DW_AT_decl_column(0x03)
    2089                    
    2090                    
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:17 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{D5117D28-3097-44CE-B654-78C5C428E8EA} PAGE   39

    2091                    $C$DW$T$45      .dwtag  DW_TAG_union_type
    2092                            .dwattr $C$DW$T$45, DW_AT_name("ClockP_Struct")
    2093                            .dwattr $C$DW$T$45, DW_AT_byte_size(0x24)
    2094                    $C$DW$142       .dwtag  DW_TAG_member
    2095                            .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$22)
    2096                            .dwattr $C$DW$142, DW_AT_name("dummy")
    2097                            .dwattr $C$DW$142, DW_AT_TI_symbol_name("dummy")
    2098                            .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2099                            .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    2100                            .dwattr $C$DW$142, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/d
    2101                            .dwattr $C$DW$142, DW_AT_decl_line(0x54)
    2102                            .dwattr $C$DW$142, DW_AT_decl_column(0x0e)
    2103                    
    2104                    $C$DW$143       .dwtag  DW_TAG_member
    2105                            .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$44)
    2106                            .dwattr $C$DW$143, DW_AT_name("data")
    2107                            .dwattr $C$DW$143, DW_AT_TI_symbol_name("data")
    2108                            .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2109                            .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    2110                            .dwattr $C$DW$143, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/d
    2111                            .dwattr $C$DW$143, DW_AT_decl_line(0x55)
    2112                            .dwattr $C$DW$143, DW_AT_decl_column(0x0e)
    2113                    
    2114                            .dwattr $C$DW$T$45, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/
    2115                            .dwattr $C$DW$T$45, DW_AT_decl_line(0x53)
    2116                            .dwattr $C$DW$T$45, DW_AT_decl_column(0x0f)
    2117                            .dwendtag $C$DW$T$45
    2118                    
    2119                    $C$DW$T$62      .dwtag  DW_TAG_typedef
    2120                            .dwattr $C$DW$T$62, DW_AT_name("ClockP_Struct")
    2121                            .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$45)
    2122                            .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
    2123                            .dwattr $C$DW$T$62, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/
    2124                            .dwattr $C$DW$T$62, DW_AT_decl_line(0x56)
    2125                            .dwattr $C$DW$T$62, DW_AT_decl_column(0x03)
    2126                    
    2127                    
    2128                    $C$DW$T$46      .dwtag  DW_TAG_structure_type
    2129                            .dwattr $C$DW$T$46, DW_AT_name("HwiP_Params")
    2130                            .dwattr $C$DW$T$46, DW_AT_byte_size(0x0c)
    2131                    $C$DW$144       .dwtag  DW_TAG_member
    2132                            .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$41)
    2133                            .dwattr $C$DW$144, DW_AT_name("arg")
    2134                            .dwattr $C$DW$144, DW_AT_TI_symbol_name("arg")
    2135                            .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2136                            .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    2137                            .dwattr $C$DW$144, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/d
    2138                            .dwattr $C$DW$144, DW_AT_decl_line(0x72)
    2139                            .dwattr $C$DW$144, DW_AT_decl_column(0x10)
    2140                    
    2141                    $C$DW$145       .dwtag  DW_TAG_member
    2142                            .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$22)
    2143                            .dwattr $C$DW$145, DW_AT_name("priority")
    2144                            .dwattr $C$DW$145, DW_AT_TI_symbol_name("priority")
    2145                            .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:17 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{D5117D28-3097-44CE-B654-78C5C428E8EA} PAGE   40

    2146                            .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    2147                            .dwattr $C$DW$145, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/d
    2148                            .dwattr $C$DW$145, DW_AT_decl_line(0x73)
    2149                            .dwattr $C$DW$145, DW_AT_decl_column(0x10)
    2150                    
    2151                    $C$DW$146       .dwtag  DW_TAG_member
    2152                            .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$40)
    2153                            .dwattr $C$DW$146, DW_AT_name("enableInt")
    2154                            .dwattr $C$DW$146, DW_AT_TI_symbol_name("enableInt")
    2155                            .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2156                            .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    2157                            .dwattr $C$DW$146, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/d
    2158                            .dwattr $C$DW$146, DW_AT_decl_line(0x74)
    2159                            .dwattr $C$DW$146, DW_AT_decl_column(0x10)
    2160                    
    2161                            .dwattr $C$DW$T$46, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/
    2162                            .dwattr $C$DW$T$46, DW_AT_decl_line(0x71)
    2163                            .dwattr $C$DW$T$46, DW_AT_decl_column(0x10)
    2164                            .dwendtag $C$DW$T$46
    2165                    
    2166                    $C$DW$T$163     .dwtag  DW_TAG_typedef
    2167                            .dwattr $C$DW$T$163, DW_AT_name("HwiP_Params")
    2168                            .dwattr $C$DW$T$163, DW_AT_type(*$C$DW$T$46)
    2169                            .dwattr $C$DW$T$163, DW_AT_language(DW_LANG_C)
    2170                            .dwattr $C$DW$T$163, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers
    2171                            .dwattr $C$DW$T$163, DW_AT_decl_line(0x75)
    2172                            .dwattr $C$DW$T$163, DW_AT_decl_column(0x03)
    2173                    
    2174                    
    2175                    $C$DW$T$164     .dwtag  DW_TAG_enumeration_type
    2176                            .dwattr $C$DW$T$164, DW_AT_name("HwiP_Status")
    2177                            .dwattr $C$DW$T$164, DW_AT_byte_size(0x01)
    2178                    $C$DW$147       .dwtag  DW_TAG_enumerator
    2179                            .dwattr $C$DW$147, DW_AT_name("HwiP_OK")
    2180                            .dwattr $C$DW$147, DW_AT_const_value(0x00)
    2181                            .dwattr $C$DW$147, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/d
    2182                            .dwattr $C$DW$147, DW_AT_decl_line(0x5c)
    2183                            .dwattr $C$DW$147, DW_AT_decl_column(0x05)
    2184                    
    2185                    $C$DW$148       .dwtag  DW_TAG_enumerator
    2186                            .dwattr $C$DW$148, DW_AT_name("HwiP_FAILURE")
    2187                            .dwattr $C$DW$148, DW_AT_const_value(-1)
    2188                            .dwattr $C$DW$148, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/d
    2189                            .dwattr $C$DW$148, DW_AT_decl_line(0x5d)
    2190                            .dwattr $C$DW$148, DW_AT_decl_column(0x05)
    2191                    
    2192                            .dwattr $C$DW$T$164, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers
    2193                            .dwattr $C$DW$T$164, DW_AT_decl_line(0x5b)
    2194                            .dwattr $C$DW$T$164, DW_AT_decl_column(0x0e)
    2195                            .dwendtag $C$DW$T$164
    2196                    
    2197                    $C$DW$T$165     .dwtag  DW_TAG_typedef
    2198                            .dwattr $C$DW$T$165, DW_AT_name("HwiP_Status")
    2199                            .dwattr $C$DW$T$165, DW_AT_type(*$C$DW$T$164)
    2200                            .dwattr $C$DW$T$165, DW_AT_language(DW_LANG_C)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:17 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{D5117D28-3097-44CE-B654-78C5C428E8EA} PAGE   41

    2201                            .dwattr $C$DW$T$165, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers
    2202                            .dwattr $C$DW$T$165, DW_AT_decl_line(0x5e)
    2203                            .dwattr $C$DW$T$165, DW_AT_decl_column(0x03)
    2204                    
    2205                    
    2206                    $C$DW$T$48      .dwtag  DW_TAG_union_type
    2207                            .dwattr $C$DW$T$48, DW_AT_name("HwiP_Struct")
    2208                            .dwattr $C$DW$T$48, DW_AT_byte_size(0x1c)
    2209                    $C$DW$149       .dwtag  DW_TAG_member
    2210                            .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$22)
    2211                            .dwattr $C$DW$149, DW_AT_name("dummy")
    2212                            .dwattr $C$DW$149, DW_AT_TI_symbol_name("dummy")
    2213                            .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2214                            .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    2215                            .dwattr $C$DW$149, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/d
    2216                            .dwattr $C$DW$149, DW_AT_decl_line(0x4d)
    2217                            .dwattr $C$DW$149, DW_AT_decl_column(0x0e)
    2218                    
    2219                    $C$DW$150       .dwtag  DW_TAG_member
    2220                            .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$47)
    2221                            .dwattr $C$DW$150, DW_AT_name("data")
    2222                            .dwattr $C$DW$150, DW_AT_TI_symbol_name("data")
    2223                            .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2224                            .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    2225                            .dwattr $C$DW$150, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/d
    2226                            .dwattr $C$DW$150, DW_AT_decl_line(0x4e)
    2227                            .dwattr $C$DW$150, DW_AT_decl_column(0x0e)
    2228                    
    2229                            .dwattr $C$DW$T$48, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/
    2230                            .dwattr $C$DW$T$48, DW_AT_decl_line(0x4c)
    2231                            .dwattr $C$DW$T$48, DW_AT_decl_column(0x0f)
    2232                            .dwendtag $C$DW$T$48
    2233                    
    2234                    $C$DW$T$63      .dwtag  DW_TAG_typedef
    2235                            .dwattr $C$DW$T$63, DW_AT_name("HwiP_Struct")
    2236                            .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$48)
    2237                            .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
    2238                            .dwattr $C$DW$T$63, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/
    2239                            .dwattr $C$DW$T$63, DW_AT_decl_line(0x4f)
    2240                            .dwattr $C$DW$T$63, DW_AT_decl_column(0x03)
    2241                    
    2242                    
    2243                    $C$DW$T$50      .dwtag  DW_TAG_structure_type
    2244                            .dwattr $C$DW$T$50, DW_AT_name("List_Elem")
    2245                            .dwattr $C$DW$T$50, DW_AT_byte_size(0x08)
    2246                    $C$DW$151       .dwtag  DW_TAG_member
    2247                            .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$49)
    2248                            .dwattr $C$DW$151, DW_AT_name("next")
    2249                            .dwattr $C$DW$151, DW_AT_TI_symbol_name("next")
    2250                            .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2251                            .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    2252                            .dwattr $C$DW$151, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/u
    2253                            .dwattr $C$DW$151, DW_AT_decl_line(0x7f)
    2254                            .dwattr $C$DW$151, DW_AT_decl_column(0x17)
    2255                    
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:17 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{D5117D28-3097-44CE-B654-78C5C428E8EA} PAGE   42

    2256                    $C$DW$152       .dwtag  DW_TAG_member
    2257                            .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$49)
    2258                            .dwattr $C$DW$152, DW_AT_name("prev")
    2259                            .dwattr $C$DW$152, DW_AT_TI_symbol_name("prev")
    2260                            .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2261                            .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    2262                            .dwattr $C$DW$152, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/u
    2263                            .dwattr $C$DW$152, DW_AT_decl_line(0x80)
    2264                            .dwattr $C$DW$152, DW_AT_decl_column(0x17)
    2265                    
    2266                            .dwattr $C$DW$T$50, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/
    2267                            .dwattr $C$DW$T$50, DW_AT_decl_line(0x7e)
    2268                            .dwattr $C$DW$T$50, DW_AT_decl_column(0x10)
    2269                            .dwendtag $C$DW$T$50
    2270                    
    2271                    $C$DW$T$51      .dwtag  DW_TAG_typedef
    2272                            .dwattr $C$DW$T$51, DW_AT_name("List_Elem")
    2273                            .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$50)
    2274                            .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
    2275                            .dwattr $C$DW$T$51, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/
    2276                            .dwattr $C$DW$T$51, DW_AT_decl_line(0x81)
    2277                            .dwattr $C$DW$T$51, DW_AT_decl_column(0x03)
    2278                    
    2279                    $C$DW$T$52      .dwtag  DW_TAG_pointer_type
    2280                            .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$51)
    2281                            .dwattr $C$DW$T$52, DW_AT_address_class(0x20)
    2282                    
    2283                    $C$DW$T$49      .dwtag  DW_TAG_pointer_type
    2284                            .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$50)
    2285                            .dwattr $C$DW$T$49, DW_AT_address_class(0x20)
    2286                    
    2287                    
    2288                    $C$DW$T$53      .dwtag  DW_TAG_structure_type
    2289                            .dwattr $C$DW$T$53, DW_AT_name("List_List")
    2290                            .dwattr $C$DW$T$53, DW_AT_byte_size(0x08)
    2291                    $C$DW$153       .dwtag  DW_TAG_member
    2292                            .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$52)
    2293                            .dwattr $C$DW$153, DW_AT_name("head")
    2294                            .dwattr $C$DW$153, DW_AT_TI_symbol_name("head")
    2295                            .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2296                            .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    2297                            .dwattr $C$DW$153, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/u
    2298                            .dwattr $C$DW$153, DW_AT_decl_line(0x84)
    2299                            .dwattr $C$DW$153, DW_AT_decl_column(0x10)
    2300                    
    2301                    $C$DW$154       .dwtag  DW_TAG_member
    2302                            .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$52)
    2303                            .dwattr $C$DW$154, DW_AT_name("tail")
    2304                            .dwattr $C$DW$154, DW_AT_TI_symbol_name("tail")
    2305                            .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2306                            .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    2307                            .dwattr $C$DW$154, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/u
    2308                            .dwattr $C$DW$154, DW_AT_decl_line(0x85)
    2309                            .dwattr $C$DW$154, DW_AT_decl_column(0x10)
    2310                    
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:17 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{D5117D28-3097-44CE-B654-78C5C428E8EA} PAGE   43

    2311                            .dwattr $C$DW$T$53, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/
    2312                            .dwattr $C$DW$T$53, DW_AT_decl_line(0x83)
    2313                            .dwattr $C$DW$T$53, DW_AT_decl_column(0x10)
    2314                            .dwendtag $C$DW$T$53
    2315                    
    2316                    $C$DW$T$61      .dwtag  DW_TAG_typedef
    2317                            .dwattr $C$DW$T$61, DW_AT_name("List_List")
    2318                            .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$53)
    2319                            .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
    2320                            .dwattr $C$DW$T$61, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/
    2321                            .dwattr $C$DW$T$61, DW_AT_decl_line(0x86)
    2322                            .dwattr $C$DW$T$61, DW_AT_decl_column(0x03)
    2323                    
    2324                    
    2325                    $C$DW$T$60      .dwtag  DW_TAG_structure_type
    2326                            .dwattr $C$DW$T$60, DW_AT_name("PowerCC26XX_Config")
    2327                            .dwattr $C$DW$T$60, DW_AT_byte_size(0x18)
    2328                    $C$DW$155       .dwtag  DW_TAG_member
    2329                            .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$56)
    2330                            .dwattr $C$DW$155, DW_AT_name("policyInitFxn")
    2331                            .dwattr $C$DW$155, DW_AT_TI_symbol_name("policyInitFxn")
    2332                            .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2333                            .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    2334                            .dwattr $C$DW$155, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/p
    2335                            .dwattr $C$DW$155, DW_AT_decl_line(0x147)
    2336                            .dwattr $C$DW$155, DW_AT_decl_column(0x19)
    2337                    
    2338                    $C$DW$156       .dwtag  DW_TAG_member
    2339                            .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$57)
    2340                            .dwattr $C$DW$156, DW_AT_name("policyFxn")
    2341                            .dwattr $C$DW$156, DW_AT_TI_symbol_name("policyFxn")
    2342                            .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2343                            .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    2344                            .dwattr $C$DW$156, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/p
    2345                            .dwattr $C$DW$156, DW_AT_decl_line(0x15d)
    2346                            .dwattr $C$DW$156, DW_AT_decl_column(0x15)
    2347                    
    2348                    $C$DW$157       .dwtag  DW_TAG_member
    2349                            .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$59)
    2350                            .dwattr $C$DW$157, DW_AT_name("calibrateFxn")
    2351                            .dwattr $C$DW$157, DW_AT_TI_symbol_name("calibrateFxn")
    2352                            .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2353                            .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    2354                            .dwattr $C$DW$157, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/p
    2355                            .dwattr $C$DW$157, DW_AT_decl_line(0x169)
    2356                            .dwattr $C$DW$157, DW_AT_decl_column(0x0c)
    2357                    
    2358                    $C$DW$158       .dwtag  DW_TAG_member
    2359                            .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$22)
    2360                            .dwattr $C$DW$158, DW_AT_name("maxStandbyDuration")
    2361                            .dwattr $C$DW$158, DW_AT_TI_symbol_name("maxStandbyDuration")
    2362                            .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2363                            .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    2364                            .dwattr $C$DW$158, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/p
    2365                            .dwattr $C$DW$158, DW_AT_decl_line(0x184)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:17 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{D5117D28-3097-44CE-B654-78C5C428E8EA} PAGE   44

    2366                            .dwattr $C$DW$158, DW_AT_decl_column(0x0e)
    2367                    
    2368                    $C$DW$159       .dwtag  DW_TAG_member
    2369                            .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$33)
    2370                            .dwattr $C$DW$159, DW_AT_name("vddrRechargeMargin")
    2371                            .dwattr $C$DW$159, DW_AT_TI_symbol_name("vddrRechargeMargin")
    2372                            .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2373                            .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    2374                            .dwattr $C$DW$159, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/p
    2375                            .dwattr $C$DW$159, DW_AT_decl_line(0x195)
    2376                            .dwattr $C$DW$159, DW_AT_decl_column(0x0e)
    2377                    
    2378                    $C$DW$160       .dwtag  DW_TAG_member
    2379                            .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$40)
    2380                            .dwattr $C$DW$160, DW_AT_name("enableMaxStandbyDuration")
    2381                            .dwattr $C$DW$160, DW_AT_TI_symbol_name("enableMaxStandbyDuration")
    2382                            .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    2383                            .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2384                            .dwattr $C$DW$160, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/p
    2385                            .dwattr $C$DW$160, DW_AT_decl_line(0x1a2)
    2386                            .dwattr $C$DW$160, DW_AT_decl_column(0x0a)
    2387                    
    2388                    $C$DW$161       .dwtag  DW_TAG_member
    2389                            .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$40)
    2390                            .dwattr $C$DW$161, DW_AT_name("enablePolicy")
    2391                            .dwattr $C$DW$161, DW_AT_TI_symbol_name("enablePolicy")
    2392                            .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    2393                            .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    2394                            .dwattr $C$DW$161, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/p
    2395                            .dwattr $C$DW$161, DW_AT_decl_line(0x1af)
    2396                            .dwattr $C$DW$161, DW_AT_decl_column(0x0a)
    2397                    
    2398                    $C$DW$162       .dwtag  DW_TAG_member
    2399                            .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$40)
    2400                            .dwattr $C$DW$162, DW_AT_name("calibrateRCOSC_LF")
    2401                            .dwattr $C$DW$162, DW_AT_TI_symbol_name("calibrateRCOSC_LF")
    2402                            .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2403                            .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2404                            .dwattr $C$DW$162, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/p
    2405                            .dwattr $C$DW$162, DW_AT_decl_line(0x1b8)
    2406                            .dwattr $C$DW$162, DW_AT_decl_column(0x0a)
    2407                    
    2408                    $C$DW$163       .dwtag  DW_TAG_member
    2409                            .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$40)
    2410                            .dwattr $C$DW$163, DW_AT_name("calibrateRCOSC_HF")
    2411                            .dwattr $C$DW$163, DW_AT_TI_symbol_name("calibrateRCOSC_HF")
    2412                            .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    2413                            .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2414                            .dwattr $C$DW$163, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/p
    2415                            .dwattr $C$DW$163, DW_AT_decl_line(0x1c1)
    2416                            .dwattr $C$DW$163, DW_AT_decl_column(0x0a)
    2417                    
    2418                            .dwattr $C$DW$T$60, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/
    2419                            .dwattr $C$DW$T$60, DW_AT_decl_line(0x140)
    2420                            .dwattr $C$DW$T$60, DW_AT_decl_column(0x10)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:17 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{D5117D28-3097-44CE-B654-78C5C428E8EA} PAGE   45

    2421                            .dwendtag $C$DW$T$60
    2422                    
    2423                    $C$DW$T$166     .dwtag  DW_TAG_typedef
    2424                            .dwattr $C$DW$T$166, DW_AT_name("PowerCC26XX_Config")
    2425                            .dwattr $C$DW$T$166, DW_AT_type(*$C$DW$T$60)
    2426                            .dwattr $C$DW$T$166, DW_AT_language(DW_LANG_C)
    2427                            .dwattr $C$DW$T$166, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers
    2428                            .dwattr $C$DW$T$166, DW_AT_decl_line(0x1c2)
    2429                            .dwattr $C$DW$T$166, DW_AT_decl_column(0x03)
    2430                    
    2431                    
    2432                    $C$DW$T$70      .dwtag  DW_TAG_structure_type
    2433                            .dwattr $C$DW$T$70, DW_AT_name("PowerCC26XX_ModuleState")
    2434                            .dwattr $C$DW$T$70, DW_AT_byte_size(0x114)
    2435                    $C$DW$164       .dwtag  DW_TAG_member
    2436                            .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$61)
    2437                            .dwattr $C$DW$164, DW_AT_name("notifyList")
    2438                            .dwattr $C$DW$164, DW_AT_TI_symbol_name("notifyList")
    2439                            .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2440                            .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2441                            .dwattr $C$DW$164, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/p
    2442                            .dwattr $C$DW$164, DW_AT_decl_line(0x1cb)
    2443                            .dwattr $C$DW$164, DW_AT_decl_column(0x0f)
    2444                    
    2445                    $C$DW$165       .dwtag  DW_TAG_member
    2446                            .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$22)
    2447                            .dwattr $C$DW$165, DW_AT_name("constraintMask")
    2448                            .dwattr $C$DW$165, DW_AT_TI_symbol_name("constraintMask")
    2449                            .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2450                            .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2451                            .dwattr $C$DW$165, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/p
    2452                            .dwattr $C$DW$165, DW_AT_decl_line(0x1cc)
    2453                            .dwattr $C$DW$165, DW_AT_decl_column(0x0e)
    2454                    
    2455                    $C$DW$166       .dwtag  DW_TAG_member
    2456                            .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$62)
    2457                            .dwattr $C$DW$166, DW_AT_name("clockObj")
    2458                            .dwattr $C$DW$166, DW_AT_TI_symbol_name("clockObj")
    2459                            .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2460                            .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2461                            .dwattr $C$DW$166, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/p
    2462                            .dwattr $C$DW$166, DW_AT_decl_line(0x1cd)
    2463                            .dwattr $C$DW$166, DW_AT_decl_column(0x13)
    2464                    
    2465                    $C$DW$167       .dwtag  DW_TAG_member
    2466                            .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$62)
    2467                            .dwattr $C$DW$167, DW_AT_name("xoscClockObj")
    2468                            .dwattr $C$DW$167, DW_AT_TI_symbol_name("xoscClockObj")
    2469                            .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2470                            .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2471                            .dwattr $C$DW$167, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/p
    2472                            .dwattr $C$DW$167, DW_AT_decl_line(0x1ce)
    2473                            .dwattr $C$DW$167, DW_AT_decl_column(0x13)
    2474                    
    2475                    $C$DW$168       .dwtag  DW_TAG_member
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:17 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{D5117D28-3097-44CE-B654-78C5C428E8EA} PAGE   46

    2476                            .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$62)
    2477                            .dwattr $C$DW$168, DW_AT_name("lfClockObj")
    2478                            .dwattr $C$DW$168, DW_AT_TI_symbol_name("lfClockObj")
    2479                            .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
    2480                            .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2481                            .dwattr $C$DW$168, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/p
    2482                            .dwattr $C$DW$168, DW_AT_decl_line(0x1cf)
    2483                            .dwattr $C$DW$168, DW_AT_decl_column(0x13)
    2484                    
    2485                    $C$DW$169       .dwtag  DW_TAG_member
    2486                            .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$62)
    2487                            .dwattr $C$DW$169, DW_AT_name("calClockStruct")
    2488                            .dwattr $C$DW$169, DW_AT_TI_symbol_name("calClockStruct")
    2489                            .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    2490                            .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2491                            .dwattr $C$DW$169, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/p
    2492                            .dwattr $C$DW$169, DW_AT_decl_line(0x1d0)
    2493                            .dwattr $C$DW$169, DW_AT_decl_column(0x13)
    2494                    
    2495                    $C$DW$170       .dwtag  DW_TAG_member
    2496                            .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$63)
    2497                            .dwattr $C$DW$170, DW_AT_name("hwiStruct")
    2498                            .dwattr $C$DW$170, DW_AT_TI_symbol_name("hwiStruct")
    2499                            .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    2500                            .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    2501                            .dwattr $C$DW$170, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/p
    2502                            .dwattr $C$DW$170, DW_AT_decl_line(0x1d1)
    2503                            .dwattr $C$DW$170, DW_AT_decl_column(0x11)
    2504                    
    2505                    $C$DW$171       .dwtag  DW_TAG_member
    2506                            .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$64)
    2507                            .dwattr $C$DW$171, DW_AT_name("nDeltaFreqCurr")
    2508                            .dwattr $C$DW$171, DW_AT_TI_symbol_name("nDeltaFreqCurr")
    2509                            .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0xb8]
    2510                            .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    2511                            .dwattr $C$DW$171, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/p
    2512                            .dwattr $C$DW$171, DW_AT_decl_line(0x1d2)
    2513                            .dwattr $C$DW$171, DW_AT_decl_column(0x0d)
    2514                    
    2515                    $C$DW$172       .dwtag  DW_TAG_member
    2516                            .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$64)
    2517                            .dwattr $C$DW$172, DW_AT_name("nCtrimCurr")
    2518                            .dwattr $C$DW$172, DW_AT_TI_symbol_name("nCtrimCurr")
    2519                            .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    2520                            .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    2521                            .dwattr $C$DW$172, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/p
    2522                            .dwattr $C$DW$172, DW_AT_decl_line(0x1d3)
    2523                            .dwattr $C$DW$172, DW_AT_decl_column(0x0d)
    2524                    
    2525                    $C$DW$173       .dwtag  DW_TAG_member
    2526                            .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$64)
    2527                            .dwattr $C$DW$173, DW_AT_name("nCtrimFractCurr")
    2528                            .dwattr $C$DW$173, DW_AT_TI_symbol_name("nCtrimFractCurr")
    2529                            .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    2530                            .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:17 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{D5117D28-3097-44CE-B654-78C5C428E8EA} PAGE   47

    2531                            .dwattr $C$DW$173, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/p
    2532                            .dwattr $C$DW$173, DW_AT_decl_line(0x1d4)
    2533                            .dwattr $C$DW$173, DW_AT_decl_column(0x0d)
    2534                    
    2535                    $C$DW$174       .dwtag  DW_TAG_member
    2536                            .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$64)
    2537                            .dwattr $C$DW$174, DW_AT_name("nCtrimNew")
    2538                            .dwattr $C$DW$174, DW_AT_TI_symbol_name("nCtrimNew")
    2539                            .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    2540                            .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    2541                            .dwattr $C$DW$174, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/p
    2542                            .dwattr $C$DW$174, DW_AT_decl_line(0x1d5)
    2543                            .dwattr $C$DW$174, DW_AT_decl_column(0x0d)
    2544                    
    2545                    $C$DW$175       .dwtag  DW_TAG_member
    2546                            .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$64)
    2547                            .dwattr $C$DW$175, DW_AT_name("nCtrimFractNew")
    2548                            .dwattr $C$DW$175, DW_AT_TI_symbol_name("nCtrimFractNew")
    2549                            .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    2550                            .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    2551                            .dwattr $C$DW$175, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/p
    2552                            .dwattr $C$DW$175, DW_AT_decl_line(0x1d6)
    2553                            .dwattr $C$DW$175, DW_AT_decl_column(0x0d)
    2554                    
    2555                    $C$DW$176       .dwtag  DW_TAG_member
    2556                            .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$64)
    2557                            .dwattr $C$DW$176, DW_AT_name("nRtrimNew")
    2558                            .dwattr $C$DW$176, DW_AT_TI_symbol_name("nRtrimNew")
    2559                            .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    2560                            .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    2561                            .dwattr $C$DW$176, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/p
    2562                            .dwattr $C$DW$176, DW_AT_decl_line(0x1d7)
    2563                            .dwattr $C$DW$176, DW_AT_decl_column(0x0d)
    2564                    
    2565                    $C$DW$177       .dwtag  DW_TAG_member
    2566                            .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$64)
    2567                            .dwattr $C$DW$177, DW_AT_name("nRtrimCurr")
    2568                            .dwattr $C$DW$177, DW_AT_TI_symbol_name("nRtrimCurr")
    2569                            .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    2570                            .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    2571                            .dwattr $C$DW$177, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/p
    2572                            .dwattr $C$DW$177, DW_AT_decl_line(0x1d8)
    2573                            .dwattr $C$DW$177, DW_AT_decl_column(0x0d)
    2574                    
    2575                    $C$DW$178       .dwtag  DW_TAG_member
    2576                            .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$64)
    2577                            .dwattr $C$DW$178, DW_AT_name("nDeltaFreqNew")
    2578                            .dwattr $C$DW$178, DW_AT_TI_symbol_name("nDeltaFreqNew")
    2579                            .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    2580                            .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    2581                            .dwattr $C$DW$178, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/p
    2582                            .dwattr $C$DW$178, DW_AT_decl_line(0x1d9)
    2583                            .dwattr $C$DW$178, DW_AT_decl_column(0x0d)
    2584                    
    2585                    $C$DW$179       .dwtag  DW_TAG_member
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:17 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{D5117D28-3097-44CE-B654-78C5C428E8EA} PAGE   48

    2586                            .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$40)
    2587                            .dwattr $C$DW$179, DW_AT_name("bRefine")
    2588                            .dwattr $C$DW$179, DW_AT_TI_symbol_name("bRefine")
    2589                            .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    2590                            .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    2591                            .dwattr $C$DW$179, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/p
    2592                            .dwattr $C$DW$179, DW_AT_decl_line(0x1da)
    2593                            .dwattr $C$DW$179, DW_AT_decl_column(0x0a)
    2594                    
    2595                    $C$DW$180       .dwtag  DW_TAG_member
    2596                            .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$22)
    2597                            .dwattr $C$DW$180, DW_AT_name("state")
    2598                            .dwattr $C$DW$180, DW_AT_TI_symbol_name("state")
    2599                            .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    2600                            .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    2601                            .dwattr $C$DW$180, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/p
    2602                            .dwattr $C$DW$180, DW_AT_decl_line(0x1db)
    2603                            .dwattr $C$DW$180, DW_AT_decl_column(0x0e)
    2604                    
    2605                    $C$DW$181       .dwtag  DW_TAG_member
    2606                            .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$40)
    2607                            .dwattr $C$DW$181, DW_AT_name("xoscPending")
    2608                            .dwattr $C$DW$181, DW_AT_TI_symbol_name("xoscPending")
    2609                            .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    2610                            .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    2611                            .dwattr $C$DW$181, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/p
    2612                            .dwattr $C$DW$181, DW_AT_decl_line(0x1dc)
    2613                            .dwattr $C$DW$181, DW_AT_decl_column(0x0a)
    2614                    
    2615                    $C$DW$182       .dwtag  DW_TAG_member
    2616                            .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$40)
    2617                            .dwattr $C$DW$182, DW_AT_name("calLF")
    2618                            .dwattr $C$DW$182, DW_AT_TI_symbol_name("calLF")
    2619                            .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0xe1]
    2620                            .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    2621                            .dwattr $C$DW$182, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/p
    2622                            .dwattr $C$DW$182, DW_AT_decl_line(0x1dd)
    2623                            .dwattr $C$DW$182, DW_AT_decl_column(0x0a)
    2624                    
    2625                    $C$DW$183       .dwtag  DW_TAG_member
    2626                            .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$30)
    2627                            .dwattr $C$DW$183, DW_AT_name("hwiState")
    2628                            .dwattr $C$DW$183, DW_AT_TI_symbol_name("hwiState")
    2629                            .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    2630                            .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    2631                            .dwattr $C$DW$183, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/p
    2632                            .dwattr $C$DW$183, DW_AT_decl_line(0x1de)
    2633                            .dwattr $C$DW$183, DW_AT_decl_column(0x0d)
    2634                    
    2635                    $C$DW$184       .dwtag  DW_TAG_member
    2636                            .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$40)
    2637                            .dwattr $C$DW$184, DW_AT_name("busyCal")
    2638                            .dwattr $C$DW$184, DW_AT_TI_symbol_name("busyCal")
    2639                            .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0xe3]
    2640                            .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:17 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{D5117D28-3097-44CE-B654-78C5C428E8EA} PAGE   49

    2641                            .dwattr $C$DW$184, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/p
    2642                            .dwattr $C$DW$184, DW_AT_decl_line(0x1df)
    2643                            .dwattr $C$DW$184, DW_AT_decl_column(0x0a)
    2644                    
    2645                    $C$DW$185       .dwtag  DW_TAG_member
    2646                            .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$30)
    2647                            .dwattr $C$DW$185, DW_AT_name("calStep")
    2648                            .dwattr $C$DW$185, DW_AT_TI_symbol_name("calStep")
    2649                            .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0xe4]
    2650                            .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    2651                            .dwattr $C$DW$185, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/p
    2652                            .dwattr $C$DW$185, DW_AT_decl_line(0x1e0)
    2653                            .dwattr $C$DW$185, DW_AT_decl_column(0x0d)
    2654                    
    2655                    $C$DW$186       .dwtag  DW_TAG_member
    2656                            .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$40)
    2657                            .dwattr $C$DW$186, DW_AT_name("firstLF")
    2658                            .dwattr $C$DW$186, DW_AT_TI_symbol_name("firstLF")
    2659                            .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0xe5]
    2660                            .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    2661                            .dwattr $C$DW$186, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/p
    2662                            .dwattr $C$DW$186, DW_AT_decl_line(0x1e1)
    2663                            .dwattr $C$DW$186, DW_AT_decl_column(0x0a)
    2664                    
    2665                    $C$DW$187       .dwtag  DW_TAG_member
    2666                            .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$40)
    2667                            .dwattr $C$DW$187, DW_AT_name("enablePolicy")
    2668                            .dwattr $C$DW$187, DW_AT_TI_symbol_name("enablePolicy")
    2669                            .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
    2670                            .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    2671                            .dwattr $C$DW$187, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/p
    2672                            .dwattr $C$DW$187, DW_AT_decl_line(0x1e2)
    2673                            .dwattr $C$DW$187, DW_AT_decl_column(0x0a)
    2674                    
    2675                    $C$DW$188       .dwtag  DW_TAG_member
    2676                            .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$40)
    2677                            .dwattr $C$DW$188, DW_AT_name("initialized")
    2678                            .dwattr $C$DW$188, DW_AT_TI_symbol_name("initialized")
    2679                            .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0xe7]
    2680                            .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    2681                            .dwattr $C$DW$188, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/p
    2682                            .dwattr $C$DW$188, DW_AT_decl_line(0x1e3)
    2683                            .dwattr $C$DW$188, DW_AT_decl_column(0x0a)
    2684                    
    2685                    $C$DW$189       .dwtag  DW_TAG_member
    2686                            .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$65)
    2687                            .dwattr $C$DW$189, DW_AT_name("constraintCounts")
    2688                            .dwattr $C$DW$189, DW_AT_TI_symbol_name("constraintCounts")
    2689                            .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    2690                            .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    2691                            .dwattr $C$DW$189, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/p
    2692                            .dwattr $C$DW$189, DW_AT_decl_line(0x1e7)
    2693                            .dwattr $C$DW$189, DW_AT_decl_column(0x0d)
    2694                    
    2695                    $C$DW$190       .dwtag  DW_TAG_member
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:17 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{D5117D28-3097-44CE-B654-78C5C428E8EA} PAGE   50

    2696                            .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$66)
    2697                            .dwattr $C$DW$190, DW_AT_name("resourceCounts")
    2698                            .dwattr $C$DW$190, DW_AT_TI_symbol_name("resourceCounts")
    2699                            .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0xef]
    2700                            .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    2701                            .dwattr $C$DW$190, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/p
    2702                            .dwattr $C$DW$190, DW_AT_decl_line(0x1e9)
    2703                            .dwattr $C$DW$190, DW_AT_decl_column(0x0d)
    2704                    
    2705                    $C$DW$191       .dwtag  DW_TAG_member
    2706                            .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$69)
    2707                            .dwattr $C$DW$191, DW_AT_name("resourceHandlers")
    2708                            .dwattr $C$DW$191, DW_AT_TI_symbol_name("resourceHandlers")
    2709                            .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
    2710                            .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    2711                            .dwattr $C$DW$191, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/p
    2712                            .dwattr $C$DW$191, DW_AT_decl_line(0x1eb)
    2713                            .dwattr $C$DW$191, DW_AT_decl_column(0x14)
    2714                    
    2715                    $C$DW$192       .dwtag  DW_TAG_member
    2716                            .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$57)
    2717                            .dwattr $C$DW$192, DW_AT_name("policyFxn")
    2718                            .dwattr $C$DW$192, DW_AT_TI_symbol_name("policyFxn")
    2719                            .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x110]
    2720                            .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    2721                            .dwattr $C$DW$192, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/p
    2722                            .dwattr $C$DW$192, DW_AT_decl_line(0x1ed)
    2723                            .dwattr $C$DW$192, DW_AT_decl_column(0x15)
    2724                    
    2725                            .dwattr $C$DW$T$70, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/
    2726                            .dwattr $C$DW$T$70, DW_AT_decl_line(0x1ca)
    2727                            .dwattr $C$DW$T$70, DW_AT_decl_column(0x10)
    2728                            .dwendtag $C$DW$T$70
    2729                    
    2730                    $C$DW$T$167     .dwtag  DW_TAG_typedef
    2731                            .dwattr $C$DW$T$167, DW_AT_name("PowerCC26XX_ModuleState")
    2732                            .dwattr $C$DW$T$167, DW_AT_type(*$C$DW$T$70)
    2733                            .dwattr $C$DW$T$167, DW_AT_language(DW_LANG_C)
    2734                            .dwattr $C$DW$T$167, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers
    2735                            .dwattr $C$DW$T$167, DW_AT_decl_line(0x1ee)
    2736                            .dwattr $C$DW$T$167, DW_AT_decl_column(0x03)
    2737                    
    2738                    
    2739                    $C$DW$T$71      .dwtag  DW_TAG_structure_type
    2740                            .dwattr $C$DW$T$71, DW_AT_name("PowerCC26XX_ResourceRecord")
    2741                            .dwattr $C$DW$T$71, DW_AT_byte_size(0x04)
    2742                    $C$DW$193       .dwtag  DW_TAG_member
    2743                            .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$30)
    2744                            .dwattr $C$DW$193, DW_AT_name("flags")
    2745                            .dwattr $C$DW$193, DW_AT_TI_symbol_name("flags")
    2746                            .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2747                            .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    2748                            .dwattr $C$DW$193, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/p
    2749                            .dwattr $C$DW$193, DW_AT_decl_line(0x13a)
    2750                            .dwattr $C$DW$193, DW_AT_decl_column(0x0d)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:17 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{D5117D28-3097-44CE-B654-78C5C428E8EA} PAGE   51

    2751                    
    2752                    $C$DW$194       .dwtag  DW_TAG_member
    2753                            .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$33)
    2754                            .dwattr $C$DW$194, DW_AT_name("driverlibID")
    2755                            .dwattr $C$DW$194, DW_AT_TI_symbol_name("driverlibID")
    2756                            .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2757                            .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    2758                            .dwattr $C$DW$194, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/p
    2759                            .dwattr $C$DW$194, DW_AT_decl_line(0x13b)
    2760                            .dwattr $C$DW$194, DW_AT_decl_column(0x0e)
    2761                    
    2762                            .dwattr $C$DW$T$71, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/
    2763                            .dwattr $C$DW$T$71, DW_AT_decl_line(0x139)
    2764                            .dwattr $C$DW$T$71, DW_AT_decl_column(0x10)
    2765                            .dwendtag $C$DW$T$71
    2766                    
    2767                    $C$DW$T$168     .dwtag  DW_TAG_typedef
    2768                            .dwattr $C$DW$T$168, DW_AT_name("PowerCC26XX_ResourceRecord")
    2769                            .dwattr $C$DW$T$168, DW_AT_type(*$C$DW$T$71)
    2770                            .dwattr $C$DW$T$168, DW_AT_language(DW_LANG_C)
    2771                            .dwattr $C$DW$T$168, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers
    2772                            .dwattr $C$DW$T$168, DW_AT_decl_line(0x13c)
    2773                            .dwattr $C$DW$T$168, DW_AT_decl_column(0x03)
    2774                    
    2775                    
    2776                    $C$DW$T$77      .dwtag  DW_TAG_structure_type
    2777                            .dwattr $C$DW$T$77, DW_AT_name("Power_NotifyObj_")
    2778                            .dwattr $C$DW$T$77, DW_AT_byte_size(0x14)
    2779                    $C$DW$195       .dwtag  DW_TAG_member
    2780                            .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$51)
    2781                            .dwattr $C$DW$195, DW_AT_name("link")
    2782                            .dwattr $C$DW$195, DW_AT_TI_symbol_name("link")
    2783                            .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2784                            .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    2785                            .dwattr $C$DW$195, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/P
    2786                            .dwattr $C$DW$195, DW_AT_decl_line(0x74)
    2787                            .dwattr $C$DW$195, DW_AT_decl_column(0x0f)
    2788                    
    2789                    $C$DW$196       .dwtag  DW_TAG_member
    2790                            .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$72)
    2791                            .dwattr $C$DW$196, DW_AT_name("eventTypes")
    2792                            .dwattr $C$DW$196, DW_AT_TI_symbol_name("eventTypes")
    2793                            .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2794                            .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    2795                            .dwattr $C$DW$196, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/P
    2796                            .dwattr $C$DW$196, DW_AT_decl_line(0x75)
    2797                            .dwattr $C$DW$196, DW_AT_decl_column(0x13)
    2798                    
    2799                    $C$DW$197       .dwtag  DW_TAG_member
    2800                            .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$76)
    2801                            .dwattr $C$DW$197, DW_AT_name("notifyFxn")
    2802                            .dwattr $C$DW$197, DW_AT_TI_symbol_name("notifyFxn")
    2803                            .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2804                            .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    2805                            .dwattr $C$DW$197, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/P
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:17 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{D5117D28-3097-44CE-B654-78C5C428E8EA} PAGE   52

    2806                            .dwattr $C$DW$197, DW_AT_decl_line(0x76)
    2807                            .dwattr $C$DW$197, DW_AT_decl_column(0x15)
    2808                    
    2809                    $C$DW$198       .dwtag  DW_TAG_member
    2810                            .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$41)
    2811                            .dwattr $C$DW$198, DW_AT_name("clientArg")
    2812                            .dwattr $C$DW$198, DW_AT_TI_symbol_name("clientArg")
    2813                            .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2814                            .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    2815                            .dwattr $C$DW$198, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/P
    2816                            .dwattr $C$DW$198, DW_AT_decl_line(0x77)
    2817                            .dwattr $C$DW$198, DW_AT_decl_column(0x0f)
    2818                    
    2819                            .dwattr $C$DW$T$77, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/
    2820                            .dwattr $C$DW$T$77, DW_AT_decl_line(0x73)
    2821                            .dwattr $C$DW$T$77, DW_AT_decl_column(0x10)
    2822                            .dwendtag $C$DW$T$77
    2823                    
    2824                    $C$DW$T$169     .dwtag  DW_TAG_typedef
    2825                            .dwattr $C$DW$T$169, DW_AT_name("Power_NotifyObj")
    2826                            .dwattr $C$DW$T$169, DW_AT_type(*$C$DW$T$77)
    2827                            .dwattr $C$DW$T$169, DW_AT_language(DW_LANG_C)
    2828                            .dwattr $C$DW$T$169, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers
    2829                            .dwattr $C$DW$T$169, DW_AT_decl_line(0x78)
