TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:25 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{B8A034D0-7CBD-40EF-A8F0-18C84766EFB4} PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                        PC v16.9.4.LTS *
       3                    ;* Date/Time created: Sat Nov 18 18:46:24 2017                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../Application/MAC/HighLevel/mac_pib.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v16.9.4.LTS Copyright (c) 1996-20
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Kevin\workspace_v7\sensor_cc1310lp\sensor_cc1310lp"
      13                    
      14                    $C$DW$1 .dwtag  DW_TAG_subprogram

    5892                            .dwattr $C$DW$T$1060, DW_AT_decl_line(0x9f)
    5893                            .dwattr $C$DW$T$1060, DW_AT_decl_column(0x01)
    5894                            .dwendtag $C$DW$T$1060
    5895                    
    5896                    
    5897                    $C$DW$T$1061    .dwtag  DW_TAG_enumeration_type
    5898                            .dwattr $C$DW$T$1061, DW_AT_byte_size(0x01)
    5899                    $C$DW$550       .dwtag  DW_TAG_enumerator
    5900                            .dwattr $C$DW$550, DW_AT_name("MAC_FEAT_DEVICE")
    5901                            .dwattr $C$DW$550, DW_AT_const_value(0x00)
    5902                            .dwattr $C$DW$550, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    5903                            .dwattr $C$DW$550, DW_AT_decl_line(0x103)
    5904                            .dwattr $C$DW$550, DW_AT_decl_column(0x03)
    5905                    
    5906                    $C$DW$551       .dwtag  DW_TAG_enumerator
    5907                            .dwattr $C$DW$551, DW_AT_name("MAC_FEAT_COORD")
    5908                            .dwattr $C$DW$551, DW_AT_const_value(0x01)
    5909                            .dwattr $C$DW$551, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    5910                            .dwattr $C$DW$551, DW_AT_decl_line(0x104)
    5911                            .dwattr $C$DW$551, DW_AT_decl_column(0x03)
    5912                    
    5913                    $C$DW$552       .dwtag  DW_TAG_enumerator
    5914                            .dwattr $C$DW$552, DW_AT_name("MAC_FEAT_SECURITY")
    5915                            .dwattr $C$DW$552, DW_AT_const_value(0x02)
    5916                            .dwattr $C$DW$552, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    5917                            .dwattr $C$DW$552, DW_AT_decl_line(0x105)
    5918                            .dwattr $C$DW$552, DW_AT_decl_column(0x03)
    5919                    
    5920                    $C$DW$553       .dwtag  DW_TAG_enumerator
    5921                            .dwattr $C$DW$553, DW_AT_name("MAC_FEAT_BEACON_COORD")
    5922                            .dwattr $C$DW$553, DW_AT_const_value(0x03)
    5923                            .dwattr $C$DW$553, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    5924                            .dwattr $C$DW$553, DW_AT_decl_line(0x106)
    5925                            .dwattr $C$DW$553, DW_AT_decl_column(0x03)
    5926                    
    5927                    $C$DW$554       .dwtag  DW_TAG_enumerator
    5928                            .dwattr $C$DW$554, DW_AT_name("MAC_FEAT_BEACON_DEVICE")
    5929                            .dwattr $C$DW$554, DW_AT_const_value(0x04)
    5930                            .dwattr $C$DW$554, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    5931                            .dwattr $C$DW$554, DW_AT_decl_line(0x107)
    5932                            .dwattr $C$DW$554, DW_AT_decl_column(0x03)
    5933                    
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:25 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{B8A034D0-7CBD-40EF-A8F0-18C84766EFB4} PAGE  109

    5934                    $C$DW$555       .dwtag  DW_TAG_enumerator
    5935                            .dwattr $C$DW$555, DW_AT_name("MAC_FEAT_GTS_CLIENT")
    5936                            .dwattr $C$DW$555, DW_AT_const_value(0x05)
    5937                            .dwattr $C$DW$555, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    5938                            .dwattr $C$DW$555, DW_AT_decl_line(0x108)
    5939                            .dwattr $C$DW$555, DW_AT_decl_column(0x03)
    5940                    
    5941                    $C$DW$556       .dwtag  DW_TAG_enumerator
    5942                            .dwattr $C$DW$556, DW_AT_name("MAC_FEAT_GTS_SERVER")
    5943                            .dwattr $C$DW$556, DW_AT_const_value(0x06)
    5944                            .dwattr $C$DW$556, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    5945                            .dwattr $C$DW$556, DW_AT_decl_line(0x109)
    5946                            .dwattr $C$DW$556, DW_AT_decl_column(0x03)
    5947                    
    5948                    $C$DW$557       .dwtag  DW_TAG_enumerator
    5949                            .dwattr $C$DW$557, DW_AT_name("MAC_FEAT_MAX")
    5950                            .dwattr $C$DW$557, DW_AT_const_value(0x07)
    5951                            .dwattr $C$DW$557, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    5952                            .dwattr $C$DW$557, DW_AT_decl_line(0x10a)
    5953                            .dwattr $C$DW$557, DW_AT_decl_column(0x03)
    5954                    
    5955                            .dwattr $C$DW$T$1061, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154s
    5956                            .dwattr $C$DW$T$1061, DW_AT_decl_line(0x102)
    5957                            .dwattr $C$DW$T$1061, DW_AT_decl_column(0x01)
    5958                            .dwendtag $C$DW$T$1061
    5959                    
    5960                    
    5961                    $C$DW$T$22      .dwtag  DW_TAG_structure_type
    5962                            .dwattr $C$DW$T$22, DW_AT_byte_size(0x10)
    5963                    $C$DW$558       .dwtag  DW_TAG_member
    5964                            .dwattr $C$DW$558, DW_AT_type(*$C$DW$T$19)
    5965                            .dwattr $C$DW$558, DW_AT_name("firstChCentrFreq")
    5966                            .dwattr $C$DW$558, DW_AT_TI_symbol_name("firstChCentrFreq")
    5967                            .dwattr $C$DW$558, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5968                            .dwattr $C$DW$558, DW_AT_accessibility(DW_ACCESS_public)
    5969                            .dwattr $C$DW$558, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    5970                            .dwattr $C$DW$558, DW_AT_decl_line(0x286)
    5971                            .dwattr $C$DW$558, DW_AT_decl_column(0x0a)
    5972                    
    5973                    $C$DW$559       .dwtag  DW_TAG_member
    5974                            .dwattr $C$DW$559, DW_AT_type(*$C$DW$T$19)
    5975                            .dwattr $C$DW$559, DW_AT_name("channelSpacing")
    5976                            .dwattr $C$DW$559, DW_AT_TI_symbol_name("channelSpacing")
    5977                            .dwattr $C$DW$559, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5978                            .dwattr $C$DW$559, DW_AT_accessibility(DW_ACCESS_public)
    5979                            .dwattr $C$DW$559, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    5980                            .dwattr $C$DW$559, DW_AT_decl_line(0x287)
    5981                            .dwattr $C$DW$559, DW_AT_decl_column(0x0a)
    5982                    
    5983                    $C$DW$560       .dwtag  DW_TAG_member
    5984                            .dwattr $C$DW$560, DW_AT_type(*$C$DW$T$20)
    5985                            .dwattr $C$DW$560, DW_AT_name("noOfChannels")
    5986                            .dwattr $C$DW$560, DW_AT_TI_symbol_name("noOfChannels")
    5987                            .dwattr $C$DW$560, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5988                            .dwattr $C$DW$560, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:25 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{B8A034D0-7CBD-40EF-A8F0-18C84766EFB4} PAGE  110

    5989                            .dwattr $C$DW$560, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    5990                            .dwattr $C$DW$560, DW_AT_decl_line(0x288)
    5991                            .dwattr $C$DW$560, DW_AT_decl_column(0x0a)
    5992                    
    5993                    $C$DW$561       .dwtag  DW_TAG_member
    5994                            .dwattr $C$DW$561, DW_AT_type(*$C$DW$T$21)
    5995                            .dwattr $C$DW$561, DW_AT_name("fskModScheme")
    5996                            .dwattr $C$DW$561, DW_AT_TI_symbol_name("fskModScheme")
    5997                            .dwattr $C$DW$561, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5998                            .dwattr $C$DW$561, DW_AT_accessibility(DW_ACCESS_public)
    5999                            .dwattr $C$DW$561, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    6000                            .dwattr $C$DW$561, DW_AT_decl_line(0x28a)
    6001                            .dwattr $C$DW$561, DW_AT_decl_column(0x09)
    6002                    
    6003                    $C$DW$562       .dwtag  DW_TAG_member
    6004                            .dwattr $C$DW$562, DW_AT_type(*$C$DW$T$20)
    6005                            .dwattr $C$DW$562, DW_AT_name("symbolRate")
    6006                            .dwattr $C$DW$562, DW_AT_TI_symbol_name("symbolRate")
    6007                            .dwattr $C$DW$562, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6008                            .dwattr $C$DW$562, DW_AT_accessibility(DW_ACCESS_public)
    6009                            .dwattr $C$DW$562, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    6010                            .dwattr $C$DW$562, DW_AT_decl_line(0x28c)
    6011                            .dwattr $C$DW$562, DW_AT_decl_column(0x0a)
    6012                    
    6013                    $C$DW$563       .dwtag  DW_TAG_member
    6014                            .dwattr $C$DW$563, DW_AT_type(*$C$DW$T$21)
    6015                            .dwattr $C$DW$563, DW_AT_name("fskModIndex")
    6016                            .dwattr $C$DW$563, DW_AT_TI_symbol_name("fskModIndex")
    6017                            .dwattr $C$DW$563, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    6018                            .dwattr $C$DW$563, DW_AT_accessibility(DW_ACCESS_public)
    6019                            .dwattr $C$DW$563, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    6020                            .dwattr $C$DW$563, DW_AT_decl_line(0x28d)
    6021                            .dwattr $C$DW$563, DW_AT_decl_column(0x09)
    6022                    
    6023                    $C$DW$564       .dwtag  DW_TAG_member
    6024                            .dwattr $C$DW$564, DW_AT_type(*$C$DW$T$21)
    6025                            .dwattr $C$DW$564, DW_AT_name("ccaType")
    6026                            .dwattr $C$DW$564, DW_AT_TI_symbol_name("ccaType")
    6027                            .dwattr $C$DW$564, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    6028                            .dwattr $C$DW$564, DW_AT_accessibility(DW_ACCESS_public)
    6029                            .dwattr $C$DW$564, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    6030                            .dwattr $C$DW$564, DW_AT_decl_line(0x295)
    6031                            .dwattr $C$DW$564, DW_AT_decl_column(0x09)
    6032                    
    6033                            .dwattr $C$DW$T$22, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/M
    6034                            .dwattr $C$DW$T$22, DW_AT_decl_line(0x285)
    6035                            .dwattr $C$DW$T$22, DW_AT_decl_column(0x01)
    6036                            .dwendtag $C$DW$T$22
    6037                    
    6038                    $C$DW$T$514     .dwtag  DW_TAG_const_type
    6039                            .dwattr $C$DW$T$514, DW_AT_type(*$C$DW$T$22)
    6040                    
    6041                    
    6042                    $C$DW$T$515     .dwtag  DW_TAG_array_type
    6043                            .dwattr $C$DW$T$515, DW_AT_type(*$C$DW$T$514)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:25 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{B8A034D0-7CBD-40EF-A8F0-18C84766EFB4} PAGE  111

    6044                            .dwattr $C$DW$T$515, DW_AT_language(DW_LANG_C)
    6045                            .dwattr $C$DW$T$515, DW_AT_byte_size(0x30)
    6046                    $C$DW$565       .dwtag  DW_TAG_subrange_type
    6047                            .dwattr $C$DW$565, DW_AT_upper_bound(0x02)
    6048                    
    6049                            .dwendtag $C$DW$T$515
    6050                    
    6051                    
    6052                    $C$DW$T$512     .dwtag  DW_TAG_array_type
    6053                            .dwattr $C$DW$T$512, DW_AT_type(*$C$DW$T$22)
    6054                            .dwattr $C$DW$T$512, DW_AT_language(DW_LANG_C)
    6055                            .dwattr $C$DW$T$512, DW_AT_byte_size(0x80)
    6056                    $C$DW$566       .dwtag  DW_TAG_subrange_type
    6057                            .dwattr $C$DW$566, DW_AT_upper_bound(0x07)
    6058                    
    6059                            .dwendtag $C$DW$T$512
    6060                    
    6061                    $C$DW$T$1068    .dwtag  DW_TAG_typedef
    6062                            .dwattr $C$DW$T$1068, DW_AT_name("macMRFSKPHYDesc_t")
    6063                            .dwattr $C$DW$T$1068, DW_AT_type(*$C$DW$T$22)
    6064                            .dwattr $C$DW$T$1068, DW_AT_language(DW_LANG_C)
    6065                            .dwattr $C$DW$T$1068, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application
    6066                            .dwattr $C$DW$T$1068, DW_AT_decl_line(0x296)
    6067                            .dwattr $C$DW$T$1068, DW_AT_decl_column(0x03)
    6068                    
    6069                    $C$DW$T$1069    .dwtag  DW_TAG_pointer_type
    6070                            .dwattr $C$DW$T$1069, DW_AT_type(*$C$DW$T$1068)
    6071                            .dwattr $C$DW$T$1069, DW_AT_address_class(0x20)
    6072                    
    6073                    
    6074                    $C$DW$T$1071    .dwtag  DW_TAG_array_type
    6075                            .dwattr $C$DW$T$1071, DW_AT_type(*$C$DW$T$1068)
    6076                            .dwattr $C$DW$T$1071, DW_AT_language(DW_LANG_C)
    6077                            .dwattr $C$DW$T$1071, DW_AT_byte_size(0x80)
    6078                    $C$DW$567       .dwtag  DW_TAG_subrange_type
    6079                            .dwattr $C$DW$567, DW_AT_upper_bound(0x07)
    6080                    
    6081                            .dwendtag $C$DW$T$1071
    6082                    
    6083                    $C$DW$T$1072    .dwtag  DW_TAG_const_type
    6084                            .dwattr $C$DW$T$1072, DW_AT_type(*$C$DW$T$1068)
    6085                    
    6086                    
    6087                    $C$DW$T$1073    .dwtag  DW_TAG_array_type
    6088                            .dwattr $C$DW$T$1073, DW_AT_type(*$C$DW$T$1072)
    6089                            .dwattr $C$DW$T$1073, DW_AT_language(DW_LANG_C)
    6090                            .dwattr $C$DW$T$1073, DW_AT_byte_size(0x30)
    6091                    $C$DW$568       .dwtag  DW_TAG_subrange_type
    6092                            .dwattr $C$DW$568, DW_AT_upper_bound(0x02)
    6093                    
    6094                            .dwendtag $C$DW$T$1073
    6095                    
    6096                    
    6097                    $C$DW$T$23      .dwtag  DW_TAG_structure_type
    6098                            .dwattr $C$DW$T$23, DW_AT_byte_size(0x0a)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:25 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{B8A034D0-7CBD-40EF-A8F0-18C84766EFB4} PAGE  112

    6099                    $C$DW$569       .dwtag  DW_TAG_member
    6100                            .dwattr $C$DW$569, DW_AT_type(*$C$DW$T$443)
    6101                            .dwattr $C$DW$569, DW_AT_name("addr")
    6102                            .dwattr $C$DW$569, DW_AT_TI_symbol_name("addr")
    6103                            .dwattr $C$DW$569, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6104                            .dwattr $C$DW$569, DW_AT_accessibility(DW_ACCESS_public)
    6105                            .dwattr $C$DW$569, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/Se
    6106                            .dwattr $C$DW$569, DW_AT_decl_line(0x52)
    6107                            .dwattr $C$DW$569, DW_AT_decl_column(0x05)
    6108                    
    6109                    $C$DW$570       .dwtag  DW_TAG_member
    6110                            .dwattr $C$DW$570, DW_AT_type(*$C$DW$T$21)
    6111                            .dwattr $C$DW$570, DW_AT_name("addrMode")
    6112                            .dwattr $C$DW$570, DW_AT_TI_symbol_name("addrMode")
    6113                            .dwattr $C$DW$570, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6114                            .dwattr $C$DW$570, DW_AT_accessibility(DW_ACCESS_public)
    6115                            .dwattr $C$DW$570, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/Se
    6116                            .dwattr $C$DW$570, DW_AT_decl_line(0x53)
    6117                            .dwattr $C$DW$570, DW_AT_decl_column(0x11)
    6118                    
    6119                            .dwattr $C$DW$T$23, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/S
    6120                            .dwattr $C$DW$T$23, DW_AT_decl_line(0x4d)
    6121                            .dwattr $C$DW$T$23, DW_AT_decl_column(0x01)
    6122                            .dwendtag $C$DW$T$23
    6123                    
    6124                    $C$DW$T$26      .dwtag  DW_TAG_typedef
    6125                            .dwattr $C$DW$T$26, DW_AT_name("sAddr_t")
    6126                            .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$23)
    6127                            .dwattr $C$DW$T$26, DW_AT_language(DW_LANG_C)
    6128                            .dwattr $C$DW$T$26, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/S
    6129                            .dwattr $C$DW$T$26, DW_AT_decl_line(0x54)
    6130                            .dwattr $C$DW$T$26, DW_AT_decl_column(0x03)
    6131                    
    6132                    
    6133                    $C$DW$T$28      .dwtag  DW_TAG_structure_type
    6134                            .dwattr $C$DW$T$28, DW_AT_byte_size(0x84)
    6135                    $C$DW$571       .dwtag  DW_TAG_member
    6136                            .dwattr $C$DW$571, DW_AT_type(*$C$DW$T$21)
    6137                            .dwattr $C$DW$571, DW_AT_name("ackWaitDuration")
    6138                            .dwattr $C$DW$571, DW_AT_TI_symbol_name("ackWaitDuration")
    6139                            .dwattr $C$DW$571, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6140                            .dwattr $C$DW$571, DW_AT_accessibility(DW_ACCESS_public)
    6141                            .dwattr $C$DW$571, DW_AT_decl_file("..\Application\MAC\HighLevel\mac_pib.h")
    6142                            .dwattr $C$DW$571, DW_AT_decl_line(0x4b)
    6143                            .dwattr $C$DW$571, DW_AT_decl_column(0x15)
    6144                    
    6145                    $C$DW$572       .dwtag  DW_TAG_member
    6146                            .dwattr $C$DW$572, DW_AT_type(*$C$DW$T$24)
    6147                            .dwattr $C$DW$572, DW_AT_name("associationPermit")
    6148                            .dwattr $C$DW$572, DW_AT_TI_symbol_name("associationPermit")
    6149                            .dwattr $C$DW$572, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6150                            .dwattr $C$DW$572, DW_AT_accessibility(DW_ACCESS_public)
    6151                            .dwattr $C$DW$572, DW_AT_decl_file("..\Application\MAC\HighLevel\mac_pib.h")
    6152                            .dwattr $C$DW$572, DW_AT_decl_line(0x4c)
    6153                            .dwattr $C$DW$572, DW_AT_decl_column(0x15)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:25 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{B8A034D0-7CBD-40EF-A8F0-18C84766EFB4} PAGE  113

    6154                    
    6155                    $C$DW$573       .dwtag  DW_TAG_member
    6156                            .dwattr $C$DW$573, DW_AT_type(*$C$DW$T$24)
    6157                            .dwattr $C$DW$573, DW_AT_name("autoRequest")
    6158                            .dwattr $C$DW$573, DW_AT_TI_symbol_name("autoRequest")
    6159                            .dwattr $C$DW$573, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6160                            .dwattr $C$DW$573, DW_AT_accessibility(DW_ACCESS_public)
    6161                            .dwattr $C$DW$573, DW_AT_decl_file("..\Application\MAC\HighLevel\mac_pib.h")
    6162                            .dwattr $C$DW$573, DW_AT_decl_line(0x4d)
    6163                            .dwattr $C$DW$573, DW_AT_decl_column(0x15)
    6164                    
    6165                    $C$DW$574       .dwtag  DW_TAG_member
    6166                            .dwattr $C$DW$574, DW_AT_type(*$C$DW$T$24)
    6167                            .dwattr $C$DW$574, DW_AT_name("battLifeExt")
    6168                            .dwattr $C$DW$574, DW_AT_TI_symbol_name("battLifeExt")
    6169                            .dwattr $C$DW$574, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    6170                            .dwattr $C$DW$574, DW_AT_accessibility(DW_ACCESS_public)
    6171                            .dwattr $C$DW$574, DW_AT_decl_file("..\Application\MAC\HighLevel\mac_pib.h")
    6172                            .dwattr $C$DW$574, DW_AT_decl_line(0x4e)
    6173                            .dwattr $C$DW$574, DW_AT_decl_column(0x15)
    6174                    
    6175                    $C$DW$575       .dwtag  DW_TAG_member
    6176                            .dwattr $C$DW$575, DW_AT_type(*$C$DW$T$21)
    6177                            .dwattr $C$DW$575, DW_AT_name("battLifeExtPeriods")
    6178                            .dwattr $C$DW$575, DW_AT_TI_symbol_name("battLifeExtPeriods")
    6179                            .dwattr $C$DW$575, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6180                            .dwattr $C$DW$575, DW_AT_accessibility(DW_ACCESS_public)
    6181                            .dwattr $C$DW$575, DW_AT_decl_file("..\Application\MAC\HighLevel\mac_pib.h")
    6182                            .dwattr $C$DW$575, DW_AT_decl_line(0x4f)
    6183                            .dwattr $C$DW$575, DW_AT_decl_column(0x15)
    6184                    
    6185                    $C$DW$576       .dwtag  DW_TAG_member
    6186                            .dwattr $C$DW$576, DW_AT_type(*$C$DW$T$25)
    6187                            .dwattr $C$DW$576, DW_AT_name("pBeaconPayload")
    6188                            .dwattr $C$DW$576, DW_AT_TI_symbol_name("pBeaconPayload")
    6189                            .dwattr $C$DW$576, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6190                            .dwattr $C$DW$576, DW_AT_accessibility(DW_ACCESS_public)
    6191                            .dwattr $C$DW$576, DW_AT_decl_file("..\Application\MAC\HighLevel\mac_pib.h")
    6192                            .dwattr $C$DW$576, DW_AT_decl_line(0x51)
    6193                            .dwattr $C$DW$576, DW_AT_decl_column(0x16)
    6194                    
    6195                    $C$DW$577       .dwtag  DW_TAG_member
    6196                            .dwattr $C$DW$577, DW_AT_type(*$C$DW$T$21)
    6197                            .dwattr $C$DW$577, DW_AT_name("beaconPayloadLength")
    6198                            .dwattr $C$DW$577, DW_AT_TI_symbol_name("beaconPayloadLength")
    6199                            .dwattr $C$DW$577, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6200                            .dwattr $C$DW$577, DW_AT_accessibility(DW_ACCESS_public)
    6201                            .dwattr $C$DW$577, DW_AT_decl_file("..\Application\MAC\HighLevel\mac_pib.h")
    6202                            .dwattr $C$DW$577, DW_AT_decl_line(0x52)
    6203                            .dwattr $C$DW$577, DW_AT_decl_column(0x15)
    6204                    
    6205                    $C$DW$578       .dwtag  DW_TAG_member
    6206                            .dwattr $C$DW$578, DW_AT_type(*$C$DW$T$21)
    6207                            .dwattr $C$DW$578, DW_AT_name("beaconOrder")
    6208                            .dwattr $C$DW$578, DW_AT_TI_symbol_name("beaconOrder")
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:25 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{B8A034D0-7CBD-40EF-A8F0-18C84766EFB4} PAGE  114

    6209                            .dwattr $C$DW$578, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    6210                            .dwattr $C$DW$578, DW_AT_accessibility(DW_ACCESS_public)
    6211                            .dwattr $C$DW$578, DW_AT_decl_file("..\Application\MAC\HighLevel\mac_pib.h")
    6212                            .dwattr $C$DW$578, DW_AT_decl_line(0x53)
    6213                            .dwattr $C$DW$578, DW_AT_decl_column(0x15)
    6214                    
    6215                    $C$DW$579       .dwtag  DW_TAG_member
    6216                            .dwattr $C$DW$579, DW_AT_type(*$C$DW$T$19)
    6217                            .dwattr $C$DW$579, DW_AT_name("beaconTxTime")
    6218                            .dwattr $C$DW$579, DW_AT_TI_symbol_name("beaconTxTime")
    6219                            .dwattr $C$DW$579, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6220                            .dwattr $C$DW$579, DW_AT_accessibility(DW_ACCESS_public)
    6221                            .dwattr $C$DW$579, DW_AT_decl_file("..\Application\MAC\HighLevel\mac_pib.h")
    6222                            .dwattr $C$DW$579, DW_AT_decl_line(0x54)
    6223                            .dwattr $C$DW$579, DW_AT_decl_column(0x15)
    6224                    
    6225                    $C$DW$580       .dwtag  DW_TAG_member
    6226                            .dwattr $C$DW$580, DW_AT_type(*$C$DW$T$21)
    6227                            .dwattr $C$DW$580, DW_AT_name("bsn")
    6228                            .dwattr $C$DW$580, DW_AT_TI_symbol_name("bsn")
    6229                            .dwattr $C$DW$580, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    6230                            .dwattr $C$DW$580, DW_AT_accessibility(DW_ACCESS_public)
    6231                            .dwattr $C$DW$580, DW_AT_decl_file("..\Application\MAC\HighLevel\mac_pib.h")
    6232                            .dwattr $C$DW$580, DW_AT_decl_line(0x55)
    6233                            .dwattr $C$DW$580, DW_AT_decl_column(0x15)
    6234                    
    6235                    $C$DW$581       .dwtag  DW_TAG_member
    6236                            .dwattr $C$DW$581, DW_AT_type(*$C$DW$T$26)
    6237                            .dwattr $C$DW$581, DW_AT_name("coordExtendedAddress")
    6238                            .dwattr $C$DW$581, DW_AT_TI_symbol_name("coordExtendedAddress")
    6239                            .dwattr $C$DW$581, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    6240                            .dwattr $C$DW$581, DW_AT_accessibility(DW_ACCESS_public)
    6241                            .dwattr $C$DW$581, DW_AT_decl_file("..\Application\MAC\HighLevel\mac_pib.h")
    6242                            .dwattr $C$DW$581, DW_AT_decl_line(0x57)
    6243                            .dwattr $C$DW$581, DW_AT_decl_column(0x15)
    6244                    
    6245                    $C$DW$582       .dwtag  DW_TAG_member
    6246                            .dwattr $C$DW$582, DW_AT_type(*$C$DW$T$20)
    6247                            .dwattr $C$DW$582, DW_AT_name("coordShortAddress")
    6248                            .dwattr $C$DW$582, DW_AT_TI_symbol_name("coordShortAddress")
    6249                            .dwattr $C$DW$582, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    6250                            .dwattr $C$DW$582, DW_AT_accessibility(DW_ACCESS_public)
    6251                            .dwattr $C$DW$582, DW_AT_decl_file("..\Application\MAC\HighLevel\mac_pib.h")
    6252                            .dwattr $C$DW$582, DW_AT_decl_line(0x58)
    6253                            .dwattr $C$DW$582, DW_AT_decl_column(0x15)
    6254                    
    6255                    $C$DW$583       .dwtag  DW_TAG_member
    6256                            .dwattr $C$DW$583, DW_AT_type(*$C$DW$T$21)
    6257                            .dwattr $C$DW$583, DW_AT_name("dsn")
    6258                            .dwattr $C$DW$583, DW_AT_TI_symbol_name("dsn")
    6259                            .dwattr $C$DW$583, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    6260                            .dwattr $C$DW$583, DW_AT_accessibility(DW_ACCESS_public)
    6261                            .dwattr $C$DW$583, DW_AT_decl_file("..\Application\MAC\HighLevel\mac_pib.h")
    6262                            .dwattr $C$DW$583, DW_AT_decl_line(0x59)
    6263                            .dwattr $C$DW$583, DW_AT_decl_column(0x15)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:25 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{B8A034D0-7CBD-40EF-A8F0-18C84766EFB4} PAGE  115

    6264                    
    6265                    $C$DW$584       .dwtag  DW_TAG_member
    6266                            .dwattr $C$DW$584, DW_AT_type(*$C$DW$T$24)
    6267                            .dwattr $C$DW$584, DW_AT_name("gtsPermit")
    6268                            .dwattr $C$DW$584, DW_AT_TI_symbol_name("gtsPermit")
    6269                            .dwattr $C$DW$584, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
    6270                            .dwattr $C$DW$584, DW_AT_accessibility(DW_ACCESS_public)
    6271                            .dwattr $C$DW$584, DW_AT_decl_file("..\Application\MAC\HighLevel\mac_pib.h")
    6272                            .dwattr $C$DW$584, DW_AT_decl_line(0x5a)
    6273                            .dwattr $C$DW$584, DW_AT_decl_column(0x15)
    6274                    
    6275                    $C$DW$585       .dwtag  DW_TAG_member
    6276                            .dwattr $C$DW$585, DW_AT_type(*$C$DW$T$21)
    6277                            .dwattr $C$DW$585, DW_AT_name("maxCsmaBackoffs")
    6278                            .dwattr $C$DW$585, DW_AT_TI_symbol_name("maxCsmaBackoffs")
    6279                            .dwattr $C$DW$585, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    6280                            .dwattr $C$DW$585, DW_AT_accessibility(DW_ACCESS_public)
    6281                            .dwattr $C$DW$585, DW_AT_decl_file("..\Application\MAC\HighLevel\mac_pib.h")
    6282                            .dwattr $C$DW$585, DW_AT_decl_line(0x5b)
    6283                            .dwattr $C$DW$585, DW_AT_decl_column(0x15)
    6284                    
    6285                    $C$DW$586       .dwtag  DW_TAG_member
    6286                            .dwattr $C$DW$586, DW_AT_type(*$C$DW$T$21)
    6287                            .dwattr $C$DW$586, DW_AT_name("minBe")
    6288                            .dwattr $C$DW$586, DW_AT_TI_symbol_name("minBe")
    6289                            .dwattr $C$DW$586, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    6290                            .dwattr $C$DW$586, DW_AT_accessibility(DW_ACCESS_public)
    6291                            .dwattr $C$DW$586, DW_AT_decl_file("..\Application\MAC\HighLevel\mac_pib.h")
    6292                            .dwattr $C$DW$586, DW_AT_decl_line(0x5d)
    6293                            .dwattr $C$DW$586, DW_AT_decl_column(0x15)
    6294                    
    6295                    $C$DW$587       .dwtag  DW_TAG_member
    6296                            .dwattr $C$DW$587, DW_AT_type(*$C$DW$T$20)
    6297                            .dwattr $C$DW$587, DW_AT_name("panId")
    6298                            .dwattr $C$DW$587, DW_AT_TI_symbol_name("panId")
    6299                            .dwattr $C$DW$587, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    6300                            .dwattr $C$DW$587, DW_AT_accessibility(DW_ACCESS_public)
    6301                            .dwattr $C$DW$587, DW_AT_decl_file("..\Application\MAC\HighLevel\mac_pib.h")
    6302                            .dwattr $C$DW$587, DW_AT_decl_line(0x5e)
    6303                            .dwattr $C$DW$587, DW_AT_decl_column(0x15)
    6304                    
    6305                    $C$DW$588       .dwtag  DW_TAG_member
    6306                            .dwattr $C$DW$588, DW_AT_type(*$C$DW$T$24)
    6307                            .dwattr $C$DW$588, DW_AT_name("promiscuousMode")
    6308                            .dwattr $C$DW$588, DW_AT_TI_symbol_name("promiscuousMode")
    6309                            .dwattr $C$DW$588, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    6310                            .dwattr $C$DW$588, DW_AT_accessibility(DW_ACCESS_public)
    6311                            .dwattr $C$DW$588, DW_AT_decl_file("..\Application\MAC\HighLevel\mac_pib.h")
    6312                            .dwattr $C$DW$588, DW_AT_decl_line(0x5f)
    6313                            .dwattr $C$DW$588, DW_AT_decl_column(0x15)
    6314                    
    6315                    $C$DW$589       .dwtag  DW_TAG_member
    6316                            .dwattr $C$DW$589, DW_AT_type(*$C$DW$T$24)
    6317                            .dwattr $C$DW$589, DW_AT_name("rxOnWhenIdle")
    6318                            .dwattr $C$DW$589, DW_AT_TI_symbol_name("rxOnWhenIdle")
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:25 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{B8A034D0-7CBD-40EF-A8F0-18C84766EFB4} PAGE  116

    6319                            .dwattr $C$DW$589, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    6320                            .dwattr $C$DW$589, DW_AT_accessibility(DW_ACCESS_public)
    6321                            .dwattr $C$DW$589, DW_AT_decl_file("..\Application\MAC\HighLevel\mac_pib.h")
    6322                            .dwattr $C$DW$589, DW_AT_decl_line(0x60)
    6323                            .dwattr $C$DW$589, DW_AT_decl_column(0x15)
    6324                    
    6325                    $C$DW$590       .dwtag  DW_TAG_member
    6326                            .dwattr $C$DW$590, DW_AT_type(*$C$DW$T$20)
    6327                            .dwattr $C$DW$590, DW_AT_name("shortAddress")
    6328                            .dwattr $C$DW$590, DW_AT_TI_symbol_name("shortAddress")
    6329                            .dwattr $C$DW$590, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    6330                            .dwattr $C$DW$590, DW_AT_accessibility(DW_ACCESS_public)
    6331                            .dwattr $C$DW$590, DW_AT_decl_file("..\Application\MAC\HighLevel\mac_pib.h")
    6332                            .dwattr $C$DW$590, DW_AT_decl_line(0x61)
    6333                            .dwattr $C$DW$590, DW_AT_decl_column(0x15)
    6334                    
    6335                    $C$DW$591       .dwtag  DW_TAG_member
    6336                            .dwattr $C$DW$591, DW_AT_type(*$C$DW$T$21)
    6337                            .dwattr $C$DW$591, DW_AT_name("superframeOrder")
    6338                            .dwattr $C$DW$591, DW_AT_TI_symbol_name("superframeOrder")
    6339                            .dwattr $C$DW$591, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    6340                            .dwattr $C$DW$591, DW_AT_accessibility(DW_ACCESS_public)
    6341                            .dwattr $C$DW$591, DW_AT_decl_file("..\Application\MAC\HighLevel\mac_pib.h")
    6342                            .dwattr $C$DW$591, DW_AT_decl_line(0x63)
    6343                            .dwattr $C$DW$591, DW_AT_decl_column(0x15)
    6344                    
    6345                    $C$DW$592       .dwtag  DW_TAG_member
    6346                            .dwattr $C$DW$592, DW_AT_type(*$C$DW$T$20)
    6347                            .dwattr $C$DW$592, DW_AT_name("transactionPersistenceTime")
    6348                            .dwattr $C$DW$592, DW_AT_TI_symbol_name("transactionPersistenceTime")
    6349                            .dwattr $C$DW$592, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    6350                            .dwattr $C$DW$592, DW_AT_accessibility(DW_ACCESS_public)
    6351                            .dwattr $C$DW$592, DW_AT_decl_file("..\Application\MAC\HighLevel\mac_pib.h")
    6352                            .dwattr $C$DW$592, DW_AT_decl_line(0x64)
    6353                            .dwattr $C$DW$592, DW_AT_decl_column(0x15)
    6354                    
    6355                    $C$DW$593       .dwtag  DW_TAG_member
    6356                            .dwattr $C$DW$593, DW_AT_type(*$C$DW$T$24)
    6357                            .dwattr $C$DW$593, DW_AT_name("associatedPanCoord")
    6358                            .dwattr $C$DW$593, DW_AT_TI_symbol_name("associatedPanCoord")
    6359                            .dwattr $C$DW$593, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    6360                            .dwattr $C$DW$593, DW_AT_accessibility(DW_ACCESS_public)
    6361                            .dwattr $C$DW$593, DW_AT_decl_file("..\Application\MAC\HighLevel\mac_pib.h")
    6362                            .dwattr $C$DW$593, DW_AT_decl_line(0x65)
    6363                            .dwattr $C$DW$593, DW_AT_decl_column(0x15)
    6364                    
    6365                    $C$DW$594       .dwtag  DW_TAG_member
    6366                            .dwattr $C$DW$594, DW_AT_type(*$C$DW$T$21)
    6367                            .dwattr $C$DW$594, DW_AT_name("maxBe")
    6368                            .dwattr $C$DW$594, DW_AT_TI_symbol_name("maxBe")
    6369                            .dwattr $C$DW$594, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
    6370                            .dwattr $C$DW$594, DW_AT_accessibility(DW_ACCESS_public)
    6371                            .dwattr $C$DW$594, DW_AT_decl_file("..\Application\MAC\HighLevel\mac_pib.h")
    6372                            .dwattr $C$DW$594, DW_AT_decl_line(0x66)
    6373                            .dwattr $C$DW$594, DW_AT_decl_column(0x15)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:25 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{B8A034D0-7CBD-40EF-A8F0-18C84766EFB4} PAGE  117

    6374                    
    6375                    $C$DW$595       .dwtag  DW_TAG_member
    6376                            .dwattr $C$DW$595, DW_AT_type(*$C$DW$T$20)
    6377                            .dwattr $C$DW$595, DW_AT_name("maxFrameTotalWaitTime")
    6378                            .dwattr $C$DW$595, DW_AT_TI_symbol_name("maxFrameTotalWaitTime")
    6379                            .dwattr $C$DW$595, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    6380                            .dwattr $C$DW$595, DW_AT_accessibility(DW_ACCESS_public)
    6381                            .dwattr $C$DW$595, DW_AT_decl_file("..\Application\MAC\HighLevel\mac_pib.h")
    6382                            .dwattr $C$DW$595, DW_AT_decl_line(0x67)
    6383                            .dwattr $C$DW$595, DW_AT_decl_column(0x15)
    6384                    
    6385                    $C$DW$596       .dwtag  DW_TAG_member
    6386                            .dwattr $C$DW$596, DW_AT_type(*$C$DW$T$21)
    6387                            .dwattr $C$DW$596, DW_AT_name("maxFrameRetries")
    6388                            .dwattr $C$DW$596, DW_AT_TI_symbol_name("maxFrameRetries")
    6389                            .dwattr $C$DW$596, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    6390                            .dwattr $C$DW$596, DW_AT_accessibility(DW_ACCESS_public)
    6391                            .dwattr $C$DW$596, DW_AT_decl_file("..\Application\MAC\HighLevel\mac_pib.h")
    6392                            .dwattr $C$DW$596, DW_AT_decl_line(0x69)
    6393                            .dwattr $C$DW$596, DW_AT_decl_column(0x15)
    6394                    
    6395                    $C$DW$597       .dwtag  DW_TAG_member
    6396                            .dwattr $C$DW$597, DW_AT_type(*$C$DW$T$21)
    6397                            .dwattr $C$DW$597, DW_AT_name("responseWaitTime")
    6398                            .dwattr $C$DW$597, DW_AT_TI_symbol_name("responseWaitTime")
    6399                            .dwattr $C$DW$597, DW_AT_data_member_location[DW_OP_plus_uconst 0x35]
    6400                            .dwattr $C$DW$597, DW_AT_accessibility(DW_ACCESS_public)
    6401                            .dwattr $C$DW$597, DW_AT_decl_file("..\Application\MAC\HighLevel\mac_pib.h")
    6402                            .dwattr $C$DW$597, DW_AT_decl_line(0x6a)
    6403                            .dwattr $C$DW$597, DW_AT_decl_column(0x15)
    6404                    
    6405                    $C$DW$598       .dwtag  DW_TAG_member
    6406                            .dwattr $C$DW$598, DW_AT_type(*$C$DW$T$21)
    6407                            .dwattr $C$DW$598, DW_AT_name("syncSymbolOffset")
    6408                            .dwattr $C$DW$598, DW_AT_TI_symbol_name("syncSymbolOffset")
    6409                            .dwattr $C$DW$598, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    6410                            .dwattr $C$DW$598, DW_AT_accessibility(DW_ACCESS_public)
    6411                            .dwattr $C$DW$598, DW_AT_decl_file("..\Application\MAC\HighLevel\mac_pib.h")
    6412                            .dwattr $C$DW$598, DW_AT_decl_line(0x6b)
    6413                            .dwattr $C$DW$598, DW_AT_decl_column(0x15)
    6414                    
    6415                    $C$DW$599       .dwtag  DW_TAG_member
    6416                            .dwattr $C$DW$599, DW_AT_type(*$C$DW$T$24)
    6417                            .dwattr $C$DW$599, DW_AT_name("timeStampSupported")
    6418                            .dwattr $C$DW$599, DW_AT_TI_symbol_name("timeStampSupported")
    6419                            .dwattr $C$DW$599, DW_AT_data_member_location[DW_OP_plus_uconst 0x37]
    6420                            .dwattr $C$DW$599, DW_AT_accessibility(DW_ACCESS_public)
    6421                            .dwattr $C$DW$599, DW_AT_decl_file("..\Application\MAC\HighLevel\mac_pib.h")
    6422                            .dwattr $C$DW$599, DW_AT_decl_line(0x6c)
    6423                            .dwattr $C$DW$599, DW_AT_decl_column(0x15)
    6424                    
    6425                    $C$DW$600       .dwtag  DW_TAG_member
    6426                            .dwattr $C$DW$600, DW_AT_type(*$C$DW$T$24)
    6427                            .dwattr $C$DW$600, DW_AT_name("securityEnabled")
    6428                            .dwattr $C$DW$600, DW_AT_TI_symbol_name("securityEnabled")
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:25 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{B8A034D0-7CBD-40EF-A8F0-18C84766EFB4} PAGE  118

    6429                            .dwattr $C$DW$600, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    6430                            .dwattr $C$DW$600, DW_AT_accessibility(DW_ACCESS_public)
    6431                            .dwattr $C$DW$600, DW_AT_decl_file("..\Application\MAC\HighLevel\mac_pib.h")
    6432                            .dwattr $C$DW$600, DW_AT_decl_line(0x6d)
    6433                            .dwattr $C$DW$600, DW_AT_decl_column(0x15)
    6434                    
    6435                    $C$DW$601       .dwtag  DW_TAG_member
    6436                            .dwattr $C$DW$601, DW_AT_type(*$C$DW$T$21)
    6437                            .dwattr $C$DW$601, DW_AT_name("ebsn")
    6438                            .dwattr $C$DW$601, DW_AT_TI_symbol_name("ebsn")
    6439                            .dwattr $C$DW$601, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
    6440                            .dwattr $C$DW$601, DW_AT_accessibility(DW_ACCESS_public)
    6441                            .dwattr $C$DW$601, DW_AT_decl_file("..\Application\MAC\HighLevel\mac_pib.h")
    6442                            .dwattr $C$DW$601, DW_AT_decl_line(0x6f)
    6443                            .dwattr $C$DW$601, DW_AT_decl_column(0x15)
    6444                    
    6445                    $C$DW$602       .dwtag  DW_TAG_member
    6446                            .dwattr $C$DW$602, DW_AT_type(*$C$DW$T$21)
    6447                            .dwattr $C$DW$602, DW_AT_name("eBeaconOrder")
    6448                            .dwattr $C$DW$602, DW_AT_TI_symbol_name("eBeaconOrder")
    6449                            .dwattr $C$DW$602, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    6450                            .dwattr $C$DW$602, DW_AT_accessibility(DW_ACCESS_public)
    6451                            .dwattr $C$DW$602, DW_AT_decl_file("..\Application\MAC\HighLevel\mac_pib.h")
    6452                            .dwattr $C$DW$602, DW_AT_decl_line(0x70)
    6453                            .dwattr $C$DW$602, DW_AT_decl_column(0x15)
    6454                    
    6455                    $C$DW$603       .dwtag  DW_TAG_member
    6456                            .dwattr $C$DW$603, DW_AT_type(*$C$DW$T$20)
    6457                            .dwattr $C$DW$603, DW_AT_name("eBeaconOrderNBPAN")
    6458                            .dwattr $C$DW$603, DW_AT_TI_symbol_name("eBeaconOrderNBPAN")
    6459                            .dwattr $C$DW$603, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    6460                            .dwattr $C$DW$603, DW_AT_accessibility(DW_ACCESS_public)
    6461                            .dwattr $C$DW$603, DW_AT_decl_file("..\Application\MAC\HighLevel\mac_pib.h")
    6462                            .dwattr $C$DW$603, DW_AT_decl_line(0x71)
    6463                            .dwattr $C$DW$603, DW_AT_decl_column(0x15)
    6464                    
    6465                    $C$DW$604       .dwtag  DW_TAG_member
    6466                            .dwattr $C$DW$604, DW_AT_type(*$C$DW$T$21)
    6467                            .dwattr $C$DW$604, DW_AT_name("offsetTimeSlot")
    6468                            .dwattr $C$DW$604, DW_AT_TI_symbol_name("offsetTimeSlot")
    6469                            .dwattr $C$DW$604, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
    6470                            .dwattr $C$DW$604, DW_AT_accessibility(DW_ACCESS_public)
    6471                            .dwattr $C$DW$604, DW_AT_decl_file("..\Application\MAC\HighLevel\mac_pib.h")
    6472                            .dwattr $C$DW$604, DW_AT_decl_line(0x72)
    6473                            .dwattr $C$DW$604, DW_AT_decl_column(0x15)
    6474                    
    6475                    $C$DW$605       .dwtag  DW_TAG_member
    6476                            .dwattr $C$DW$605, DW_AT_type(*$C$DW$T$24)
    6477                            .dwattr $C$DW$605, DW_AT_name("includeMPMIE")
    6478                            .dwattr $C$DW$605, DW_AT_TI_symbol_name("includeMPMIE")
    6479                            .dwattr $C$DW$605, DW_AT_data_member_location[DW_OP_plus_uconst 0x3f]
    6480                            .dwattr $C$DW$605, DW_AT_accessibility(DW_ACCESS_public)
    6481                            .dwattr $C$DW$605, DW_AT_decl_file("..\Application\MAC\HighLevel\mac_pib.h")
    6482                            .dwattr $C$DW$605, DW_AT_decl_line(0x73)
    6483                            .dwattr $C$DW$605, DW_AT_decl_column(0x15)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:25 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{B8A034D0-7CBD-40EF-A8F0-18C84766EFB4} PAGE  119

    6484                    
    6485                    $C$DW$606       .dwtag  DW_TAG_member
    6486                            .dwattr $C$DW$606, DW_AT_type(*$C$DW$T$21)
    6487                            .dwattr $C$DW$606, DW_AT_name("fskPreambleLen")
    6488                            .dwattr $C$DW$606, DW_AT_TI_symbol_name("fskPreambleLen")
    6489                            .dwattr $C$DW$606, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    6490                            .dwattr $C$DW$606, DW_AT_accessibility(DW_ACCESS_public)
    6491                            .dwattr $C$DW$606, DW_AT_decl_file("..\Application\MAC\HighLevel\mac_pib.h")
    6492                            .dwattr $C$DW$606, DW_AT_decl_line(0x75)
    6493                            .dwattr $C$DW$606, DW_AT_decl_column(0x15)
    6494                    
    6495                    $C$DW$607       .dwtag  DW_TAG_member
    6496                            .dwattr $C$DW$607, DW_AT_type(*$C$DW$T$21)
    6497                            .dwattr $C$DW$607, DW_AT_name("mrFSKSFD")
    6498                            .dwattr $C$DW$607, DW_AT_TI_symbol_name("mrFSKSFD")
    6499                            .dwattr $C$DW$607, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
    6500                            .dwattr $C$DW$607, DW_AT_accessibility(DW_ACCESS_public)
    6501                            .dwattr $C$DW$607, DW_AT_decl_file("..\Application\MAC\HighLevel\mac_pib.h")
    6502                            .dwattr $C$DW$607, DW_AT_decl_line(0x76)
    6503                            .dwattr $C$DW$607, DW_AT_decl_column(0x15)
    6504                    
    6505                    $C$DW$608       .dwtag  DW_TAG_member
    6506                            .dwattr $C$DW$608, DW_AT_type(*$C$DW$T$27)
    6507                            .dwattr $C$DW$608, DW_AT_name("phyTransmitPower")
    6508                            .dwattr $C$DW$608, DW_AT_TI_symbol_name("phyTransmitPower")
    6509                            .dwattr $C$DW$608, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    6510                            .dwattr $C$DW$608, DW_AT_accessibility(DW_ACCESS_public)
    6511                            .dwattr $C$DW$608, DW_AT_decl_file("..\Application\MAC\HighLevel\mac_pib.h")
    6512                            .dwattr $C$DW$608, DW_AT_decl_line(0x79)
    6513                            .dwattr $C$DW$608, DW_AT_decl_column(0x15)
    6514                    
    6515                    $C$DW$609       .dwtag  DW_TAG_member
    6516                            .dwattr $C$DW$609, DW_AT_type(*$C$DW$T$21)
    6517                            .dwattr $C$DW$609, DW_AT_name("logicalChannel")
    6518                            .dwattr $C$DW$609, DW_AT_TI_symbol_name("logicalChannel")
    6519                            .dwattr $C$DW$609, DW_AT_data_member_location[DW_OP_plus_uconst 0x43]
    6520                            .dwattr $C$DW$609, DW_AT_accessibility(DW_ACCESS_public)
    6521                            .dwattr $C$DW$609, DW_AT_decl_file("..\Application\MAC\HighLevel\mac_pib.h")
    6522                            .dwattr $C$DW$609, DW_AT_decl_line(0x7a)
    6523                            .dwattr $C$DW$609, DW_AT_decl_column(0x15)
    6524                    
    6525                    $C$DW$610       .dwtag  DW_TAG_member
    6526                            .dwattr $C$DW$610, DW_AT_type(*$C$DW$T$26)
    6527                            .dwattr $C$DW$610, DW_AT_name("extendedAddress")
    6528                            .dwattr $C$DW$610, DW_AT_TI_symbol_name("extendedAddress")
    6529                            .dwattr $C$DW$610, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    6530                            .dwattr $C$DW$610, DW_AT_accessibility(DW_ACCESS_public)
    6531                            .dwattr $C$DW$610, DW_AT_decl_file("..\Application\MAC\HighLevel\mac_pib.h")
    6532                            .dwattr $C$DW$610, DW_AT_decl_line(0x7b)
    6533                            .dwattr $C$DW$610, DW_AT_decl_column(0x15)
    6534                    
    6535                    $C$DW$611       .dwtag  DW_TAG_member
    6536                            .dwattr $C$DW$611, DW_AT_type(*$C$DW$T$21)
    6537                            .dwattr $C$DW$611, DW_AT_name("altBe")
    6538                            .dwattr $C$DW$611, DW_AT_TI_symbol_name("altBe")
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:25 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{B8A034D0-7CBD-40EF-A8F0-18C84766EFB4} PAGE  120

    6539                            .dwattr $C$DW$611, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
    6540                            .dwattr $C$DW$611, DW_AT_accessibility(DW_ACCESS_public)
    6541                            .dwattr $C$DW$611, DW_AT_decl_file("..\Application\MAC\HighLevel\mac_pib.h")
    6542                            .dwattr $C$DW$611, DW_AT_decl_line(0x7c)
    6543                            .dwattr $C$DW$611, DW_AT_decl_column(0x15)
    6544                    
    6545                    $C$DW$612       .dwtag  DW_TAG_member
    6546                            .dwattr $C$DW$612, DW_AT_type(*$C$DW$T$21)
    6547                            .dwattr $C$DW$612, DW_AT_name("deviceBeaconOrder")
    6548                            .dwattr $C$DW$612, DW_AT_TI_symbol_name("deviceBeaconOrder")
    6549                            .dwattr $C$DW$612, DW_AT_data_member_location[DW_OP_plus_uconst 0x4f]
    6550                            .dwattr $C$DW$612, DW_AT_accessibility(DW_ACCESS_public)
    6551                            .dwattr $C$DW$612, DW_AT_decl_file("..\Application\MAC\HighLevel\mac_pib.h")
    6552                            .dwattr $C$DW$612, DW_AT_decl_line(0x7d)
    6553                            .dwattr $C$DW$612, DW_AT_decl_column(0x15)
    6554                    
    6555                    $C$DW$613       .dwtag  DW_TAG_member
    6556                            .dwattr $C$DW$613, DW_AT_type(*$C$DW$T$21)
    6557                            .dwattr $C$DW$613, DW_AT_name("rf4cepowerSavings")
    6558                            .dwattr $C$DW$613, DW_AT_TI_symbol_name("rf4cepowerSavings")
    6559                            .dwattr $C$DW$613, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    6560                            .dwattr $C$DW$613, DW_AT_accessibility(DW_ACCESS_public)
    6561                            .dwattr $C$DW$613, DW_AT_decl_file("..\Application\MAC\HighLevel\mac_pib.h")
    6562                            .dwattr $C$DW$613, DW_AT_decl_line(0x7e)
    6563                            .dwattr $C$DW$613, DW_AT_decl_column(0x15)
    6564                    
    6565                    $C$DW$614       .dwtag  DW_TAG_member
    6566                            .dwattr $C$DW$614, DW_AT_type(*$C$DW$T$21)
    6567                            .dwattr $C$DW$614, DW_AT_name("frameVersionSupport")
    6568                            .dwattr $C$DW$614, DW_AT_TI_symbol_name("frameVersionSupport")
    6569                            .dwattr $C$DW$614, DW_AT_data_member_location[DW_OP_plus_uconst 0x51]
    6570                            .dwattr $C$DW$614, DW_AT_accessibility(DW_ACCESS_public)
    6571                            .dwattr $C$DW$614, DW_AT_decl_file("..\Application\MAC\HighLevel\mac_pib.h")
    6572                            .dwattr $C$DW$614, DW_AT_decl_line(0x7f)
    6573                            .dwattr $C$DW$614, DW_AT_decl_column(0x15)
    6574                    
    6575                    $C$DW$615       .dwtag  DW_TAG_member
    6576                            .dwattr $C$DW$615, DW_AT_type(*$C$DW$T$21)
    6577                            .dwattr $C$DW$615, DW_AT_name("channelPage")
    6578                            .dwattr $C$DW$615, DW_AT_TI_symbol_name("channelPage")
    6579                            .dwattr $C$DW$615, DW_AT_data_member_location[DW_OP_plus_uconst 0x52]
    6580                            .dwattr $C$DW$615, DW_AT_accessibility(DW_ACCESS_public)
    6581                            .dwattr $C$DW$615, DW_AT_decl_file("..\Application\MAC\HighLevel\mac_pib.h")
    6582                            .dwattr $C$DW$615, DW_AT_decl_line(0x80)
    6583                            .dwattr $C$DW$615, DW_AT_decl_column(0x15)
    6584                    
    6585                    $C$DW$616       .dwtag  DW_TAG_member
    6586                            .dwattr $C$DW$616, DW_AT_type(*$C$DW$T$21)
    6587                            .dwattr $C$DW$616, DW_AT_name("curPhyID")
    6588                            .dwattr $C$DW$616, DW_AT_TI_symbol_name("curPhyID")
    6589                            .dwattr $C$DW$616, DW_AT_data_member_location[DW_OP_plus_uconst 0x53]
    6590                            .dwattr $C$DW$616, DW_AT_accessibility(DW_ACCESS_public)
    6591                            .dwattr $C$DW$616, DW_AT_decl_file("..\Application\MAC\HighLevel\mac_pib.h")
    6592                            .dwattr $C$DW$616, DW_AT_decl_line(0x81)
    6593                            .dwattr $C$DW$616, DW_AT_decl_column(0x15)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:25 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{B8A034D0-7CBD-40EF-A8F0-18C84766EFB4} PAGE  121

    6594                    
    6595                    $C$DW$617       .dwtag  DW_TAG_member
    6596                            .dwattr $C$DW$617, DW_AT_type(*$C$DW$T$24)
    6597                            .dwattr $C$DW$617, DW_AT_name("fcsType")
    6598                            .dwattr $C$DW$617, DW_AT_TI_symbol_name("fcsType")
    6599                            .dwattr $C$DW$617, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
    6600                            .dwattr $C$DW$617, DW_AT_accessibility(DW_ACCESS_public)
    6601                            .dwattr $C$DW$617, DW_AT_decl_file("..\Application\MAC\HighLevel\mac_pib.h")
    6602                            .dwattr $C$DW$617, DW_AT_decl_line(0x82)
    6603                            .dwattr $C$DW$617, DW_AT_decl_column(0x15)
    6604                    
    6605                    $C$DW$618       .dwtag  DW_TAG_member
    6606                            .dwattr $C$DW$618, DW_AT_type(*$C$DW$T$19)
    6607                            .dwattr $C$DW$618, DW_AT_name("diagsRxCrcPass")
    6608                            .dwattr $C$DW$618, DW_AT_TI_symbol_name("diagsRxCrcPass")
    6609                            .dwattr $C$DW$618, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    6610                            .dwattr $C$DW$618, DW_AT_accessibility(DW_ACCESS_public)
    6611                            .dwattr $C$DW$618, DW_AT_decl_file("..\Application\MAC\HighLevel\mac_pib.h")
    6612                            .dwattr $C$DW$618, DW_AT_decl_line(0x85)
    6613                            .dwattr $C$DW$618, DW_AT_decl_column(0x15)
    6614                    
    6615                    $C$DW$619       .dwtag  DW_TAG_member
    6616                            .dwattr $C$DW$619, DW_AT_type(*$C$DW$T$19)
    6617                            .dwattr $C$DW$619, DW_AT_name("diagsRxCrcFail")
    6618                            .dwattr $C$DW$619, DW_AT_TI_symbol_name("diagsRxCrcFail")
    6619                            .dwattr $C$DW$619, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    6620                            .dwattr $C$DW$619, DW_AT_accessibility(DW_ACCESS_public)
    6621                            .dwattr $C$DW$619, DW_AT_decl_file("..\Application\MAC\HighLevel\mac_pib.h")
    6622                            .dwattr $C$DW$619, DW_AT_decl_line(0x86)
    6623                            .dwattr $C$DW$619, DW_AT_decl_column(0x15)
    6624                    
    6625                    $C$DW$620       .dwtag  DW_TAG_member
    6626                            .dwattr $C$DW$620, DW_AT_type(*$C$DW$T$19)
    6627                            .dwattr $C$DW$620, DW_AT_name("diagsRxBcast")
    6628                            .dwattr $C$DW$620, DW_AT_TI_symbol_name("diagsRxBcast")
    6629                            .dwattr $C$DW$620, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    6630                            .dwattr $C$DW$620, DW_AT_accessibility(DW_ACCESS_public)
    6631                            .dwattr $C$DW$620, DW_AT_decl_file("..\Application\MAC\HighLevel\mac_pib.h")
    6632                            .dwattr $C$DW$620, DW_AT_decl_line(0x87)
    6633                            .dwattr $C$DW$620, DW_AT_decl_column(0x15)
    6634                    
    6635                    $C$DW$621       .dwtag  DW_TAG_member
    6636                            .dwattr $C$DW$621, DW_AT_type(*$C$DW$T$19)
    6637                            .dwattr $C$DW$621, DW_AT_name("diagsTxBcast")
    6638                            .dwattr $C$DW$621, DW_AT_TI_symbol_name("diagsTxBcast")
    6639                            .dwattr $C$DW$621, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
    6640                            .dwattr $C$DW$621, DW_AT_accessibility(DW_ACCESS_public)
    6641                            .dwattr $C$DW$621, DW_AT_decl_file("..\Application\MAC\HighLevel\mac_pib.h")
    6642                            .dwattr $C$DW$621, DW_AT_decl_line(0x88)
    6643                            .dwattr $C$DW$621, DW_AT_decl_column(0x15)
    6644                    
    6645                    $C$DW$622       .dwtag  DW_TAG_member
    6646                            .dwattr $C$DW$622, DW_AT_type(*$C$DW$T$19)
    6647                            .dwattr $C$DW$622, DW_AT_name("diagsRxUcast")
    6648                            .dwattr $C$DW$622, DW_AT_TI_symbol_name("diagsRxUcast")
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:25 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{B8A034D0-7CBD-40EF-A8F0-18C84766EFB4} PAGE  122

    6649                            .dwattr $C$DW$622, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
    6650                            .dwattr $C$DW$622, DW_AT_accessibility(DW_ACCESS_public)
    6651                            .dwattr $C$DW$622, DW_AT_decl_file("..\Application\MAC\HighLevel\mac_pib.h")
    6652                            .dwattr $C$DW$622, DW_AT_decl_line(0x89)
    6653                            .dwattr $C$DW$622, DW_AT_decl_column(0x15)
    6654                    
    6655                    $C$DW$623       .dwtag  DW_TAG_member
    6656                            .dwattr $C$DW$623, DW_AT_type(*$C$DW$T$19)
    6657                            .dwattr $C$DW$623, DW_AT_name("diagsTxUcast")
    6658                            .dwattr $C$DW$623, DW_AT_TI_symbol_name("diagsTxUcast")
    6659                            .dwattr $C$DW$623, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    6660                            .dwattr $C$DW$623, DW_AT_accessibility(DW_ACCESS_public)
    6661                            .dwattr $C$DW$623, DW_AT_decl_file("..\Application\MAC\HighLevel\mac_pib.h")
    6662                            .dwattr $C$DW$623, DW_AT_decl_line(0x8a)
    6663                            .dwattr $C$DW$623, DW_AT_decl_column(0x15)
    6664                    
    6665                    $C$DW$624       .dwtag  DW_TAG_member
    6666                            .dwattr $C$DW$624, DW_AT_type(*$C$DW$T$19)
    6667                            .dwattr $C$DW$624, DW_AT_name("diagsTxUcastRetry")
    6668                            .dwattr $C$DW$624, DW_AT_TI_symbol_name("diagsTxUcastRetry")
    6669                            .dwattr $C$DW$624, DW_AT_data_member_location[DW_OP_plus_uconst 0x70]
    6670                            .dwattr $C$DW$624, DW_AT_accessibility(DW_ACCESS_public)
    6671                            .dwattr $C$DW$624, DW_AT_decl_file("..\Application\MAC\HighLevel\mac_pib.h")
    6672                            .dwattr $C$DW$624, DW_AT_decl_line(0x8b)
    6673                            .dwattr $C$DW$624, DW_AT_decl_column(0x15)
    6674                    
    6675                    $C$DW$625       .dwtag  DW_TAG_member
    6676                            .dwattr $C$DW$625, DW_AT_type(*$C$DW$T$19)
    6677                            .dwattr $C$DW$625, DW_AT_name("diagsTxUcastFail")
    6678                            .dwattr $C$DW$625, DW_AT_TI_symbol_name("diagsTxUcastFail")
    6679                            .dwattr $C$DW$625, DW_AT_data_member_location[DW_OP_plus_uconst 0x74]
    6680                            .dwattr $C$DW$625, DW_AT_accessibility(DW_ACCESS_public)
    6681                            .dwattr $C$DW$625, DW_AT_decl_file("..\Application\MAC\HighLevel\mac_pib.h")
    6682                            .dwattr $C$DW$625, DW_AT_decl_line(0x8c)
    6683                            .dwattr $C$DW$625, DW_AT_decl_column(0x15)
    6684                    
    6685                    $C$DW$626       .dwtag  DW_TAG_member
    6686                            .dwattr $C$DW$626, DW_AT_type(*$C$DW$T$19)
    6687                            .dwattr $C$DW$626, DW_AT_name("diagsRxSecFail")
    6688                            .dwattr $C$DW$626, DW_AT_TI_symbol_name("diagsRxSecFail")
    6689                            .dwattr $C$DW$626, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    6690                            .dwattr $C$DW$626, DW_AT_accessibility(DW_ACCESS_public)
    6691                            .dwattr $C$DW$626, DW_AT_decl_file("..\Application\MAC\HighLevel\mac_pib.h")
    6692                            .dwattr $C$DW$626, DW_AT_decl_line(0x8d)
    6693                            .dwattr $C$DW$626, DW_AT_decl_column(0x15)
    6694                    
    6695                    $C$DW$627       .dwtag  DW_TAG_member
    6696                            .dwattr $C$DW$627, DW_AT_type(*$C$DW$T$19)
    6697                            .dwattr $C$DW$627, DW_AT_name("diagsTxSecFail")
    6698                            .dwattr $C$DW$627, DW_AT_TI_symbol_name("diagsTxSecFail")
    6699                            .dwattr $C$DW$627, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
    6700                            .dwattr $C$DW$627, DW_AT_accessibility(DW_ACCESS_public)
    6701                            .dwattr $C$DW$627, DW_AT_decl_file("..\Application\MAC\HighLevel\mac_pib.h")
    6702                            .dwattr $C$DW$627, DW_AT_decl_line(0x8e)
    6703                            .dwattr $C$DW$627, DW_AT_decl_column(0x15)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:25 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{B8A034D0-7CBD-40EF-A8F0-18C84766EFB4} PAGE  123

    6704                    
    6705                    $C$DW$628       .dwtag  DW_TAG_member
    6706                            .dwattr $C$DW$628, DW_AT_type(*$C$DW$T$27)
    6707                            .dwattr $C$DW$628, DW_AT_name("rssiThreshold")
    6708                            .dwattr $C$DW$628, DW_AT_TI_symbol_name("rssiThreshold")
    6709                            .dwattr $C$DW$628, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
    6710                            .dwattr $C$DW$628, DW_AT_accessibility(DW_ACCESS_public)
    6711                            .dwattr $C$DW$628, DW_AT_decl_file("..\Application\MAC\HighLevel\mac_pib.h")
    6712                            .dwattr $C$DW$628, DW_AT_decl_line(0x91)
    6713                            .dwattr $C$DW$628, DW_AT_decl_column(0x15)
    6714                    
    6715                    $C$DW$629       .dwtag  DW_TAG_member
    6716                            .dwattr $C$DW$629, DW_AT_type(*$C$DW$T$21)
    6717                            .dwattr $C$DW$629, DW_AT_name("rangeExt")
    6718                            .dwattr $C$DW$629, DW_AT_TI_symbol_name("rangeExt")
    6719                            .dwattr $C$DW$629, DW_AT_data_member_location[DW_OP_plus_uconst 0x81]
    6720                            .dwattr $C$DW$629, DW_AT_accessibility(DW_ACCESS_public)
    6721                            .dwattr $C$DW$629, DW_AT_decl_file("..\Application\MAC\HighLevel\mac_pib.h")
    6722                            .dwattr $C$DW$629, DW_AT_decl_line(0x94)
    6723                            .dwattr $C$DW$629, DW_AT_decl_column(0x15)
    6724                    
    6725                            .dwattr $C$DW$T$28, DW_AT_decl_file("..\Application\MAC\HighLevel\mac_pib.h")
    6726                            .dwattr $C$DW$T$28, DW_AT_decl_line(0x4a)
    6727                            .dwattr $C$DW$T$28, DW_AT_decl_column(0x01)
    6728                            .dwendtag $C$DW$T$28
    6729                    
    6730                    $C$DW$T$516     .dwtag  DW_TAG_const_type
    6731                            .dwattr $C$DW$T$516, DW_AT_type(*$C$DW$T$28)
    6732                    
    6733                    $C$DW$T$1076    .dwtag  DW_TAG_typedef
    6734                            .dwattr $C$DW$T$1076, DW_AT_name("macPib_t")
    6735                            .dwattr $C$DW$T$1076, DW_AT_type(*$C$DW$T$28)
    6736                            .dwattr $C$DW$T$1076, DW_AT_language(DW_LANG_C)
    6737                            .dwattr $C$DW$T$1076, DW_AT_decl_file("..\Application\MAC\HighLevel\mac_pib.h")
    6738                            .dwattr $C$DW$T$1076, DW_AT_decl_line(0x95)
    6739                            .dwattr $C$DW$T$1076, DW_AT_decl_column(0x03)
    6740                    
    6741                    $C$DW$T$1077    .dwtag  DW_TAG_const_type
    6742                            .dwattr $C$DW$T$1077, DW_AT_type(*$C$DW$T$1076)
    6743                    
    6744                    
    6745                    $C$DW$T$29      .dwtag  DW_TAG_structure_type
    6746                            .dwattr $C$DW$T$29, DW_AT_byte_size(0x04)
    6747                    $C$DW$630       .dwtag  DW_TAG_member
    6748                            .dwattr $C$DW$630, DW_AT_type(*$C$DW$T$21)
    6749                            .dwattr $C$DW$630, DW_AT_name("offset")
    6750                            .dwattr $C$DW$630, DW_AT_TI_symbol_name("offset")
    6751                            .dwattr $C$DW$630, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6752                            .dwattr $C$DW$630, DW_AT_accessibility(DW_ACCESS_public)
    6753                            .dwattr $C$DW$630, DW_AT_decl_file("../Application/MAC/HighLevel/mac_pib.c")
    6754                            .dwattr $C$DW$630, DW_AT_decl_line(0x5b)
    6755                            .dwattr $C$DW$630, DW_AT_decl_column(0x0d)
    6756                    
    6757                    $C$DW$631       .dwtag  DW_TAG_member
    6758                            .dwattr $C$DW$631, DW_AT_type(*$C$DW$T$21)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:25 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{B8A034D0-7CBD-40EF-A8F0-18C84766EFB4} PAGE  124

    6759                            .dwattr $C$DW$631, DW_AT_name("len")
    6760                            .dwattr $C$DW$631, DW_AT_TI_symbol_name("len")
    6761                            .dwattr $C$DW$631, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6762                            .dwattr $C$DW$631, DW_AT_accessibility(DW_ACCESS_public)
    6763                            .dwattr $C$DW$631, DW_AT_decl_file("../Application/MAC/HighLevel/mac_pib.c")
    6764                            .dwattr $C$DW$631, DW_AT_decl_line(0x5c)
    6765                            .dwattr $C$DW$631, DW_AT_decl_column(0x0d)
    6766                    
    6767                    $C$DW$632       .dwtag  DW_TAG_member
    6768                            .dwattr $C$DW$632, DW_AT_type(*$C$DW$T$21)
    6769                            .dwattr $C$DW$632, DW_AT_name("min")
    6770                            .dwattr $C$DW$632, DW_AT_TI_symbol_name("min")
    6771                            .dwattr $C$DW$632, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6772                            .dwattr $C$DW$632, DW_AT_accessibility(DW_ACCESS_public)
    6773                            .dwattr $C$DW$632, DW_AT_decl_file("../Application/MAC/HighLevel/mac_pib.c")
    6774                            .dwattr $C$DW$632, DW_AT_decl_line(0x5d)
    6775                            .dwattr $C$DW$632, DW_AT_decl_column(0x0d)
    6776                    
    6777                    $C$DW$633       .dwtag  DW_TAG_member
    6778                            .dwattr $C$DW$633, DW_AT_type(*$C$DW$T$21)
    6779                            .dwattr $C$DW$633, DW_AT_name("max")
    6780                            .dwattr $C$DW$633, DW_AT_TI_symbol_name("max")
    6781                            .dwattr $C$DW$633, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    6782                            .dwattr $C$DW$633, DW_AT_accessibility(DW_ACCESS_public)
    6783                            .dwattr $C$DW$633, DW_AT_decl_file("../Application/MAC/HighLevel/mac_pib.c")
    6784                            .dwattr $C$DW$633, DW_AT_decl_line(0x5e)
    6785                            .dwattr $C$DW$633, DW_AT_decl_column(0x0d)
    6786                    
    6787                            .dwattr $C$DW$T$29, DW_AT_decl_file("../Application/MAC/HighLevel/mac_pib.c")
    6788                            .dwattr $C$DW$T$29, DW_AT_decl_line(0x5a)
    6789                            .dwattr $C$DW$T$29, DW_AT_decl_column(0x01)
    6790                            .dwendtag $C$DW$T$29
    6791                    
    6792                    $C$DW$T$517     .dwtag  DW_TAG_const_type
    6793                            .dwattr $C$DW$T$517, DW_AT_type(*$C$DW$T$29)
    6794                    
    6795                    
    6796                    $C$DW$T$518     .dwtag  DW_TAG_array_type
    6797                            .dwattr $C$DW$T$518, DW_AT_type(*$C$DW$T$517)
    6798                            .dwattr $C$DW$T$518, DW_AT_language(DW_LANG_C)
    6799                            .dwattr $C$DW$T$518, DW_AT_byte_size(0xec)
    6800                    $C$DW$634       .dwtag  DW_TAG_subrange_type
    6801                            .dwattr $C$DW$634, DW_AT_upper_bound(0x3a)
    6802                    
    6803                            .dwendtag $C$DW$T$518
    6804                    
    6805                    $C$DW$T$1080    .dwtag  DW_TAG_typedef
    6806                            .dwattr $C$DW$T$1080, DW_AT_name("macPibTbl_t")
    6807                            .dwattr $C$DW$T$1080, DW_AT_type(*$C$DW$T$29)
    6808                            .dwattr $C$DW$T$1080, DW_AT_language(DW_LANG_C)
    6809                            .dwattr $C$DW$T$1080, DW_AT_decl_file("../Application/MAC/HighLevel/mac_pib.c")
    6810                            .dwattr $C$DW$T$1080, DW_AT_decl_line(0x5f)
    6811                            .dwattr $C$DW$T$1080, DW_AT_decl_column(0x03)
    6812                    
    6813                    $C$DW$T$1081    .dwtag  DW_TAG_const_type
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:25 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{B8A034D0-7CBD-40EF-A8F0-18C84766EFB4} PAGE  125

    6814                            .dwattr $C$DW$T$1081, DW_AT_type(*$C$DW$T$1080)
    6815                    
    6816                    
    6817                    $C$DW$T$1082    .dwtag  DW_TAG_array_type
    6818                            .dwattr $C$DW$T$1082, DW_AT_type(*$C$DW$T$1081)
    6819                            .dwattr $C$DW$T$1082, DW_AT_language(DW_LANG_C)
    6820                            .dwattr $C$DW$T$1082, DW_AT_byte_size(0xec)
    6821                    $C$DW$635       .dwtag  DW_TAG_subrange_type
    6822                            .dwattr $C$DW$635, DW_AT_upper_bound(0x3a)
    6823                    
    6824                            .dwendtag $C$DW$T$1082
    6825                    
    6826                    
    6827                    $C$DW$T$71      .dwtag  DW_TAG_structure_type
    6828                            .dwattr $C$DW$T$71, DW_AT_byte_size(0x4c)
    6829                    $C$DW$636       .dwtag  DW_TAG_member
    6830                            .dwattr $C$DW$636, DW_AT_type(*$C$DW$T$35)
    6831                            .dwattr $C$DW$636, DW_AT_name("Crc32")
    6832                            .dwattr $C$DW$636, DW_AT_TI_symbol_name("Crc32")
    6833                            .dwattr $C$DW$636, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6834                            .dwattr $C$DW$636, DW_AT_accessibility(DW_ACCESS_public)
    6835                            .dwattr $C$DW$636, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    6836                            .dwattr $C$DW$636, DW_AT_decl_line(0x76)
    6837                            .dwattr $C$DW$636, DW_AT_decl_column(0x25)
    6838                    
    6839                    $C$DW$637       .dwtag  DW_TAG_member
    6840                            .dwattr $C$DW$637, DW_AT_type(*$C$DW$T$38)
    6841                            .dwattr $C$DW$637, DW_AT_name("FlashGetSize")
    6842                            .dwattr $C$DW$637, DW_AT_TI_symbol_name("FlashGetSize")
    6843                            .dwattr $C$DW$637, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6844                            .dwattr $C$DW$637, DW_AT_accessibility(DW_ACCESS_public)
    6845                            .dwattr $C$DW$637, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    6846                            .dwattr $C$DW$637, DW_AT_decl_line(0x77)
    6847                            .dwattr $C$DW$637, DW_AT_decl_column(0x25)
    6848                    
    6849                    $C$DW$638       .dwtag  DW_TAG_member
    6850                            .dwattr $C$DW$638, DW_AT_type(*$C$DW$T$39)
    6851                            .dwattr $C$DW$638, DW_AT_name("GetChipId")
    6852                            .dwattr $C$DW$638, DW_AT_TI_symbol_name("GetChipId")
    6853                            .dwattr $C$DW$638, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6854                            .dwattr $C$DW$638, DW_AT_accessibility(DW_ACCESS_public)
    6855                            .dwattr $C$DW$638, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    6856                            .dwattr $C$DW$638, DW_AT_decl_line(0x78)
    6857                            .dwattr $C$DW$638, DW_AT_decl_column(0x25)
    6858                    
    6859                    $C$DW$639       .dwtag  DW_TAG_member
    6860                            .dwattr $C$DW$639, DW_AT_type(*$C$DW$T$42)
    6861                            .dwattr $C$DW$639, DW_AT_name("ReservedLocation1")
    6862                            .dwattr $C$DW$639, DW_AT_TI_symbol_name("ReservedLocation1")
    6863                            .dwattr $C$DW$639, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6864                            .dwattr $C$DW$639, DW_AT_accessibility(DW_ACCESS_public)
    6865                            .dwattr $C$DW$639, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    6866                            .dwattr $C$DW$639, DW_AT_decl_line(0x79)
    6867                            .dwattr $C$DW$639, DW_AT_decl_column(0x25)
    6868                    
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:25 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{B8A034D0-7CBD-40EF-A8F0-18C84766EFB4} PAGE  126

    6869                    $C$DW$640       .dwtag  DW_TAG_member
    6870                            .dwattr $C$DW$640, DW_AT_type(*$C$DW$T$43)
    6871                            .dwattr $C$DW$640, DW_AT_name("ReservedLocation2")
    6872                            .dwattr $C$DW$640, DW_AT_TI_symbol_name("ReservedLocation2")
    6873                            .dwattr $C$DW$640, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6874                            .dwattr $C$DW$640, DW_AT_accessibility(DW_ACCESS_public)
    6875                            .dwattr $C$DW$640, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    6876                            .dwattr $C$DW$640, DW_AT_decl_line(0x7a)
    6877                            .dwattr $C$DW$640, DW_AT_decl_column(0x25)
    6878                    
    6879                    $C$DW$641       .dwtag  DW_TAG_member
    6880                            .dwattr $C$DW$641, DW_AT_type(*$C$DW$T$44)
    6881                            .dwattr $C$DW$641, DW_AT_name("ReservedLocation3")
    6882                            .dwattr $C$DW$641, DW_AT_TI_symbol_name("ReservedLocation3")
    6883                            .dwattr $C$DW$641, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    6884                            .dwattr $C$DW$641, DW_AT_accessibility(DW_ACCESS_public)
    6885                            .dwattr $C$DW$641, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    6886                            .dwattr $C$DW$641, DW_AT_decl_line(0x7b)
    6887                            .dwattr $C$DW$641, DW_AT_decl_column(0x25)
    6888                    
    6889                    $C$DW$642       .dwtag  DW_TAG_member
    6890                            .dwattr $C$DW$642, DW_AT_type(*$C$DW$T$47)
    6891                            .dwattr $C$DW$642, DW_AT_name("ResetDevice")
    6892                            .dwattr $C$DW$642, DW_AT_TI_symbol_name("ResetDevice")
    6893                            .dwattr $C$DW$642, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    6894                            .dwattr $C$DW$642, DW_AT_accessibility(DW_ACCESS_public)
    6895                            .dwattr $C$DW$642, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    6896                            .dwattr $C$DW$642, DW_AT_decl_line(0x7c)
    6897                            .dwattr $C$DW$642, DW_AT_decl_column(0x25)
    6898                    
    6899                    $C$DW$643       .dwtag  DW_TAG_member
    6900                            .dwattr $C$DW$643, DW_AT_type(*$C$DW$T$52)
    6901                            .dwattr $C$DW$643, DW_AT_name("Fletcher32")
    6902                            .dwattr $C$DW$643, DW_AT_TI_symbol_name("Fletcher32")
    6903                            .dwattr $C$DW$643, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    6904                            .dwattr $C$DW$643, DW_AT_accessibility(DW_ACCESS_public)
    6905                            .dwattr $C$DW$643, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    6906                            .dwattr $C$DW$643, DW_AT_decl_line(0x7d)
    6907                            .dwattr $C$DW$643, DW_AT_decl_column(0x25)
    6908                    
    6909                    $C$DW$644       .dwtag  DW_TAG_member
    6910                            .dwattr $C$DW$644, DW_AT_type(*$C$DW$T$56)
    6911                            .dwattr $C$DW$644, DW_AT_name("MinValue")
    6912                            .dwattr $C$DW$644, DW_AT_TI_symbol_name("MinValue")
    6913                            .dwattr $C$DW$644, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    6914                            .dwattr $C$DW$644, DW_AT_accessibility(DW_ACCESS_public)
    6915                            .dwattr $C$DW$644, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    6916                            .dwattr $C$DW$644, DW_AT_decl_line(0x7e)
    6917                            .dwattr $C$DW$644, DW_AT_decl_column(0x25)
    6918                    
    6919                    $C$DW$645       .dwtag  DW_TAG_member
    6920                            .dwattr $C$DW$645, DW_AT_type(*$C$DW$T$57)
    6921                            .dwattr $C$DW$645, DW_AT_name("MaxValue")
    6922                            .dwattr $C$DW$645, DW_AT_TI_symbol_name("MaxValue")
    6923                            .dwattr $C$DW$645, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:25 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{B8A034D0-7CBD-40EF-A8F0-18C84766EFB4} PAGE  127

    6924                            .dwattr $C$DW$645, DW_AT_accessibility(DW_ACCESS_public)
    6925                            .dwattr $C$DW$645, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    6926                            .dwattr $C$DW$645, DW_AT_decl_line(0x7f)
    6927                            .dwattr $C$DW$645, DW_AT_decl_column(0x25)
    6928                    
    6929                    $C$DW$646       .dwtag  DW_TAG_member
    6930                            .dwattr $C$DW$646, DW_AT_type(*$C$DW$T$58)
    6931                            .dwattr $C$DW$646, DW_AT_name("MeanValue")
    6932                            .dwattr $C$DW$646, DW_AT_TI_symbol_name("MeanValue")
    6933                            .dwattr $C$DW$646, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    6934                            .dwattr $C$DW$646, DW_AT_accessibility(DW_ACCESS_public)
    6935                            .dwattr $C$DW$646, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    6936                            .dwattr $C$DW$646, DW_AT_decl_line(0x80)
    6937                            .dwattr $C$DW$646, DW_AT_decl_column(0x25)
    6938                    
    6939                    $C$DW$647       .dwtag  DW_TAG_member
    6940                            .dwattr $C$DW$647, DW_AT_type(*$C$DW$T$59)
    6941                            .dwattr $C$DW$647, DW_AT_name("StandDeviationValue")
    6942                            .dwattr $C$DW$647, DW_AT_TI_symbol_name("StandDeviationValue")
    6943                            .dwattr $C$DW$647, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    6944                            .dwattr $C$DW$647, DW_AT_accessibility(DW_ACCESS_public)
    6945                            .dwattr $C$DW$647, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    6946                            .dwattr $C$DW$647, DW_AT_decl_line(0x81)
    6947                            .dwattr $C$DW$647, DW_AT_decl_column(0x25)
    6948                    
    6949                    $C$DW$648       .dwtag  DW_TAG_member
    6950                            .dwattr $C$DW$648, DW_AT_type(*$C$DW$T$62)
    6951                            .dwattr $C$DW$648, DW_AT_name("ReservedLocation4")
    6952                            .dwattr $C$DW$648, DW_AT_TI_symbol_name("ReservedLocation4")
    6953                            .dwattr $C$DW$648, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    6954                            .dwattr $C$DW$648, DW_AT_accessibility(DW_ACCESS_public)
    6955                            .dwattr $C$DW$648, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    6956                            .dwattr $C$DW$648, DW_AT_decl_line(0x82)
    6957                            .dwattr $C$DW$648, DW_AT_decl_column(0x25)
    6958                    
    6959                    $C$DW$649       .dwtag  DW_TAG_member
    6960                            .dwattr $C$DW$649, DW_AT_type(*$C$DW$T$63)
    6961                            .dwattr $C$DW$649, DW_AT_name("ReservedLocation5")
    6962                            .dwattr $C$DW$649, DW_AT_TI_symbol_name("ReservedLocation5")
    6963                            .dwattr $C$DW$649, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    6964                            .dwattr $C$DW$649, DW_AT_accessibility(DW_ACCESS_public)
    6965                            .dwattr $C$DW$649, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    6966                            .dwattr $C$DW$649, DW_AT_decl_line(0x83)
    6967                            .dwattr $C$DW$649, DW_AT_decl_column(0x25)
    6968                    
    6969                    $C$DW$650       .dwtag  DW_TAG_member
    6970                            .dwattr $C$DW$650, DW_AT_type(*$C$DW$T$64)
    6971                            .dwattr $C$DW$650, DW_AT_name("HFSourceSafeSwitch")
    6972                            .dwattr $C$DW$650, DW_AT_TI_symbol_name("HFSourceSafeSwitch")
    6973                            .dwattr $C$DW$650, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    6974                            .dwattr $C$DW$650, DW_AT_accessibility(DW_ACCESS_public)
    6975                            .dwattr $C$DW$650, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    6976                            .dwattr $C$DW$650, DW_AT_decl_line(0x84)
    6977                            .dwattr $C$DW$650, DW_AT_decl_column(0x25)
    6978                    
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:25 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{B8A034D0-7CBD-40EF-A8F0-18C84766EFB4} PAGE  128

    6979                    $C$DW$651       .dwtag  DW_TAG_member
    6980                            .dwattr $C$DW$651, DW_AT_type(*$C$DW$T$67)
    6981                            .dwattr $C$DW$651, DW_AT_name("SelectCompAInput")
    6982                            .dwattr $C$DW$651, DW_AT_TI_symbol_name("SelectCompAInput")
    6983                            .dwattr $C$DW$651, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    6984                            .dwattr $C$DW$651, DW_AT_accessibility(DW_ACCESS_public)
    6985                            .dwattr $C$DW$651, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    6986                            .dwattr $C$DW$651, DW_AT_decl_line(0x85)
    6987                            .dwattr $C$DW$651, DW_AT_decl_column(0x25)
    6988                    
    6989                    $C$DW$652       .dwtag  DW_TAG_member
    6990                            .dwattr $C$DW$652, DW_AT_type(*$C$DW$T$68)
    6991                            .dwattr $C$DW$652, DW_AT_name("SelectCompARef")
    6992                            .dwattr $C$DW$652, DW_AT_TI_symbol_name("SelectCompARef")
    6993                            .dwattr $C$DW$652, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    6994                            .dwattr $C$DW$652, DW_AT_accessibility(DW_ACCESS_public)
    6995                            .dwattr $C$DW$652, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    6996                            .dwattr $C$DW$652, DW_AT_decl_line(0x86)
    6997                            .dwattr $C$DW$652, DW_AT_decl_column(0x25)
    6998                    
    6999                    $C$DW$653       .dwtag  DW_TAG_member
    7000                            .dwattr $C$DW$653, DW_AT_type(*$C$DW$T$69)
    7001                            .dwattr $C$DW$653, DW_AT_name("SelectADCCompBInput")
    7002                            .dwattr $C$DW$653, DW_AT_TI_symbol_name("SelectADCCompBInput")
    7003                            .dwattr $C$DW$653, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    7004                            .dwattr $C$DW$653, DW_AT_accessibility(DW_ACCESS_public)
    7005                            .dwattr $C$DW$653, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    7006                            .dwattr $C$DW$653, DW_AT_decl_line(0x87)
    7007                            .dwattr $C$DW$653, DW_AT_decl_column(0x25)
    7008                    
    7009                    $C$DW$654       .dwtag  DW_TAG_member
    7010                            .dwattr $C$DW$654, DW_AT_type(*$C$DW$T$70)
    7011                            .dwattr $C$DW$654, DW_AT_name("SelectCompBRef")
    7012                            .dwattr $C$DW$654, DW_AT_TI_symbol_name("SelectCompBRef")
    7013                            .dwattr $C$DW$654, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    7014                            .dwattr $C$DW$654, DW_AT_accessibility(DW_ACCESS_public)
    7015                            .dwattr $C$DW$654, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    7016                            .dwattr $C$DW$654, DW_AT_decl_line(0x88)
    7017                            .dwattr $C$DW$654, DW_AT_decl_column(0x25)
    7018                    
    7019                            .dwattr $C$DW$T$71, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\
    7020                            .dwattr $C$DW$T$71, DW_AT_decl_line(0x75)
    7021                            .dwattr $C$DW$T$71, DW_AT_decl_column(0x01)
    7022                            .dwendtag $C$DW$T$71
    7023                    
    7024                    $C$DW$T$1083    .dwtag  DW_TAG_typedef
    7025                            .dwattr $C$DW$T$1083, DW_AT_name("HARD_API_T")
    7026                            .dwattr $C$DW$T$1083, DW_AT_type(*$C$DW$T$71)
    7027                            .dwattr $C$DW$T$1083, DW_AT_language(DW_LANG_C)
    7028                            .dwattr $C$DW$T$1083, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\device
    7029                            .dwattr $C$DW$T$1083, DW_AT_decl_line(0x89)
    7030                            .dwattr $C$DW$T$1083, DW_AT_decl_column(0x03)
    7031                    
    7032                    
    7033                    $C$DW$T$72      .dwtag  DW_TAG_structure_type
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:25 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{B8A034D0-7CBD-40EF-A8F0-18C84766EFB4} PAGE  129

    7034                            .dwattr $C$DW$T$72, DW_AT_byte_size(0x08)
    7035                    $C$DW$655       .dwtag  DW_TAG_member
    7036                            .dwattr $C$DW$655, DW_AT_type(*$C$DW$T$10)
    7037                            .dwattr $C$DW$655, DW_AT_name("quot")
    7038                            .dwattr $C$DW$655, DW_AT_TI_symbol_name("quot")
    7039                            .dwattr $C$DW$655, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7040                            .dwattr $C$DW$655, DW_AT_accessibility(DW_ACCESS_public)
    7041                            .dwattr $C$DW$655, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/s
    7042                            .dwattr $C$DW$655, DW_AT_decl_line(0x5c)
    7043                            .dwattr $C$DW$655, DW_AT_decl_column(0x16)
    7044                    
    7045                    $C$DW$656       .dwtag  DW_TAG_member
    7046                            .dwattr $C$DW$656, DW_AT_type(*$C$DW$T$10)
    7047                            .dwattr $C$DW$656, DW_AT_name("rem")
    7048                            .dwattr $C$DW$656, DW_AT_TI_symbol_name("rem")
    7049                            .dwattr $C$DW$656, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7050                            .dwattr $C$DW$656, DW_AT_accessibility(DW_ACCESS_public)
    7051                            .dwattr $C$DW$656, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/s
    7052                            .dwattr $C$DW$656, DW_AT_decl_line(0x5c)
    7053                            .dwattr $C$DW$656, DW_AT_decl_column(0x1c)
    7054                    
    7055                            .dwattr $C$DW$T$72, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/
    7056                            .dwattr $C$DW$T$72, DW_AT_decl_line(0x5c)
    7057                            .dwattr $C$DW$T$72, DW_AT_decl_column(0x10)
    7058                            .dwendtag $C$DW$T$72
    7059                    
    7060                    $C$DW$T$1084    .dwtag  DW_TAG_typedef
    7061                            .dwattr $C$DW$T$1084, DW_AT_name("div_t")
    7062                            .dwattr $C$DW$T$1084, DW_AT_type(*$C$DW$T$72)
    7063                            .dwattr $C$DW$T$1084, DW_AT_language(DW_LANG_C)
    7064                            .dwattr $C$DW$T$1084, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/includ
    7065                            .dwattr $C$DW$T$1084, DW_AT_decl_line(0x5c)
    7066                            .dwattr $C$DW$T$1084, DW_AT_decl_column(0x23)
    7067                    
    7068                    
    7069                    $C$DW$T$73      .dwtag  DW_TAG_structure_type
    7070                            .dwattr $C$DW$T$73, DW_AT_byte_size(0x08)
    7071                    $C$DW$657       .dwtag  DW_TAG_member
    7072                            .dwattr $C$DW$657, DW_AT_type(*$C$DW$T$10)
    7073                            .dwattr $C$DW$657, DW_AT_name("quot")
    7074                            .dwattr $C$DW$657, DW_AT_TI_symbol_name("quot")
