TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:25 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{F29005E1-0F76-4F90-B1D3-F929141D604A} PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                        PC v16.9.4.LTS *
       3                    ;* Date/Time created: Sat Nov 18 18:46:25 2017                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../Application/MAC/LowLevel/mac_settings.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v16.9.4.LTS Copyright (c) 1996-20
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Kevin\workspace_v7\sensor_cc1310lp\sensor_cc1310lp"
      13                            .global RF_cmdPropRadioDivSetup

     506                            .dwattr $C$DW$22, DW_AT_decl_line(0x2de)
     507                            .dwattr $C$DW$22, DW_AT_decl_column(0x05)
     508                    
     509                    $C$DW$23        .dwtag  DW_TAG_enumerator
     510                            .dwattr $C$DW$23, DW_AT_name("RF_StatSuccess")
     511                            .dwattr $C$DW$23, DW_AT_const_value(0x83)
     512                            .dwattr $C$DW$23, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/rf
     513                            .dwattr $C$DW$23, DW_AT_decl_line(0x2df)
     514                            .dwattr $C$DW$23, DW_AT_decl_column(0x05)
     515                    
     516                            .dwattr $C$DW$T$370, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers
     517                            .dwattr $C$DW$T$370, DW_AT_decl_line(0x2d6)
     518                            .dwattr $C$DW$T$370, DW_AT_decl_column(0x0e)
     519                            .dwendtag $C$DW$T$370
     520                    
     521                    $C$DW$T$371     .dwtag  DW_TAG_typedef
     522                            .dwattr $C$DW$T$371, DW_AT_name("RF_Stat")
     523                            .dwattr $C$DW$T$371, DW_AT_type(*$C$DW$T$370)
     524                            .dwattr $C$DW$T$371, DW_AT_language(DW_LANG_C)
     525                            .dwattr $C$DW$T$371, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers
     526                            .dwattr $C$DW$T$371, DW_AT_decl_line(0x2e0)
     527                            .dwattr $C$DW$T$371, DW_AT_decl_column(0x03)
     528                    
     529                    
     530                    $C$DW$T$372     .dwtag  DW_TAG_enumeration_type
     531                            .dwattr $C$DW$T$372, DW_AT_byte_size(0x01)
     532                    $C$DW$24        .dwtag  DW_TAG_enumerator
     533                            .dwattr $C$DW$24, DW_AT_name("RF_GET_CURR_CMD")
     534                            .dwattr $C$DW$24, DW_AT_const_value(0x00)
     535                            .dwattr $C$DW$24, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/rf
     536                            .dwattr $C$DW$24, DW_AT_decl_line(0x3aa)
     537                            .dwattr $C$DW$24, DW_AT_decl_column(0x05)
     538                    
     539                    $C$DW$25        .dwtag  DW_TAG_enumerator
     540                            .dwattr $C$DW$25, DW_AT_name("RF_GET_AVAIL_RAT_CH")
     541                            .dwattr $C$DW$25, DW_AT_const_value(0x01)
     542                            .dwattr $C$DW$25, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/rf
     543                            .dwattr $C$DW$25, DW_AT_decl_line(0x3ab)
     544                            .dwattr $C$DW$25, DW_AT_decl_column(0x05)
     545                    
     546                    $C$DW$26        .dwtag  DW_TAG_enumerator
     547                            .dwattr $C$DW$26, DW_AT_name("RF_GET_RADIO_STATE")
     548                            .dwattr $C$DW$26, DW_AT_const_value(0x02)
     549                            .dwattr $C$DW$26, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/rf
     550                            .dwattr $C$DW$26, DW_AT_decl_line(0x3ac)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:25 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{F29005E1-0F76-4F90-B1D3-F929141D604A} PAGE   11

     551                            .dwattr $C$DW$26, DW_AT_decl_column(0x05)
     552                    
     553                    $C$DW$27        .dwtag  DW_TAG_enumerator
     554                            .dwattr $C$DW$27, DW_AT_name("RF_GET_SCHEDULE_MAP")
     555                            .dwattr $C$DW$27, DW_AT_const_value(0x03)
     556                            .dwattr $C$DW$27, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/rf
     557                            .dwattr $C$DW$27, DW_AT_decl_line(0x3ad)
     558                            .dwattr $C$DW$27, DW_AT_decl_column(0x05)
     559                    
     560                            .dwattr $C$DW$T$372, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers
     561                            .dwattr $C$DW$T$372, DW_AT_decl_line(0x3a9)
     562                            .dwattr $C$DW$T$372, DW_AT_decl_column(0x0e)
     563                            .dwendtag $C$DW$T$372
     564                    
     565                    $C$DW$T$373     .dwtag  DW_TAG_typedef
     566                            .dwattr $C$DW$T$373, DW_AT_name("RF_InfoType")
     567                            .dwattr $C$DW$T$373, DW_AT_type(*$C$DW$T$372)
     568                            .dwattr $C$DW$T$373, DW_AT_language(DW_LANG_C)
     569                            .dwattr $C$DW$T$373, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers
     570                            .dwattr $C$DW$T$373, DW_AT_decl_line(0x3ae)
     571                            .dwattr $C$DW$T$373, DW_AT_decl_column(0x03)
     572                    
     573                    
     574                    $C$DW$T$20      .dwtag  DW_TAG_structure_type
     575                            .dwattr $C$DW$T$20, DW_AT_byte_size(0x01)
     576                    $C$DW$28        .dwtag  DW_TAG_member
     577                            .dwattr $C$DW$28, DW_AT_type(*$C$DW$T$19)
     578                            .dwattr $C$DW$28, DW_AT_name("triggerType")
     579                            .dwattr $C$DW$28, DW_AT_TI_symbol_name("triggerType")
     580                            .dwattr $C$DW$28, DW_AT_bit_offset(0x04)
     581                            .dwattr $C$DW$28, DW_AT_bit_size(0x04)
     582                            .dwattr $C$DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     583                            .dwattr $C$DW$28, DW_AT_accessibility(DW_ACCESS_public)
     584                            .dwattr $C$DW$28, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/cc
     585                            .dwattr $C$DW$28, DW_AT_decl_line(0x77)
     586                            .dwattr $C$DW$28, DW_AT_decl_column(0x0f)
     587                    
     588                    $C$DW$29        .dwtag  DW_TAG_member
     589                            .dwattr $C$DW$29, DW_AT_type(*$C$DW$T$19)
     590                            .dwattr $C$DW$29, DW_AT_name("bEnaCmd")
     591                            .dwattr $C$DW$29, DW_AT_TI_symbol_name("bEnaCmd")
     592                            .dwattr $C$DW$29, DW_AT_bit_offset(0x03)
     593                            .dwattr $C$DW$29, DW_AT_bit_size(0x01)
     594                            .dwattr $C$DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     595                            .dwattr $C$DW$29, DW_AT_accessibility(DW_ACCESS_public)
     596                            .dwattr $C$DW$29, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/cc
     597                            .dwattr $C$DW$29, DW_AT_decl_line(0x78)
     598                            .dwattr $C$DW$29, DW_AT_decl_column(0x0f)
     599                    
     600                    $C$DW$30        .dwtag  DW_TAG_member
     601                            .dwattr $C$DW$30, DW_AT_type(*$C$DW$T$19)
     602                            .dwattr $C$DW$30, DW_AT_name("triggerNo")
     603                            .dwattr $C$DW$30, DW_AT_TI_symbol_name("triggerNo")
     604                            .dwattr $C$DW$30, DW_AT_bit_offset(0x01)
     605                            .dwattr $C$DW$30, DW_AT_bit_size(0x02)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:25 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{F29005E1-0F76-4F90-B1D3-F929141D604A} PAGE   12

     606                            .dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     607                            .dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
     608                            .dwattr $C$DW$30, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/cc
     609                            .dwattr $C$DW$30, DW_AT_decl_line(0x7a)
     610                            .dwattr $C$DW$30, DW_AT_decl_column(0x0f)
     611                    
     612                    $C$DW$31        .dwtag  DW_TAG_member
     613                            .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$19)
     614                            .dwattr $C$DW$31, DW_AT_name("pastTrig")
     615                            .dwattr $C$DW$31, DW_AT_TI_symbol_name("pastTrig")
     616                            .dwattr $C$DW$31, DW_AT_bit_offset(0x00)
     617                            .dwattr $C$DW$31, DW_AT_bit_size(0x01)
     618                            .dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     619                            .dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
     620                            .dwattr $C$DW$31, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/cc
     621                            .dwattr $C$DW$31, DW_AT_decl_line(0x7b)
     622                            .dwattr $C$DW$31, DW_AT_decl_column(0x0f)
     623                    
     624                            .dwattr $C$DW$T$20, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/
     625                            .dwattr $C$DW$T$20, DW_AT_decl_line(0x76)
     626                            .dwattr $C$DW$T$20, DW_AT_decl_column(0x0b)
     627                            .dwendtag $C$DW$T$20
     628                    
     629                    
     630                    $C$DW$T$21      .dwtag  DW_TAG_structure_type
     631                            .dwattr $C$DW$T$21, DW_AT_byte_size(0x01)
     632                    $C$DW$32        .dwtag  DW_TAG_member
     633                            .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$19)
     634                            .dwattr $C$DW$32, DW_AT_name("rule")
     635                            .dwattr $C$DW$32, DW_AT_TI_symbol_name("rule")
     636                            .dwattr $C$DW$32, DW_AT_bit_offset(0x04)
     637                            .dwattr $C$DW$32, DW_AT_bit_size(0x04)
     638                            .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     639                            .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
     640                            .dwattr $C$DW$32, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/cc
     641                            .dwattr $C$DW$32, DW_AT_decl_line(0x7f)
     642                            .dwattr $C$DW$32, DW_AT_decl_column(0x0f)
     643                    
     644                    $C$DW$33        .dwtag  DW_TAG_member
     645                            .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$19)
     646                            .dwattr $C$DW$33, DW_AT_name("nSkip")
     647                            .dwattr $C$DW$33, DW_AT_TI_symbol_name("nSkip")
     648                            .dwattr $C$DW$33, DW_AT_bit_offset(0x00)
     649                            .dwattr $C$DW$33, DW_AT_bit_size(0x04)
     650                            .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     651                            .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
     652                            .dwattr $C$DW$33, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/cc
     653                            .dwattr $C$DW$33, DW_AT_decl_line(0x80)
     654                            .dwattr $C$DW$33, DW_AT_decl_column(0x0f)
     655                    
     656                            .dwattr $C$DW$T$21, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/
     657                            .dwattr $C$DW$T$21, DW_AT_decl_line(0x7e)
     658                            .dwattr $C$DW$T$21, DW_AT_decl_column(0x0b)
     659                            .dwendtag $C$DW$T$21
     660                    
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:25 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{F29005E1-0F76-4F90-B1D3-F929141D604A} PAGE   13

     661                    
     662                    $C$DW$T$22      .dwtag  DW_TAG_structure_type
     663                            .dwattr $C$DW$T$22, DW_AT_byte_size(0x01)
     664                    $C$DW$34        .dwtag  DW_TAG_member
     665                            .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$19)
     666                            .dwattr $C$DW$34, DW_AT_name("triggerType")
     667                            .dwattr $C$DW$34, DW_AT_TI_symbol_name("triggerType")
     668                            .dwattr $C$DW$34, DW_AT_bit_offset(0x04)
     669                            .dwattr $C$DW$34, DW_AT_bit_size(0x04)
     670                            .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     671                            .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
     672                            .dwattr $C$DW$34, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/cc
     673                            .dwattr $C$DW$34, DW_AT_decl_line(0x22d)
     674                            .dwattr $C$DW$34, DW_AT_decl_column(0x0f)
     675                    
     676                    $C$DW$35        .dwtag  DW_TAG_member
     677                            .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$19)
     678                            .dwattr $C$DW$35, DW_AT_name("bEnaCmd")
     679                            .dwattr $C$DW$35, DW_AT_TI_symbol_name("bEnaCmd")
     680                            .dwattr $C$DW$35, DW_AT_bit_offset(0x03)
     681                            .dwattr $C$DW$35, DW_AT_bit_size(0x01)
     682                            .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     683                            .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
     684                            .dwattr $C$DW$35, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/cc
     685                            .dwattr $C$DW$35, DW_AT_decl_line(0x22e)
     686                            .dwattr $C$DW$35, DW_AT_decl_column(0x0f)
     687                    
     688                    $C$DW$36        .dwtag  DW_TAG_member
     689                            .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$19)
     690                            .dwattr $C$DW$36, DW_AT_name("triggerNo")
     691                            .dwattr $C$DW$36, DW_AT_TI_symbol_name("triggerNo")
     692                            .dwattr $C$DW$36, DW_AT_bit_offset(0x01)
     693                            .dwattr $C$DW$36, DW_AT_bit_size(0x02)
     694                            .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     695                            .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
     696                            .dwattr $C$DW$36, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/cc
     697                            .dwattr $C$DW$36, DW_AT_decl_line(0x230)
     698                            .dwattr $C$DW$36, DW_AT_decl_column(0x0f)
     699                    
     700                    $C$DW$37        .dwtag  DW_TAG_member
     701                            .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$19)
     702                            .dwattr $C$DW$37, DW_AT_name("pastTrig")
     703                            .dwattr $C$DW$37, DW_AT_TI_symbol_name("pastTrig")
     704                            .dwattr $C$DW$37, DW_AT_bit_offset(0x00)
     705                            .dwattr $C$DW$37, DW_AT_bit_size(0x01)
     706                            .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     707                            .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
     708                            .dwattr $C$DW$37, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/cc
     709                            .dwattr $C$DW$37, DW_AT_decl_line(0x231)
     710                            .dwattr $C$DW$37, DW_AT_decl_column(0x0f)
     711                    
     712                            .dwattr $C$DW$T$22, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/
     713                            .dwattr $C$DW$T$22, DW_AT_decl_line(0x22c)
     714                            .dwattr $C$DW$T$22, DW_AT_decl_column(0x0b)
     715                            .dwendtag $C$DW$T$22
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:25 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{F29005E1-0F76-4F90-B1D3-F929141D604A} PAGE   14

     716                    
     717                    
     718                    $C$DW$T$23      .dwtag  DW_TAG_structure_type
     719                            .dwattr $C$DW$T$23, DW_AT_byte_size(0x01)
     720                    $C$DW$38        .dwtag  DW_TAG_member
     721                            .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$19)
     722                            .dwattr $C$DW$38, DW_AT_name("rule")
     723                            .dwattr $C$DW$38, DW_AT_TI_symbol_name("rule")
     724                            .dwattr $C$DW$38, DW_AT_bit_offset(0x04)
     725                            .dwattr $C$DW$38, DW_AT_bit_size(0x04)
     726                            .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     727                            .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
     728                            .dwattr $C$DW$38, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/cc
     729                            .dwattr $C$DW$38, DW_AT_decl_line(0x235)
     730                            .dwattr $C$DW$38, DW_AT_decl_column(0x0f)
     731                    
     732                    $C$DW$39        .dwtag  DW_TAG_member
     733                            .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$19)
     734                            .dwattr $C$DW$39, DW_AT_name("nSkip")
     735                            .dwattr $C$DW$39, DW_AT_TI_symbol_name("nSkip")
     736                            .dwattr $C$DW$39, DW_AT_bit_offset(0x00)
     737                            .dwattr $C$DW$39, DW_AT_bit_size(0x04)
     738                            .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     739                            .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
     740                            .dwattr $C$DW$39, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/cc
     741                            .dwattr $C$DW$39, DW_AT_decl_line(0x236)
     742                            .dwattr $C$DW$39, DW_AT_decl_column(0x0f)
     743                    
     744                            .dwattr $C$DW$T$23, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/
     745                            .dwattr $C$DW$T$23, DW_AT_decl_line(0x234)
     746                            .dwattr $C$DW$T$23, DW_AT_decl_column(0x0b)
     747                            .dwendtag $C$DW$T$23
     748                    
     749                    
     750                    $C$DW$T$25      .dwtag  DW_TAG_structure_type
     751                            .dwattr $C$DW$T$25, DW_AT_byte_size(0x02)
     752                    $C$DW$40        .dwtag  DW_TAG_member
     753                            .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$24)
     754                            .dwattr $C$DW$40, DW_AT_name("modType")
     755                            .dwattr $C$DW$40, DW_AT_TI_symbol_name("modType")
     756                            .dwattr $C$DW$40, DW_AT_bit_offset(0x0d)
     757                            .dwattr $C$DW$40, DW_AT_bit_size(0x03)
     758                            .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     759                            .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     760                            .dwattr $C$DW$40, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/cc
     761                            .dwattr $C$DW$40, DW_AT_decl_line(0x239)
     762                            .dwattr $C$DW$40, DW_AT_decl_column(0x10)
     763                    
     764                    $C$DW$41        .dwtag  DW_TAG_member
     765                            .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$24)
     766                            .dwattr $C$DW$41, DW_AT_name("deviation")
     767                            .dwattr $C$DW$41, DW_AT_TI_symbol_name("deviation")
     768                            .dwattr $C$DW$41, DW_AT_bit_offset(0x00)
     769                            .dwattr $C$DW$41, DW_AT_bit_size(0x0d)
     770                            .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:25 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{F29005E1-0F76-4F90-B1D3-F929141D604A} PAGE   15

     771                            .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
     772                            .dwattr $C$DW$41, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/cc
     773                            .dwattr $C$DW$41, DW_AT_decl_line(0x23c)
     774                            .dwattr $C$DW$41, DW_AT_decl_column(0x10)
     775                    
     776                            .dwattr $C$DW$T$25, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/
     777                            .dwattr $C$DW$T$25, DW_AT_decl_line(0x238)
     778                            .dwattr $C$DW$T$25, DW_AT_decl_column(0x0b)
     779                            .dwendtag $C$DW$T$25
     780                    
     781                    
     782                    $C$DW$T$27      .dwtag  DW_TAG_structure_type
     783                            .dwattr $C$DW$T$27, DW_AT_byte_size(0x04)
     784                    $C$DW$42        .dwtag  DW_TAG_member
     785                            .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$26)
     786                            .dwattr $C$DW$42, DW_AT_name("preScale")
     787                            .dwattr $C$DW$42, DW_AT_TI_symbol_name("preScale")
     788                            .dwattr $C$DW$42, DW_AT_bit_offset(0x1c)
     789                            .dwattr $C$DW$42, DW_AT_bit_size(0x04)
     790                            .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     791                            .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     792                            .dwattr $C$DW$42, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/cc
     793                            .dwattr $C$DW$42, DW_AT_decl_line(0x23f)
     794                            .dwattr $C$DW$42, DW_AT_decl_column(0x10)
     795                    
     796                    $C$DW$43        .dwtag  DW_TAG_member
     797                            .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$26)
     798                            .dwattr $C$DW$43, DW_AT_name("rateWord")
     799                            .dwattr $C$DW$43, DW_AT_TI_symbol_name("rateWord")
     800                            .dwattr $C$DW$43, DW_AT_bit_offset(0x03)
     801                            .dwattr $C$DW$43, DW_AT_bit_size(0x15)
     802                            .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     803                            .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     804                            .dwattr $C$DW$43, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/cc
     805                            .dwattr $C$DW$43, DW_AT_decl_line(0x241)
     806                            .dwattr $C$DW$43, DW_AT_decl_column(0x10)
     807                    
     808                    $C$DW$44        .dwtag  DW_TAG_member
     809                            .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$26)
     810                            .dwattr $C$DW$44, DW_AT_name("decimMode")
     811                            .dwattr $C$DW$44, DW_AT_TI_symbol_name("decimMode")
     812                            .dwattr $C$DW$44, DW_AT_bit_offset(0x00)
     813                            .dwattr $C$DW$44, DW_AT_bit_size(0x03)
     814                            .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     815                            .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     816                            .dwattr $C$DW$44, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/cc
     817                            .dwattr $C$DW$44, DW_AT_decl_line(0x242)
     818                            .dwattr $C$DW$44, DW_AT_decl_column(0x10)
     819                    
     820                            .dwattr $C$DW$T$27, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/
     821                            .dwattr $C$DW$T$27, DW_AT_decl_line(0x23e)
     822                            .dwattr $C$DW$T$27, DW_AT_decl_column(0x0b)
     823                            .dwendtag $C$DW$T$27
     824                    
     825                    
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:25 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{F29005E1-0F76-4F90-B1D3-F929141D604A} PAGE   16

     826                    $C$DW$T$28      .dwtag  DW_TAG_structure_type
     827                            .dwattr $C$DW$T$28, DW_AT_byte_size(0x01)
     828                    $C$DW$45        .dwtag  DW_TAG_member
     829                            .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$19)
     830                            .dwattr $C$DW$45, DW_AT_name("nPreamBytes")
     831                            .dwattr $C$DW$45, DW_AT_TI_symbol_name("nPreamBytes")
     832                            .dwattr $C$DW$45, DW_AT_bit_offset(0x02)
     833                            .dwattr $C$DW$45, DW_AT_bit_size(0x06)
     834                            .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     835                            .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     836                            .dwattr $C$DW$45, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/cc
     837                            .dwattr $C$DW$45, DW_AT_decl_line(0x24a)
     838                            .dwattr $C$DW$45, DW_AT_decl_column(0x0f)
     839                    
     840                    $C$DW$46        .dwtag  DW_TAG_member
     841                            .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$19)
     842                            .dwattr $C$DW$46, DW_AT_name("preamMode")
     843                            .dwattr $C$DW$46, DW_AT_TI_symbol_name("preamMode")
     844                            .dwattr $C$DW$46, DW_AT_bit_offset(0x00)
     845                            .dwattr $C$DW$46, DW_AT_bit_size(0x02)
     846                            .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     847                            .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     848                            .dwattr $C$DW$46, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/cc
     849                            .dwattr $C$DW$46, DW_AT_decl_line(0x250)
     850                            .dwattr $C$DW$46, DW_AT_decl_column(0x0f)
     851                    
     852                            .dwattr $C$DW$T$28, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/
     853                            .dwattr $C$DW$T$28, DW_AT_decl_line(0x249)
     854                            .dwattr $C$DW$T$28, DW_AT_decl_column(0x0b)
     855                            .dwendtag $C$DW$T$28
     856                    
     857                    
     858                    $C$DW$T$29      .dwtag  DW_TAG_structure_type
     859                            .dwattr $C$DW$T$29, DW_AT_byte_size(0x02)
     860                    $C$DW$47        .dwtag  DW_TAG_member
     861                            .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$24)
     862                            .dwattr $C$DW$47, DW_AT_name("nSwBits")
     863                            .dwattr $C$DW$47, DW_AT_TI_symbol_name("nSwBits")
     864                            .dwattr $C$DW$47, DW_AT_bit_offset(0x0a)
     865                            .dwattr $C$DW$47, DW_AT_bit_size(0x06)
     866                            .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     867                            .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     868                            .dwattr $C$DW$47, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/cc
     869                            .dwattr $C$DW$47, DW_AT_decl_line(0x256)
     870                            .dwattr $C$DW$47, DW_AT_decl_column(0x10)
     871                    
     872                    $C$DW$48        .dwtag  DW_TAG_member
     873                            .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$24)
     874                            .dwattr $C$DW$48, DW_AT_name("bBitReversal")
     875                            .dwattr $C$DW$48, DW_AT_TI_symbol_name("bBitReversal")
     876                            .dwattr $C$DW$48, DW_AT_bit_offset(0x09)
     877                            .dwattr $C$DW$48, DW_AT_bit_size(0x01)
     878                            .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     879                            .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     880                            .dwattr $C$DW$48, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/cc
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:25 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{F29005E1-0F76-4F90-B1D3-F929141D604A} PAGE   17

     881                            .dwattr $C$DW$48, DW_AT_decl_line(0x257)
     882                            .dwattr $C$DW$48, DW_AT_decl_column(0x10)
     883                    
     884                    $C$DW$49        .dwtag  DW_TAG_member
     885                            .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$24)
     886                            .dwattr $C$DW$49, DW_AT_name("bMsbFirst")
     887                            .dwattr $C$DW$49, DW_AT_TI_symbol_name("bMsbFirst")
     888                            .dwattr $C$DW$49, DW_AT_bit_offset(0x08)
     889                            .dwattr $C$DW$49, DW_AT_bit_size(0x01)
     890                            .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     891                            .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     892                            .dwattr $C$DW$49, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/cc
     893                            .dwattr $C$DW$49, DW_AT_decl_line(0x259)
     894                            .dwattr $C$DW$49, DW_AT_decl_column(0x10)
     895                    
     896                    $C$DW$50        .dwtag  DW_TAG_member
     897                            .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$24)
     898                            .dwattr $C$DW$50, DW_AT_name("fecMode")
     899                            .dwattr $C$DW$50, DW_AT_TI_symbol_name("fecMode")
     900                            .dwattr $C$DW$50, DW_AT_bit_offset(0x04)
     901                            .dwattr $C$DW$50, DW_AT_bit_size(0x04)
     902                            .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     903                            .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     904                            .dwattr $C$DW$50, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/cc
     905                            .dwattr $C$DW$50, DW_AT_decl_line(0x25b)
     906                            .dwattr $C$DW$50, DW_AT_decl_column(0x10)
     907                    
     908                    $C$DW$51        .dwtag  DW_TAG_member
     909                            .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$24)
     910                            .dwattr $C$DW$51, DW_AT_name("whitenMode")
     911                            .dwattr $C$DW$51, DW_AT_TI_symbol_name("whitenMode")
     912                            .dwattr $C$DW$51, DW_AT_bit_offset(0x00)
     913                            .dwattr $C$DW$51, DW_AT_bit_size(0x03)
     914                            .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     915                            .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     916                            .dwattr $C$DW$51, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/cc
     917                            .dwattr $C$DW$51, DW_AT_decl_line(0x261)
     918                            .dwattr $C$DW$51, DW_AT_decl_column(0x10)
     919                    
     920                            .dwattr $C$DW$T$29, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/
     921                            .dwattr $C$DW$T$29, DW_AT_decl_line(0x255)
     922                            .dwattr $C$DW$T$29, DW_AT_decl_column(0x0b)
     923                            .dwendtag $C$DW$T$29
     924                    
     925                    
     926                    $C$DW$T$30      .dwtag  DW_TAG_structure_type
     927                            .dwattr $C$DW$T$30, DW_AT_byte_size(0x02)
     928                    $C$DW$52        .dwtag  DW_TAG_member
     929                            .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$24)
     930                            .dwattr $C$DW$52, DW_AT_name("frontEndMode")
     931                            .dwattr $C$DW$52, DW_AT_TI_symbol_name("frontEndMode")
     932                            .dwattr $C$DW$52, DW_AT_bit_offset(0x0d)
     933                            .dwattr $C$DW$52, DW_AT_bit_size(0x03)
     934                            .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     935                            .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:25 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{F29005E1-0F76-4F90-B1D3-F929141D604A} PAGE   18

     936                            .dwattr $C$DW$52, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/cc
     937                            .dwattr $C$DW$52, DW_AT_decl_line(0x26b)
     938                            .dwattr $C$DW$52, DW_AT_decl_column(0x10)
     939                    
     940                    $C$DW$53        .dwtag  DW_TAG_member
     941                            .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$24)
     942                            .dwattr $C$DW$53, DW_AT_name("biasMode")
     943                            .dwattr $C$DW$53, DW_AT_TI_symbol_name("biasMode")
     944                            .dwattr $C$DW$53, DW_AT_bit_offset(0x0c)
     945                            .dwattr $C$DW$53, DW_AT_bit_size(0x01)
     946                            .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     947                            .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     948                            .dwattr $C$DW$53, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/cc
     949                            .dwattr $C$DW$53, DW_AT_decl_line(0x271)
     950                            .dwattr $C$DW$53, DW_AT_decl_column(0x10)
     951                    
     952                    $C$DW$54        .dwtag  DW_TAG_member
     953                            .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$24)
     954                            .dwattr $C$DW$54, DW_AT_name("analogCfgMode")
     955                            .dwattr $C$DW$54, DW_AT_TI_symbol_name("analogCfgMode")
     956                            .dwattr $C$DW$54, DW_AT_bit_offset(0x06)
     957                            .dwattr $C$DW$54, DW_AT_bit_size(0x06)
     958                            .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     959                            .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     960                            .dwattr $C$DW$54, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/cc
     961                            .dwattr $C$DW$54, DW_AT_decl_line(0x273)
     962                            .dwattr $C$DW$54, DW_AT_decl_column(0x10)
     963                    
     964                    $C$DW$55        .dwtag  DW_TAG_member
     965                            .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$24)
     966                            .dwattr $C$DW$55, DW_AT_name("bNoFsPowerUp")
     967                            .dwattr $C$DW$55, DW_AT_TI_symbol_name("bNoFsPowerUp")
     968                            .dwattr $C$DW$55, DW_AT_bit_offset(0x05)
     969                            .dwattr $C$DW$55, DW_AT_bit_size(0x01)
     970                            .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     971                            .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     972                            .dwattr $C$DW$55, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/cc
     973                            .dwattr $C$DW$55, DW_AT_decl_line(0x27a)
     974                            .dwattr $C$DW$55, DW_AT_decl_column(0x10)
     975                    
     976                            .dwattr $C$DW$T$30, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/
     977                            .dwattr $C$DW$T$30, DW_AT_decl_line(0x26a)
     978                            .dwattr $C$DW$T$30, DW_AT_decl_column(0x0b)
     979                            .dwendtag $C$DW$T$30
     980                    
     981                    
     982                    $C$DW$T$31      .dwtag  DW_TAG_structure_type
     983                            .dwattr $C$DW$T$31, DW_AT_byte_size(0x01)
     984                    $C$DW$56        .dwtag  DW_TAG_member
     985                            .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$19)
     986                            .dwattr $C$DW$56, DW_AT_name("triggerType")
     987                            .dwattr $C$DW$56, DW_AT_TI_symbol_name("triggerType")
     988                            .dwattr $C$DW$56, DW_AT_bit_offset(0x04)
     989                            .dwattr $C$DW$56, DW_AT_bit_size(0x04)
     990                            .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:25 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{F29005E1-0F76-4F90-B1D3-F929141D604A} PAGE   19

     991                            .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     992                            .dwattr $C$DW$56, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/cc
     993                            .dwattr $C$DW$56, DW_AT_decl_line(0xe8)
     994                            .dwattr $C$DW$56, DW_AT_decl_column(0x0f)
     995                    
     996                    $C$DW$57        .dwtag  DW_TAG_member
     997                            .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$19)
     998                            .dwattr $C$DW$57, DW_AT_name("bEnaCmd")
     999                            .dwattr $C$DW$57, DW_AT_TI_symbol_name("bEnaCmd")
    1000                            .dwattr $C$DW$57, DW_AT_bit_offset(0x03)
    1001                            .dwattr $C$DW$57, DW_AT_bit_size(0x01)
    1002                            .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1003                            .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
    1004                            .dwattr $C$DW$57, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/cc
    1005                            .dwattr $C$DW$57, DW_AT_decl_line(0xe9)
    1006                            .dwattr $C$DW$57, DW_AT_decl_column(0x0f)
    1007                    
    1008                    $C$DW$58        .dwtag  DW_TAG_member
    1009                            .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$19)
    1010                            .dwattr $C$DW$58, DW_AT_name("triggerNo")
    1011                            .dwattr $C$DW$58, DW_AT_TI_symbol_name("triggerNo")
    1012                            .dwattr $C$DW$58, DW_AT_bit_offset(0x01)
    1013                            .dwattr $C$DW$58, DW_AT_bit_size(0x02)
    1014                            .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1015                            .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
    1016                            .dwattr $C$DW$58, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/cc
    1017                            .dwattr $C$DW$58, DW_AT_decl_line(0xeb)
    1018                            .dwattr $C$DW$58, DW_AT_decl_column(0x0f)
    1019                    
    1020                    $C$DW$59        .dwtag  DW_TAG_member
    1021                            .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$19)
    1022                            .dwattr $C$DW$59, DW_AT_name("pastTrig")
    1023                            .dwattr $C$DW$59, DW_AT_TI_symbol_name("pastTrig")
    1024                            .dwattr $C$DW$59, DW_AT_bit_offset(0x00)
    1025                            .dwattr $C$DW$59, DW_AT_bit_size(0x01)
    1026                            .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1027                            .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
    1028                            .dwattr $C$DW$59, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/cc
    1029                            .dwattr $C$DW$59, DW_AT_decl_line(0xec)
    1030                            .dwattr $C$DW$59, DW_AT_decl_column(0x0f)
    1031                    
    1032                            .dwattr $C$DW$T$31, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/
    1033                            .dwattr $C$DW$T$31, DW_AT_decl_line(0xe7)
    1034                            .dwattr $C$DW$T$31, DW_AT_decl_column(0x0b)
    1035                            .dwendtag $C$DW$T$31
    1036                    
    1037                    
    1038                    $C$DW$T$32      .dwtag  DW_TAG_structure_type
    1039                            .dwattr $C$DW$T$32, DW_AT_byte_size(0x01)
    1040                    $C$DW$60        .dwtag  DW_TAG_member
    1041                            .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$19)
    1042                            .dwattr $C$DW$60, DW_AT_name("rule")
    1043                            .dwattr $C$DW$60, DW_AT_TI_symbol_name("rule")
    1044                            .dwattr $C$DW$60, DW_AT_bit_offset(0x04)
    1045                            .dwattr $C$DW$60, DW_AT_bit_size(0x04)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:25 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{F29005E1-0F76-4F90-B1D3-F929141D604A} PAGE   20

    1046                            .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1047                            .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
    1048                            .dwattr $C$DW$60, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/cc
    1049                            .dwattr $C$DW$60, DW_AT_decl_line(0xf0)
    1050                            .dwattr $C$DW$60, DW_AT_decl_column(0x0f)
    1051                    
    1052                    $C$DW$61        .dwtag  DW_TAG_member
    1053                            .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$19)
    1054                            .dwattr $C$DW$61, DW_AT_name("nSkip")
    1055                            .dwattr $C$DW$61, DW_AT_TI_symbol_name("nSkip")
    1056                            .dwattr $C$DW$61, DW_AT_bit_offset(0x00)
    1057                            .dwattr $C$DW$61, DW_AT_bit_size(0x04)
    1058                            .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1059                            .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
    1060                            .dwattr $C$DW$61, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/cc
    1061                            .dwattr $C$DW$61, DW_AT_decl_line(0xf1)
    1062                            .dwattr $C$DW$61, DW_AT_decl_column(0x0f)
    1063                    
    1064                            .dwattr $C$DW$T$32, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/
    1065                            .dwattr $C$DW$T$32, DW_AT_decl_line(0xef)
    1066                            .dwattr $C$DW$T$32, DW_AT_decl_column(0x0b)
    1067                            .dwendtag $C$DW$T$32
    1068                    
    1069                    
    1070                    $C$DW$T$33      .dwtag  DW_TAG_structure_type
    1071                            .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
    1072                    $C$DW$62        .dwtag  DW_TAG_member
    1073                            .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$19)
    1074                            .dwattr $C$DW$62, DW_AT_name("bTxMode")
    1075                            .dwattr $C$DW$62, DW_AT_TI_symbol_name("bTxMode")
    1076                            .dwattr $C$DW$62, DW_AT_bit_offset(0x07)
    1077                            .dwattr $C$DW$62, DW_AT_bit_size(0x01)
    1078                            .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1079                            .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
    1080                            .dwattr $C$DW$62, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/cc
    1081                            .dwattr $C$DW$62, DW_AT_decl_line(0xf6)
    1082                            .dwattr $C$DW$62, DW_AT_decl_column(0x0f)
    1083                    
    1084                    $C$DW$63        .dwtag  DW_TAG_member
    1085                            .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$19)
    1086                            .dwattr $C$DW$63, DW_AT_name("refFreq")
    1087                            .dwattr $C$DW$63, DW_AT_TI_symbol_name("refFreq")
    1088                            .dwattr $C$DW$63, DW_AT_bit_offset(0x01)
    1089                            .dwattr $C$DW$63, DW_AT_bit_size(0x06)
    1090                            .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1091                            .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
    1092                            .dwattr $C$DW$63, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/cc
    1093                            .dwattr $C$DW$63, DW_AT_decl_line(0xf8)
    1094                            .dwattr $C$DW$63, DW_AT_decl_column(0x0f)
    1095                    
    1096                            .dwattr $C$DW$T$33, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/
    1097                            .dwattr $C$DW$T$33, DW_AT_decl_line(0xf5)
    1098                            .dwattr $C$DW$T$33, DW_AT_decl_column(0x0b)
    1099                            .dwendtag $C$DW$T$33
    1100                    
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:25 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{F29005E1-0F76-4F90-B1D3-F929141D604A} PAGE   21

    1101                    
    1102                    $C$DW$T$34      .dwtag  DW_TAG_structure_type
    1103                            .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
    1104                    $C$DW$64        .dwtag  DW_TAG_member
    1105                            .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$19)
    1106                            .dwattr $C$DW$64, DW_AT_name("triggerType")
    1107                            .dwattr $C$DW$64, DW_AT_TI_symbol_name("triggerType")
    1108                            .dwattr $C$DW$64, DW_AT_bit_offset(0x04)
    1109                            .dwattr $C$DW$64, DW_AT_bit_size(0x04)
    1110                            .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1111                            .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
    1112                            .dwattr $C$DW$64, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/cc
    1113                            .dwattr $C$DW$64, DW_AT_decl_line(0xef)
    1114                            .dwattr $C$DW$64, DW_AT_decl_column(0x0f)
    1115                    
    1116                    $C$DW$65        .dwtag  DW_TAG_member
    1117                            .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$19)
    1118                            .dwattr $C$DW$65, DW_AT_name("bEnaCmd")
    1119                            .dwattr $C$DW$65, DW_AT_TI_symbol_name("bEnaCmd")
    1120                            .dwattr $C$DW$65, DW_AT_bit_offset(0x03)
    1121                            .dwattr $C$DW$65, DW_AT_bit_size(0x01)
    1122                            .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1123                            .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
    1124                            .dwattr $C$DW$65, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/cc
    1125                            .dwattr $C$DW$65, DW_AT_decl_line(0xf0)
    1126                            .dwattr $C$DW$65, DW_AT_decl_column(0x0f)
    1127                    
    1128                    $C$DW$66        .dwtag  DW_TAG_member
    1129                            .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$19)
    1130                            .dwattr $C$DW$66, DW_AT_name("triggerNo")
    1131                            .dwattr $C$DW$66, DW_AT_TI_symbol_name("triggerNo")
    1132                            .dwattr $C$DW$66, DW_AT_bit_offset(0x01)
    1133                            .dwattr $C$DW$66, DW_AT_bit_size(0x02)
    1134                            .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1135                            .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
    1136                            .dwattr $C$DW$66, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/cc
    1137                            .dwattr $C$DW$66, DW_AT_decl_line(0xf2)
    1138                            .dwattr $C$DW$66, DW_AT_decl_column(0x0f)
    1139                    
    1140                    $C$DW$67        .dwtag  DW_TAG_member
    1141                            .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$19)
    1142                            .dwattr $C$DW$67, DW_AT_name("pastTrig")
    1143                            .dwattr $C$DW$67, DW_AT_TI_symbol_name("pastTrig")
    1144                            .dwattr $C$DW$67, DW_AT_bit_offset(0x00)
    1145                            .dwattr $C$DW$67, DW_AT_bit_size(0x01)
    1146                            .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1147                            .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
    1148                            .dwattr $C$DW$67, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/cc
    1149                            .dwattr $C$DW$67, DW_AT_decl_line(0xf3)
    1150                            .dwattr $C$DW$67, DW_AT_decl_column(0x0f)
    1151                    
    1152                            .dwattr $C$DW$T$34, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/
    1153                            .dwattr $C$DW$T$34, DW_AT_decl_line(0xee)
    1154                            .dwattr $C$DW$T$34, DW_AT_decl_column(0x0b)
    1155                            .dwendtag $C$DW$T$34
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:25 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{F29005E1-0F76-4F90-B1D3-F929141D604A} PAGE   22

    1156                    
    1157                    
    1158                    $C$DW$T$35      .dwtag  DW_TAG_structure_type
    1159                            .dwattr $C$DW$T$35, DW_AT_byte_size(0x01)
    1160                    $C$DW$68        .dwtag  DW_TAG_member
    1161                            .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$19)
    1162                            .dwattr $C$DW$68, DW_AT_name("rule")
    1163                            .dwattr $C$DW$68, DW_AT_TI_symbol_name("rule")
    1164                            .dwattr $C$DW$68, DW_AT_bit_offset(0x04)
    1165                            .dwattr $C$DW$68, DW_AT_bit_size(0x04)
    1166                            .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1167                            .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
    1168                            .dwattr $C$DW$68, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/cc
    1169                            .dwattr $C$DW$68, DW_AT_decl_line(0xf7)
    1170                            .dwattr $C$DW$68, DW_AT_decl_column(0x0f)
    1171                    
    1172                    $C$DW$69        .dwtag  DW_TAG_member
    1173                            .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$19)
    1174                            .dwattr $C$DW$69, DW_AT_name("nSkip")
    1175                            .dwattr $C$DW$69, DW_AT_TI_symbol_name("nSkip")
    1176                            .dwattr $C$DW$69, DW_AT_bit_offset(0x00)
    1177                            .dwattr $C$DW$69, DW_AT_bit_size(0x04)
    1178                            .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1179                            .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
    1180                            .dwattr $C$DW$69, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/cc
    1181                            .dwattr $C$DW$69, DW_AT_decl_line(0xf8)
    1182                            .dwattr $C$DW$69, DW_AT_decl_column(0x0f)
    1183                    
    1184                            .dwattr $C$DW$T$35, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/
    1185                            .dwattr $C$DW$T$35, DW_AT_decl_line(0xf6)
    1186                            .dwattr $C$DW$T$35, DW_AT_decl_column(0x0b)
    1187                            .dwendtag $C$DW$T$35
    1188                    
    1189                    
    1190                    $C$DW$T$36      .dwtag  DW_TAG_structure_type
    1191                            .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
    1192                    $C$DW$70        .dwtag  DW_TAG_member
    1193                            .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$19)
    1194                            .dwattr $C$DW$70, DW_AT_name("bFsOff")
    1195                            .dwattr $C$DW$70, DW_AT_TI_symbol_name("bFsOff")
    1196                            .dwattr $C$DW$70, DW_AT_bit_offset(0x07)
    1197                            .dwattr $C$DW$70, DW_AT_bit_size(0x01)
    1198                            .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1199                            .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
    1200                            .dwattr $C$DW$70, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/cc
    1201                            .dwattr $C$DW$70, DW_AT_decl_line(0xfb)
    1202                            .dwattr $C$DW$70, DW_AT_decl_column(0x0f)
    1203                    
    1204                    $C$DW$71        .dwtag  DW_TAG_member
    1205                            .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$19)
    1206                            .dwattr $C$DW$71, DW_AT_name("bUseCrc")
    1207                            .dwattr $C$DW$71, DW_AT_TI_symbol_name("bUseCrc")
    1208                            .dwattr $C$DW$71, DW_AT_bit_offset(0x04)
    1209                            .dwattr $C$DW$71, DW_AT_bit_size(0x01)
    1210                            .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:25 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{F29005E1-0F76-4F90-B1D3-F929141D604A} PAGE   23

    1211                            .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
    1212                            .dwattr $C$DW$71, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/cc
    1213                            .dwattr $C$DW$71, DW_AT_decl_line(0xfe)
    1214                            .dwattr $C$DW$71, DW_AT_decl_column(0x0f)
    1215                    
    1216                    $C$DW$72        .dwtag  DW_TAG_member
    1217                            .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$19)
    1218                            .dwattr $C$DW$72, DW_AT_name("bCrcIncSw")
    1219                            .dwattr $C$DW$72, DW_AT_TI_symbol_name("bCrcIncSw")
    1220                            .dwattr $C$DW$72, DW_AT_bit_offset(0x03)
    1221                            .dwattr $C$DW$72, DW_AT_bit_size(0x01)
    1222                            .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1223                            .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
    1224                            .dwattr $C$DW$72, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/cc
    1225                            .dwattr $C$DW$72, DW_AT_decl_line(0x100)
    1226                            .dwattr $C$DW$72, DW_AT_decl_column(0x0f)
    1227                    
    1228                    $C$DW$73        .dwtag  DW_TAG_member
    1229                            .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$19)
    1230                            .dwattr $C$DW$73, DW_AT_name("bCrcIncHdr")
    1231                            .dwattr $C$DW$73, DW_AT_TI_symbol_name("bCrcIncHdr")
    1232                            .dwattr $C$DW$73, DW_AT_bit_offset(0x02)
    1233                            .dwattr $C$DW$73, DW_AT_bit_size(0x01)
    1234                            .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1235                            .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
    1236                            .dwattr $C$DW$73, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/cc
    1237                            .dwattr $C$DW$73, DW_AT_decl_line(0x102)
    1238                            .dwattr $C$DW$73, DW_AT_decl_column(0x0f)
    1239                    
    1240                            .dwattr $C$DW$T$36, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/
    1241                            .dwattr $C$DW$T$36, DW_AT_decl_line(0xfa)
    1242                            .dwattr $C$DW$T$36, DW_AT_decl_column(0x0b)
    1243                            .dwendtag $C$DW$T$36
    1244                    
    1245                    
    1246                    $C$DW$T$37      .dwtag  DW_TAG_structure_type
    1247                            .dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
    1248                    $C$DW$74        .dwtag  DW_TAG_member
    1249                            .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$19)
    1250                            .dwattr $C$DW$74, DW_AT_name("bExtTxTrig")
    1251                            .dwattr $C$DW$74, DW_AT_TI_symbol_name("bExtTxTrig")
    1252                            .dwattr $C$DW$74, DW_AT_bit_offset(0x07)
    1253                            .dwattr $C$DW$74, DW_AT_bit_size(0x01)
    1254                            .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1255                            .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
    1256                            .dwattr $C$DW$74, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/cc
    1257                            .dwattr $C$DW$74, DW_AT_decl_line(0x108)
    1258                            .dwattr $C$DW$74, DW_AT_decl_column(0x0f)
    1259                    
    1260                    $C$DW$75        .dwtag  DW_TAG_member
    1261                            .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$19)
    1262                            .dwattr $C$DW$75, DW_AT_name("inputMode")
    1263                            .dwattr $C$DW$75, DW_AT_TI_symbol_name("inputMode")
    1264                            .dwattr $C$DW$75, DW_AT_bit_offset(0x05)
    1265                            .dwattr $C$DW$75, DW_AT_bit_size(0x02)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:25 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{F29005E1-0F76-4F90-B1D3-F929141D604A} PAGE   24

    1266                            .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1267                            .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
    1268                            .dwattr $C$DW$75, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/cc
    1269                            .dwattr $C$DW$75, DW_AT_decl_line(0x10a)
    1270                            .dwattr $C$DW$75, DW_AT_decl_column(0x0f)
    1271                    
    1272                    $C$DW$76        .dwtag  DW_TAG_member
    1273                            .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$19)
    1274                            .dwattr $C$DW$76, DW_AT_name("source")
    1275                            .dwattr $C$DW$76, DW_AT_TI_symbol_name("source")
    1276                            .dwattr $C$DW$76, DW_AT_bit_offset(0x00)
    1277                            .dwattr $C$DW$76, DW_AT_bit_size(0x05)
    1278                            .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1279                            .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1280                            .dwattr $C$DW$76, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/cc
    1281                            .dwattr $C$DW$76, DW_AT_decl_line(0x10f)
    1282                            .dwattr $C$DW$76, DW_AT_decl_column(0x0f)
    1283                    
    1284                            .dwattr $C$DW$T$37, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/
    1285                            .dwattr $C$DW$T$37, DW_AT_decl_line(0x107)
    1286                            .dwattr $C$DW$T$37, DW_AT_decl_column(0x0b)
    1287                            .dwendtag $C$DW$T$37
    1288                    
    1289                    
    1290                    $C$DW$T$38      .dwtag  DW_TAG_structure_type
    1291                            .dwattr $C$DW$T$38, DW_AT_byte_size(0x01)
    1292                    $C$DW$77        .dwtag  DW_TAG_member
    1293                            .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$19)
    1294                            .dwattr $C$DW$77, DW_AT_name("triggerType")
    1295                            .dwattr $C$DW$77, DW_AT_TI_symbol_name("triggerType")
    1296                            .dwattr $C$DW$77, DW_AT_bit_offset(0x04)
    1297                            .dwattr $C$DW$77, DW_AT_bit_size(0x04)
    1298                            .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1299                            .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1300                            .dwattr $C$DW$77, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/cc
    1301                            .dwattr $C$DW$77, DW_AT_decl_line(0x112)
    1302                            .dwattr $C$DW$77, DW_AT_decl_column(0x0f)
    1303                    
    1304                    $C$DW$78        .dwtag  DW_TAG_member
    1305                            .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$19)
    1306                            .dwattr $C$DW$78, DW_AT_name("bEnaCmd")
    1307                            .dwattr $C$DW$78, DW_AT_TI_symbol_name("bEnaCmd")
    1308                            .dwattr $C$DW$78, DW_AT_bit_offset(0x03)
    1309                            .dwattr $C$DW$78, DW_AT_bit_size(0x01)
    1310                            .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1311                            .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1312                            .dwattr $C$DW$78, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/cc
    1313                            .dwattr $C$DW$78, DW_AT_decl_line(0x113)
    1314                            .dwattr $C$DW$78, DW_AT_decl_column(0x0f)
    1315                    
    1316                    $C$DW$79        .dwtag  DW_TAG_member
    1317                            .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$19)
    1318                            .dwattr $C$DW$79, DW_AT_name("triggerNo")
    1319                            .dwattr $C$DW$79, DW_AT_TI_symbol_name("triggerNo")
    1320                            .dwattr $C$DW$79, DW_AT_bit_offset(0x01)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:25 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{F29005E1-0F76-4F90-B1D3-F929141D604A} PAGE   25

    1321                            .dwattr $C$DW$79, DW_AT_bit_size(0x02)
    1322                            .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1323                            .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1324                            .dwattr $C$DW$79, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/cc
    1325                            .dwattr $C$DW$79, DW_AT_decl_line(0x115)
    1326                            .dwattr $C$DW$79, DW_AT_decl_column(0x0f)
    1327                    
    1328                    $C$DW$80        .dwtag  DW_TAG_member
    1329                            .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$19)
    1330                            .dwattr $C$DW$80, DW_AT_name("pastTrig")
    1331                            .dwattr $C$DW$80, DW_AT_TI_symbol_name("pastTrig")
    1332                            .dwattr $C$DW$80, DW_AT_bit_offset(0x00)
    1333                            .dwattr $C$DW$80, DW_AT_bit_size(0x01)
    1334                            .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1335                            .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1336                            .dwattr $C$DW$80, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/cc
    1337                            .dwattr $C$DW$80, DW_AT_decl_line(0x116)
    1338                            .dwattr $C$DW$80, DW_AT_decl_column(0x0f)
    1339                    
    1340                            .dwattr $C$DW$T$38, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/
    1341                            .dwattr $C$DW$T$38, DW_AT_decl_line(0x111)
    1342                            .dwattr $C$DW$T$38, DW_AT_decl_column(0x0b)
    1343                            .dwendtag $C$DW$T$38
    1344                    
    1345                    
    1346                    $C$DW$T$39      .dwtag  DW_TAG_structure_type
    1347                            .dwattr $C$DW$T$39, DW_AT_byte_size(0x01)
    1348                    $C$DW$81        .dwtag  DW_TAG_member
    1349                            .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$19)
    1350                            .dwattr $C$DW$81, DW_AT_name("triggerType")
    1351                            .dwattr $C$DW$81, DW_AT_TI_symbol_name("triggerType")
    1352                            .dwattr $C$DW$81, DW_AT_bit_offset(0x04)
    1353                            .dwattr $C$DW$81, DW_AT_bit_size(0x04)
    1354                            .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1355                            .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1356                            .dwattr $C$DW$81, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/cc
    1357                            .dwattr $C$DW$81, DW_AT_decl_line(0x185)
    1358                            .dwattr $C$DW$81, DW_AT_decl_column(0x0f)
    1359                    
    1360                    $C$DW$82        .dwtag  DW_TAG_member
    1361                            .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$19)
    1362                            .dwattr $C$DW$82, DW_AT_name("bEnaCmd")
    1363                            .dwattr $C$DW$82, DW_AT_TI_symbol_name("bEnaCmd")
    1364                            .dwattr $C$DW$82, DW_AT_bit_offset(0x03)
    1365                            .dwattr $C$DW$82, DW_AT_bit_size(0x01)
    1366                            .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1367                            .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1368                            .dwattr $C$DW$82, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/cc
    1369                            .dwattr $C$DW$82, DW_AT_decl_line(0x186)
    1370                            .dwattr $C$DW$82, DW_AT_decl_column(0x0f)
    1371                    
    1372                    $C$DW$83        .dwtag  DW_TAG_member
    1373                            .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$19)
    1374                            .dwattr $C$DW$83, DW_AT_name("triggerNo")
    1375                            .dwattr $C$DW$83, DW_AT_TI_symbol_name("triggerNo")
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:25 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{F29005E1-0F76-4F90-B1D3-F929141D604A} PAGE   26

    1376                            .dwattr $C$DW$83, DW_AT_bit_offset(0x01)
    1377                            .dwattr $C$DW$83, DW_AT_bit_size(0x02)
    1378                            .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1379                            .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1380                            .dwattr $C$DW$83, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/cc
    1381                            .dwattr $C$DW$83, DW_AT_decl_line(0x188)
    1382                            .dwattr $C$DW$83, DW_AT_decl_column(0x0f)
    1383                    
    1384                    $C$DW$84        .dwtag  DW_TAG_member
    1385                            .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$19)
    1386                            .dwattr $C$DW$84, DW_AT_name("pastTrig")
    1387                            .dwattr $C$DW$84, DW_AT_TI_symbol_name("pastTrig")
    1388                            .dwattr $C$DW$84, DW_AT_bit_offset(0x00)
    1389                            .dwattr $C$DW$84, DW_AT_bit_size(0x01)
    1390                            .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1391                            .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1392                            .dwattr $C$DW$84, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/cc
    1393                            .dwattr $C$DW$84, DW_AT_decl_line(0x189)
    1394                            .dwattr $C$DW$84, DW_AT_decl_column(0x0f)
    1395                    
    1396                            .dwattr $C$DW$T$39, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/
    1397                            .dwattr $C$DW$T$39, DW_AT_decl_line(0x184)
    1398                            .dwattr $C$DW$T$39, DW_AT_decl_column(0x0b)
    1399                            .dwendtag $C$DW$T$39
    1400                    
    1401                    
    1402                    $C$DW$T$40      .dwtag  DW_TAG_structure_type
    1403                            .dwattr $C$DW$T$40, DW_AT_byte_size(0x01)
    1404                    $C$DW$85        .dwtag  DW_TAG_member
    1405                            .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$19)
    1406                            .dwattr $C$DW$85, DW_AT_name("rule")
    1407                            .dwattr $C$DW$85, DW_AT_TI_symbol_name("rule")
    1408                            .dwattr $C$DW$85, DW_AT_bit_offset(0x04)
    1409                            .dwattr $C$DW$85, DW_AT_bit_size(0x04)
    1410                            .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1411                            .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1412                            .dwattr $C$DW$85, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/cc
    1413                            .dwattr $C$DW$85, DW_AT_decl_line(0x18d)
    1414                            .dwattr $C$DW$85, DW_AT_decl_column(0x0f)
    1415                    
    1416                    $C$DW$86        .dwtag  DW_TAG_member
    1417                            .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$19)
    1418                            .dwattr $C$DW$86, DW_AT_name("nSkip")
    1419                            .dwattr $C$DW$86, DW_AT_TI_symbol_name("nSkip")
    1420                            .dwattr $C$DW$86, DW_AT_bit_offset(0x00)
    1421                            .dwattr $C$DW$86, DW_AT_bit_size(0x04)
    1422                            .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1423                            .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1424                            .dwattr $C$DW$86, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/cc
    1425                            .dwattr $C$DW$86, DW_AT_decl_line(0x18e)
    1426                            .dwattr $C$DW$86, DW_AT_decl_column(0x0f)
    1427                    
    1428                            .dwattr $C$DW$T$40, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/
    1429                            .dwattr $C$DW$T$40, DW_AT_decl_line(0x18c)
    1430                            .dwattr $C$DW$T$40, DW_AT_decl_column(0x0b)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:25 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{F29005E1-0F76-4F90-B1D3-F929141D604A} PAGE   27

    1431                            .dwendtag $C$DW$T$40
    1432                    
    1433                    
    1434                    $C$DW$T$41      .dwtag  DW_TAG_structure_type
    1435                            .dwattr $C$DW$T$41, DW_AT_byte_size(0x01)
    1436                    $C$DW$87        .dwtag  DW_TAG_member
    1437                            .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$19)
    1438                            .dwattr $C$DW$87, DW_AT_name("bFsOffIdle")
    1439                            .dwattr $C$DW$87, DW_AT_TI_symbol_name("bFsOffIdle")
    1440                            .dwattr $C$DW$87, DW_AT_bit_offset(0x07)
    1441                            .dwattr $C$DW$87, DW_AT_bit_size(0x01)
    1442                            .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1443                            .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1444                            .dwattr $C$DW$87, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/cc
    1445                            .dwattr $C$DW$87, DW_AT_decl_line(0x191)
    1446                            .dwattr $C$DW$87, DW_AT_decl_column(0x0f)
    1447                    
    1448                    $C$DW$88        .dwtag  DW_TAG_member
    1449                            .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$19)
    1450                            .dwattr $C$DW$88, DW_AT_name("bFsOffBusy")
    1451                            .dwattr $C$DW$88, DW_AT_TI_symbol_name("bFsOffBusy")
    1452                            .dwattr $C$DW$88, DW_AT_bit_offset(0x06)
    1453                            .dwattr $C$DW$88, DW_AT_bit_size(0x01)
    1454                            .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1455                            .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1456                            .dwattr $C$DW$88, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/cc
    1457                            .dwattr $C$DW$88, DW_AT_decl_line(0x193)
    1458                            .dwattr $C$DW$88, DW_AT_decl_column(0x0f)
    1459                    
    1460                            .dwattr $C$DW$T$41, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/
    1461                            .dwattr $C$DW$T$41, DW_AT_decl_line(0x190)
    1462                            .dwattr $C$DW$T$41, DW_AT_decl_column(0x0b)
    1463                            .dwendtag $C$DW$T$41
    1464                    
    1465                    
    1466                    $C$DW$T$42      .dwtag  DW_TAG_structure_type
    1467                            .dwattr $C$DW$T$42, DW_AT_byte_size(0x01)
    1468                    $C$DW$89        .dwtag  DW_TAG_member
    1469                            .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$19)
    1470                            .dwattr $C$DW$89, DW_AT_name("bEnaRssi")
    1471                            .dwattr $C$DW$89, DW_AT_TI_symbol_name("bEnaRssi")
    1472                            .dwattr $C$DW$89, DW_AT_bit_offset(0x07)
    1473                            .dwattr $C$DW$89, DW_AT_bit_size(0x01)
    1474                            .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1475                            .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1476                            .dwattr $C$DW$89, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/cc
    1477                            .dwattr $C$DW$89, DW_AT_decl_line(0x198)
    1478                            .dwattr $C$DW$89, DW_AT_decl_column(0x0f)
    1479                    
    1480                    $C$DW$90        .dwtag  DW_TAG_member
    1481                            .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$19)
    1482                            .dwattr $C$DW$90, DW_AT_name("bEnaCorr")
    1483                            .dwattr $C$DW$90, DW_AT_TI_symbol_name("bEnaCorr")
    1484                            .dwattr $C$DW$90, DW_AT_bit_offset(0x06)
    1485                            .dwattr $C$DW$90, DW_AT_bit_size(0x01)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:25 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{F29005E1-0F76-4F90-B1D3-F929141D604A} PAGE   28

    1486                            .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1487                            .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1488                            .dwattr $C$DW$90, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/cc
    1489                            .dwattr $C$DW$90, DW_AT_decl_line(0x199)
    1490                            .dwattr $C$DW$90, DW_AT_decl_column(0x0f)
    1491                    
    1492                    $C$DW$91        .dwtag  DW_TAG_member
    1493                            .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$19)
    1494                            .dwattr $C$DW$91, DW_AT_name("operation")
    1495                            .dwattr $C$DW$91, DW_AT_TI_symbol_name("operation")
    1496                            .dwattr $C$DW$91, DW_AT_bit_offset(0x05)
    1497                            .dwattr $C$DW$91, DW_AT_bit_size(0x01)
    1498                            .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1499                            .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1500                            .dwattr $C$DW$91, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/cc
    1501                            .dwattr $C$DW$91, DW_AT_decl_line(0x19a)
    1502                            .dwattr $C$DW$91, DW_AT_decl_column(0x0f)
    1503                    
    1504                    $C$DW$92        .dwtag  DW_TAG_member
    1505                            .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$19)
    1506                            .dwattr $C$DW$92, DW_AT_name("busyOp")
    1507                            .dwattr $C$DW$92, DW_AT_TI_symbol_name("busyOp")
    1508                            .dwattr $C$DW$92, DW_AT_bit_offset(0x04)
    1509                            .dwattr $C$DW$92, DW_AT_bit_size(0x01)
    1510                            .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1511                            .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1512                            .dwattr $C$DW$92, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/cc
    1513                            .dwattr $C$DW$92, DW_AT_decl_line(0x19c)
    1514                            .dwattr $C$DW$92, DW_AT_decl_column(0x0f)
    1515                    
    1516                    $C$DW$93        .dwtag  DW_TAG_member
    1517                            .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$19)
    1518                            .dwattr $C$DW$93, DW_AT_name("idleOp")
    1519                            .dwattr $C$DW$93, DW_AT_TI_symbol_name("idleOp")
    1520                            .dwattr $C$DW$93, DW_AT_bit_offset(0x03)
    1521                            .dwattr $C$DW$93, DW_AT_bit_size(0x01)
    1522                            .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1523                            .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1524                            .dwattr $C$DW$93, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/cc
    1525                            .dwattr $C$DW$93, DW_AT_decl_line(0x19f)
    1526                            .dwattr $C$DW$93, DW_AT_decl_column(0x0f)
    1527                    
    1528                    $C$DW$94        .dwtag  DW_TAG_member
    1529                            .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$19)
    1530                            .dwattr $C$DW$94, DW_AT_name("timeoutRes")
    1531                            .dwattr $C$DW$94, DW_AT_TI_symbol_name("timeoutRes")
    1532                            .dwattr $C$DW$94, DW_AT_bit_offset(0x02)
    1533                            .dwattr $C$DW$94, DW_AT_bit_size(0x01)
    1534                            .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1535                            .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1536                            .dwattr $C$DW$94, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/cc
    1537                            .dwattr $C$DW$94, DW_AT_decl_line(0x1a1)
    1538                            .dwattr $C$DW$94, DW_AT_decl_column(0x0f)
    1539                    
    1540                            .dwattr $C$DW$T$42, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:25 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{F29005E1-0F76-4F90-B1D3-F929141D604A} PAGE   29

    1541                            .dwattr $C$DW$T$42, DW_AT_decl_line(0x197)
    1542                            .dwattr $C$DW$T$42, DW_AT_decl_column(0x0b)
    1543                            .dwendtag $C$DW$T$42
    1544                    
    1545                    
    1546                    $C$DW$T$43      .dwtag  DW_TAG_structure_type
    1547                            .dwattr $C$DW$T$43, DW_AT_byte_size(0x01)
    1548                    $C$DW$95        .dwtag  DW_TAG_member
    1549                            .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$19)
    1550                            .dwattr $C$DW$95, DW_AT_name("numCorrInv")
    1551                            .dwattr $C$DW$95, DW_AT_TI_symbol_name("numCorrInv")
    1552                            .dwattr $C$DW$95, DW_AT_bit_offset(0x04)
    1553                            .dwattr $C$DW$95, DW_AT_bit_size(0x04)
    1554                            .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1555                            .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1556                            .dwattr $C$DW$95, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/cc
    1557                            .dwattr $C$DW$95, DW_AT_decl_line(0x1ab)
    1558                            .dwattr $C$DW$95, DW_AT_decl_column(0x0f)
    1559                    
    1560                    $C$DW$96        .dwtag  DW_TAG_member
    1561                            .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$19)
    1562                            .dwattr $C$DW$96, DW_AT_name("numCorrBusy")
    1563                            .dwattr $C$DW$96, DW_AT_TI_symbol_name("numCorrBusy")
    1564                            .dwattr $C$DW$96, DW_AT_bit_offset(0x00)
    1565                            .dwattr $C$DW$96, DW_AT_bit_size(0x04)
    1566                            .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1567                            .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1568                            .dwattr $C$DW$96, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/cc
    1569                            .dwattr $C$DW$96, DW_AT_decl_line(0x1ad)
    1570                            .dwattr $C$DW$96, DW_AT_decl_column(0x0f)
    1571                    
    1572                            .dwattr $C$DW$T$43, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/
    1573                            .dwattr $C$DW$T$43, DW_AT_decl_line(0x1aa)
    1574                            .dwattr $C$DW$T$43, DW_AT_decl_column(0x0b)
    1575                            .dwendtag $C$DW$T$43
    1576                    
    1577                    
    1578                    $C$DW$T$44      .dwtag  DW_TAG_structure_type
    1579                            .dwattr $C$DW$T$44, DW_AT_byte_size(0x01)
    1580                    $C$DW$97        .dwtag  DW_TAG_member
    1581                            .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$19)
    1582                            .dwattr $C$DW$97, DW_AT_name("triggerType")
    1583                            .dwattr $C$DW$97, DW_AT_TI_symbol_name("triggerType")
    1584                            .dwattr $C$DW$97, DW_AT_bit_offset(0x04)
    1585                            .dwattr $C$DW$97, DW_AT_bit_size(0x04)
    1586                            .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1587                            .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1588                            .dwattr $C$DW$97, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/cc
    1589                            .dwattr $C$DW$97, DW_AT_decl_line(0x1b1)
    1590                            .dwattr $C$DW$97, DW_AT_decl_column(0x0f)
    1591                    
    1592                    $C$DW$98        .dwtag  DW_TAG_member
    1593                            .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$19)
    1594                            .dwattr $C$DW$98, DW_AT_name("bEnaCmd")
    1595                            .dwattr $C$DW$98, DW_AT_TI_symbol_name("bEnaCmd")
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:25 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{F29005E1-0F76-4F90-B1D3-F929141D604A} PAGE   30

    1596                            .dwattr $C$DW$98, DW_AT_bit_offset(0x03)
    1597                            .dwattr $C$DW$98, DW_AT_bit_size(0x01)
    1598                            .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1599                            .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1600                            .dwattr $C$DW$98, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/cc
    1601                            .dwattr $C$DW$98, DW_AT_decl_line(0x1b2)
    1602                            .dwattr $C$DW$98, DW_AT_decl_column(0x0f)
    1603                    
    1604                    $C$DW$99        .dwtag  DW_TAG_member
    1605                            .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$19)
    1606                            .dwattr $C$DW$99, DW_AT_name("triggerNo")
    1607                            .dwattr $C$DW$99, DW_AT_TI_symbol_name("triggerNo")
    1608                            .dwattr $C$DW$99, DW_AT_bit_offset(0x01)
    1609                            .dwattr $C$DW$99, DW_AT_bit_size(0x02)
    1610                            .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1611                            .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1612                            .dwattr $C$DW$99, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/cc
    1613                            .dwattr $C$DW$99, DW_AT_decl_line(0x1b4)
    1614                            .dwattr $C$DW$99, DW_AT_decl_column(0x0f)
    1615                    
    1616                    $C$DW$100       .dwtag  DW_TAG_member
    1617                            .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$19)
    1618                            .dwattr $C$DW$100, DW_AT_name("pastTrig")
    1619                            .dwattr $C$DW$100, DW_AT_TI_symbol_name("pastTrig")
    1620                            .dwattr $C$DW$100, DW_AT_bit_offset(0x00)
    1621                            .dwattr $C$DW$100, DW_AT_bit_size(0x01)
    1622                            .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1623                            .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1624                            .dwattr $C$DW$100, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    1625                            .dwattr $C$DW$100, DW_AT_decl_line(0x1b5)
    1626                            .dwattr $C$DW$100, DW_AT_decl_column(0x0f)
    1627                    
    1628                            .dwattr $C$DW$T$44, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/
    1629                            .dwattr $C$DW$T$44, DW_AT_decl_line(0x1b0)
    1630                            .dwattr $C$DW$T$44, DW_AT_decl_column(0x0b)
    1631                            .dwendtag $C$DW$T$44
    1632                    
    1633                    
    1634                    $C$DW$T$45      .dwtag  DW_TAG_structure_type
    1635                            .dwattr $C$DW$T$45, DW_AT_byte_size(0x01)
    1636                    $C$DW$101       .dwtag  DW_TAG_member
    1637                            .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$19)
    1638                            .dwattr $C$DW$101, DW_AT_name("triggerType")
    1639                            .dwattr $C$DW$101, DW_AT_TI_symbol_name("triggerType")
    1640                            .dwattr $C$DW$101, DW_AT_bit_offset(0x04)
    1641                            .dwattr $C$DW$101, DW_AT_bit_size(0x04)
    1642                            .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1643                            .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1644                            .dwattr $C$DW$101, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    1645                            .dwattr $C$DW$101, DW_AT_decl_line(0x12f)
    1646                            .dwattr $C$DW$101, DW_AT_decl_column(0x0f)
    1647                    
    1648                    $C$DW$102       .dwtag  DW_TAG_member
    1649                            .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$19)
    1650                            .dwattr $C$DW$102, DW_AT_name("bEnaCmd")
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:25 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{F29005E1-0F76-4F90-B1D3-F929141D604A} PAGE   31

    1651                            .dwattr $C$DW$102, DW_AT_TI_symbol_name("bEnaCmd")
    1652                            .dwattr $C$DW$102, DW_AT_bit_offset(0x03)
    1653                            .dwattr $C$DW$102, DW_AT_bit_size(0x01)
    1654                            .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1655                            .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1656                            .dwattr $C$DW$102, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    1657                            .dwattr $C$DW$102, DW_AT_decl_line(0x130)
    1658                            .dwattr $C$DW$102, DW_AT_decl_column(0x0f)
    1659                    
    1660                    $C$DW$103       .dwtag  DW_TAG_member
    1661                            .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$19)
    1662                            .dwattr $C$DW$103, DW_AT_name("triggerNo")
    1663                            .dwattr $C$DW$103, DW_AT_TI_symbol_name("triggerNo")
    1664                            .dwattr $C$DW$103, DW_AT_bit_offset(0x01)
    1665                            .dwattr $C$DW$103, DW_AT_bit_size(0x02)
    1666                            .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1667                            .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1668                            .dwattr $C$DW$103, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    1669                            .dwattr $C$DW$103, DW_AT_decl_line(0x132)
    1670                            .dwattr $C$DW$103, DW_AT_decl_column(0x0f)
    1671                    
    1672                    $C$DW$104       .dwtag  DW_TAG_member
    1673                            .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$19)
    1674                            .dwattr $C$DW$104, DW_AT_name("pastTrig")
    1675                            .dwattr $C$DW$104, DW_AT_TI_symbol_name("pastTrig")
    1676                            .dwattr $C$DW$104, DW_AT_bit_offset(0x00)
    1677                            .dwattr $C$DW$104, DW_AT_bit_size(0x01)
    1678                            .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1679                            .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1680                            .dwattr $C$DW$104, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    1681                            .dwattr $C$DW$104, DW_AT_decl_line(0x133)
    1682                            .dwattr $C$DW$104, DW_AT_decl_column(0x0f)
    1683                    
    1684                            .dwattr $C$DW$T$45, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/
    1685                            .dwattr $C$DW$T$45, DW_AT_decl_line(0x12e)
    1686                            .dwattr $C$DW$T$45, DW_AT_decl_column(0x0b)
    1687                            .dwendtag $C$DW$T$45
    1688                    
    1689                    
    1690                    $C$DW$T$46      .dwtag  DW_TAG_structure_type
    1691                            .dwattr $C$DW$T$46, DW_AT_byte_size(0x01)
    1692                    $C$DW$105       .dwtag  DW_TAG_member
    1693                            .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$19)
    1694                            .dwattr $C$DW$105, DW_AT_name("rule")
    1695                            .dwattr $C$DW$105, DW_AT_TI_symbol_name("rule")
    1696                            .dwattr $C$DW$105, DW_AT_bit_offset(0x04)
    1697                            .dwattr $C$DW$105, DW_AT_bit_size(0x04)
    1698                            .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1699                            .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1700                            .dwattr $C$DW$105, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    1701                            .dwattr $C$DW$105, DW_AT_decl_line(0x137)
