TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:25 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{5D65ECDE-4882-4DA3-96F9-CCC8C19D381F} PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                        PC v16.9.4.LTS *
       3                    ;* Date/Time created: Sat Nov 18 18:46:24 2017                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../Application/MAC/HighLevel/mac_security_pib.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v16.9.4.LTS Copyright (c) 1996-20
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Kevin\workspace_v7\sensor_cc1310lp\sensor_cc1310lp"
      13                    
      14                    $C$DW$1 .dwtag  DW_TAG_subprogram

    4900                            .dwattr $C$DW$T$559, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154st
    4901                            .dwattr $C$DW$T$559, DW_AT_decl_line(0x9f)
    4902                            .dwattr $C$DW$T$559, DW_AT_decl_column(0x01)
    4903                            .dwendtag $C$DW$T$559
    4904                    
    4905                    
    4906                    $C$DW$T$560     .dwtag  DW_TAG_enumeration_type
    4907                            .dwattr $C$DW$T$560, DW_AT_byte_size(0x01)
    4908                    $C$DW$448       .dwtag  DW_TAG_enumerator
    4909                            .dwattr $C$DW$448, DW_AT_name("MAC_FEAT_DEVICE")
    4910                            .dwattr $C$DW$448, DW_AT_const_value(0x00)
    4911                            .dwattr $C$DW$448, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    4912                            .dwattr $C$DW$448, DW_AT_decl_line(0x103)
    4913                            .dwattr $C$DW$448, DW_AT_decl_column(0x03)
    4914                    
    4915                    $C$DW$449       .dwtag  DW_TAG_enumerator
    4916                            .dwattr $C$DW$449, DW_AT_name("MAC_FEAT_COORD")
    4917                            .dwattr $C$DW$449, DW_AT_const_value(0x01)
    4918                            .dwattr $C$DW$449, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    4919                            .dwattr $C$DW$449, DW_AT_decl_line(0x104)
    4920                            .dwattr $C$DW$449, DW_AT_decl_column(0x03)
    4921                    
    4922                    $C$DW$450       .dwtag  DW_TAG_enumerator
    4923                            .dwattr $C$DW$450, DW_AT_name("MAC_FEAT_SECURITY")
    4924                            .dwattr $C$DW$450, DW_AT_const_value(0x02)
    4925                            .dwattr $C$DW$450, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    4926                            .dwattr $C$DW$450, DW_AT_decl_line(0x105)
    4927                            .dwattr $C$DW$450, DW_AT_decl_column(0x03)
    4928                    
    4929                    $C$DW$451       .dwtag  DW_TAG_enumerator
    4930                            .dwattr $C$DW$451, DW_AT_name("MAC_FEAT_BEACON_COORD")
    4931                            .dwattr $C$DW$451, DW_AT_const_value(0x03)
    4932                            .dwattr $C$DW$451, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    4933                            .dwattr $C$DW$451, DW_AT_decl_line(0x106)
    4934                            .dwattr $C$DW$451, DW_AT_decl_column(0x03)
    4935                    
    4936                    $C$DW$452       .dwtag  DW_TAG_enumerator
    4937                            .dwattr $C$DW$452, DW_AT_name("MAC_FEAT_BEACON_DEVICE")
    4938                            .dwattr $C$DW$452, DW_AT_const_value(0x04)
    4939                            .dwattr $C$DW$452, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    4940                            .dwattr $C$DW$452, DW_AT_decl_line(0x107)
    4941                            .dwattr $C$DW$452, DW_AT_decl_column(0x03)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:25 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{5D65ECDE-4882-4DA3-96F9-CCC8C19D381F} PAGE   91

    4942                    
    4943                    $C$DW$453       .dwtag  DW_TAG_enumerator
    4944                            .dwattr $C$DW$453, DW_AT_name("MAC_FEAT_GTS_CLIENT")
    4945                            .dwattr $C$DW$453, DW_AT_const_value(0x05)
    4946                            .dwattr $C$DW$453, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    4947                            .dwattr $C$DW$453, DW_AT_decl_line(0x108)
    4948                            .dwattr $C$DW$453, DW_AT_decl_column(0x03)
    4949                    
    4950                    $C$DW$454       .dwtag  DW_TAG_enumerator
    4951                            .dwattr $C$DW$454, DW_AT_name("MAC_FEAT_GTS_SERVER")
    4952                            .dwattr $C$DW$454, DW_AT_const_value(0x06)
    4953                            .dwattr $C$DW$454, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    4954                            .dwattr $C$DW$454, DW_AT_decl_line(0x109)
    4955                            .dwattr $C$DW$454, DW_AT_decl_column(0x03)
    4956                    
    4957                    $C$DW$455       .dwtag  DW_TAG_enumerator
    4958                            .dwattr $C$DW$455, DW_AT_name("MAC_FEAT_MAX")
    4959                            .dwattr $C$DW$455, DW_AT_const_value(0x07)
    4960                            .dwattr $C$DW$455, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    4961                            .dwattr $C$DW$455, DW_AT_decl_line(0x10a)
    4962                            .dwattr $C$DW$455, DW_AT_decl_column(0x03)
    4963                    
    4964                            .dwattr $C$DW$T$560, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154st
    4965                            .dwattr $C$DW$T$560, DW_AT_decl_line(0x102)
    4966                            .dwattr $C$DW$T$560, DW_AT_decl_column(0x01)
    4967                            .dwendtag $C$DW$T$560
    4968                    
    4969                    
    4970                    $C$DW$T$20      .dwtag  DW_TAG_structure_type
    4971                            .dwattr $C$DW$T$20, DW_AT_byte_size(0x04)
    4972                    $C$DW$456       .dwtag  DW_TAG_member
    4973                            .dwattr $C$DW$456, DW_AT_type(*$C$DW$T$19)
    4974                            .dwattr $C$DW$456, DW_AT_name("offset")
    4975                            .dwattr $C$DW$456, DW_AT_TI_symbol_name("offset")
    4976                            .dwattr $C$DW$456, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4977                            .dwattr $C$DW$456, DW_AT_accessibility(DW_ACCESS_public)
    4978                            .dwattr $C$DW$456, DW_AT_decl_file("../Application/MAC/HighLevel/mac_security_pib.c")
    4979                            .dwattr $C$DW$456, DW_AT_decl_line(0x55)
    4980                            .dwattr $C$DW$456, DW_AT_decl_column(0x0d)
    4981                    
    4982                    $C$DW$457       .dwtag  DW_TAG_member
    4983                            .dwattr $C$DW$457, DW_AT_type(*$C$DW$T$19)
    4984                            .dwattr $C$DW$457, DW_AT_name("len")
    4985                            .dwattr $C$DW$457, DW_AT_TI_symbol_name("len")
    4986                            .dwattr $C$DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4987                            .dwattr $C$DW$457, DW_AT_accessibility(DW_ACCESS_public)
    4988                            .dwattr $C$DW$457, DW_AT_decl_file("../Application/MAC/HighLevel/mac_security_pib.c")
    4989                            .dwattr $C$DW$457, DW_AT_decl_line(0x56)
    4990                            .dwattr $C$DW$457, DW_AT_decl_column(0x0d)
    4991                    
    4992                    $C$DW$458       .dwtag  DW_TAG_member
    4993                            .dwattr $C$DW$458, DW_AT_type(*$C$DW$T$19)
    4994                            .dwattr $C$DW$458, DW_AT_name("min")
    4995                            .dwattr $C$DW$458, DW_AT_TI_symbol_name("min")
    4996                            .dwattr $C$DW$458, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:25 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{5D65ECDE-4882-4DA3-96F9-CCC8C19D381F} PAGE   92

    4997                            .dwattr $C$DW$458, DW_AT_accessibility(DW_ACCESS_public)
    4998                            .dwattr $C$DW$458, DW_AT_decl_file("../Application/MAC/HighLevel/mac_security_pib.c")
    4999                            .dwattr $C$DW$458, DW_AT_decl_line(0x57)
    5000                            .dwattr $C$DW$458, DW_AT_decl_column(0x0d)
    5001                    
    5002                    $C$DW$459       .dwtag  DW_TAG_member
    5003                            .dwattr $C$DW$459, DW_AT_type(*$C$DW$T$19)
    5004                            .dwattr $C$DW$459, DW_AT_name("max")
    5005                            .dwattr $C$DW$459, DW_AT_TI_symbol_name("max")
    5006                            .dwattr $C$DW$459, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    5007                            .dwattr $C$DW$459, DW_AT_accessibility(DW_ACCESS_public)
    5008                            .dwattr $C$DW$459, DW_AT_decl_file("../Application/MAC/HighLevel/mac_security_pib.c")
    5009                            .dwattr $C$DW$459, DW_AT_decl_line(0x58)
    5010                            .dwattr $C$DW$459, DW_AT_decl_column(0x0d)
    5011                    
    5012                            .dwattr $C$DW$T$20, DW_AT_decl_file("../Application/MAC/HighLevel/mac_security_pib.c")
    5013                            .dwattr $C$DW$T$20, DW_AT_decl_line(0x54)
    5014                            .dwattr $C$DW$T$20, DW_AT_decl_column(0x01)
    5015                            .dwendtag $C$DW$T$20
    5016                    
    5017                    $C$DW$T$564     .dwtag  DW_TAG_typedef
    5018                            .dwattr $C$DW$T$564, DW_AT_name("macSecurityPibTbl_t")
    5019                            .dwattr $C$DW$T$564, DW_AT_type(*$C$DW$T$20)
    5020                            .dwattr $C$DW$T$564, DW_AT_language(DW_LANG_C)
    5021                            .dwattr $C$DW$T$564, DW_AT_decl_file("../Application/MAC/HighLevel/mac_security_pib.c")
    5022                            .dwattr $C$DW$T$564, DW_AT_decl_line(0x59)
    5023                            .dwattr $C$DW$T$564, DW_AT_decl_column(0x03)
    5024                    
    5025                    $C$DW$T$565     .dwtag  DW_TAG_const_type
    5026                            .dwattr $C$DW$T$565, DW_AT_type(*$C$DW$T$564)
    5027                    
    5028                    
    5029                    $C$DW$T$566     .dwtag  DW_TAG_array_type
    5030                            .dwattr $C$DW$T$566, DW_AT_type(*$C$DW$T$565)
    5031                            .dwattr $C$DW$T$566, DW_AT_language(DW_LANG_C)
    5032                            .dwattr $C$DW$T$566, DW_AT_byte_size(0x2c)
    5033                    $C$DW$460       .dwtag  DW_TAG_subrange_type
    5034                            .dwattr $C$DW$460, DW_AT_upper_bound(0x0a)
    5035                    
    5036                            .dwendtag $C$DW$T$566
    5037                    
    5038                    
    5039                    $C$DW$T$21      .dwtag  DW_TAG_structure_type
    5040                            .dwattr $C$DW$T$21, DW_AT_byte_size(0x0a)
    5041                    $C$DW$461       .dwtag  DW_TAG_member
    5042                            .dwattr $C$DW$461, DW_AT_type(*$C$DW$T$190)
    5043                            .dwattr $C$DW$461, DW_AT_name("addr")
    5044                            .dwattr $C$DW$461, DW_AT_TI_symbol_name("addr")
    5045                            .dwattr $C$DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5046                            .dwattr $C$DW$461, DW_AT_accessibility(DW_ACCESS_public)
    5047                            .dwattr $C$DW$461, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/Se
    5048                            .dwattr $C$DW$461, DW_AT_decl_line(0x52)
    5049                            .dwattr $C$DW$461, DW_AT_decl_column(0x05)
    5050                    
    5051                    $C$DW$462       .dwtag  DW_TAG_member
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:25 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{5D65ECDE-4882-4DA3-96F9-CCC8C19D381F} PAGE   93

    5052                            .dwattr $C$DW$462, DW_AT_type(*$C$DW$T$19)
    5053                            .dwattr $C$DW$462, DW_AT_name("addrMode")
    5054                            .dwattr $C$DW$462, DW_AT_TI_symbol_name("addrMode")
    5055                            .dwattr $C$DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5056                            .dwattr $C$DW$462, DW_AT_accessibility(DW_ACCESS_public)
    5057                            .dwattr $C$DW$462, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/Se
    5058                            .dwattr $C$DW$462, DW_AT_decl_line(0x53)
    5059                            .dwattr $C$DW$462, DW_AT_decl_column(0x11)
    5060                    
    5061                            .dwattr $C$DW$T$21, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/S
    5062                            .dwattr $C$DW$T$21, DW_AT_decl_line(0x4d)
    5063                            .dwattr $C$DW$T$21, DW_AT_decl_column(0x01)
    5064                            .dwendtag $C$DW$T$21
    5065                    
    5066                    $C$DW$T$42      .dwtag  DW_TAG_typedef
    5067                            .dwattr $C$DW$T$42, DW_AT_name("sAddr_t")
    5068                            .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$21)
    5069                            .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    5070                            .dwattr $C$DW$T$42, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/S
    5071                            .dwattr $C$DW$T$42, DW_AT_decl_line(0x54)
    5072                            .dwattr $C$DW$T$42, DW_AT_decl_column(0x03)
    5073                    
    5074                    
    5075                    $C$DW$T$23      .dwtag  DW_TAG_structure_type
    5076                            .dwattr $C$DW$T$23, DW_AT_byte_size(0x0a)
    5077                    $C$DW$463       .dwtag  DW_TAG_member
    5078                            .dwattr $C$DW$463, DW_AT_type(*$C$DW$T$22)
    5079                            .dwattr $C$DW$463, DW_AT_name("lookupData")
    5080                            .dwattr $C$DW$463, DW_AT_TI_symbol_name("lookupData")
    5081                            .dwattr $C$DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5082                            .dwattr $C$DW$463, DW_AT_accessibility(DW_ACCESS_public)
    5083                            .dwattr $C$DW$463, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    5084                            .dwattr $C$DW$463, DW_AT_decl_line(0x2b6)
    5085                            .dwattr $C$DW$463, DW_AT_decl_column(0x16)
    5086                    
    5087                    $C$DW$464       .dwtag  DW_TAG_member
    5088                            .dwattr $C$DW$464, DW_AT_type(*$C$DW$T$19)
    5089                            .dwattr $C$DW$464, DW_AT_name("lookupDataSize")
    5090                            .dwattr $C$DW$464, DW_AT_TI_symbol_name("lookupDataSize")
    5091                            .dwattr $C$DW$464, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    5092                            .dwattr $C$DW$464, DW_AT_accessibility(DW_ACCESS_public)
    5093                            .dwattr $C$DW$464, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    5094                            .dwattr $C$DW$464, DW_AT_decl_line(0x2b7)
    5095                            .dwattr $C$DW$464, DW_AT_decl_column(0x16)
    5096                    
    5097                            .dwattr $C$DW$T$23, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/M
    5098                            .dwattr $C$DW$T$23, DW_AT_decl_line(0x2b5)
    5099                            .dwattr $C$DW$T$23, DW_AT_decl_column(0x01)
    5100                            .dwendtag $C$DW$T$23
    5101                    
    5102                    $C$DW$T$27      .dwtag  DW_TAG_typedef
    5103                            .dwattr $C$DW$T$27, DW_AT_name("keyIdLookupDescriptor_t")
    5104                            .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$23)
    5105                            .dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
    5106                            .dwattr $C$DW$T$27, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/M
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:25 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{5D65ECDE-4882-4DA3-96F9-CCC8C19D381F} PAGE   94

    5107                            .dwattr $C$DW$T$27, DW_AT_decl_line(0x2b8)
    5108                            .dwattr $C$DW$T$27, DW_AT_decl_column(0x03)
    5109                    
    5110                    $C$DW$T$28      .dwtag  DW_TAG_pointer_type
    5111                            .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$27)
    5112                            .dwattr $C$DW$T$28, DW_AT_address_class(0x20)
    5113                    
    5114                    
    5115                    $C$DW$T$45      .dwtag  DW_TAG_array_type
    5116                            .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$27)
    5117                            .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    5118                            .dwattr $C$DW$T$45, DW_AT_byte_size(0x0a)
    5119                    $C$DW$465       .dwtag  DW_TAG_subrange_type
    5120                            .dwattr $C$DW$465, DW_AT_upper_bound(0x00)
    5121                    
    5122                            .dwendtag $C$DW$T$45
    5123                    
    5124                    
    5125                    $C$DW$T$46      .dwtag  DW_TAG_array_type
    5126                            .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$27)
    5127                            .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    5128                            .dwattr $C$DW$T$46, DW_AT_byte_size(0x14)
    5129                    $C$DW$466       .dwtag  DW_TAG_subrange_type
    5130                            .dwattr $C$DW$466, DW_AT_upper_bound(0x01)
    5131                    
    5132                    $C$DW$467       .dwtag  DW_TAG_subrange_type
    5133                            .dwattr $C$DW$467, DW_AT_upper_bound(0x00)
    5134                    
    5135                            .dwendtag $C$DW$T$46
    5136                    
    5137                    
    5138                    $C$DW$T$25      .dwtag  DW_TAG_structure_type
    5139                            .dwattr $C$DW$T$25, DW_AT_byte_size(0x03)
    5140                    $C$DW$468       .dwtag  DW_TAG_member
    5141                            .dwattr $C$DW$468, DW_AT_type(*$C$DW$T$19)
    5142                            .dwattr $C$DW$468, DW_AT_name("deviceDescriptorHandle")
    5143                            .dwattr $C$DW$468, DW_AT_TI_symbol_name("deviceDescriptorHandle")
    5144                            .dwattr $C$DW$468, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5145                            .dwattr $C$DW$468, DW_AT_accessibility(DW_ACCESS_public)
    5146                            .dwattr $C$DW$468, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    5147                            .dwattr $C$DW$468, DW_AT_decl_line(0x2bd)
    5148                            .dwattr $C$DW$468, DW_AT_decl_column(0x16)
    5149                    
    5150                    $C$DW$469       .dwtag  DW_TAG_member
    5151                            .dwattr $C$DW$469, DW_AT_type(*$C$DW$T$24)
    5152                            .dwattr $C$DW$469, DW_AT_name("uniqueDevice")
    5153                            .dwattr $C$DW$469, DW_AT_TI_symbol_name("uniqueDevice")
    5154                            .dwattr $C$DW$469, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5155                            .dwattr $C$DW$469, DW_AT_accessibility(DW_ACCESS_public)
    5156                            .dwattr $C$DW$469, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    5157                            .dwattr $C$DW$469, DW_AT_decl_line(0x2be)
    5158                            .dwattr $C$DW$469, DW_AT_decl_column(0x16)
    5159                    
    5160                    $C$DW$470       .dwtag  DW_TAG_member
    5161                            .dwattr $C$DW$470, DW_AT_type(*$C$DW$T$24)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:25 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{5D65ECDE-4882-4DA3-96F9-CCC8C19D381F} PAGE   95

    5162                            .dwattr $C$DW$470, DW_AT_name("blackListed")
    5163                            .dwattr $C$DW$470, DW_AT_TI_symbol_name("blackListed")
    5164                            .dwattr $C$DW$470, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5165                            .dwattr $C$DW$470, DW_AT_accessibility(DW_ACCESS_public)
    5166                            .dwattr $C$DW$470, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    5167                            .dwattr $C$DW$470, DW_AT_decl_line(0x2bf)
    5168                            .dwattr $C$DW$470, DW_AT_decl_column(0x16)
    5169                    
    5170                            .dwattr $C$DW$T$25, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/M
    5171                            .dwattr $C$DW$T$25, DW_AT_decl_line(0x2bc)
    5172                            .dwattr $C$DW$T$25, DW_AT_decl_column(0x01)
    5173                            .dwendtag $C$DW$T$25
    5174                    
    5175                    $C$DW$T$29      .dwtag  DW_TAG_typedef
    5176                            .dwattr $C$DW$T$29, DW_AT_name("keyDeviceDescriptor_t")
    5177                            .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$25)
    5178                            .dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
    5179                            .dwattr $C$DW$T$29, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/M
    5180                            .dwattr $C$DW$T$29, DW_AT_decl_line(0x2c0)
    5181                            .dwattr $C$DW$T$29, DW_AT_decl_column(0x03)
    5182                    
    5183                    $C$DW$T$30      .dwtag  DW_TAG_pointer_type
    5184                            .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$29)
    5185                            .dwattr $C$DW$T$30, DW_AT_address_class(0x20)
    5186                    
    5187                    
    5188                    $C$DW$T$47      .dwtag  DW_TAG_array_type
    5189                            .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$29)
    5190                            .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    5191                            .dwattr $C$DW$T$47, DW_AT_byte_size(0x09)
    5192                    $C$DW$471       .dwtag  DW_TAG_subrange_type
    5193                            .dwattr $C$DW$471, DW_AT_upper_bound(0x02)
    5194                    
    5195                            .dwendtag $C$DW$T$47
    5196                    
    5197                    
    5198                    $C$DW$T$48      .dwtag  DW_TAG_array_type
    5199                            .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$29)
    5200                            .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    5201                            .dwattr $C$DW$T$48, DW_AT_byte_size(0x12)
    5202                    $C$DW$472       .dwtag  DW_TAG_subrange_type
    5203                            .dwattr $C$DW$472, DW_AT_upper_bound(0x01)
    5204                    
    5205                    $C$DW$473       .dwtag  DW_TAG_subrange_type
    5206                            .dwattr $C$DW$473, DW_AT_upper_bound(0x02)
    5207                    
    5208                            .dwendtag $C$DW$T$48
    5209                    
    5210                    
    5211                    $C$DW$T$26      .dwtag  DW_TAG_structure_type
    5212                            .dwattr $C$DW$T$26, DW_AT_byte_size(0x02)
    5213                    $C$DW$474       .dwtag  DW_TAG_member
    5214                            .dwattr $C$DW$474, DW_AT_type(*$C$DW$T$19)
    5215                            .dwattr $C$DW$474, DW_AT_name("frameType")
    5216                            .dwattr $C$DW$474, DW_AT_TI_symbol_name("frameType")
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:25 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{5D65ECDE-4882-4DA3-96F9-CCC8C19D381F} PAGE   96

    5217                            .dwattr $C$DW$474, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5218                            .dwattr $C$DW$474, DW_AT_accessibility(DW_ACCESS_public)
    5219                            .dwattr $C$DW$474, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    5220                            .dwattr $C$DW$474, DW_AT_decl_line(0x2c5)
    5221                            .dwattr $C$DW$474, DW_AT_decl_column(0x16)
    5222                    
    5223                    $C$DW$475       .dwtag  DW_TAG_member
    5224                            .dwattr $C$DW$475, DW_AT_type(*$C$DW$T$19)
    5225                            .dwattr $C$DW$475, DW_AT_name("cmdFrameId")
    5226                            .dwattr $C$DW$475, DW_AT_TI_symbol_name("cmdFrameId")
    5227                            .dwattr $C$DW$475, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5228                            .dwattr $C$DW$475, DW_AT_accessibility(DW_ACCESS_public)
    5229                            .dwattr $C$DW$475, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    5230                            .dwattr $C$DW$475, DW_AT_decl_line(0x2c6)
    5231                            .dwattr $C$DW$475, DW_AT_decl_column(0x16)
    5232                    
    5233                            .dwattr $C$DW$T$26, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/M
    5234                            .dwattr $C$DW$T$26, DW_AT_decl_line(0x2c4)
    5235                            .dwattr $C$DW$T$26, DW_AT_decl_column(0x01)
    5236                            .dwendtag $C$DW$T$26
    5237                    
    5238                    $C$DW$T$31      .dwtag  DW_TAG_typedef
    5239                            .dwattr $C$DW$T$31, DW_AT_name("keyUsageDescriptor_t")
    5240                            .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$26)
    5241                            .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
    5242                            .dwattr $C$DW$T$31, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/M
    5243                            .dwattr $C$DW$T$31, DW_AT_decl_line(0x2c7)
    5244                            .dwattr $C$DW$T$31, DW_AT_decl_column(0x03)
    5245                    
    5246                    $C$DW$T$32      .dwtag  DW_TAG_pointer_type
    5247                            .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$31)
    5248                            .dwattr $C$DW$T$32, DW_AT_address_class(0x20)
    5249                    
    5250                    
    5251                    $C$DW$T$49      .dwtag  DW_TAG_array_type
    5252                            .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$31)
    5253                            .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    5254                            .dwattr $C$DW$T$49, DW_AT_byte_size(0x04)
    5255                    $C$DW$476       .dwtag  DW_TAG_subrange_type
    5256                            .dwattr $C$DW$476, DW_AT_upper_bound(0x01)
    5257                    
    5258                            .dwendtag $C$DW$T$49
    5259                    
    5260                    
    5261                    $C$DW$T$50      .dwtag  DW_TAG_array_type
    5262                            .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$31)
    5263                            .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
    5264                            .dwattr $C$DW$T$50, DW_AT_byte_size(0x08)
    5265                    $C$DW$477       .dwtag  DW_TAG_subrange_type
    5266                            .dwattr $C$DW$477, DW_AT_upper_bound(0x01)
    5267                    
    5268                    $C$DW$478       .dwtag  DW_TAG_subrange_type
    5269                            .dwattr $C$DW$478, DW_AT_upper_bound(0x01)
    5270                    
    5271                            .dwendtag $C$DW$T$50
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:25 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{5D65ECDE-4882-4DA3-96F9-CCC8C19D381F} PAGE   97

    5272                    
    5273                    
    5274                    $C$DW$T$35      .dwtag  DW_TAG_structure_type
    5275                            .dwattr $C$DW$T$35, DW_AT_byte_size(0x2c)
    5276                    $C$DW$479       .dwtag  DW_TAG_member
    5277                            .dwattr $C$DW$479, DW_AT_type(*$C$DW$T$28)
    5278                            .dwattr $C$DW$479, DW_AT_name("keyIdLookupList")
    5279                            .dwattr $C$DW$479, DW_AT_TI_symbol_name("keyIdLookupList")
    5280                            .dwattr $C$DW$479, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5281                            .dwattr $C$DW$479, DW_AT_accessibility(DW_ACCESS_public)
    5282                            .dwattr $C$DW$479, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    5283                            .dwattr $C$DW$479, DW_AT_decl_line(0x2cc)
    5284                            .dwattr $C$DW$479, DW_AT_decl_column(0x1d)
    5285                    
    5286                    $C$DW$480       .dwtag  DW_TAG_member
    5287                            .dwattr $C$DW$480, DW_AT_type(*$C$DW$T$19)
    5288                            .dwattr $C$DW$480, DW_AT_name("keyIdLookupEntries")
    5289                            .dwattr $C$DW$480, DW_AT_TI_symbol_name("keyIdLookupEntries")
    5290                            .dwattr $C$DW$480, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5291                            .dwattr $C$DW$480, DW_AT_accessibility(DW_ACCESS_public)
    5292                            .dwattr $C$DW$480, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    5293                            .dwattr $C$DW$480, DW_AT_decl_line(0x2cd)
    5294                            .dwattr $C$DW$480, DW_AT_decl_column(0x1c)
    5295                    
    5296                    $C$DW$481       .dwtag  DW_TAG_member
    5297                            .dwattr $C$DW$481, DW_AT_type(*$C$DW$T$30)
    5298                            .dwattr $C$DW$481, DW_AT_name("keyDeviceList")
    5299                            .dwattr $C$DW$481, DW_AT_TI_symbol_name("keyDeviceList")
    5300                            .dwattr $C$DW$481, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5301                            .dwattr $C$DW$481, DW_AT_accessibility(DW_ACCESS_public)
    5302                            .dwattr $C$DW$481, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    5303                            .dwattr $C$DW$481, DW_AT_decl_line(0x2cf)
    5304                            .dwattr $C$DW$481, DW_AT_decl_column(0x1d)
    5305                    
    5306                    $C$DW$482       .dwtag  DW_TAG_member
    5307                            .dwattr $C$DW$482, DW_AT_type(*$C$DW$T$19)
    5308                            .dwattr $C$DW$482, DW_AT_name("keyDeviceListEntries")
    5309                            .dwattr $C$DW$482, DW_AT_TI_symbol_name("keyDeviceListEntries")
    5310                            .dwattr $C$DW$482, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5311                            .dwattr $C$DW$482, DW_AT_accessibility(DW_ACCESS_public)
    5312                            .dwattr $C$DW$482, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    5313                            .dwattr $C$DW$482, DW_AT_decl_line(0x2d2)
    5314                            .dwattr $C$DW$482, DW_AT_decl_column(0x1c)
    5315                    
    5316                    $C$DW$483       .dwtag  DW_TAG_member
    5317                            .dwattr $C$DW$483, DW_AT_type(*$C$DW$T$32)
    5318                            .dwattr $C$DW$483, DW_AT_name("keyUsageList")
    5319                            .dwattr $C$DW$483, DW_AT_TI_symbol_name("keyUsageList")
    5320                            .dwattr $C$DW$483, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5321                            .dwattr $C$DW$483, DW_AT_accessibility(DW_ACCESS_public)
    5322                            .dwattr $C$DW$483, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    5323                            .dwattr $C$DW$483, DW_AT_decl_line(0x2d4)
    5324                            .dwattr $C$DW$483, DW_AT_decl_column(0x1d)
    5325                    
    5326                    $C$DW$484       .dwtag  DW_TAG_member
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:25 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{5D65ECDE-4882-4DA3-96F9-CCC8C19D381F} PAGE   98

    5327                            .dwattr $C$DW$484, DW_AT_type(*$C$DW$T$19)
    5328                            .dwattr $C$DW$484, DW_AT_name("keyUsageListEntries")
    5329                            .dwattr $C$DW$484, DW_AT_TI_symbol_name("keyUsageListEntries")
    5330                            .dwattr $C$DW$484, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    5331                            .dwattr $C$DW$484, DW_AT_accessibility(DW_ACCESS_public)
    5332                            .dwattr $C$DW$484, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    5333                            .dwattr $C$DW$484, DW_AT_decl_line(0x2d6)
    5334                            .dwattr $C$DW$484, DW_AT_decl_column(0x1c)
    5335                    
    5336                    $C$DW$485       .dwtag  DW_TAG_member
    5337                            .dwattr $C$DW$485, DW_AT_type(*$C$DW$T$33)
    5338                            .dwattr $C$DW$485, DW_AT_name("key")
    5339                            .dwattr $C$DW$485, DW_AT_TI_symbol_name("key")
    5340                            .dwattr $C$DW$485, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    5341                            .dwattr $C$DW$485, DW_AT_accessibility(DW_ACCESS_public)
    5342                            .dwattr $C$DW$485, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    5343                            .dwattr $C$DW$485, DW_AT_decl_line(0x2d8)
    5344                            .dwattr $C$DW$485, DW_AT_decl_column(0x1c)
    5345                    
    5346                    $C$DW$486       .dwtag  DW_TAG_member
    5347                            .dwattr $C$DW$486, DW_AT_type(*$C$DW$T$34)
    5348                            .dwattr $C$DW$486, DW_AT_name("frameCounter")
    5349                            .dwattr $C$DW$486, DW_AT_TI_symbol_name("frameCounter")
    5350                            .dwattr $C$DW$486, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    5351                            .dwattr $C$DW$486, DW_AT_accessibility(DW_ACCESS_public)
    5352                            .dwattr $C$DW$486, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    5353                            .dwattr $C$DW$486, DW_AT_decl_line(0x2d9)
    5354                            .dwattr $C$DW$486, DW_AT_decl_column(0x1c)
    5355                    
    5356                            .dwattr $C$DW$T$35, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/M
    5357                            .dwattr $C$DW$T$35, DW_AT_decl_line(0x2cb)
    5358                            .dwattr $C$DW$T$35, DW_AT_decl_column(0x01)
    5359                            .dwendtag $C$DW$T$35
    5360                    
    5361                    $C$DW$T$43      .dwtag  DW_TAG_typedef
    5362                            .dwattr $C$DW$T$43, DW_AT_name("keyDescriptor_t")
    5363                            .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$35)
    5364                            .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
    5365                            .dwattr $C$DW$T$43, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/M
    5366                            .dwattr $C$DW$T$43, DW_AT_decl_line(0x2dc)
    5367                            .dwattr $C$DW$T$43, DW_AT_decl_column(0x03)
    5368                    
    5369                    
    5370                    $C$DW$T$44      .dwtag  DW_TAG_array_type
    5371                            .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$43)
    5372                            .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    5373                            .dwattr $C$DW$T$44, DW_AT_byte_size(0x58)
    5374                    $C$DW$487       .dwtag  DW_TAG_subrange_type
    5375                            .dwattr $C$DW$487, DW_AT_upper_bound(0x01)
    5376                    
    5377                            .dwendtag $C$DW$T$44
    5378                    
    5379                    $C$DW$T$127     .dwtag  DW_TAG_pointer_type
    5380                            .dwattr $C$DW$T$127, DW_AT_type(*$C$DW$T$43)
    5381                            .dwattr $C$DW$T$127, DW_AT_address_class(0x20)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:25 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{5D65ECDE-4882-4DA3-96F9-CCC8C19D381F} PAGE   99

    5382                    
    5383                    
    5384                    $C$DW$T$40      .dwtag  DW_TAG_structure_type
    5385                            .dwattr $C$DW$T$40, DW_AT_byte_size(0x18)
    5386                    $C$DW$488       .dwtag  DW_TAG_member
    5387                            .dwattr $C$DW$488, DW_AT_type(*$C$DW$T$36)
    5388                            .dwattr $C$DW$488, DW_AT_name("panID")
    5389                            .dwattr $C$DW$488, DW_AT_TI_symbol_name("panID")
    5390                            .dwattr $C$DW$488, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5391                            .dwattr $C$DW$488, DW_AT_accessibility(DW_ACCESS_public)
    5392                            .dwattr $C$DW$488, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    5393                            .dwattr $C$DW$488, DW_AT_decl_line(0x2e1)
    5394                            .dwattr $C$DW$488, DW_AT_decl_column(0x16)
    5395                    
    5396                    $C$DW$489       .dwtag  DW_TAG_member
    5397                            .dwattr $C$DW$489, DW_AT_type(*$C$DW$T$36)
    5398                            .dwattr $C$DW$489, DW_AT_name("shortAddress")
    5399                            .dwattr $C$DW$489, DW_AT_TI_symbol_name("shortAddress")
    5400                            .dwattr $C$DW$489, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5401                            .dwattr $C$DW$489, DW_AT_accessibility(DW_ACCESS_public)
    5402                            .dwattr $C$DW$489, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    5403                            .dwattr $C$DW$489, DW_AT_decl_line(0x2e2)
    5404                            .dwattr $C$DW$489, DW_AT_decl_column(0x16)
    5405                    
    5406                    $C$DW$490       .dwtag  DW_TAG_member
    5407                            .dwattr $C$DW$490, DW_AT_type(*$C$DW$T$38)
    5408                            .dwattr $C$DW$490, DW_AT_name("extAddress")
    5409                            .dwattr $C$DW$490, DW_AT_TI_symbol_name("extAddress")
    5410                            .dwattr $C$DW$490, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5411                            .dwattr $C$DW$490, DW_AT_accessibility(DW_ACCESS_public)
    5412                            .dwattr $C$DW$490, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    5413                            .dwattr $C$DW$490, DW_AT_decl_line(0x2e3)
    5414                            .dwattr $C$DW$490, DW_AT_decl_column(0x16)
    5415                    
    5416                    $C$DW$491       .dwtag  DW_TAG_member
    5417                            .dwattr $C$DW$491, DW_AT_type(*$C$DW$T$39)
    5418                            .dwattr $C$DW$491, DW_AT_name("frameCounter")
    5419                            .dwattr $C$DW$491, DW_AT_TI_symbol_name("frameCounter")
    5420                            .dwattr $C$DW$491, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5421                            .dwattr $C$DW$491, DW_AT_accessibility(DW_ACCESS_public)
    5422                            .dwattr $C$DW$491, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    5423                            .dwattr $C$DW$491, DW_AT_decl_line(0x2e7)
    5424                            .dwattr $C$DW$491, DW_AT_decl_column(0x16)
    5425                    
    5426                    $C$DW$492       .dwtag  DW_TAG_member
    5427                            .dwattr $C$DW$492, DW_AT_type(*$C$DW$T$24)
    5428                            .dwattr $C$DW$492, DW_AT_name("exempt")
    5429                            .dwattr $C$DW$492, DW_AT_TI_symbol_name("exempt")
    5430                            .dwattr $C$DW$492, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    5431                            .dwattr $C$DW$492, DW_AT_accessibility(DW_ACCESS_public)
    5432                            .dwattr $C$DW$492, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    5433                            .dwattr $C$DW$492, DW_AT_decl_line(0x2eb)
    5434                            .dwattr $C$DW$492, DW_AT_decl_column(0x16)
    5435                    
    5436                            .dwattr $C$DW$T$40, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/M
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:25 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{5D65ECDE-4882-4DA3-96F9-CCC8C19D381F} PAGE  100

    5437                            .dwattr $C$DW$T$40, DW_AT_decl_line(0x2e0)
    5438                            .dwattr $C$DW$T$40, DW_AT_decl_column(0x01)
    5439                            .dwendtag $C$DW$T$40
    5440                    
    5441                    $C$DW$T$51      .dwtag  DW_TAG_typedef
    5442                            .dwattr $C$DW$T$51, DW_AT_name("deviceDescriptor_t")
    5443                            .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$40)
    5444                            .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
    5445                            .dwattr $C$DW$T$51, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/M
    5446                            .dwattr $C$DW$T$51, DW_AT_decl_line(0x2ed)
    5447                            .dwattr $C$DW$T$51, DW_AT_decl_column(0x03)
    5448                    
    5449                    
    5450                    $C$DW$T$52      .dwtag  DW_TAG_array_type
    5451                            .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$51)
    5452                            .dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
    5453                            .dwattr $C$DW$T$52, DW_AT_byte_size(0x48)
    5454                    $C$DW$493       .dwtag  DW_TAG_subrange_type
    5455                            .dwattr $C$DW$493, DW_AT_upper_bound(0x02)
    5456                    
    5457                            .dwendtag $C$DW$T$52
    5458                    
    5459                    
    5460                    $C$DW$T$41      .dwtag  DW_TAG_structure_type
    5461                            .dwattr $C$DW$T$41, DW_AT_byte_size(0x04)
    5462                    $C$DW$494       .dwtag  DW_TAG_member
    5463                            .dwattr $C$DW$494, DW_AT_type(*$C$DW$T$19)
    5464                            .dwattr $C$DW$494, DW_AT_name("frameType")
    5465                            .dwattr $C$DW$494, DW_AT_TI_symbol_name("frameType")
    5466                            .dwattr $C$DW$494, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5467                            .dwattr $C$DW$494, DW_AT_accessibility(DW_ACCESS_public)
    5468                            .dwattr $C$DW$494, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    5469                            .dwattr $C$DW$494, DW_AT_decl_line(0x2f2)
    5470                            .dwattr $C$DW$494, DW_AT_decl_column(0x16)
    5471                    
    5472                    $C$DW$495       .dwtag  DW_TAG_member
    5473                            .dwattr $C$DW$495, DW_AT_type(*$C$DW$T$19)
    5474                            .dwattr $C$DW$495, DW_AT_name("commandFrameIdentifier")
    5475                            .dwattr $C$DW$495, DW_AT_TI_symbol_name("commandFrameIdentifier")
    5476                            .dwattr $C$DW$495, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5477                            .dwattr $C$DW$495, DW_AT_accessibility(DW_ACCESS_public)
    5478                            .dwattr $C$DW$495, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    5479                            .dwattr $C$DW$495, DW_AT_decl_line(0x2f3)
    5480                            .dwattr $C$DW$495, DW_AT_decl_column(0x16)
    5481                    
    5482                    $C$DW$496       .dwtag  DW_TAG_member
    5483                            .dwattr $C$DW$496, DW_AT_type(*$C$DW$T$19)
    5484                            .dwattr $C$DW$496, DW_AT_name("securityMinimum")
    5485                            .dwattr $C$DW$496, DW_AT_TI_symbol_name("securityMinimum")
    5486                            .dwattr $C$DW$496, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5487                            .dwattr $C$DW$496, DW_AT_accessibility(DW_ACCESS_public)
    5488                            .dwattr $C$DW$496, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    5489                            .dwattr $C$DW$496, DW_AT_decl_line(0x2f4)
    5490                            .dwattr $C$DW$496, DW_AT_decl_column(0x16)
    5491                    
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:25 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{5D65ECDE-4882-4DA3-96F9-CCC8C19D381F} PAGE  101

    5492                    $C$DW$497       .dwtag  DW_TAG_member
    5493                            .dwattr $C$DW$497, DW_AT_type(*$C$DW$T$24)
    5494                            .dwattr $C$DW$497, DW_AT_name("securityOverrideSecurityMinimum")
    5495                            .dwattr $C$DW$497, DW_AT_TI_symbol_name("securityOverrideSecurityMinimum")
    5496                            .dwattr $C$DW$497, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    5497                            .dwattr $C$DW$497, DW_AT_accessibility(DW_ACCESS_public)
    5498                            .dwattr $C$DW$497, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    5499                            .dwattr $C$DW$497, DW_AT_decl_line(0x2f6)
    5500                            .dwattr $C$DW$497, DW_AT_decl_column(0x16)
    5501                    
    5502                            .dwattr $C$DW$T$41, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/M
    5503                            .dwattr $C$DW$T$41, DW_AT_decl_line(0x2f1)
    5504                            .dwattr $C$DW$T$41, DW_AT_decl_column(0x01)
    5505                            .dwendtag $C$DW$T$41
    5506                    
    5507                    $C$DW$T$53      .dwtag  DW_TAG_typedef
    5508                            .dwattr $C$DW$T$53, DW_AT_name("securityLevelDescriptor_t")
    5509                            .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$41)
    5510                            .dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
    5511                            .dwattr $C$DW$T$53, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/M
    5512                            .dwattr $C$DW$T$53, DW_AT_decl_line(0x2ff)
    5513                            .dwattr $C$DW$T$53, DW_AT_decl_column(0x03)
    5514                    
    5515                    
    5516                    $C$DW$T$54      .dwtag  DW_TAG_array_type
    5517                            .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$53)
    5518                            .dwattr $C$DW$T$54, DW_AT_language(DW_LANG_C)
    5519                            .dwattr $C$DW$T$54, DW_AT_byte_size(0x08)
    5520                    $C$DW$498       .dwtag  DW_TAG_subrange_type
    5521                            .dwattr $C$DW$498, DW_AT_upper_bound(0x01)
    5522                    
    5523                            .dwendtag $C$DW$T$54
    5524                    
    5525                    
    5526                    $C$DW$T$55      .dwtag  DW_TAG_structure_type
    5527                            .dwattr $C$DW$T$55, DW_AT_byte_size(0xfc)
    5528                    $C$DW$499       .dwtag  DW_TAG_member
    5529                            .dwattr $C$DW$499, DW_AT_type(*$C$DW$T$19)
    5530                            .dwattr $C$DW$499, DW_AT_name("keyTableEntries")
    5531                            .dwattr $C$DW$499, DW_AT_TI_symbol_name("keyTableEntries")
    5532                            .dwattr $C$DW$499, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5533                            .dwattr $C$DW$499, DW_AT_accessibility(DW_ACCESS_public)
    5534                            .dwattr $C$DW$499, DW_AT_decl_file("..\Application\MAC\HighLevel\mac_security_pib.h")
    5535                            .dwattr $C$DW$499, DW_AT_decl_line(0x62)
    5536                            .dwattr $C$DW$499, DW_AT_decl_column(0x16)
    5537                    
    5538                    $C$DW$500       .dwtag  DW_TAG_member
    5539                            .dwattr $C$DW$500, DW_AT_type(*$C$DW$T$19)
    5540                            .dwattr $C$DW$500, DW_AT_name("deviceTableEntries")
    5541                            .dwattr $C$DW$500, DW_AT_TI_symbol_name("deviceTableEntries")
    5542                            .dwattr $C$DW$500, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5543                            .dwattr $C$DW$500, DW_AT_accessibility(DW_ACCESS_public)
    5544                            .dwattr $C$DW$500, DW_AT_decl_file("..\Application\MAC\HighLevel\mac_security_pib.h")
    5545                            .dwattr $C$DW$500, DW_AT_decl_line(0x63)
    5546                            .dwattr $C$DW$500, DW_AT_decl_column(0x16)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:25 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{5D65ECDE-4882-4DA3-96F9-CCC8C19D381F} PAGE  102

    5547                    
    5548                    $C$DW$501       .dwtag  DW_TAG_member
    5549                            .dwattr $C$DW$501, DW_AT_type(*$C$DW$T$19)
    5550                            .dwattr $C$DW$501, DW_AT_name("securityLevelTableEntries")
    5551                            .dwattr $C$DW$501, DW_AT_TI_symbol_name("securityLevelTableEntries")
    5552                            .dwattr $C$DW$501, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5553                            .dwattr $C$DW$501, DW_AT_accessibility(DW_ACCESS_public)
    5554                            .dwattr $C$DW$501, DW_AT_decl_file("..\Application\MAC\HighLevel\mac_security_pib.h")
    5555                            .dwattr $C$DW$501, DW_AT_decl_line(0x64)
    5556                            .dwattr $C$DW$501, DW_AT_decl_column(0x16)
    5557                    
    5558                    $C$DW$502       .dwtag  DW_TAG_member
    5559                            .dwattr $C$DW$502, DW_AT_type(*$C$DW$T$19)
    5560                            .dwattr $C$DW$502, DW_AT_name("autoRequestSecurityLevel")
    5561                            .dwattr $C$DW$502, DW_AT_TI_symbol_name("autoRequestSecurityLevel")
    5562                            .dwattr $C$DW$502, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    5563                            .dwattr $C$DW$502, DW_AT_accessibility(DW_ACCESS_public)
    5564                            .dwattr $C$DW$502, DW_AT_decl_file("..\Application\MAC\HighLevel\mac_security_pib.h")
    5565                            .dwattr $C$DW$502, DW_AT_decl_line(0x66)
    5566                            .dwattr $C$DW$502, DW_AT_decl_column(0x16)
    5567                    
    5568                    $C$DW$503       .dwtag  DW_TAG_member
    5569                            .dwattr $C$DW$503, DW_AT_type(*$C$DW$T$19)
    5570                            .dwattr $C$DW$503, DW_AT_name("autoRequestKeyIdMode")
    5571                            .dwattr $C$DW$503, DW_AT_TI_symbol_name("autoRequestKeyIdMode")
    5572                            .dwattr $C$DW$503, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5573                            .dwattr $C$DW$503, DW_AT_accessibility(DW_ACCESS_public)
    5574                            .dwattr $C$DW$503, DW_AT_decl_file("..\Application\MAC\HighLevel\mac_security_pib.h")
    5575                            .dwattr $C$DW$503, DW_AT_decl_line(0x67)
    5576                            .dwattr $C$DW$503, DW_AT_decl_column(0x16)
    5577                    
    5578                    $C$DW$504       .dwtag  DW_TAG_member
    5579                            .dwattr $C$DW$504, DW_AT_type(*$C$DW$T$37)
    5580                            .dwattr $C$DW$504, DW_AT_name("autoRequestKeySource")
    5581                            .dwattr $C$DW$504, DW_AT_TI_symbol_name("autoRequestKeySource")
    5582                            .dwattr $C$DW$504, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    5583                            .dwattr $C$DW$504, DW_AT_accessibility(DW_ACCESS_public)
    5584                            .dwattr $C$DW$504, DW_AT_decl_file("..\Application\MAC\HighLevel\mac_security_pib.h")
    5585                            .dwattr $C$DW$504, DW_AT_decl_line(0x68)
    5586                            .dwattr $C$DW$504, DW_AT_decl_column(0x16)
    5587                    
    5588                    $C$DW$505       .dwtag  DW_TAG_member
    5589                            .dwattr $C$DW$505, DW_AT_type(*$C$DW$T$19)
    5590                            .dwattr $C$DW$505, DW_AT_name("autoRequestKeyIndex")
    5591                            .dwattr $C$DW$505, DW_AT_TI_symbol_name("autoRequestKeyIndex")
    5592                            .dwattr $C$DW$505, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    5593                            .dwattr $C$DW$505, DW_AT_accessibility(DW_ACCESS_public)
    5594                            .dwattr $C$DW$505, DW_AT_decl_file("..\Application\MAC\HighLevel\mac_security_pib.h")
    5595                            .dwattr $C$DW$505, DW_AT_decl_line(0x69)
    5596                            .dwattr $C$DW$505, DW_AT_decl_column(0x16)
    5597                    
    5598                    $C$DW$506       .dwtag  DW_TAG_member
    5599                            .dwattr $C$DW$506, DW_AT_type(*$C$DW$T$37)
    5600                            .dwattr $C$DW$506, DW_AT_name("defaultKeySource")
    5601                            .dwattr $C$DW$506, DW_AT_TI_symbol_name("defaultKeySource")
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:25 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{5D65ECDE-4882-4DA3-96F9-CCC8C19D381F} PAGE  103

    5602                            .dwattr $C$DW$506, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    5603                            .dwattr $C$DW$506, DW_AT_accessibility(DW_ACCESS_public)
    5604                            .dwattr $C$DW$506, DW_AT_decl_file("..\Application\MAC\HighLevel\mac_security_pib.h")
    5605                            .dwattr $C$DW$506, DW_AT_decl_line(0x6b)
    5606                            .dwattr $C$DW$506, DW_AT_decl_column(0x16)
    5607                    
    5608                    $C$DW$507       .dwtag  DW_TAG_member
    5609                            .dwattr $C$DW$507, DW_AT_type(*$C$DW$T$42)
    5610                            .dwattr $C$DW$507, DW_AT_name("panCoordExtendedAddress")
    5611                            .dwattr $C$DW$507, DW_AT_TI_symbol_name("panCoordExtendedAddress")
    5612                            .dwattr $C$DW$507, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    5613                            .dwattr $C$DW$507, DW_AT_accessibility(DW_ACCESS_public)
    5614                            .dwattr $C$DW$507, DW_AT_decl_file("..\Application\MAC\HighLevel\mac_security_pib.h")
    5615                            .dwattr $C$DW$507, DW_AT_decl_line(0x6c)
    5616                            .dwattr $C$DW$507, DW_AT_decl_column(0x16)
    5617                    
    5618                    $C$DW$508       .dwtag  DW_TAG_member
    5619                            .dwattr $C$DW$508, DW_AT_type(*$C$DW$T$36)
    5620                            .dwattr $C$DW$508, DW_AT_name("panCoordShortAddress")
    5621                            .dwattr $C$DW$508, DW_AT_TI_symbol_name("panCoordShortAddress")
    5622                            .dwattr $C$DW$508, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    5623                            .dwattr $C$DW$508, DW_AT_accessibility(DW_ACCESS_public)
    5624                            .dwattr $C$DW$508, DW_AT_decl_file("..\Application\MAC\HighLevel\mac_security_pib.h")
    5625                            .dwattr $C$DW$508, DW_AT_decl_line(0x6d)
    5626                            .dwattr $C$DW$508, DW_AT_decl_column(0x16)
    5627                    
    5628                    $C$DW$509       .dwtag  DW_TAG_member
    5629                            .dwattr $C$DW$509, DW_AT_type(*$C$DW$T$44)
    5630                            .dwattr $C$DW$509, DW_AT_name("macKeyTable")
    5631                            .dwattr $C$DW$509, DW_AT_TI_symbol_name("macKeyTable")
    5632                            .dwattr $C$DW$509, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    5633                            .dwattr $C$DW$509, DW_AT_accessibility(DW_ACCESS_public)
    5634                            .dwattr $C$DW$509, DW_AT_decl_file("..\Application\MAC\HighLevel\mac_security_pib.h")
    5635                            .dwattr $C$DW$509, DW_AT_decl_line(0x70)
    5636                            .dwattr $C$DW$509, DW_AT_decl_column(0x1e)
    5637                    
    5638                    $C$DW$510       .dwtag  DW_TAG_member
    5639                            .dwattr $C$DW$510, DW_AT_type(*$C$DW$T$46)
    5640                            .dwattr $C$DW$510, DW_AT_name("macKeyIdLookupList")
    5641                            .dwattr $C$DW$510, DW_AT_TI_symbol_name("macKeyIdLookupList")
    5642                            .dwattr $C$DW$510, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
    5643                            .dwattr $C$DW$510, DW_AT_accessibility(DW_ACCESS_public)
    5644                            .dwattr $C$DW$510, DW_AT_decl_file("..\Application\MAC\HighLevel\mac_security_pib.h")
    5645                            .dwattr $C$DW$510, DW_AT_decl_line(0x71)
    5646                            .dwattr $C$DW$510, DW_AT_decl_column(0x1e)
    5647                    
    5648                    $C$DW$511       .dwtag  DW_TAG_member
    5649                            .dwattr $C$DW$511, DW_AT_type(*$C$DW$T$48)
    5650                            .dwattr $C$DW$511, DW_AT_name("macKeyDeviceList")
    5651                            .dwattr $C$DW$511, DW_AT_TI_symbol_name("macKeyDeviceList")
    5652                            .dwattr $C$DW$511, DW_AT_data_member_location[DW_OP_plus_uconst 0x90]
    5653                            .dwattr $C$DW$511, DW_AT_accessibility(DW_ACCESS_public)
    5654                            .dwattr $C$DW$511, DW_AT_decl_file("..\Application\MAC\HighLevel\mac_security_pib.h")
    5655                            .dwattr $C$DW$511, DW_AT_decl_line(0x72)
    5656                            .dwattr $C$DW$511, DW_AT_decl_column(0x1e)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:25 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{5D65ECDE-4882-4DA3-96F9-CCC8C19D381F} PAGE  104

    5657                    
    5658                    $C$DW$512       .dwtag  DW_TAG_member
    5659                            .dwattr $C$DW$512, DW_AT_type(*$C$DW$T$50)
    5660                            .dwattr $C$DW$512, DW_AT_name("macKeyUsageList")
    5661                            .dwattr $C$DW$512, DW_AT_TI_symbol_name("macKeyUsageList")
    5662                            .dwattr $C$DW$512, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    5663                            .dwattr $C$DW$512, DW_AT_accessibility(DW_ACCESS_public)
    5664                            .dwattr $C$DW$512, DW_AT_decl_file("..\Application\MAC\HighLevel\mac_security_pib.h")
    5665                            .dwattr $C$DW$512, DW_AT_decl_line(0x73)
    5666                            .dwattr $C$DW$512, DW_AT_decl_column(0x1e)
    5667                    
    5668                    $C$DW$513       .dwtag  DW_TAG_member
    5669                            .dwattr $C$DW$513, DW_AT_type(*$C$DW$T$52)
    5670                            .dwattr $C$DW$513, DW_AT_name("macDeviceTable")
    5671                            .dwattr $C$DW$513, DW_AT_TI_symbol_name("macDeviceTable")
    5672                            .dwattr $C$DW$513, DW_AT_data_member_location[DW_OP_plus_uconst 0xac]
    5673                            .dwattr $C$DW$513, DW_AT_accessibility(DW_ACCESS_public)
    5674                            .dwattr $C$DW$513, DW_AT_decl_file("..\Application\MAC\HighLevel\mac_security_pib.h")
    5675                            .dwattr $C$DW$513, DW_AT_decl_line(0x74)
    5676                            .dwattr $C$DW$513, DW_AT_decl_column(0x1e)
    5677                    
    5678                    $C$DW$514       .dwtag  DW_TAG_member
    5679                            .dwattr $C$DW$514, DW_AT_type(*$C$DW$T$54)
    5680                            .dwattr $C$DW$514, DW_AT_name("macSecurityLevelTable")
    5681                            .dwattr $C$DW$514, DW_AT_TI_symbol_name("macSecurityLevelTable")
    5682                            .dwattr $C$DW$514, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    5683                            .dwattr $C$DW$514, DW_AT_accessibility(DW_ACCESS_public)
    5684                            .dwattr $C$DW$514, DW_AT_decl_file("..\Application\MAC\HighLevel\mac_security_pib.h")
    5685                            .dwattr $C$DW$514, DW_AT_decl_line(0x75)
    5686                            .dwattr $C$DW$514, DW_AT_decl_column(0x1e)
    5687                    
    5688                            .dwattr $C$DW$T$55, DW_AT_decl_file("..\Application\MAC\HighLevel\mac_security_pib.h")
    5689                            .dwattr $C$DW$T$55, DW_AT_decl_line(0x61)
    5690                            .dwattr $C$DW$T$55, DW_AT_decl_column(0x01)
    5691                            .dwendtag $C$DW$T$55
    5692                    
    5693                    $C$DW$T$589     .dwtag  DW_TAG_typedef
    5694                            .dwattr $C$DW$T$589, DW_AT_name("macSecurityPib_t")
    5695                            .dwattr $C$DW$T$589, DW_AT_type(*$C$DW$T$55)
    5696                            .dwattr $C$DW$T$589, DW_AT_language(DW_LANG_C)
    5697                            .dwattr $C$DW$T$589, DW_AT_decl_file("..\Application\MAC\HighLevel\mac_security_pib.h")
    5698                            .dwattr $C$DW$T$589, DW_AT_decl_line(0x77)
    5699                            .dwattr $C$DW$T$589, DW_AT_decl_column(0x03)
    5700                    
    5701                    
    5702                    $C$DW$T$56      .dwtag  DW_TAG_structure_type
    5703                            .dwattr $C$DW$T$56, DW_AT_byte_size(0x0c)
    5704                    $C$DW$515       .dwtag  DW_TAG_member
    5705                            .dwattr $C$DW$515, DW_AT_type(*$C$DW$T$19)
    5706                            .dwattr $C$DW$515, DW_AT_name("key_index")
    5707                            .dwattr $C$DW$515, DW_AT_TI_symbol_name("key_index")
    5708                            .dwattr $C$DW$515, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5709                            .dwattr $C$DW$515, DW_AT_accessibility(DW_ACCESS_public)
    5710                            .dwattr $C$DW$515, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    5711                            .dwattr $C$DW$515, DW_AT_decl_line(0x304)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:25 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{5D65ECDE-4882-4DA3-96F9-CCC8C19D381F} PAGE  105

    5712                            .dwattr $C$DW$515, DW_AT_decl_column(0x1b)
    5713                    
    5714                    $C$DW$516       .dwtag  DW_TAG_member
    5715                            .dwattr $C$DW$516, DW_AT_type(*$C$DW$T$19)
    5716                            .dwattr $C$DW$516, DW_AT_name("key_id_lookup_index")
    5717                            .dwattr $C$DW$516, DW_AT_TI_symbol_name("key_id_lookup_index")
    5718                            .dwattr $C$DW$516, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5719                            .dwattr $C$DW$516, DW_AT_accessibility(DW_ACCESS_public)
    5720                            .dwattr $C$DW$516, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    5721                            .dwattr $C$DW$516, DW_AT_decl_line(0x305)
    5722                            .dwattr $C$DW$516, DW_AT_decl_column(0x1b)
    5723                    
    5724                    $C$DW$517       .dwtag  DW_TAG_member
    5725                            .dwattr $C$DW$517, DW_AT_type(*$C$DW$T$27)
    5726                            .dwattr $C$DW$517, DW_AT_name("macKeyIdLookupEntry")
    5727                            .dwattr $C$DW$517, DW_AT_TI_symbol_name("macKeyIdLookupEntry")
    5728                            .dwattr $C$DW$517, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5729                            .dwattr $C$DW$517, DW_AT_accessibility(DW_ACCESS_public)
    5730                            .dwattr $C$DW$517, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    5731                            .dwattr $C$DW$517, DW_AT_decl_line(0x306)
    5732                            .dwattr $C$DW$517, DW_AT_decl_column(0x1b)
    5733                    
    5734                            .dwattr $C$DW$T$56, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/M
    5735                            .dwattr $C$DW$T$56, DW_AT_decl_line(0x303)
    5736                            .dwattr $C$DW$T$56, DW_AT_decl_column(0x01)
    5737                            .dwendtag $C$DW$T$56
    5738                    
    5739                    $C$DW$T$591     .dwtag  DW_TAG_typedef
    5740                            .dwattr $C$DW$T$591, DW_AT_name("macSecurityPibKeyIdLookupEntry_t")
    5741                            .dwattr $C$DW$T$591, DW_AT_type(*$C$DW$T$56)
    5742                            .dwattr $C$DW$T$591, DW_AT_language(DW_LANG_C)
    5743                            .dwattr $C$DW$T$591, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/
    5744                            .dwattr $C$DW$T$591, DW_AT_decl_line(0x307)
    5745                            .dwattr $C$DW$T$591, DW_AT_decl_column(0x03)
    5746                    
    5747                    
    5748                    $C$DW$T$57      .dwtag  DW_TAG_structure_type
    5749                            .dwattr $C$DW$T$57, DW_AT_byte_size(0x05)
    5750                    $C$DW$518       .dwtag  DW_TAG_member
    5751                            .dwattr $C$DW$518, DW_AT_type(*$C$DW$T$19)
    5752                            .dwattr $C$DW$518, DW_AT_name("key_index")
    5753                            .dwattr $C$DW$518, DW_AT_TI_symbol_name("key_index")
    5754                            .dwattr $C$DW$518, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5755                            .dwattr $C$DW$518, DW_AT_accessibility(DW_ACCESS_public)
    5756                            .dwattr $C$DW$518, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    5757                            .dwattr $C$DW$518, DW_AT_decl_line(0x30b)
    5758                            .dwattr $C$DW$518, DW_AT_decl_column(0x1b)
    5759                    
    5760                    $C$DW$519       .dwtag  DW_TAG_member
    5761                            .dwattr $C$DW$519, DW_AT_type(*$C$DW$T$19)
    5762                            .dwattr $C$DW$519, DW_AT_name("key_device_index")
    5763                            .dwattr $C$DW$519, DW_AT_TI_symbol_name("key_device_index")
    5764                            .dwattr $C$DW$519, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5765                            .dwattr $C$DW$519, DW_AT_accessibility(DW_ACCESS_public)
    5766                            .dwattr $C$DW$519, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:25 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{5D65ECDE-4882-4DA3-96F9-CCC8C19D381F} PAGE  106

    5767                            .dwattr $C$DW$519, DW_AT_decl_line(0x30c)
    5768                            .dwattr $C$DW$519, DW_AT_decl_column(0x1b)
    5769                    
    5770                    $C$DW$520       .dwtag  DW_TAG_member
    5771                            .dwattr $C$DW$520, DW_AT_type(*$C$DW$T$29)
    5772                            .dwattr $C$DW$520, DW_AT_name("macKeyDeviceEntry")
    5773                            .dwattr $C$DW$520, DW_AT_TI_symbol_name("macKeyDeviceEntry")
    5774                            .dwattr $C$DW$520, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5775                            .dwattr $C$DW$520, DW_AT_accessibility(DW_ACCESS_public)
    5776                            .dwattr $C$DW$520, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    5777                            .dwattr $C$DW$520, DW_AT_decl_line(0x30d)
    5778                            .dwattr $C$DW$520, DW_AT_decl_column(0x1b)
    5779                    
    5780                            .dwattr $C$DW$T$57, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/M
    5781                            .dwattr $C$DW$T$57, DW_AT_decl_line(0x30a)
    5782                            .dwattr $C$DW$T$57, DW_AT_decl_column(0x01)
    5783                            .dwendtag $C$DW$T$57
    5784                    
    5785                    $C$DW$T$593     .dwtag  DW_TAG_typedef
    5786                            .dwattr $C$DW$T$593, DW_AT_name("macSecurityPibKeyDeviceEntry_t")
    5787                            .dwattr $C$DW$T$593, DW_AT_type(*$C$DW$T$57)
    5788                            .dwattr $C$DW$T$593, DW_AT_language(DW_LANG_C)
    5789                            .dwattr $C$DW$T$593, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/
    5790                            .dwattr $C$DW$T$593, DW_AT_decl_line(0x30e)
    5791                            .dwattr $C$DW$T$593, DW_AT_decl_column(0x03)
    5792                    
    5793                    
    5794                    $C$DW$T$58      .dwtag  DW_TAG_structure_type
    5795                            .dwattr $C$DW$T$58, DW_AT_byte_size(0x04)
    5796                    $C$DW$521       .dwtag  DW_TAG_member
    5797                            .dwattr $C$DW$521, DW_AT_type(*$C$DW$T$19)
    5798                            .dwattr $C$DW$521, DW_AT_name("key_index")
    5799                            .dwattr $C$DW$521, DW_AT_TI_symbol_name("key_index")
    5800                            .dwattr $C$DW$521, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5801                            .dwattr $C$DW$521, DW_AT_accessibility(DW_ACCESS_public)
    5802                            .dwattr $C$DW$521, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    5803                            .dwattr $C$DW$521, DW_AT_decl_line(0x312)
    5804                            .dwattr $C$DW$521, DW_AT_decl_column(0x1b)
    5805                    
    5806                    $C$DW$522       .dwtag  DW_TAG_member
    5807                            .dwattr $C$DW$522, DW_AT_type(*$C$DW$T$19)
    5808                            .dwattr $C$DW$522, DW_AT_name("key_key_usage_index")
    5809                            .dwattr $C$DW$522, DW_AT_TI_symbol_name("key_key_usage_index")
    5810                            .dwattr $C$DW$522, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5811                            .dwattr $C$DW$522, DW_AT_accessibility(DW_ACCESS_public)
    5812                            .dwattr $C$DW$522, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    5813                            .dwattr $C$DW$522, DW_AT_decl_line(0x313)
    5814                            .dwattr $C$DW$522, DW_AT_decl_column(0x1b)
    5815                    
    5816                    $C$DW$523       .dwtag  DW_TAG_member
    5817                            .dwattr $C$DW$523, DW_AT_type(*$C$DW$T$31)
    5818                            .dwattr $C$DW$523, DW_AT_name("macKeyUsageEntry")
    5819                            .dwattr $C$DW$523, DW_AT_TI_symbol_name("macKeyUsageEntry")
    5820                            .dwattr $C$DW$523, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5821                            .dwattr $C$DW$523, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:25 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{5D65ECDE-4882-4DA3-96F9-CCC8C19D381F} PAGE  107

    5822                            .dwattr $C$DW$523, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    5823                            .dwattr $C$DW$523, DW_AT_decl_line(0x314)
    5824                            .dwattr $C$DW$523, DW_AT_decl_column(0x1b)
    5825                    
    5826                            .dwattr $C$DW$T$58, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/M
    5827                            .dwattr $C$DW$T$58, DW_AT_decl_line(0x311)
    5828                            .dwattr $C$DW$T$58, DW_AT_decl_column(0x01)
    5829                            .dwendtag $C$DW$T$58
    5830                    
    5831                    $C$DW$T$595     .dwtag  DW_TAG_typedef
    5832                            .dwattr $C$DW$T$595, DW_AT_name("macSecurityPibKeyUsageEntry_t")
    5833                            .dwattr $C$DW$T$595, DW_AT_type(*$C$DW$T$58)
    5834                            .dwattr $C$DW$T$595, DW_AT_language(DW_LANG_C)
    5835                            .dwattr $C$DW$T$595, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/
    5836                            .dwattr $C$DW$T$595, DW_AT_decl_line(0x315)
    5837                            .dwattr $C$DW$T$595, DW_AT_decl_column(0x03)
    5838                    
    5839                    
    5840                    $C$DW$T$59      .dwtag  DW_TAG_structure_type
    5841                            .dwattr $C$DW$T$59, DW_AT_byte_size(0x18)
    5842                    $C$DW$524       .dwtag  DW_TAG_member
    5843                            .dwattr $C$DW$524, DW_AT_type(*$C$DW$T$19)
    5844                            .dwattr $C$DW$524, DW_AT_name("key_index")
    5845                            .dwattr $C$DW$524, DW_AT_TI_symbol_name("key_index")
    5846                            .dwattr $C$DW$524, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5847                            .dwattr $C$DW$524, DW_AT_accessibility(DW_ACCESS_public)
    5848                            .dwattr $C$DW$524, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    5849                            .dwattr $C$DW$524, DW_AT_decl_line(0x319)
    5850                            .dwattr $C$DW$524, DW_AT_decl_column(0x1b)
    5851                    
    5852                    $C$DW$525       .dwtag  DW_TAG_member
    5853                            .dwattr $C$DW$525, DW_AT_type(*$C$DW$T$33)
    5854                            .dwattr $C$DW$525, DW_AT_name("keyEntry")
    5855                            .dwattr $C$DW$525, DW_AT_TI_symbol_name("keyEntry")
    5856                            .dwattr $C$DW$525, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5857                            .dwattr $C$DW$525, DW_AT_accessibility(DW_ACCESS_public)
    5858                            .dwattr $C$DW$525, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    5859                            .dwattr $C$DW$525, DW_AT_decl_line(0x31a)
    5860                            .dwattr $C$DW$525, DW_AT_decl_column(0x1b)
    5861                    
    5862                    $C$DW$526       .dwtag  DW_TAG_member
    5863                            .dwattr $C$DW$526, DW_AT_type(*$C$DW$T$34)
    5864                            .dwattr $C$DW$526, DW_AT_name("frameCounter")
    5865                            .dwattr $C$DW$526, DW_AT_TI_symbol_name("frameCounter")
    5866                            .dwattr $C$DW$526, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    5867                            .dwattr $C$DW$526, DW_AT_accessibility(DW_ACCESS_public)
    5868                            .dwattr $C$DW$526, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    5869                            .dwattr $C$DW$526, DW_AT_decl_line(0x31b)
    5870                            .dwattr $C$DW$526, DW_AT_decl_column(0x1b)
    5871                    
    5872                            .dwattr $C$DW$T$59, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/M
    5873                            .dwattr $C$DW$T$59, DW_AT_decl_line(0x318)
    5874                            .dwattr $C$DW$T$59, DW_AT_decl_column(0x01)
    5875                            .dwendtag $C$DW$T$59
    5876                    
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:25 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{5D65ECDE-4882-4DA3-96F9-CCC8C19D381F} PAGE  108

    5877                    $C$DW$T$597     .dwtag  DW_TAG_typedef
    5878                            .dwattr $C$DW$T$597, DW_AT_name("macSecurityPibKeyEntry_t")
    5879                            .dwattr $C$DW$T$597, DW_AT_type(*$C$DW$T$59)
    5880                            .dwattr $C$DW$T$597, DW_AT_language(DW_LANG_C)
    5881                            .dwattr $C$DW$T$597, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/
    5882                            .dwattr $C$DW$T$597, DW_AT_decl_line(0x31c)
    5883                            .dwattr $C$DW$T$597, DW_AT_decl_column(0x03)
    5884                    
    5885                    
    5886                    $C$DW$T$60      .dwtag  DW_TAG_structure_type
    5887                            .dwattr $C$DW$T$60, DW_AT_byte_size(0x1c)
    5888                    $C$DW$527       .dwtag  DW_TAG_member
    5889                            .dwattr $C$DW$527, DW_AT_type(*$C$DW$T$19)
    5890                            .dwattr $C$DW$527, DW_AT_name("device_index")
    5891                            .dwattr $C$DW$527, DW_AT_TI_symbol_name("device_index")
    5892                            .dwattr $C$DW$527, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5893                            .dwattr $C$DW$527, DW_AT_accessibility(DW_ACCESS_public)
    5894                            .dwattr $C$DW$527, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    5895                            .dwattr $C$DW$527, DW_AT_decl_line(0x320)
    5896                            .dwattr $C$DW$527, DW_AT_decl_column(0x1b)
    5897                    
    5898                    $C$DW$528       .dwtag  DW_TAG_member
    5899                            .dwattr $C$DW$528, DW_AT_type(*$C$DW$T$51)
    5900                            .dwattr $C$DW$528, DW_AT_name("macDeviceEntry")
    5901                            .dwattr $C$DW$528, DW_AT_TI_symbol_name("macDeviceEntry")
    5902                            .dwattr $C$DW$528, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5903                            .dwattr $C$DW$528, DW_AT_accessibility(DW_ACCESS_public)
    5904                            .dwattr $C$DW$528, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    5905                            .dwattr $C$DW$528, DW_AT_decl_line(0x321)
    5906                            .dwattr $C$DW$528, DW_AT_decl_column(0x1b)
    5907                    
    5908                            .dwattr $C$DW$T$60, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/M
    5909                            .dwattr $C$DW$T$60, DW_AT_decl_line(0x31f)
    5910                            .dwattr $C$DW$T$60, DW_AT_decl_column(0x01)
    5911                            .dwendtag $C$DW$T$60
    5912                    
    5913                    $C$DW$T$599     .dwtag  DW_TAG_typedef
    5914                            .dwattr $C$DW$T$599, DW_AT_name("macSecurityPibDeviceEntry_t")
    5915                            .dwattr $C$DW$T$599, DW_AT_type(*$C$DW$T$60)
    5916                            .dwattr $C$DW$T$599, DW_AT_language(DW_LANG_C)
    5917                            .dwattr $C$DW$T$599, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/
    5918                            .dwattr $C$DW$T$599, DW_AT_decl_line(0x322)
    5919                            .dwattr $C$DW$T$599, DW_AT_decl_column(0x03)
    5920                    
    5921                    
    5922                    $C$DW$T$61      .dwtag  DW_TAG_structure_type
    5923                            .dwattr $C$DW$T$61, DW_AT_byte_size(0x05)
    5924                    $C$DW$529       .dwtag  DW_TAG_member
    5925                            .dwattr $C$DW$529, DW_AT_type(*$C$DW$T$19)
    5926                            .dwattr $C$DW$529, DW_AT_name("security_level_index")
    5927                            .dwattr $C$DW$529, DW_AT_TI_symbol_name("security_level_index")
    5928                            .dwattr $C$DW$529, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5929                            .dwattr $C$DW$529, DW_AT_accessibility(DW_ACCESS_public)
    5930                            .dwattr $C$DW$529, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    5931                            .dwattr $C$DW$529, DW_AT_decl_line(0x326)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:25 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{5D65ECDE-4882-4DA3-96F9-CCC8C19D381F} PAGE  109

    5932                            .dwattr $C$DW$529, DW_AT_decl_column(0x1f)
    5933                    
    5934                    $C$DW$530       .dwtag  DW_TAG_member
    5935                            .dwattr $C$DW$530, DW_AT_type(*$C$DW$T$53)
    5936                            .dwattr $C$DW$530, DW_AT_name("macSecurityLevelEntry")
    5937                            .dwattr $C$DW$530, DW_AT_TI_symbol_name("macSecurityLevelEntry")
    5938                            .dwattr $C$DW$530, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5939                            .dwattr $C$DW$530, DW_AT_accessibility(DW_ACCESS_public)
    5940                            .dwattr $C$DW$530, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    5941                            .dwattr $C$DW$530, DW_AT_decl_line(0x327)
    5942                            .dwattr $C$DW$530, DW_AT_decl_column(0x1f)
    5943                    
    5944                            .dwattr $C$DW$T$61, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/M
    5945                            .dwattr $C$DW$T$61, DW_AT_decl_line(0x325)
    5946                            .dwattr $C$DW$T$61, DW_AT_decl_column(0x01)
    5947                            .dwendtag $C$DW$T$61
    5948                    
    5949                    $C$DW$T$601     .dwtag  DW_TAG_typedef
    5950                            .dwattr $C$DW$T$601, DW_AT_name("macSecurityPibSecurityLevelEntry_t")
    5951                            .dwattr $C$DW$T$601, DW_AT_type(*$C$DW$T$61)
    5952                            .dwattr $C$DW$T$601, DW_AT_language(DW_LANG_C)
    5953                            .dwattr $C$DW$T$601, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/
    5954                            .dwattr $C$DW$T$601, DW_AT_decl_line(0x328)
    5955                            .dwattr $C$DW$T$601, DW_AT_decl_column(0x03)
    5956                    
    5957                    
    5958                    $C$DW$T$103     .dwtag  DW_TAG_structure_type
    5959                            .dwattr $C$DW$T$103, DW_AT_byte_size(0x4c)
    5960                    $C$DW$531       .dwtag  DW_TAG_member
    5961                            .dwattr $C$DW$531, DW_AT_type(*$C$DW$T$67)
    5962                            .dwattr $C$DW$531, DW_AT_name("Crc32")
    5963                            .dwattr $C$DW$531, DW_AT_TI_symbol_name("Crc32")
    5964                            .dwattr $C$DW$531, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5965                            .dwattr $C$DW$531, DW_AT_accessibility(DW_ACCESS_public)
    5966                            .dwattr $C$DW$531, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    5967                            .dwattr $C$DW$531, DW_AT_decl_line(0x76)
    5968                            .dwattr $C$DW$531, DW_AT_decl_column(0x25)
    5969                    
    5970                    $C$DW$532       .dwtag  DW_TAG_member
    5971                            .dwattr $C$DW$532, DW_AT_type(*$C$DW$T$70)
    5972                            .dwattr $C$DW$532, DW_AT_name("FlashGetSize")
    5973                            .dwattr $C$DW$532, DW_AT_TI_symbol_name("FlashGetSize")
    5974                            .dwattr $C$DW$532, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5975                            .dwattr $C$DW$532, DW_AT_accessibility(DW_ACCESS_public)
    5976                            .dwattr $C$DW$532, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    5977                            .dwattr $C$DW$532, DW_AT_decl_line(0x77)
    5978                            .dwattr $C$DW$532, DW_AT_decl_column(0x25)
    5979                    
    5980                    $C$DW$533       .dwtag  DW_TAG_member
    5981                            .dwattr $C$DW$533, DW_AT_type(*$C$DW$T$71)
    5982                            .dwattr $C$DW$533, DW_AT_name("GetChipId")
    5983                            .dwattr $C$DW$533, DW_AT_TI_symbol_name("GetChipId")
    5984                            .dwattr $C$DW$533, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5985                            .dwattr $C$DW$533, DW_AT_accessibility(DW_ACCESS_public)
    5986                            .dwattr $C$DW$533, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:25 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{5D65ECDE-4882-4DA3-96F9-CCC8C19D381F} PAGE  110

    5987                            .dwattr $C$DW$533, DW_AT_decl_line(0x78)
    5988                            .dwattr $C$DW$533, DW_AT_decl_column(0x25)
    5989                    
    5990                    $C$DW$534       .dwtag  DW_TAG_member
    5991                            .dwattr $C$DW$534, DW_AT_type(*$C$DW$T$74)
    5992                            .dwattr $C$DW$534, DW_AT_name("ReservedLocation1")
    5993                            .dwattr $C$DW$534, DW_AT_TI_symbol_name("ReservedLocation1")
    5994                            .dwattr $C$DW$534, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5995                            .dwattr $C$DW$534, DW_AT_accessibility(DW_ACCESS_public)
    5996                            .dwattr $C$DW$534, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    5997                            .dwattr $C$DW$534, DW_AT_decl_line(0x79)
    5998                            .dwattr $C$DW$534, DW_AT_decl_column(0x25)
    5999                    
    6000                    $C$DW$535       .dwtag  DW_TAG_member
    6001                            .dwattr $C$DW$535, DW_AT_type(*$C$DW$T$75)
    6002                            .dwattr $C$DW$535, DW_AT_name("ReservedLocation2")
    6003                            .dwattr $C$DW$535, DW_AT_TI_symbol_name("ReservedLocation2")
    6004                            .dwattr $C$DW$535, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6005                            .dwattr $C$DW$535, DW_AT_accessibility(DW_ACCESS_public)
    6006                            .dwattr $C$DW$535, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    6007                            .dwattr $C$DW$535, DW_AT_decl_line(0x7a)
    6008                            .dwattr $C$DW$535, DW_AT_decl_column(0x25)
    6009                    
    6010                    $C$DW$536       .dwtag  DW_TAG_member
    6011                            .dwattr $C$DW$536, DW_AT_type(*$C$DW$T$76)
    6012                            .dwattr $C$DW$536, DW_AT_name("ReservedLocation3")
    6013                            .dwattr $C$DW$536, DW_AT_TI_symbol_name("ReservedLocation3")
    6014                            .dwattr $C$DW$536, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    6015                            .dwattr $C$DW$536, DW_AT_accessibility(DW_ACCESS_public)
    6016                            .dwattr $C$DW$536, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    6017                            .dwattr $C$DW$536, DW_AT_decl_line(0x7b)
    6018                            .dwattr $C$DW$536, DW_AT_decl_column(0x25)
    6019                    
    6020                    $C$DW$537       .dwtag  DW_TAG_member
    6021                            .dwattr $C$DW$537, DW_AT_type(*$C$DW$T$79)
    6022                            .dwattr $C$DW$537, DW_AT_name("ResetDevice")
    6023                            .dwattr $C$DW$537, DW_AT_TI_symbol_name("ResetDevice")
    6024                            .dwattr $C$DW$537, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    6025                            .dwattr $C$DW$537, DW_AT_accessibility(DW_ACCESS_public)
    6026                            .dwattr $C$DW$537, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    6027                            .dwattr $C$DW$537, DW_AT_decl_line(0x7c)
    6028                            .dwattr $C$DW$537, DW_AT_decl_column(0x25)
    6029                    
    6030                    $C$DW$538       .dwtag  DW_TAG_member
    6031                            .dwattr $C$DW$538, DW_AT_type(*$C$DW$T$84)
    6032                            .dwattr $C$DW$538, DW_AT_name("Fletcher32")
    6033                            .dwattr $C$DW$538, DW_AT_TI_symbol_name("Fletcher32")
    6034                            .dwattr $C$DW$538, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    6035                            .dwattr $C$DW$538, DW_AT_accessibility(DW_ACCESS_public)
    6036                            .dwattr $C$DW$538, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    6037                            .dwattr $C$DW$538, DW_AT_decl_line(0x7d)
    6038                            .dwattr $C$DW$538, DW_AT_decl_column(0x25)
    6039                    
    6040                    $C$DW$539       .dwtag  DW_TAG_member
    6041                            .dwattr $C$DW$539, DW_AT_type(*$C$DW$T$88)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:25 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{5D65ECDE-4882-4DA3-96F9-CCC8C19D381F} PAGE  111

    6042                            .dwattr $C$DW$539, DW_AT_name("MinValue")
    6043                            .dwattr $C$DW$539, DW_AT_TI_symbol_name("MinValue")
    6044                            .dwattr $C$DW$539, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    6045                            .dwattr $C$DW$539, DW_AT_accessibility(DW_ACCESS_public)
    6046                            .dwattr $C$DW$539, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    6047                            .dwattr $C$DW$539, DW_AT_decl_line(0x7e)
    6048                            .dwattr $C$DW$539, DW_AT_decl_column(0x25)
    6049                    
    6050                    $C$DW$540       .dwtag  DW_TAG_member
    6051                            .dwattr $C$DW$540, DW_AT_type(*$C$DW$T$89)
    6052                            .dwattr $C$DW$540, DW_AT_name("MaxValue")
    6053                            .dwattr $C$DW$540, DW_AT_TI_symbol_name("MaxValue")
    6054                            .dwattr $C$DW$540, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    6055                            .dwattr $C$DW$540, DW_AT_accessibility(DW_ACCESS_public)
    6056                            .dwattr $C$DW$540, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    6057                            .dwattr $C$DW$540, DW_AT_decl_line(0x7f)
    6058                            .dwattr $C$DW$540, DW_AT_decl_column(0x25)
    6059                    
    6060                    $C$DW$541       .dwtag  DW_TAG_member
    6061                            .dwattr $C$DW$541, DW_AT_type(*$C$DW$T$90)
    6062                            .dwattr $C$DW$541, DW_AT_name("MeanValue")
    6063                            .dwattr $C$DW$541, DW_AT_TI_symbol_name("MeanValue")
    6064                            .dwattr $C$DW$541, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    6065                            .dwattr $C$DW$541, DW_AT_accessibility(DW_ACCESS_public)
    6066                            .dwattr $C$DW$541, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    6067                            .dwattr $C$DW$541, DW_AT_decl_line(0x80)
    6068                            .dwattr $C$DW$541, DW_AT_decl_column(0x25)
    6069                    
    6070                    $C$DW$542       .dwtag  DW_TAG_member
    6071                            .dwattr $C$DW$542, DW_AT_type(*$C$DW$T$91)
    6072                            .dwattr $C$DW$542, DW_AT_name("StandDeviationValue")
    6073                            .dwattr $C$DW$542, DW_AT_TI_symbol_name("StandDeviationValue")
    6074                            .dwattr $C$DW$542, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    6075                            .dwattr $C$DW$542, DW_AT_accessibility(DW_ACCESS_public)
    6076                            .dwattr $C$DW$542, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    6077                            .dwattr $C$DW$542, DW_AT_decl_line(0x81)
    6078                            .dwattr $C$DW$542, DW_AT_decl_column(0x25)
    6079                    
    6080                    $C$DW$543       .dwtag  DW_TAG_member
    6081                            .dwattr $C$DW$543, DW_AT_type(*$C$DW$T$94)
    6082                            .dwattr $C$DW$543, DW_AT_name("ReservedLocation4")
    6083                            .dwattr $C$DW$543, DW_AT_TI_symbol_name("ReservedLocation4")
    6084                            .dwattr $C$DW$543, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    6085                            .dwattr $C$DW$543, DW_AT_accessibility(DW_ACCESS_public)
    6086                            .dwattr $C$DW$543, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    6087                            .dwattr $C$DW$543, DW_AT_decl_line(0x82)
    6088                            .dwattr $C$DW$543, DW_AT_decl_column(0x25)
    6089                    
    6090                    $C$DW$544       .dwtag  DW_TAG_member
    6091                            .dwattr $C$DW$544, DW_AT_type(*$C$DW$T$95)
    6092                            .dwattr $C$DW$544, DW_AT_name("ReservedLocation5")
    6093                            .dwattr $C$DW$544, DW_AT_TI_symbol_name("ReservedLocation5")
