TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:24 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{44BCB735-7A54-47AF-A239-E7BCF205B6E4} PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                        PC v16.9.4.LTS *
       3                    ;* Date/Time created: Sat Nov 18 18:46:24 2017                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../Application/MAC/HighLevel/mac_cfg.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v16.9.4.LTS Copyright (c) 1996-20
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Kevin\workspace_v7\sensor_cc1310lp\sensor_cc1310lp"
      13                            .global macCfg
      14 00000000                   .sect   ".const:macCfg"

    2166                            .dwattr $C$DW$234, DW_AT_const_value(0x08)
    2167                            .dwattr $C$DW$234, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2168                            .dwattr $C$DW$234, DW_AT_decl_line(0xa8)
    2169                            .dwattr $C$DW$234, DW_AT_decl_column(0x05)
    2170                    
    2171                    $C$DW$235       .dwtag  DW_TAG_enumerator
    2172                            .dwattr $C$DW$235, DW_AT_name("FAPI_VALIDATE_SECTOR")
    2173                            .dwattr $C$DW$235, DW_AT_const_value(0x0e)
    2174                            .dwattr $C$DW$235, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2175                            .dwattr $C$DW$235, DW_AT_decl_line(0xa9)
    2176                            .dwattr $C$DW$235, DW_AT_decl_column(0x05)
    2177                    
    2178                    $C$DW$236       .dwtag  DW_TAG_enumerator
    2179                            .dwattr $C$DW$236, DW_AT_name("FAPI_CLEAR_STATUS")
    2180                            .dwattr $C$DW$236, DW_AT_const_value(0x10)
    2181                            .dwattr $C$DW$236, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2182                            .dwattr $C$DW$236, DW_AT_decl_line(0xaa)
    2183                            .dwattr $C$DW$236, DW_AT_decl_column(0x05)
    2184                    
    2185                    $C$DW$237       .dwtag  DW_TAG_enumerator
    2186                            .dwattr $C$DW$237, DW_AT_name("FAPI_PROGRAM_RESUME")
    2187                            .dwattr $C$DW$237, DW_AT_const_value(0x14)
    2188                            .dwattr $C$DW$237, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2189                            .dwattr $C$DW$237, DW_AT_decl_line(0xab)
    2190                            .dwattr $C$DW$237, DW_AT_decl_column(0x05)
    2191                    
    2192                    $C$DW$238       .dwtag  DW_TAG_enumerator
    2193                            .dwattr $C$DW$238, DW_AT_name("FAPI_ERASE_RESUME")
    2194                            .dwattr $C$DW$238, DW_AT_const_value(0x16)
    2195                            .dwattr $C$DW$238, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2196                            .dwattr $C$DW$238, DW_AT_decl_line(0xac)
    2197                            .dwattr $C$DW$238, DW_AT_decl_column(0x05)
    2198                    
    2199                    $C$DW$239       .dwtag  DW_TAG_enumerator
    2200                            .dwattr $C$DW$239, DW_AT_name("FAPI_CLEAR_MORE")
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:24 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{44BCB735-7A54-47AF-A239-E7BCF205B6E4} PAGE   41

    2201                            .dwattr $C$DW$239, DW_AT_const_value(0x18)
    2202                            .dwattr $C$DW$239, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2203                            .dwattr $C$DW$239, DW_AT_decl_line(0xad)
    2204                            .dwattr $C$DW$239, DW_AT_decl_column(0x05)
    2205                    
    2206                    $C$DW$240       .dwtag  DW_TAG_enumerator
    2207                            .dwattr $C$DW$240, DW_AT_name("FAPI_PROGRAM_SECTOR")
    2208                            .dwattr $C$DW$240, DW_AT_const_value(0x20)
    2209                            .dwattr $C$DW$240, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2210                            .dwattr $C$DW$240, DW_AT_decl_line(0xae)
    2211                            .dwattr $C$DW$240, DW_AT_decl_column(0x05)
    2212                    
    2213                    $C$DW$241       .dwtag  DW_TAG_enumerator
    2214                            .dwattr $C$DW$241, DW_AT_name("FAPI_ERASE_OTP")
    2215                            .dwattr $C$DW$241, DW_AT_const_value(0x30)
    2216                            .dwattr $C$DW$241, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2217                            .dwattr $C$DW$241, DW_AT_decl_line(0xaf)
    2218                            .dwattr $C$DW$241, DW_AT_decl_column(0x05)
    2219                    
    2220                            .dwattr $C$DW$T$526, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices
    2221                            .dwattr $C$DW$T$526, DW_AT_decl_line(0xa5)
    2222                            .dwattr $C$DW$T$526, DW_AT_decl_column(0x01)
    2223                            .dwendtag $C$DW$T$526
    2224                    
    2225                    $C$DW$T$527     .dwtag  DW_TAG_typedef
    2226                            .dwattr $C$DW$T$527, DW_AT_name("tFlashStateCommandsType")
    2227                            .dwattr $C$DW$T$527, DW_AT_type(*$C$DW$T$526)
    2228                            .dwattr $C$DW$T$527, DW_AT_language(DW_LANG_C)
    2229                            .dwattr $C$DW$T$527, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices
    2230                            .dwattr $C$DW$T$527, DW_AT_decl_line(0xb0)
    2231                            .dwattr $C$DW$T$527, DW_AT_decl_column(0x03)
    2232                    
    2233                    
    2234                    $C$DW$T$22      .dwtag  DW_TAG_structure_type
    2235                            .dwattr $C$DW$T$22, DW_AT_byte_size(0x08)
    2236                    $C$DW$242       .dwtag  DW_TAG_member
    2237                            .dwattr $C$DW$242, DW_AT_type(*$C$DW$T$19)
    2238                            .dwattr $C$DW$242, DW_AT_name("txDataMax")
    2239                            .dwattr $C$DW$242, DW_AT_TI_symbol_name("txDataMax")
    2240                            .dwattr $C$DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2241                            .dwattr $C$DW$242, DW_AT_accessibility(DW_ACCESS_public)
    2242                            .dwattr $C$DW$242, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    2243                            .dwattr $C$DW$242, DW_AT_decl_line(0x526)
    2244                            .dwattr $C$DW$242, DW_AT_decl_column(0x0b)
    2245                    
    2246                    $C$DW$243       .dwtag  DW_TAG_member
    2247                            .dwattr $C$DW$243, DW_AT_type(*$C$DW$T$19)
    2248                            .dwattr $C$DW$243, DW_AT_name("txMax")
    2249                            .dwattr $C$DW$243, DW_AT_TI_symbol_name("txMax")
    2250                            .dwattr $C$DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2251                            .dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)
    2252                            .dwattr $C$DW$243, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    2253                            .dwattr $C$DW$243, DW_AT_decl_line(0x527)
    2254                            .dwattr $C$DW$243, DW_AT_decl_column(0x0b)
    2255                    
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:24 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{44BCB735-7A54-47AF-A239-E7BCF205B6E4} PAGE   42

    2256                    $C$DW$244       .dwtag  DW_TAG_member
    2257                            .dwattr $C$DW$244, DW_AT_type(*$C$DW$T$19)
    2258                            .dwattr $C$DW$244, DW_AT_name("rxMax")
    2259                            .dwattr $C$DW$244, DW_AT_TI_symbol_name("rxMax")
    2260                            .dwattr $C$DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2261                            .dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)
    2262                            .dwattr $C$DW$244, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    2263                            .dwattr $C$DW$244, DW_AT_decl_line(0x528)
    2264                            .dwattr $C$DW$244, DW_AT_decl_column(0x0b)
    2265                    
    2266                    $C$DW$245       .dwtag  DW_TAG_member
    2267                            .dwattr $C$DW$245, DW_AT_type(*$C$DW$T$19)
    2268                            .dwattr $C$DW$245, DW_AT_name("dataIndOffset")
    2269                            .dwattr $C$DW$245, DW_AT_TI_symbol_name("dataIndOffset")
    2270                            .dwattr $C$DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2271                            .dwattr $C$DW$245, DW_AT_accessibility(DW_ACCESS_public)
    2272                            .dwattr $C$DW$245, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    2273                            .dwattr $C$DW$245, DW_AT_decl_line(0x529)
    2274                            .dwattr $C$DW$245, DW_AT_decl_column(0x0b)
    2275                    
    2276                    $C$DW$246       .dwtag  DW_TAG_member
    2277                            .dwattr $C$DW$246, DW_AT_type(*$C$DW$T$19)
    2278                            .dwattr $C$DW$246, DW_AT_name("maxDeviceTableEntries")
    2279                            .dwattr $C$DW$246, DW_AT_TI_symbol_name("maxDeviceTableEntries")
    2280                            .dwattr $C$DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2281                            .dwattr $C$DW$246, DW_AT_accessibility(DW_ACCESS_public)
    2282                            .dwattr $C$DW$246, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    2283                            .dwattr $C$DW$246, DW_AT_decl_line(0x52b)
    2284                            .dwattr $C$DW$246, DW_AT_decl_column(0x0b)
    2285                    
    2286                    $C$DW$247       .dwtag  DW_TAG_member
    2287                            .dwattr $C$DW$247, DW_AT_type(*$C$DW$T$20)
    2288                            .dwattr $C$DW$247, DW_AT_name("appPendingQueue")
    2289                            .dwattr $C$DW$247, DW_AT_TI_symbol_name("appPendingQueue")
    2290                            .dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2291                            .dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
    2292                            .dwattr $C$DW$247, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    2293                            .dwattr $C$DW$247, DW_AT_decl_line(0x52c)
    2294                            .dwattr $C$DW$247, DW_AT_decl_column(0x0b)
    2295                    
    2296                    $C$DW$248       .dwtag  DW_TAG_member
    2297                            .dwattr $C$DW$248, DW_AT_type(*$C$DW$T$21)
    2298                            .dwattr $C$DW$248, DW_AT_name("macMaxFrameSize")
    2299                            .dwattr $C$DW$248, DW_AT_TI_symbol_name("macMaxFrameSize")
    2300                            .dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2301                            .dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)
    2302                            .dwattr $C$DW$248, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    2303                            .dwattr $C$DW$248, DW_AT_decl_line(0x52e)
    2304                            .dwattr $C$DW$248, DW_AT_decl_column(0x0b)
    2305                    
    2306                            .dwattr $C$DW$T$22, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/M
    2307                            .dwattr $C$DW$T$22, DW_AT_decl_line(0x525)
    2308                            .dwattr $C$DW$T$22, DW_AT_decl_column(0x01)
    2309                            .dwendtag $C$DW$T$22
    2310                    
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:24 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{44BCB735-7A54-47AF-A239-E7BCF205B6E4} PAGE   43

    2311                    $C$DW$T$528     .dwtag  DW_TAG_typedef
    2312                            .dwattr $C$DW$T$528, DW_AT_name("macCfg_t")
    2313                            .dwattr $C$DW$T$528, DW_AT_type(*$C$DW$T$22)
    2314                            .dwattr $C$DW$T$528, DW_AT_language(DW_LANG_C)
    2315                            .dwattr $C$DW$T$528, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/
    2316                            .dwattr $C$DW$T$528, DW_AT_decl_line(0x52f)
    2317                            .dwattr $C$DW$T$528, DW_AT_decl_column(0x03)
    2318                    
    2319                    $C$DW$T$529     .dwtag  DW_TAG_const_type
    2320                            .dwattr $C$DW$T$529, DW_AT_type(*$C$DW$T$528)
    2321                    
    2322                    
    2323                    $C$DW$T$23      .dwtag  DW_TAG_structure_type
    2324                            .dwattr $C$DW$T$23, DW_AT_byte_size(0x0a)
    2325                    $C$DW$249       .dwtag  DW_TAG_member
    2326                            .dwattr $C$DW$249, DW_AT_type(*$C$DW$T$180)
    2327                            .dwattr $C$DW$249, DW_AT_name("addr")
    2328                            .dwattr $C$DW$249, DW_AT_TI_symbol_name("addr")
    2329                            .dwattr $C$DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2330                            .dwattr $C$DW$249, DW_AT_accessibility(DW_ACCESS_public)
    2331                            .dwattr $C$DW$249, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/Se
    2332                            .dwattr $C$DW$249, DW_AT_decl_line(0x52)
    2333                            .dwattr $C$DW$249, DW_AT_decl_column(0x05)
    2334                    
    2335                    $C$DW$250       .dwtag  DW_TAG_member
    2336                            .dwattr $C$DW$250, DW_AT_type(*$C$DW$T$19)
    2337                            .dwattr $C$DW$250, DW_AT_name("addrMode")
    2338                            .dwattr $C$DW$250, DW_AT_TI_symbol_name("addrMode")
    2339                            .dwattr $C$DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2340                            .dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)
    2341                            .dwattr $C$DW$250, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/Se
    2342                            .dwattr $C$DW$250, DW_AT_decl_line(0x53)
    2343                            .dwattr $C$DW$250, DW_AT_decl_column(0x11)
    2344                    
    2345                            .dwattr $C$DW$T$23, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/S
    2346                            .dwattr $C$DW$T$23, DW_AT_decl_line(0x4d)
    2347                            .dwattr $C$DW$T$23, DW_AT_decl_column(0x01)
    2348                            .dwendtag $C$DW$T$23
    2349                    
    2350                    $C$DW$T$72      .dwtag  DW_TAG_typedef
    2351                            .dwattr $C$DW$T$72, DW_AT_name("sAddr_t")
    2352                            .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$23)
    2353                            .dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
    2354                            .dwattr $C$DW$T$72, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/S
    2355                            .dwattr $C$DW$T$72, DW_AT_decl_line(0x54)
    2356                            .dwattr $C$DW$T$72, DW_AT_decl_column(0x03)
    2357                    
    2358                    
    2359                    $C$DW$T$25      .dwtag  DW_TAG_structure_type
    2360                            .dwattr $C$DW$T$25, DW_AT_byte_size(0x08)
    2361                    $C$DW$251       .dwtag  DW_TAG_member
    2362                            .dwattr $C$DW$251, DW_AT_type(*$C$DW$T$24)
    2363                            .dwattr $C$DW$251, DW_AT_name("p")
    2364                            .dwattr $C$DW$251, DW_AT_TI_symbol_name("p")
    2365                            .dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:24 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{44BCB735-7A54-47AF-A239-E7BCF205B6E4} PAGE   44

    2366                            .dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)
    2367                            .dwattr $C$DW$251, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/Se
    2368                            .dwattr $C$DW$251, DW_AT_decl_line(0x3d)
    2369                            .dwattr $C$DW$251, DW_AT_decl_column(0x0e)
    2370                    
    2371                    $C$DW$252       .dwtag  DW_TAG_member
    2372                            .dwattr $C$DW$252, DW_AT_type(*$C$DW$T$21)
    2373                            .dwattr $C$DW$252, DW_AT_name("len")
    2374                            .dwattr $C$DW$252, DW_AT_TI_symbol_name("len")
    2375                            .dwattr $C$DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2376                            .dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)
    2377                            .dwattr $C$DW$252, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/Se
    2378                            .dwattr $C$DW$252, DW_AT_decl_line(0x3e)
    2379                            .dwattr $C$DW$252, DW_AT_decl_column(0x0e)
    2380                    
    2381                            .dwattr $C$DW$T$25, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/S
    2382                            .dwattr $C$DW$T$25, DW_AT_decl_line(0x3c)
    2383                            .dwattr $C$DW$T$25, DW_AT_decl_column(0x01)
    2384                            .dwendtag $C$DW$T$25
    2385                    
    2386                    $C$DW$T$75      .dwtag  DW_TAG_typedef
    2387                            .dwattr $C$DW$T$75, DW_AT_name("sData_t")
    2388                            .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$25)
    2389                            .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    2390                            .dwattr $C$DW$T$75, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/S
    2391                            .dwattr $C$DW$T$75, DW_AT_decl_line(0x3f)
    2392                            .dwattr $C$DW$T$75, DW_AT_decl_column(0x03)
    2393                    
    2394                    
    2395                    $C$DW$T$28      .dwtag  DW_TAG_structure_type
    2396                            .dwattr $C$DW$T$28, DW_AT_byte_size(0x0a)
    2397                    $C$DW$253       .dwtag  DW_TAG_member
    2398                            .dwattr $C$DW$253, DW_AT_type(*$C$DW$T$183)
    2399                            .dwattr $C$DW$253, DW_AT_name("addr")
    2400                            .dwattr $C$DW$253, DW_AT_TI_symbol_name("addr")
    2401                            .dwattr $C$DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2402                            .dwattr $C$DW$253, DW_AT_accessibility(DW_ACCESS_public)
    2403                            .dwattr $C$DW$253, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/ap
    2404                            .dwattr $C$DW$253, DW_AT_decl_line(0x4a7)
    2405                            .dwattr $C$DW$253, DW_AT_decl_column(0x07)
    2406                    
    2407                    $C$DW$254       .dwtag  DW_TAG_member
    2408                            .dwattr $C$DW$254, DW_AT_type(*$C$DW$T$27)
    2409                            .dwattr $C$DW$254, DW_AT_name("addrMode")
    2410                            .dwattr $C$DW$254, DW_AT_TI_symbol_name("addrMode")
    2411                            .dwattr $C$DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2412                            .dwattr $C$DW$254, DW_AT_accessibility(DW_ACCESS_public)
    2413                            .dwattr $C$DW$254, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/ap
    2414                            .dwattr $C$DW$254, DW_AT_decl_line(0x4aa)
    2415                            .dwattr $C$DW$254, DW_AT_decl_column(0x17)
    2416                    
    2417                            .dwattr $C$DW$T$28, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/a
    2418                            .dwattr $C$DW$T$28, DW_AT_decl_line(0x49c)
    2419                            .dwattr $C$DW$T$28, DW_AT_decl_column(0x01)
    2420                            .dwendtag $C$DW$T$28
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:24 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{44BCB735-7A54-47AF-A239-E7BCF205B6E4} PAGE   45

    2421                    
    2422                    $C$DW$T$329     .dwtag  DW_TAG_typedef
    2423                            .dwattr $C$DW$T$329, DW_AT_name("ApiMac_sAddr_t")
    2424                            .dwattr $C$DW$T$329, DW_AT_type(*$C$DW$T$28)
    2425                            .dwattr $C$DW$T$329, DW_AT_language(DW_LANG_C)
    2426                            .dwattr $C$DW$T$329, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/
    2427                            .dwattr $C$DW$T$329, DW_AT_decl_line(0x4ab)
    2428                            .dwattr $C$DW$T$329, DW_AT_decl_column(0x03)
    2429                    
    2430                    
    2431                    $C$DW$T$33      .dwtag  DW_TAG_structure_type
    2432                            .dwattr $C$DW$T$33, DW_AT_byte_size(0x40)
    2433                    $C$DW$255       .dwtag  DW_TAG_member
    2434                            .dwattr $C$DW$255, DW_AT_type(*$C$DW$T$30)
    2435                            .dwattr $C$DW$255, DW_AT_name("beaconType")
    2436                            .dwattr $C$DW$255, DW_AT_TI_symbol_name("beaconType")
    2437                            .dwattr $C$DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2438                            .dwattr $C$DW$255, DW_AT_accessibility(DW_ACCESS_public)
    2439                            .dwattr $C$DW$255, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/ap
    2440                            .dwattr $C$DW$255, DW_AT_decl_line(0x848)
    2441                            .dwattr $C$DW$255, DW_AT_decl_column(0x19)
    2442                    
    2443                    $C$DW$256       .dwtag  DW_TAG_member
    2444                            .dwattr $C$DW$256, DW_AT_type(*$C$DW$T$31)
    2445                            .dwattr $C$DW$256, DW_AT_name("bsn")
    2446                            .dwattr $C$DW$256, DW_AT_TI_symbol_name("bsn")
    2447                            .dwattr $C$DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2448                            .dwattr $C$DW$256, DW_AT_accessibility(DW_ACCESS_public)
    2449                            .dwattr $C$DW$256, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/ap
    2450                            .dwattr $C$DW$256, DW_AT_decl_line(0x84a)
    2451                            .dwattr $C$DW$256, DW_AT_decl_column(0x0d)
    2452                    
    2453                    $C$DW$257       .dwtag  DW_TAG_member
    2454                            .dwattr $C$DW$257, DW_AT_type(*$C$DW$T$32)
    2455                            .dwattr $C$DW$257, DW_AT_name("panDesc")
    2456                            .dwattr $C$DW$257, DW_AT_TI_symbol_name("panDesc")
    2457                            .dwattr $C$DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2458                            .dwattr $C$DW$257, DW_AT_accessibility(DW_ACCESS_public)
    2459                            .dwattr $C$DW$257, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/ap
    2460                            .dwattr $C$DW$257, DW_AT_decl_line(0x84c)
    2461                            .dwattr $C$DW$257, DW_AT_decl_column(0x16)
    2462                    
    2463                    $C$DW$258       .dwtag  DW_TAG_member
    2464                            .dwattr $C$DW$258, DW_AT_type(*$C$DW$T$186)
    2465                            .dwattr $C$DW$258, DW_AT_name("beaconData")
    2466                            .dwattr $C$DW$258, DW_AT_TI_symbol_name("beaconData")
    2467                            .dwattr $C$DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2468                            .dwattr $C$DW$258, DW_AT_accessibility(DW_ACCESS_public)
    2469                            .dwattr $C$DW$258, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/ap
    2470                            .dwattr $C$DW$258, DW_AT_decl_line(0x857)
    2471                            .dwattr $C$DW$258, DW_AT_decl_column(0x07)
    2472                    
    2473                            .dwattr $C$DW$T$33, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/a
    2474                            .dwattr $C$DW$T$33, DW_AT_decl_line(0x846)
    2475                            .dwattr $C$DW$T$33, DW_AT_decl_column(0x01)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:24 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{44BCB735-7A54-47AF-A239-E7BCF205B6E4} PAGE   46

    2476                            .dwendtag $C$DW$T$33
    2477                    
    2478                    $C$DW$T$243     .dwtag  DW_TAG_typedef
    2479                            .dwattr $C$DW$T$243, DW_AT_name("ApiMac_mlmeBeaconNotifyInd_t")
    2480                            .dwattr $C$DW$T$243, DW_AT_type(*$C$DW$T$33)
    2481                            .dwattr $C$DW$T$243, DW_AT_language(DW_LANG_C)
    2482                            .dwattr $C$DW$T$243, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/
    2483                            .dwattr $C$DW$T$243, DW_AT_decl_line(0x858)
    2484                            .dwattr $C$DW$T$243, DW_AT_decl_column(0x03)
    2485                    
    2486                    $C$DW$T$244     .dwtag  DW_TAG_pointer_type
    2487                            .dwattr $C$DW$T$244, DW_AT_type(*$C$DW$T$243)
    2488                            .dwattr $C$DW$T$244, DW_AT_address_class(0x20)
    2489                    
    2490                    
    2491                    $C$DW$T$35      .dwtag  DW_TAG_structure_type
    2492                            .dwattr $C$DW$T$35, DW_AT_byte_size(0x10)
    2493                    $C$DW$259       .dwtag  DW_TAG_member
    2494                            .dwattr $C$DW$259, DW_AT_type(*$C$DW$T$34)
    2495                            .dwattr $C$DW$259, DW_AT_name("firstChCentrFreq")
    2496                            .dwattr $C$DW$259, DW_AT_TI_symbol_name("firstChCentrFreq")
    2497                            .dwattr $C$DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2498                            .dwattr $C$DW$259, DW_AT_accessibility(DW_ACCESS_public)
    2499                            .dwattr $C$DW$259, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    2500                            .dwattr $C$DW$259, DW_AT_decl_line(0x286)
    2501                            .dwattr $C$DW$259, DW_AT_decl_column(0x0a)
    2502                    
    2503                    $C$DW$260       .dwtag  DW_TAG_member
    2504                            .dwattr $C$DW$260, DW_AT_type(*$C$DW$T$34)
    2505                            .dwattr $C$DW$260, DW_AT_name("channelSpacing")
    2506                            .dwattr $C$DW$260, DW_AT_TI_symbol_name("channelSpacing")
    2507                            .dwattr $C$DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2508                            .dwattr $C$DW$260, DW_AT_accessibility(DW_ACCESS_public)
    2509                            .dwattr $C$DW$260, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    2510                            .dwattr $C$DW$260, DW_AT_decl_line(0x287)
    2511                            .dwattr $C$DW$260, DW_AT_decl_column(0x0a)
    2512                    
    2513                    $C$DW$261       .dwtag  DW_TAG_member
    2514                            .dwattr $C$DW$261, DW_AT_type(*$C$DW$T$21)
    2515                            .dwattr $C$DW$261, DW_AT_name("noOfChannels")
    2516                            .dwattr $C$DW$261, DW_AT_TI_symbol_name("noOfChannels")
    2517                            .dwattr $C$DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2518                            .dwattr $C$DW$261, DW_AT_accessibility(DW_ACCESS_public)
    2519                            .dwattr $C$DW$261, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    2520                            .dwattr $C$DW$261, DW_AT_decl_line(0x288)
    2521                            .dwattr $C$DW$261, DW_AT_decl_column(0x0a)
    2522                    
    2523                    $C$DW$262       .dwtag  DW_TAG_member
    2524                            .dwattr $C$DW$262, DW_AT_type(*$C$DW$T$19)
    2525                            .dwattr $C$DW$262, DW_AT_name("fskModScheme")
    2526                            .dwattr $C$DW$262, DW_AT_TI_symbol_name("fskModScheme")
    2527                            .dwattr $C$DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2528                            .dwattr $C$DW$262, DW_AT_accessibility(DW_ACCESS_public)
    2529                            .dwattr $C$DW$262, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    2530                            .dwattr $C$DW$262, DW_AT_decl_line(0x28a)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:24 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{44BCB735-7A54-47AF-A239-E7BCF205B6E4} PAGE   47

    2531                            .dwattr $C$DW$262, DW_AT_decl_column(0x09)
    2532                    
    2533                    $C$DW$263       .dwtag  DW_TAG_member
    2534                            .dwattr $C$DW$263, DW_AT_type(*$C$DW$T$21)
    2535                            .dwattr $C$DW$263, DW_AT_name("symbolRate")
    2536                            .dwattr $C$DW$263, DW_AT_TI_symbol_name("symbolRate")
    2537                            .dwattr $C$DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2538                            .dwattr $C$DW$263, DW_AT_accessibility(DW_ACCESS_public)
    2539                            .dwattr $C$DW$263, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    2540                            .dwattr $C$DW$263, DW_AT_decl_line(0x28c)
    2541                            .dwattr $C$DW$263, DW_AT_decl_column(0x0a)
    2542                    
    2543                    $C$DW$264       .dwtag  DW_TAG_member
    2544                            .dwattr $C$DW$264, DW_AT_type(*$C$DW$T$19)
    2545                            .dwattr $C$DW$264, DW_AT_name("fskModIndex")
    2546                            .dwattr $C$DW$264, DW_AT_TI_symbol_name("fskModIndex")
    2547                            .dwattr $C$DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2548                            .dwattr $C$DW$264, DW_AT_accessibility(DW_ACCESS_public)
    2549                            .dwattr $C$DW$264, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    2550                            .dwattr $C$DW$264, DW_AT_decl_line(0x28d)
    2551                            .dwattr $C$DW$264, DW_AT_decl_column(0x09)
    2552                    
    2553                    $C$DW$265       .dwtag  DW_TAG_member
    2554                            .dwattr $C$DW$265, DW_AT_type(*$C$DW$T$19)
    2555                            .dwattr $C$DW$265, DW_AT_name("ccaType")
    2556                            .dwattr $C$DW$265, DW_AT_TI_symbol_name("ccaType")
    2557                            .dwattr $C$DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    2558                            .dwattr $C$DW$265, DW_AT_accessibility(DW_ACCESS_public)
    2559                            .dwattr $C$DW$265, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    2560                            .dwattr $C$DW$265, DW_AT_decl_line(0x295)
    2561                            .dwattr $C$DW$265, DW_AT_decl_column(0x09)
    2562                    
    2563                            .dwattr $C$DW$T$35, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/M
    2564                            .dwattr $C$DW$T$35, DW_AT_decl_line(0x285)
    2565                            .dwattr $C$DW$T$35, DW_AT_decl_column(0x01)
    2566                            .dwendtag $C$DW$T$35
    2567                    
    2568                    $C$DW$T$530     .dwtag  DW_TAG_typedef
    2569                            .dwattr $C$DW$T$530, DW_AT_name("macMRFSKPHYDesc_t")
    2570                            .dwattr $C$DW$T$530, DW_AT_type(*$C$DW$T$35)
    2571                            .dwattr $C$DW$T$530, DW_AT_language(DW_LANG_C)
    2572                            .dwattr $C$DW$T$530, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/
    2573                            .dwattr $C$DW$T$530, DW_AT_decl_line(0x296)
    2574                            .dwattr $C$DW$T$530, DW_AT_decl_column(0x03)
    2575                    
    2576                    
    2577                    $C$DW$T$36      .dwtag  DW_TAG_structure_type
    2578                            .dwattr $C$DW$T$36, DW_AT_byte_size(0x02)
    2579                    $C$DW$266       .dwtag  DW_TAG_member
    2580                            .dwattr $C$DW$266, DW_AT_type(*$C$DW$T$19)
    2581                            .dwattr $C$DW$266, DW_AT_name("event")
    2582                            .dwattr $C$DW$266, DW_AT_TI_symbol_name("event")
    2583                            .dwattr $C$DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2584                            .dwattr $C$DW$266, DW_AT_accessibility(DW_ACCESS_public)
    2585                            .dwattr $C$DW$266, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:24 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{44BCB735-7A54-47AF-A239-E7BCF205B6E4} PAGE   48

    2586                            .dwattr $C$DW$266, DW_AT_decl_line(0x2a6)
    2587                            .dwattr $C$DW$266, DW_AT_decl_column(0x0b)
    2588                    
    2589                    $C$DW$267       .dwtag  DW_TAG_member
    2590                            .dwattr $C$DW$267, DW_AT_type(*$C$DW$T$19)
    2591                            .dwattr $C$DW$267, DW_AT_name("status")
    2592                            .dwattr $C$DW$267, DW_AT_TI_symbol_name("status")
    2593                            .dwattr $C$DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2594                            .dwattr $C$DW$267, DW_AT_accessibility(DW_ACCESS_public)
    2595                            .dwattr $C$DW$267, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    2596                            .dwattr $C$DW$267, DW_AT_decl_line(0x2a7)
    2597                            .dwattr $C$DW$267, DW_AT_decl_column(0x0b)
    2598                    
    2599                            .dwattr $C$DW$T$36, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/M
    2600                            .dwattr $C$DW$T$36, DW_AT_decl_line(0x2a5)
    2601                            .dwattr $C$DW$T$36, DW_AT_decl_column(0x01)
    2602                            .dwendtag $C$DW$T$36
    2603                    
    2604                    $C$DW$T$74      .dwtag  DW_TAG_typedef
    2605                            .dwattr $C$DW$T$74, DW_AT_name("macEventHdr_t")
    2606                            .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$36)
    2607                            .dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
    2608                            .dwattr $C$DW$T$74, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/M
    2609                            .dwattr $C$DW$T$74, DW_AT_decl_line(0x2a8)
    2610                            .dwattr $C$DW$T$74, DW_AT_decl_column(0x03)
    2611                    
    2612                    
    2613                    $C$DW$T$38      .dwtag  DW_TAG_structure_type
    2614                            .dwattr $C$DW$T$38, DW_AT_byte_size(0x0b)
    2615                    $C$DW$268       .dwtag  DW_TAG_member
    2616                            .dwattr $C$DW$268, DW_AT_type(*$C$DW$T$37)
    2617                            .dwattr $C$DW$268, DW_AT_name("keySource")
    2618                            .dwattr $C$DW$268, DW_AT_TI_symbol_name("keySource")
    2619                            .dwattr $C$DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2620                            .dwattr $C$DW$268, DW_AT_accessibility(DW_ACCESS_public)
    2621                            .dwattr $C$DW$268, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    2622                            .dwattr $C$DW$268, DW_AT_decl_line(0x2ad)
    2623                            .dwattr $C$DW$268, DW_AT_decl_column(0x0b)
    2624                    
    2625                    $C$DW$269       .dwtag  DW_TAG_member
    2626                            .dwattr $C$DW$269, DW_AT_type(*$C$DW$T$19)
    2627                            .dwattr $C$DW$269, DW_AT_name("securityLevel")
    2628                            .dwattr $C$DW$269, DW_AT_TI_symbol_name("securityLevel")
    2629                            .dwattr $C$DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2630                            .dwattr $C$DW$269, DW_AT_accessibility(DW_ACCESS_public)
    2631                            .dwattr $C$DW$269, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    2632                            .dwattr $C$DW$269, DW_AT_decl_line(0x2ae)
    2633                            .dwattr $C$DW$269, DW_AT_decl_column(0x0b)
    2634                    
    2635                    $C$DW$270       .dwtag  DW_TAG_member
    2636                            .dwattr $C$DW$270, DW_AT_type(*$C$DW$T$19)
    2637                            .dwattr $C$DW$270, DW_AT_name("keyIdMode")
    2638                            .dwattr $C$DW$270, DW_AT_TI_symbol_name("keyIdMode")
    2639                            .dwattr $C$DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2640                            .dwattr $C$DW$270, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:24 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{44BCB735-7A54-47AF-A239-E7BCF205B6E4} PAGE   49

    2641                            .dwattr $C$DW$270, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    2642                            .dwattr $C$DW$270, DW_AT_decl_line(0x2af)
    2643                            .dwattr $C$DW$270, DW_AT_decl_column(0x0b)
    2644                    
    2645                    $C$DW$271       .dwtag  DW_TAG_member
    2646                            .dwattr $C$DW$271, DW_AT_type(*$C$DW$T$19)
    2647                            .dwattr $C$DW$271, DW_AT_name("keyIndex")
    2648                            .dwattr $C$DW$271, DW_AT_TI_symbol_name("keyIndex")
    2649                            .dwattr $C$DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2650                            .dwattr $C$DW$271, DW_AT_accessibility(DW_ACCESS_public)
    2651                            .dwattr $C$DW$271, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    2652                            .dwattr $C$DW$271, DW_AT_decl_line(0x2b0)
    2653                            .dwattr $C$DW$271, DW_AT_decl_column(0x0b)
    2654                    
    2655                            .dwattr $C$DW$T$38, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/M
    2656                            .dwattr $C$DW$T$38, DW_AT_decl_line(0x2ac)
    2657                            .dwattr $C$DW$T$38, DW_AT_decl_column(0x01)
    2658                            .dwendtag $C$DW$T$38
    2659                    
    2660                    $C$DW$T$531     .dwtag  DW_TAG_typedef
    2661                            .dwattr $C$DW$T$531, DW_AT_name("macSec_t")
    2662                            .dwattr $C$DW$T$531, DW_AT_type(*$C$DW$T$38)
    2663                            .dwattr $C$DW$T$531, DW_AT_language(DW_LANG_C)
    2664                            .dwattr $C$DW$T$531, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/
    2665                            .dwattr $C$DW$T$531, DW_AT_decl_line(0x2b1)
    2666                            .dwattr $C$DW$T$531, DW_AT_decl_column(0x03)
    2667                    
    2668                    
    2669                    $C$DW$T$40      .dwtag  DW_TAG_structure_type
    2670                            .dwattr $C$DW$T$40, DW_AT_byte_size(0x0a)
    2671                    $C$DW$272       .dwtag  DW_TAG_member
    2672                            .dwattr $C$DW$272, DW_AT_type(*$C$DW$T$39)
    2673                            .dwattr $C$DW$272, DW_AT_name("lookupData")
    2674                            .dwattr $C$DW$272, DW_AT_TI_symbol_name("lookupData")
    2675                            .dwattr $C$DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2676                            .dwattr $C$DW$272, DW_AT_accessibility(DW_ACCESS_public)
    2677                            .dwattr $C$DW$272, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    2678                            .dwattr $C$DW$272, DW_AT_decl_line(0x2b6)
    2679                            .dwattr $C$DW$272, DW_AT_decl_column(0x16)
    2680                    
    2681                    $C$DW$273       .dwtag  DW_TAG_member
    2682                            .dwattr $C$DW$273, DW_AT_type(*$C$DW$T$19)
    2683                            .dwattr $C$DW$273, DW_AT_name("lookupDataSize")
    2684                            .dwattr $C$DW$273, DW_AT_TI_symbol_name("lookupDataSize")
    2685                            .dwattr $C$DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2686                            .dwattr $C$DW$273, DW_AT_accessibility(DW_ACCESS_public)
    2687                            .dwattr $C$DW$273, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    2688                            .dwattr $C$DW$273, DW_AT_decl_line(0x2b7)
    2689                            .dwattr $C$DW$273, DW_AT_decl_column(0x16)
    2690                    
    2691                            .dwattr $C$DW$T$40, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/M
    2692                            .dwattr $C$DW$T$40, DW_AT_decl_line(0x2b5)
    2693                            .dwattr $C$DW$T$40, DW_AT_decl_column(0x01)
    2694                            .dwendtag $C$DW$T$40
    2695                    
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:24 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{44BCB735-7A54-47AF-A239-E7BCF205B6E4} PAGE   50

    2696                    $C$DW$T$43      .dwtag  DW_TAG_typedef
    2697                            .dwattr $C$DW$T$43, DW_AT_name("keyIdLookupDescriptor_t")
    2698                            .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$40)
    2699                            .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
    2700                            .dwattr $C$DW$T$43, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/M
    2701                            .dwattr $C$DW$T$43, DW_AT_decl_line(0x2b8)
    2702                            .dwattr $C$DW$T$43, DW_AT_decl_column(0x03)
    2703                    
    2704                    $C$DW$T$44      .dwtag  DW_TAG_pointer_type
    2705                            .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$43)
    2706                            .dwattr $C$DW$T$44, DW_AT_address_class(0x20)
    2707                    
    2708                    
    2709                    $C$DW$T$171     .dwtag  DW_TAG_array_type
    2710                            .dwattr $C$DW$T$171, DW_AT_type(*$C$DW$T$43)
    2711                            .dwattr $C$DW$T$171, DW_AT_language(DW_LANG_C)
    2712                            .dwattr $C$DW$T$171, DW_AT_byte_size(0x0a)
    2713                    $C$DW$274       .dwtag  DW_TAG_subrange_type
    2714                            .dwattr $C$DW$274, DW_AT_upper_bound(0x00)
    2715                    
    2716                            .dwendtag $C$DW$T$171
    2717                    
    2718                    
    2719                    $C$DW$T$172     .dwtag  DW_TAG_array_type
    2720                            .dwattr $C$DW$T$172, DW_AT_type(*$C$DW$T$43)
    2721                            .dwattr $C$DW$T$172, DW_AT_language(DW_LANG_C)
    2722                            .dwattr $C$DW$T$172, DW_AT_byte_size(0x14)
    2723                    $C$DW$275       .dwtag  DW_TAG_subrange_type
    2724                            .dwattr $C$DW$275, DW_AT_upper_bound(0x01)
    2725                    
    2726                    $C$DW$276       .dwtag  DW_TAG_subrange_type
    2727                            .dwattr $C$DW$276, DW_AT_upper_bound(0x00)
    2728                    
    2729                            .dwendtag $C$DW$T$172
    2730                    
    2731                    
    2732                    $C$DW$T$41      .dwtag  DW_TAG_structure_type
    2733                            .dwattr $C$DW$T$41, DW_AT_byte_size(0x03)
    2734                    $C$DW$277       .dwtag  DW_TAG_member
    2735                            .dwattr $C$DW$277, DW_AT_type(*$C$DW$T$19)
    2736                            .dwattr $C$DW$277, DW_AT_name("deviceDescriptorHandle")
    2737                            .dwattr $C$DW$277, DW_AT_TI_symbol_name("deviceDescriptorHandle")
    2738                            .dwattr $C$DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2739                            .dwattr $C$DW$277, DW_AT_accessibility(DW_ACCESS_public)
    2740                            .dwattr $C$DW$277, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    2741                            .dwattr $C$DW$277, DW_AT_decl_line(0x2bd)
    2742                            .dwattr $C$DW$277, DW_AT_decl_column(0x16)
    2743                    
    2744                    $C$DW$278       .dwtag  DW_TAG_member
    2745                            .dwattr $C$DW$278, DW_AT_type(*$C$DW$T$20)
    2746                            .dwattr $C$DW$278, DW_AT_name("uniqueDevice")
    2747                            .dwattr $C$DW$278, DW_AT_TI_symbol_name("uniqueDevice")
    2748                            .dwattr $C$DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2749                            .dwattr $C$DW$278, DW_AT_accessibility(DW_ACCESS_public)
    2750                            .dwattr $C$DW$278, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:24 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{44BCB735-7A54-47AF-A239-E7BCF205B6E4} PAGE   51

    2751                            .dwattr $C$DW$278, DW_AT_decl_line(0x2be)
    2752                            .dwattr $C$DW$278, DW_AT_decl_column(0x16)
    2753                    
    2754                    $C$DW$279       .dwtag  DW_TAG_member
    2755                            .dwattr $C$DW$279, DW_AT_type(*$C$DW$T$20)
    2756                            .dwattr $C$DW$279, DW_AT_name("blackListed")
    2757                            .dwattr $C$DW$279, DW_AT_TI_symbol_name("blackListed")
    2758                            .dwattr $C$DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2759                            .dwattr $C$DW$279, DW_AT_accessibility(DW_ACCESS_public)
    2760                            .dwattr $C$DW$279, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    2761                            .dwattr $C$DW$279, DW_AT_decl_line(0x2bf)
    2762                            .dwattr $C$DW$279, DW_AT_decl_column(0x16)
    2763                    
    2764                            .dwattr $C$DW$T$41, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/M
    2765                            .dwattr $C$DW$T$41, DW_AT_decl_line(0x2bc)
    2766                            .dwattr $C$DW$T$41, DW_AT_decl_column(0x01)
    2767                            .dwendtag $C$DW$T$41
    2768                    
    2769                    $C$DW$T$45      .dwtag  DW_TAG_typedef
    2770                            .dwattr $C$DW$T$45, DW_AT_name("keyDeviceDescriptor_t")
    2771                            .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$41)
    2772                            .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    2773                            .dwattr $C$DW$T$45, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/M
    2774                            .dwattr $C$DW$T$45, DW_AT_decl_line(0x2c0)
    2775                            .dwattr $C$DW$T$45, DW_AT_decl_column(0x03)
    2776                    
    2777                    $C$DW$T$46      .dwtag  DW_TAG_pointer_type
    2778                            .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$45)
    2779                            .dwattr $C$DW$T$46, DW_AT_address_class(0x20)
    2780                    
    2781                    
    2782                    $C$DW$T$173     .dwtag  DW_TAG_array_type
    2783                            .dwattr $C$DW$T$173, DW_AT_type(*$C$DW$T$45)
    2784                            .dwattr $C$DW$T$173, DW_AT_language(DW_LANG_C)
    2785                            .dwattr $C$DW$T$173, DW_AT_byte_size(0x09)
    2786                    $C$DW$280       .dwtag  DW_TAG_subrange_type
    2787                            .dwattr $C$DW$280, DW_AT_upper_bound(0x02)
    2788                    
    2789                            .dwendtag $C$DW$T$173
    2790                    
    2791                    
    2792                    $C$DW$T$174     .dwtag  DW_TAG_array_type
    2793                            .dwattr $C$DW$T$174, DW_AT_type(*$C$DW$T$45)
    2794                            .dwattr $C$DW$T$174, DW_AT_language(DW_LANG_C)
    2795                            .dwattr $C$DW$T$174, DW_AT_byte_size(0x12)
    2796                    $C$DW$281       .dwtag  DW_TAG_subrange_type
    2797                            .dwattr $C$DW$281, DW_AT_upper_bound(0x01)
    2798                    
    2799                    $C$DW$282       .dwtag  DW_TAG_subrange_type
    2800                            .dwattr $C$DW$282, DW_AT_upper_bound(0x02)
    2801                    
    2802                            .dwendtag $C$DW$T$174
    2803                    
    2804                    
    2805                    $C$DW$T$42      .dwtag  DW_TAG_structure_type
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:24 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{44BCB735-7A54-47AF-A239-E7BCF205B6E4} PAGE   52

    2806                            .dwattr $C$DW$T$42, DW_AT_byte_size(0x02)
    2807                    $C$DW$283       .dwtag  DW_TAG_member
    2808                            .dwattr $C$DW$283, DW_AT_type(*$C$DW$T$19)
    2809                            .dwattr $C$DW$283, DW_AT_name("frameType")
    2810                            .dwattr $C$DW$283, DW_AT_TI_symbol_name("frameType")
    2811                            .dwattr $C$DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2812                            .dwattr $C$DW$283, DW_AT_accessibility(DW_ACCESS_public)
    2813                            .dwattr $C$DW$283, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    2814                            .dwattr $C$DW$283, DW_AT_decl_line(0x2c5)
    2815                            .dwattr $C$DW$283, DW_AT_decl_column(0x16)
    2816                    
    2817                    $C$DW$284       .dwtag  DW_TAG_member
    2818                            .dwattr $C$DW$284, DW_AT_type(*$C$DW$T$19)
    2819                            .dwattr $C$DW$284, DW_AT_name("cmdFrameId")
    2820                            .dwattr $C$DW$284, DW_AT_TI_symbol_name("cmdFrameId")
    2821                            .dwattr $C$DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2822                            .dwattr $C$DW$284, DW_AT_accessibility(DW_ACCESS_public)
    2823                            .dwattr $C$DW$284, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    2824                            .dwattr $C$DW$284, DW_AT_decl_line(0x2c6)
    2825                            .dwattr $C$DW$284, DW_AT_decl_column(0x16)
    2826                    
    2827                            .dwattr $C$DW$T$42, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/M
    2828                            .dwattr $C$DW$T$42, DW_AT_decl_line(0x2c4)
    2829                            .dwattr $C$DW$T$42, DW_AT_decl_column(0x01)
    2830                            .dwendtag $C$DW$T$42
    2831                    
    2832                    $C$DW$T$47      .dwtag  DW_TAG_typedef
    2833                            .dwattr $C$DW$T$47, DW_AT_name("keyUsageDescriptor_t")
    2834                            .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$42)
    2835                            .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    2836                            .dwattr $C$DW$T$47, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/M
    2837                            .dwattr $C$DW$T$47, DW_AT_decl_line(0x2c7)
    2838                            .dwattr $C$DW$T$47, DW_AT_decl_column(0x03)
    2839                    
    2840                    $C$DW$T$48      .dwtag  DW_TAG_pointer_type
    2841                            .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$47)
    2842                            .dwattr $C$DW$T$48, DW_AT_address_class(0x20)
    2843                    
    2844                    
    2845                    $C$DW$T$175     .dwtag  DW_TAG_array_type
    2846                            .dwattr $C$DW$T$175, DW_AT_type(*$C$DW$T$47)
    2847                            .dwattr $C$DW$T$175, DW_AT_language(DW_LANG_C)
    2848                            .dwattr $C$DW$T$175, DW_AT_byte_size(0x04)
    2849                    $C$DW$285       .dwtag  DW_TAG_subrange_type
    2850                            .dwattr $C$DW$285, DW_AT_upper_bound(0x01)
    2851                    
    2852                            .dwendtag $C$DW$T$175
    2853                    
    2854                    
    2855                    $C$DW$T$176     .dwtag  DW_TAG_array_type
    2856                            .dwattr $C$DW$T$176, DW_AT_type(*$C$DW$T$47)
    2857                            .dwattr $C$DW$T$176, DW_AT_language(DW_LANG_C)
    2858                            .dwattr $C$DW$T$176, DW_AT_byte_size(0x08)
    2859                    $C$DW$286       .dwtag  DW_TAG_subrange_type
    2860                            .dwattr $C$DW$286, DW_AT_upper_bound(0x01)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:24 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{44BCB735-7A54-47AF-A239-E7BCF205B6E4} PAGE   53

    2861                    
    2862                    $C$DW$287       .dwtag  DW_TAG_subrange_type
    2863                            .dwattr $C$DW$287, DW_AT_upper_bound(0x01)
    2864                    
    2865                            .dwendtag $C$DW$T$176
    2866                    
    2867                    
    2868                    $C$DW$T$50      .dwtag  DW_TAG_structure_type
    2869                            .dwattr $C$DW$T$50, DW_AT_byte_size(0x2c)
    2870                    $C$DW$288       .dwtag  DW_TAG_member
    2871                            .dwattr $C$DW$288, DW_AT_type(*$C$DW$T$44)
    2872                            .dwattr $C$DW$288, DW_AT_name("keyIdLookupList")
    2873                            .dwattr $C$DW$288, DW_AT_TI_symbol_name("keyIdLookupList")
    2874                            .dwattr $C$DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2875                            .dwattr $C$DW$288, DW_AT_accessibility(DW_ACCESS_public)
    2876                            .dwattr $C$DW$288, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    2877                            .dwattr $C$DW$288, DW_AT_decl_line(0x2cc)
    2878                            .dwattr $C$DW$288, DW_AT_decl_column(0x1d)
    2879                    
    2880                    $C$DW$289       .dwtag  DW_TAG_member
    2881                            .dwattr $C$DW$289, DW_AT_type(*$C$DW$T$19)
    2882                            .dwattr $C$DW$289, DW_AT_name("keyIdLookupEntries")
    2883                            .dwattr $C$DW$289, DW_AT_TI_symbol_name("keyIdLookupEntries")
    2884                            .dwattr $C$DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2885                            .dwattr $C$DW$289, DW_AT_accessibility(DW_ACCESS_public)
    2886                            .dwattr $C$DW$289, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    2887                            .dwattr $C$DW$289, DW_AT_decl_line(0x2cd)
    2888                            .dwattr $C$DW$289, DW_AT_decl_column(0x1c)
    2889                    
    2890                    $C$DW$290       .dwtag  DW_TAG_member
    2891                            .dwattr $C$DW$290, DW_AT_type(*$C$DW$T$46)
    2892                            .dwattr $C$DW$290, DW_AT_name("keyDeviceList")
    2893                            .dwattr $C$DW$290, DW_AT_TI_symbol_name("keyDeviceList")
    2894                            .dwattr $C$DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2895                            .dwattr $C$DW$290, DW_AT_accessibility(DW_ACCESS_public)
    2896                            .dwattr $C$DW$290, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    2897                            .dwattr $C$DW$290, DW_AT_decl_line(0x2cf)
    2898                            .dwattr $C$DW$290, DW_AT_decl_column(0x1d)
    2899                    
    2900                    $C$DW$291       .dwtag  DW_TAG_member
    2901                            .dwattr $C$DW$291, DW_AT_type(*$C$DW$T$19)
    2902                            .dwattr $C$DW$291, DW_AT_name("keyDeviceListEntries")
    2903                            .dwattr $C$DW$291, DW_AT_TI_symbol_name("keyDeviceListEntries")
    2904                            .dwattr $C$DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2905                            .dwattr $C$DW$291, DW_AT_accessibility(DW_ACCESS_public)
    2906                            .dwattr $C$DW$291, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    2907                            .dwattr $C$DW$291, DW_AT_decl_line(0x2d2)
    2908                            .dwattr $C$DW$291, DW_AT_decl_column(0x1c)
    2909                    
    2910                    $C$DW$292       .dwtag  DW_TAG_member
    2911                            .dwattr $C$DW$292, DW_AT_type(*$C$DW$T$48)
    2912                            .dwattr $C$DW$292, DW_AT_name("keyUsageList")
    2913                            .dwattr $C$DW$292, DW_AT_TI_symbol_name("keyUsageList")
    2914                            .dwattr $C$DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2915                            .dwattr $C$DW$292, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:24 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{44BCB735-7A54-47AF-A239-E7BCF205B6E4} PAGE   54

    2916                            .dwattr $C$DW$292, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    2917                            .dwattr $C$DW$292, DW_AT_decl_line(0x2d4)
    2918                            .dwattr $C$DW$292, DW_AT_decl_column(0x1d)
    2919                    
    2920                    $C$DW$293       .dwtag  DW_TAG_member
    2921                            .dwattr $C$DW$293, DW_AT_type(*$C$DW$T$19)
    2922                            .dwattr $C$DW$293, DW_AT_name("keyUsageListEntries")
    2923                            .dwattr $C$DW$293, DW_AT_TI_symbol_name("keyUsageListEntries")
    2924                            .dwattr $C$DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2925                            .dwattr $C$DW$293, DW_AT_accessibility(DW_ACCESS_public)
    2926                            .dwattr $C$DW$293, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    2927                            .dwattr $C$DW$293, DW_AT_decl_line(0x2d6)
    2928                            .dwattr $C$DW$293, DW_AT_decl_column(0x1c)
    2929                    
    2930                    $C$DW$294       .dwtag  DW_TAG_member
    2931                            .dwattr $C$DW$294, DW_AT_type(*$C$DW$T$49)
    2932                            .dwattr $C$DW$294, DW_AT_name("key")
    2933                            .dwattr $C$DW$294, DW_AT_TI_symbol_name("key")
    2934                            .dwattr $C$DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    2935                            .dwattr $C$DW$294, DW_AT_accessibility(DW_ACCESS_public)
    2936                            .dwattr $C$DW$294, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    2937                            .dwattr $C$DW$294, DW_AT_decl_line(0x2d8)
    2938                            .dwattr $C$DW$294, DW_AT_decl_column(0x1c)
    2939                    
    2940                    $C$DW$295       .dwtag  DW_TAG_member
    2941                            .dwattr $C$DW$295, DW_AT_type(*$C$DW$T$34)
    2942                            .dwattr $C$DW$295, DW_AT_name("frameCounter")
    2943                            .dwattr $C$DW$295, DW_AT_TI_symbol_name("frameCounter")
    2944                            .dwattr $C$DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2945                            .dwattr $C$DW$295, DW_AT_accessibility(DW_ACCESS_public)
    2946                            .dwattr $C$DW$295, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    2947                            .dwattr $C$DW$295, DW_AT_decl_line(0x2d9)
    2948                            .dwattr $C$DW$295, DW_AT_decl_column(0x1c)
    2949                    
    2950                            .dwattr $C$DW$T$50, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/M
    2951                            .dwattr $C$DW$T$50, DW_AT_decl_line(0x2cb)
    2952                            .dwattr $C$DW$T$50, DW_AT_decl_column(0x01)
    2953                            .dwendtag $C$DW$T$50
    2954                    
    2955                    $C$DW$T$64      .dwtag  DW_TAG_typedef
    2956                            .dwattr $C$DW$T$64, DW_AT_name("keyDescriptor_t")
    2957                            .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$50)
    2958                            .dwattr $C$DW$T$64, DW_AT_language(DW_LANG_C)
    2959                            .dwattr $C$DW$T$64, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/M
    2960                            .dwattr $C$DW$T$64, DW_AT_decl_line(0x2dc)
    2961                            .dwattr $C$DW$T$64, DW_AT_decl_column(0x03)
    2962                    
    2963                    $C$DW$T$65      .dwtag  DW_TAG_pointer_type
    2964                            .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$64)
    2965                            .dwattr $C$DW$T$65, DW_AT_address_class(0x20)
    2966                    
    2967                    
    2968                    $C$DW$T$170     .dwtag  DW_TAG_array_type
    2969                            .dwattr $C$DW$T$170, DW_AT_type(*$C$DW$T$64)
    2970                            .dwattr $C$DW$T$170, DW_AT_language(DW_LANG_C)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:24 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{44BCB735-7A54-47AF-A239-E7BCF205B6E4} PAGE   55

    2971                            .dwattr $C$DW$T$170, DW_AT_byte_size(0x58)
    2972                    $C$DW$296       .dwtag  DW_TAG_subrange_type
    2973                            .dwattr $C$DW$296, DW_AT_upper_bound(0x01)
    2974                    
    2975                            .dwendtag $C$DW$T$170
    2976                    
    2977                    
    2978                    $C$DW$T$53      .dwtag  DW_TAG_structure_type
    2979                            .dwattr $C$DW$T$53, DW_AT_byte_size(0x18)
    2980                    $C$DW$297       .dwtag  DW_TAG_member
    2981                            .dwattr $C$DW$297, DW_AT_type(*$C$DW$T$21)
    2982                            .dwattr $C$DW$297, DW_AT_name("panID")
    2983                            .dwattr $C$DW$297, DW_AT_TI_symbol_name("panID")
    2984                            .dwattr $C$DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2985                            .dwattr $C$DW$297, DW_AT_accessibility(DW_ACCESS_public)
    2986                            .dwattr $C$DW$297, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    2987                            .dwattr $C$DW$297, DW_AT_decl_line(0x2e1)
    2988                            .dwattr $C$DW$297, DW_AT_decl_column(0x16)
    2989                    
    2990                    $C$DW$298       .dwtag  DW_TAG_member
    2991                            .dwattr $C$DW$298, DW_AT_type(*$C$DW$T$21)
    2992                            .dwattr $C$DW$298, DW_AT_name("shortAddress")
    2993                            .dwattr $C$DW$298, DW_AT_TI_symbol_name("shortAddress")
    2994                            .dwattr $C$DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2995                            .dwattr $C$DW$298, DW_AT_accessibility(DW_ACCESS_public)
    2996                            .dwattr $C$DW$298, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    2997                            .dwattr $C$DW$298, DW_AT_decl_line(0x2e2)
    2998                            .dwattr $C$DW$298, DW_AT_decl_column(0x16)
    2999                    
    3000                    $C$DW$299       .dwtag  DW_TAG_member
    3001                            .dwattr $C$DW$299, DW_AT_type(*$C$DW$T$51)
    3002                            .dwattr $C$DW$299, DW_AT_name("extAddress")
    3003                            .dwattr $C$DW$299, DW_AT_TI_symbol_name("extAddress")
    3004                            .dwattr $C$DW$299, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3005                            .dwattr $C$DW$299, DW_AT_accessibility(DW_ACCESS_public)
    3006                            .dwattr $C$DW$299, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    3007                            .dwattr $C$DW$299, DW_AT_decl_line(0x2e3)
    3008                            .dwattr $C$DW$299, DW_AT_decl_column(0x16)
    3009                    
    3010                    $C$DW$300       .dwtag  DW_TAG_member
    3011                            .dwattr $C$DW$300, DW_AT_type(*$C$DW$T$52)
    3012                            .dwattr $C$DW$300, DW_AT_name("frameCounter")
    3013                            .dwattr $C$DW$300, DW_AT_TI_symbol_name("frameCounter")
    3014                            .dwattr $C$DW$300, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3015                            .dwattr $C$DW$300, DW_AT_accessibility(DW_ACCESS_public)
    3016                            .dwattr $C$DW$300, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    3017                            .dwattr $C$DW$300, DW_AT_decl_line(0x2e7)
    3018                            .dwattr $C$DW$300, DW_AT_decl_column(0x16)
    3019                    
    3020                    $C$DW$301       .dwtag  DW_TAG_member
    3021                            .dwattr $C$DW$301, DW_AT_type(*$C$DW$T$20)
    3022                            .dwattr $C$DW$301, DW_AT_name("exempt")
    3023                            .dwattr $C$DW$301, DW_AT_TI_symbol_name("exempt")
    3024                            .dwattr $C$DW$301, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3025                            .dwattr $C$DW$301, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:24 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{44BCB735-7A54-47AF-A239-E7BCF205B6E4} PAGE   56

    3026                            .dwattr $C$DW$301, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    3027                            .dwattr $C$DW$301, DW_AT_decl_line(0x2eb)
    3028                            .dwattr $C$DW$301, DW_AT_decl_column(0x16)
    3029                    
    3030                            .dwattr $C$DW$T$53, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/M
    3031                            .dwattr $C$DW$T$53, DW_AT_decl_line(0x2e0)
    3032                            .dwattr $C$DW$T$53, DW_AT_decl_column(0x01)
    3033                            .dwendtag $C$DW$T$53
    3034                    
    3035                    $C$DW$T$59      .dwtag  DW_TAG_typedef
    3036                            .dwattr $C$DW$T$59, DW_AT_name("deviceDescriptor_t")
    3037                            .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$53)
    3038                            .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
    3039                            .dwattr $C$DW$T$59, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/M
    3040                            .dwattr $C$DW$T$59, DW_AT_decl_line(0x2ed)
    3041                            .dwattr $C$DW$T$59, DW_AT_decl_column(0x03)
    3042                    
    3043                    
    3044                    $C$DW$T$177     .dwtag  DW_TAG_array_type
    3045                            .dwattr $C$DW$T$177, DW_AT_type(*$C$DW$T$59)
    3046                            .dwattr $C$DW$T$177, DW_AT_language(DW_LANG_C)
    3047                            .dwattr $C$DW$T$177, DW_AT_byte_size(0x48)
    3048                    $C$DW$302       .dwtag  DW_TAG_subrange_type
    3049                            .dwattr $C$DW$302, DW_AT_upper_bound(0x02)
    3050                    
    3051                            .dwendtag $C$DW$T$177
    3052                    
    3053                    
    3054                    $C$DW$T$54      .dwtag  DW_TAG_structure_type
    3055                            .dwattr $C$DW$T$54, DW_AT_byte_size(0x04)
    3056                    $C$DW$303       .dwtag  DW_TAG_member
    3057                            .dwattr $C$DW$303, DW_AT_type(*$C$DW$T$19)
    3058                            .dwattr $C$DW$303, DW_AT_name("frameType")
    3059                            .dwattr $C$DW$303, DW_AT_TI_symbol_name("frameType")
    3060                            .dwattr $C$DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3061                            .dwattr $C$DW$303, DW_AT_accessibility(DW_ACCESS_public)
    3062                            .dwattr $C$DW$303, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    3063                            .dwattr $C$DW$303, DW_AT_decl_line(0x2f2)
    3064                            .dwattr $C$DW$303, DW_AT_decl_column(0x16)
    3065                    
    3066                    $C$DW$304       .dwtag  DW_TAG_member
    3067                            .dwattr $C$DW$304, DW_AT_type(*$C$DW$T$19)
    3068                            .dwattr $C$DW$304, DW_AT_name("commandFrameIdentifier")
    3069                            .dwattr $C$DW$304, DW_AT_TI_symbol_name("commandFrameIdentifier")
    3070                            .dwattr $C$DW$304, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3071                            .dwattr $C$DW$304, DW_AT_accessibility(DW_ACCESS_public)
    3072                            .dwattr $C$DW$304, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    3073                            .dwattr $C$DW$304, DW_AT_decl_line(0x2f3)
    3074                            .dwattr $C$DW$304, DW_AT_decl_column(0x16)
    3075                    
    3076                    $C$DW$305       .dwtag  DW_TAG_member
    3077                            .dwattr $C$DW$305, DW_AT_type(*$C$DW$T$19)
    3078                            .dwattr $C$DW$305, DW_AT_name("securityMinimum")
    3079                            .dwattr $C$DW$305, DW_AT_TI_symbol_name("securityMinimum")
    3080                            .dwattr $C$DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:24 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{44BCB735-7A54-47AF-A239-E7BCF205B6E4} PAGE   57

    3081                            .dwattr $C$DW$305, DW_AT_accessibility(DW_ACCESS_public)
    3082                            .dwattr $C$DW$305, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    3083                            .dwattr $C$DW$305, DW_AT_decl_line(0x2f4)
    3084                            .dwattr $C$DW$305, DW_AT_decl_column(0x16)
    3085                    
    3086                    $C$DW$306       .dwtag  DW_TAG_member
    3087                            .dwattr $C$DW$306, DW_AT_type(*$C$DW$T$20)
    3088                            .dwattr $C$DW$306, DW_AT_name("securityOverrideSecurityMinimum")
    3089                            .dwattr $C$DW$306, DW_AT_TI_symbol_name("securityOverrideSecurityMinimum")
    3090                            .dwattr $C$DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3091                            .dwattr $C$DW$306, DW_AT_accessibility(DW_ACCESS_public)
    3092                            .dwattr $C$DW$306, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    3093                            .dwattr $C$DW$306, DW_AT_decl_line(0x2f6)
    3094                            .dwattr $C$DW$306, DW_AT_decl_column(0x16)
    3095                    
    3096                            .dwattr $C$DW$T$54, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/M
    3097                            .dwattr $C$DW$T$54, DW_AT_decl_line(0x2f1)
    3098                            .dwattr $C$DW$T$54, DW_AT_decl_column(0x01)
    3099                            .dwendtag $C$DW$T$54
    3100                    
    3101                    $C$DW$T$61      .dwtag  DW_TAG_typedef
    3102                            .dwattr $C$DW$T$61, DW_AT_name("securityLevelDescriptor_t")
    3103                            .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$54)
    3104                            .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
    3105                            .dwattr $C$DW$T$61, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/M
    3106                            .dwattr $C$DW$T$61, DW_AT_decl_line(0x2ff)
    3107                            .dwattr $C$DW$T$61, DW_AT_decl_column(0x03)
    3108                    
    3109                    
    3110                    $C$DW$T$178     .dwtag  DW_TAG_array_type
    3111                            .dwattr $C$DW$T$178, DW_AT_type(*$C$DW$T$61)
    3112                            .dwattr $C$DW$T$178, DW_AT_language(DW_LANG_C)
    3113                            .dwattr $C$DW$T$178, DW_AT_byte_size(0x08)
    3114                    $C$DW$307       .dwtag  DW_TAG_subrange_type
    3115                            .dwattr $C$DW$307, DW_AT_upper_bound(0x01)
    3116                    
    3117                            .dwendtag $C$DW$T$178
    3118                    
    3119                    
    3120                    $C$DW$T$55      .dwtag  DW_TAG_structure_type
    3121                            .dwattr $C$DW$T$55, DW_AT_byte_size(0x0c)
    3122                    $C$DW$308       .dwtag  DW_TAG_member
    3123                            .dwattr $C$DW$308, DW_AT_type(*$C$DW$T$19)
    3124                            .dwattr $C$DW$308, DW_AT_name("key_index")
    3125                            .dwattr $C$DW$308, DW_AT_TI_symbol_name("key_index")
    3126                            .dwattr $C$DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3127                            .dwattr $C$DW$308, DW_AT_accessibility(DW_ACCESS_public)
    3128                            .dwattr $C$DW$308, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    3129                            .dwattr $C$DW$308, DW_AT_decl_line(0x304)
    3130                            .dwattr $C$DW$308, DW_AT_decl_column(0x1b)
    3131                    
    3132                    $C$DW$309       .dwtag  DW_TAG_member
    3133                            .dwattr $C$DW$309, DW_AT_type(*$C$DW$T$19)
    3134                            .dwattr $C$DW$309, DW_AT_name("key_id_lookup_index")
    3135                            .dwattr $C$DW$309, DW_AT_TI_symbol_name("key_id_lookup_index")
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:24 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{44BCB735-7A54-47AF-A239-E7BCF205B6E4} PAGE   58

    3136                            .dwattr $C$DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3137                            .dwattr $C$DW$309, DW_AT_accessibility(DW_ACCESS_public)
    3138                            .dwattr $C$DW$309, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    3139                            .dwattr $C$DW$309, DW_AT_decl_line(0x305)
    3140                            .dwattr $C$DW$309, DW_AT_decl_column(0x1b)
    3141                    
    3142                    $C$DW$310       .dwtag  DW_TAG_member
    3143                            .dwattr $C$DW$310, DW_AT_type(*$C$DW$T$43)
    3144                            .dwattr $C$DW$310, DW_AT_name("macKeyIdLookupEntry")
    3145                            .dwattr $C$DW$310, DW_AT_TI_symbol_name("macKeyIdLookupEntry")
    3146                            .dwattr $C$DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3147                            .dwattr $C$DW$310, DW_AT_accessibility(DW_ACCESS_public)
    3148                            .dwattr $C$DW$310, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    3149                            .dwattr $C$DW$310, DW_AT_decl_line(0x306)
    3150                            .dwattr $C$DW$310, DW_AT_decl_column(0x1b)
    3151                    
    3152                            .dwattr $C$DW$T$55, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/M
    3153                            .dwattr $C$DW$T$55, DW_AT_decl_line(0x303)
    3154                            .dwattr $C$DW$T$55, DW_AT_decl_column(0x01)
    3155                            .dwendtag $C$DW$T$55
    3156                    
    3157                    $C$DW$T$532     .dwtag  DW_TAG_typedef
    3158                            .dwattr $C$DW$T$532, DW_AT_name("macSecurityPibKeyIdLookupEntry_t")
    3159                            .dwattr $C$DW$T$532, DW_AT_type(*$C$DW$T$55)
    3160                            .dwattr $C$DW$T$532, DW_AT_language(DW_LANG_C)
    3161                            .dwattr $C$DW$T$532, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/
    3162                            .dwattr $C$DW$T$532, DW_AT_decl_line(0x307)
    3163                            .dwattr $C$DW$T$532, DW_AT_decl_column(0x03)
    3164                    
    3165                    
    3166                    $C$DW$T$56      .dwtag  DW_TAG_structure_type
    3167                            .dwattr $C$DW$T$56, DW_AT_byte_size(0x05)
    3168                    $C$DW$311       .dwtag  DW_TAG_member
    3169                            .dwattr $C$DW$311, DW_AT_type(*$C$DW$T$19)
    3170                            .dwattr $C$DW$311, DW_AT_name("key_index")
    3171                            .dwattr $C$DW$311, DW_AT_TI_symbol_name("key_index")
    3172                            .dwattr $C$DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3173                            .dwattr $C$DW$311, DW_AT_accessibility(DW_ACCESS_public)
    3174                            .dwattr $C$DW$311, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    3175                            .dwattr $C$DW$311, DW_AT_decl_line(0x30b)
    3176                            .dwattr $C$DW$311, DW_AT_decl_column(0x1b)
    3177                    
    3178                    $C$DW$312       .dwtag  DW_TAG_member
    3179                            .dwattr $C$DW$312, DW_AT_type(*$C$DW$T$19)
    3180                            .dwattr $C$DW$312, DW_AT_name("key_device_index")
    3181                            .dwattr $C$DW$312, DW_AT_TI_symbol_name("key_device_index")
    3182                            .dwattr $C$DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3183                            .dwattr $C$DW$312, DW_AT_accessibility(DW_ACCESS_public)
    3184                            .dwattr $C$DW$312, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    3185                            .dwattr $C$DW$312, DW_AT_decl_line(0x30c)
    3186                            .dwattr $C$DW$312, DW_AT_decl_column(0x1b)
    3187                    
    3188                    $C$DW$313       .dwtag  DW_TAG_member
    3189                            .dwattr $C$DW$313, DW_AT_type(*$C$DW$T$45)
    3190                            .dwattr $C$DW$313, DW_AT_name("macKeyDeviceEntry")
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:24 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{44BCB735-7A54-47AF-A239-E7BCF205B6E4} PAGE   59

    3191                            .dwattr $C$DW$313, DW_AT_TI_symbol_name("macKeyDeviceEntry")
    3192                            .dwattr $C$DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3193                            .dwattr $C$DW$313, DW_AT_accessibility(DW_ACCESS_public)
    3194                            .dwattr $C$DW$313, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    3195                            .dwattr $C$DW$313, DW_AT_decl_line(0x30d)
    3196                            .dwattr $C$DW$313, DW_AT_decl_column(0x1b)
    3197                    
    3198                            .dwattr $C$DW$T$56, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/M
    3199                            .dwattr $C$DW$T$56, DW_AT_decl_line(0x30a)
    3200                            .dwattr $C$DW$T$56, DW_AT_decl_column(0x01)
    3201                            .dwendtag $C$DW$T$56
    3202                    
    3203                    $C$DW$T$533     .dwtag  DW_TAG_typedef
    3204                            .dwattr $C$DW$T$533, DW_AT_name("macSecurityPibKeyDeviceEntry_t")
    3205                            .dwattr $C$DW$T$533, DW_AT_type(*$C$DW$T$56)
    3206                            .dwattr $C$DW$T$533, DW_AT_language(DW_LANG_C)
    3207                            .dwattr $C$DW$T$533, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/
    3208                            .dwattr $C$DW$T$533, DW_AT_decl_line(0x30e)
    3209                            .dwattr $C$DW$T$533, DW_AT_decl_column(0x03)
    3210                    
    3211                    
    3212                    $C$DW$T$57      .dwtag  DW_TAG_structure_type
    3213                            .dwattr $C$DW$T$57, DW_AT_byte_size(0x04)
    3214                    $C$DW$314       .dwtag  DW_TAG_member
    3215                            .dwattr $C$DW$314, DW_AT_type(*$C$DW$T$19)
    3216                            .dwattr $C$DW$314, DW_AT_name("key_index")
    3217                            .dwattr $C$DW$314, DW_AT_TI_symbol_name("key_index")
    3218                            .dwattr $C$DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3219                            .dwattr $C$DW$314, DW_AT_accessibility(DW_ACCESS_public)
    3220                            .dwattr $C$DW$314, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    3221                            .dwattr $C$DW$314, DW_AT_decl_line(0x312)
    3222                            .dwattr $C$DW$314, DW_AT_decl_column(0x1b)
    3223                    
    3224                    $C$DW$315       .dwtag  DW_TAG_member
    3225                            .dwattr $C$DW$315, DW_AT_type(*$C$DW$T$19)
    3226                            .dwattr $C$DW$315, DW_AT_name("key_key_usage_index")
    3227                            .dwattr $C$DW$315, DW_AT_TI_symbol_name("key_key_usage_index")
    3228                            .dwattr $C$DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3229                            .dwattr $C$DW$315, DW_AT_accessibility(DW_ACCESS_public)
    3230                            .dwattr $C$DW$315, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    3231                            .dwattr $C$DW$315, DW_AT_decl_line(0x313)
    3232                            .dwattr $C$DW$315, DW_AT_decl_column(0x1b)
    3233                    
    3234                    $C$DW$316       .dwtag  DW_TAG_member
    3235                            .dwattr $C$DW$316, DW_AT_type(*$C$DW$T$47)
    3236                            .dwattr $C$DW$316, DW_AT_name("macKeyUsageEntry")
    3237                            .dwattr $C$DW$316, DW_AT_TI_symbol_name("macKeyUsageEntry")
    3238                            .dwattr $C$DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3239                            .dwattr $C$DW$316, DW_AT_accessibility(DW_ACCESS_public)
    3240                            .dwattr $C$DW$316, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    3241                            .dwattr $C$DW$316, DW_AT_decl_line(0x314)
    3242                            .dwattr $C$DW$316, DW_AT_decl_column(0x1b)
    3243                    
    3244                            .dwattr $C$DW$T$57, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/M
    3245                            .dwattr $C$DW$T$57, DW_AT_decl_line(0x311)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:24 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{44BCB735-7A54-47AF-A239-E7BCF205B6E4} PAGE   60

    3246                            .dwattr $C$DW$T$57, DW_AT_decl_column(0x01)
    3247                            .dwendtag $C$DW$T$57
    3248                    
    3249                    $C$DW$T$534     .dwtag  DW_TAG_typedef
    3250                            .dwattr $C$DW$T$534, DW_AT_name("macSecurityPibKeyUsageEntry_t")
    3251                            .dwattr $C$DW$T$534, DW_AT_type(*$C$DW$T$57)
    3252                            .dwattr $C$DW$T$534, DW_AT_language(DW_LANG_C)
    3253                            .dwattr $C$DW$T$534, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/
    3254                            .dwattr $C$DW$T$534, DW_AT_decl_line(0x315)
    3255                            .dwattr $C$DW$T$534, DW_AT_decl_column(0x03)
    3256                    
    3257                    
    3258                    $C$DW$T$58      .dwtag  DW_TAG_structure_type
    3259                            .dwattr $C$DW$T$58, DW_AT_byte_size(0x18)
    3260                    $C$DW$317       .dwtag  DW_TAG_member
    3261                            .dwattr $C$DW$317, DW_AT_type(*$C$DW$T$19)
    3262                            .dwattr $C$DW$317, DW_AT_name("key_index")
    3263                            .dwattr $C$DW$317, DW_AT_TI_symbol_name("key_index")
    3264                            .dwattr $C$DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3265                            .dwattr $C$DW$317, DW_AT_accessibility(DW_ACCESS_public)
    3266                            .dwattr $C$DW$317, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    3267                            .dwattr $C$DW$317, DW_AT_decl_line(0x319)
    3268                            .dwattr $C$DW$317, DW_AT_decl_column(0x1b)
    3269                    
    3270                    $C$DW$318       .dwtag  DW_TAG_member
    3271                            .dwattr $C$DW$318, DW_AT_type(*$C$DW$T$49)
    3272                            .dwattr $C$DW$318, DW_AT_name("keyEntry")
    3273                            .dwattr $C$DW$318, DW_AT_TI_symbol_name("keyEntry")
    3274                            .dwattr $C$DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3275                            .dwattr $C$DW$318, DW_AT_accessibility(DW_ACCESS_public)
    3276                            .dwattr $C$DW$318, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    3277                            .dwattr $C$DW$318, DW_AT_decl_line(0x31a)
    3278                            .dwattr $C$DW$318, DW_AT_decl_column(0x1b)
    3279                    
    3280                    $C$DW$319       .dwtag  DW_TAG_member
    3281                            .dwattr $C$DW$319, DW_AT_type(*$C$DW$T$34)
    3282                            .dwattr $C$DW$319, DW_AT_name("frameCounter")
    3283                            .dwattr $C$DW$319, DW_AT_TI_symbol_name("frameCounter")
    3284                            .dwattr $C$DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3285                            .dwattr $C$DW$319, DW_AT_accessibility(DW_ACCESS_public)
    3286                            .dwattr $C$DW$319, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    3287                            .dwattr $C$DW$319, DW_AT_decl_line(0x31b)
    3288                            .dwattr $C$DW$319, DW_AT_decl_column(0x1b)
    3289                    
    3290                            .dwattr $C$DW$T$58, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/M
    3291                            .dwattr $C$DW$T$58, DW_AT_decl_line(0x318)
    3292                            .dwattr $C$DW$T$58, DW_AT_decl_column(0x01)
    3293                            .dwendtag $C$DW$T$58
    3294                    
    3295                    $C$DW$T$535     .dwtag  DW_TAG_typedef
    3296                            .dwattr $C$DW$T$535, DW_AT_name("macSecurityPibKeyEntry_t")
    3297                            .dwattr $C$DW$T$535, DW_AT_type(*$C$DW$T$58)
    3298                            .dwattr $C$DW$T$535, DW_AT_language(DW_LANG_C)
    3299                            .dwattr $C$DW$T$535, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/
    3300                            .dwattr $C$DW$T$535, DW_AT_decl_line(0x31c)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:24 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{44BCB735-7A54-47AF-A239-E7BCF205B6E4} PAGE   61

    3301                            .dwattr $C$DW$T$535, DW_AT_decl_column(0x03)
    3302                    
    3303                    
    3304                    $C$DW$T$60      .dwtag  DW_TAG_structure_type
    3305                            .dwattr $C$DW$T$60, DW_AT_byte_size(0x1c)
    3306                    $C$DW$320       .dwtag  DW_TAG_member
    3307                            .dwattr $C$DW$320, DW_AT_type(*$C$DW$T$19)
    3308                            .dwattr $C$DW$320, DW_AT_name("device_index")
    3309                            .dwattr $C$DW$320, DW_AT_TI_symbol_name("device_index")
    3310                            .dwattr $C$DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3311                            .dwattr $C$DW$320, DW_AT_accessibility(DW_ACCESS_public)
    3312                            .dwattr $C$DW$320, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    3313                            .dwattr $C$DW$320, DW_AT_decl_line(0x320)
    3314                            .dwattr $C$DW$320, DW_AT_decl_column(0x1b)
    3315                    
    3316                    $C$DW$321       .dwtag  DW_TAG_member
    3317                            .dwattr $C$DW$321, DW_AT_type(*$C$DW$T$59)
    3318                            .dwattr $C$DW$321, DW_AT_name("macDeviceEntry")
    3319                            .dwattr $C$DW$321, DW_AT_TI_symbol_name("macDeviceEntry")
    3320                            .dwattr $C$DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3321                            .dwattr $C$DW$321, DW_AT_accessibility(DW_ACCESS_public)
    3322                            .dwattr $C$DW$321, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    3323                            .dwattr $C$DW$321, DW_AT_decl_line(0x321)
    3324                            .dwattr $C$DW$321, DW_AT_decl_column(0x1b)
    3325                    
    3326                            .dwattr $C$DW$T$60, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/M
    3327                            .dwattr $C$DW$T$60, DW_AT_decl_line(0x31f)
    3328                            .dwattr $C$DW$T$60, DW_AT_decl_column(0x01)
    3329                            .dwendtag $C$DW$T$60
    3330                    
    3331                    $C$DW$T$536     .dwtag  DW_TAG_typedef
    3332                            .dwattr $C$DW$T$536, DW_AT_name("macSecurityPibDeviceEntry_t")
    3333                            .dwattr $C$DW$T$536, DW_AT_type(*$C$DW$T$60)
    3334                            .dwattr $C$DW$T$536, DW_AT_language(DW_LANG_C)
    3335                            .dwattr $C$DW$T$536, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/
    3336                            .dwattr $C$DW$T$536, DW_AT_decl_line(0x322)
    3337                            .dwattr $C$DW$T$536, DW_AT_decl_column(0x03)
    3338                    
    3339                    
    3340                    $C$DW$T$62      .dwtag  DW_TAG_structure_type
    3341                            .dwattr $C$DW$T$62, DW_AT_byte_size(0x05)
    3342                    $C$DW$322       .dwtag  DW_TAG_member
    3343                            .dwattr $C$DW$322, DW_AT_type(*$C$DW$T$19)
    3344                            .dwattr $C$DW$322, DW_AT_name("security_level_index")
    3345                            .dwattr $C$DW$322, DW_AT_TI_symbol_name("security_level_index")
    3346                            .dwattr $C$DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3347                            .dwattr $C$DW$322, DW_AT_accessibility(DW_ACCESS_public)
    3348                            .dwattr $C$DW$322, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    3349                            .dwattr $C$DW$322, DW_AT_decl_line(0x326)
    3350                            .dwattr $C$DW$322, DW_AT_decl_column(0x1f)
    3351                    
    3352                    $C$DW$323       .dwtag  DW_TAG_member
    3353                            .dwattr $C$DW$323, DW_AT_type(*$C$DW$T$61)
    3354                            .dwattr $C$DW$323, DW_AT_name("macSecurityLevelEntry")
    3355                            .dwattr $C$DW$323, DW_AT_TI_symbol_name("macSecurityLevelEntry")
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:24 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{44BCB735-7A54-47AF-A239-E7BCF205B6E4} PAGE   62

    3356                            .dwattr $C$DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3357                            .dwattr $C$DW$323, DW_AT_accessibility(DW_ACCESS_public)
    3358                            .dwattr $C$DW$323, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    3359                            .dwattr $C$DW$323, DW_AT_decl_line(0x327)
    3360                            .dwattr $C$DW$323, DW_AT_decl_column(0x1f)
    3361                    
