TI ARM Assembler PC v16.9.4 Mon Mar 05 22:10:59 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{3A1F491F-DFFA-49FC-9E98-211AB27812D8} PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                        PC v16.9.4.LTS *
       3                    ;* Date/Time created: Mon Mar 05 22:10:59 2018                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../Application/mac_user_config.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v16.9.4.LTS Copyright (c) 1996-20
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Kevin\workspace_v7\sensor_cc1310lp\sensor_cc1310lp"
      13                    
      14                    $C$DW$1 .dwtag  DW_TAG_subprogram

    4522                    $C$DW$414       .dwtag  DW_TAG_enumerator
    4523                            .dwattr $C$DW$414, DW_AT_name("MAC_RADIO_CC1310")
    4524                            .dwattr $C$DW$414, DW_AT_const_value(0x00)
    4525                            .dwattr $C$DW$414, DW_AT_decl_file("..\Application\mac_user_config.h")
    4526                            .dwattr $C$DW$414, DW_AT_decl_line(0x106)
    4527                            .dwattr $C$DW$414, DW_AT_decl_column(0x05)
    4528                    
    4529                    $C$DW$415       .dwtag  DW_TAG_enumerator
    4530                            .dwattr $C$DW$415, DW_AT_name("MAC_RADIO_CC1350")
    4531                            .dwattr $C$DW$415, DW_AT_const_value(0x01)
    4532                            .dwattr $C$DW$415, DW_AT_decl_file("..\Application\mac_user_config.h")
    4533                            .dwattr $C$DW$415, DW_AT_decl_line(0x107)
    4534                            .dwattr $C$DW$415, DW_AT_decl_column(0x05)
    4535                    
    4536                    $C$DW$416       .dwtag  DW_TAG_enumerator
    4537                            .dwattr $C$DW$416, DW_AT_name("MAC_RADIO_MAX_CHIP_TYPES")
    4538                            .dwattr $C$DW$416, DW_AT_const_value(0x02)
    4539                            .dwattr $C$DW$416, DW_AT_decl_file("..\Application\mac_user_config.h")
    4540                            .dwattr $C$DW$416, DW_AT_decl_line(0x108)
    4541                            .dwattr $C$DW$416, DW_AT_decl_column(0x05)
    4542                    
    4543                            .dwattr $C$DW$T$729, DW_AT_decl_file("..\Application\mac_user_config.h")
    4544                            .dwattr $C$DW$T$729, DW_AT_decl_line(0x105)
    4545                            .dwattr $C$DW$T$729, DW_AT_decl_column(0x01)
    4546                            .dwendtag $C$DW$T$729
    4547                    
    4548                    $C$DW$T$730     .dwtag  DW_TAG_typedef
    4549                            .dwattr $C$DW$T$730, DW_AT_name("macChipType_t")
    4550                            .dwattr $C$DW$T$730, DW_AT_type(*$C$DW$T$729)
    4551                            .dwattr $C$DW$T$730, DW_AT_language(DW_LANG_C)
TI ARM Assembler PC v16.9.4 Mon Mar 05 22:10:59 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{3A1F491F-DFFA-49FC-9E98-211AB27812D8} PAGE   84

    4552                            .dwattr $C$DW$T$730, DW_AT_decl_file("..\Application\mac_user_config.h")
    4553                            .dwattr $C$DW$T$730, DW_AT_decl_line(0x109)
    4554                            .dwattr $C$DW$T$730, DW_AT_decl_column(0x03)
    4555                    
    4556                    
    4557                    $C$DW$T$731     .dwtag  DW_TAG_enumeration_type
    4558                            .dwattr $C$DW$T$731, DW_AT_byte_size(0x01)
    4559                    $C$DW$417       .dwtag  DW_TAG_enumerator
    4560                            .dwattr $C$DW$417, DW_AT_name("MAC_HW_REV_21")
    4561                            .dwattr $C$DW$417, DW_AT_const_value(0x00)
    4562                            .dwattr $C$DW$417, DW_AT_decl_file("..\Application\mac_user_config.h")
    4563                            .dwattr $C$DW$417, DW_AT_decl_line(0x10e)
    4564                            .dwattr $C$DW$417, DW_AT_decl_column(0x05)
    4565                    
    4566                    $C$DW$418       .dwtag  DW_TAG_enumerator
    4567                            .dwattr $C$DW$418, DW_AT_name("MAC_HW_REV_20")
    4568                            .dwattr $C$DW$418, DW_AT_const_value(0x01)
    4569                            .dwattr $C$DW$418, DW_AT_decl_file("..\Application\mac_user_config.h")
    4570                            .dwattr $C$DW$418, DW_AT_decl_line(0x10f)
    4571                            .dwattr $C$DW$418, DW_AT_decl_column(0x05)
    4572                    
    4573                    $C$DW$419       .dwtag  DW_TAG_enumerator
    4574                            .dwattr $C$DW$419, DW_AT_name("MAC_HW_MAX_REVS")
    4575                            .dwattr $C$DW$419, DW_AT_const_value(0x02)
    4576                            .dwattr $C$DW$419, DW_AT_decl_file("..\Application\mac_user_config.h")
    4577                            .dwattr $C$DW$419, DW_AT_decl_line(0x110)
    4578                            .dwattr $C$DW$419, DW_AT_decl_column(0x05)
    4579                    
    4580                            .dwattr $C$DW$T$731, DW_AT_decl_file("..\Application\mac_user_config.h")
    4581                            .dwattr $C$DW$T$731, DW_AT_decl_line(0x10d)
    4582                            .dwattr $C$DW$T$731, DW_AT_decl_column(0x01)
    4583                            .dwendtag $C$DW$T$731
    4584                    
    4585                    $C$DW$T$732     .dwtag  DW_TAG_typedef
    4586                            .dwattr $C$DW$T$732, DW_AT_name("macHwRevision_t")
    4587                            .dwattr $C$DW$T$732, DW_AT_type(*$C$DW$T$731)
    4588                            .dwattr $C$DW$T$732, DW_AT_language(DW_LANG_C)
    4589                            .dwattr $C$DW$T$732, DW_AT_decl_file("..\Application\mac_user_config.h")
    4590                            .dwattr $C$DW$T$732, DW_AT_decl_line(0x111)
    4591                            .dwattr $C$DW$T$732, DW_AT_decl_column(0x03)
    4592                    
    4593                    
    4594                    $C$DW$T$22      .dwtag  DW_TAG_structure_type
    4595                            .dwattr $C$DW$T$22, DW_AT_byte_size(0x10)
    4596                    $C$DW$420       .dwtag  DW_TAG_member
    4597                            .dwattr $C$DW$420, DW_AT_type(*$C$DW$T$19)
    4598                            .dwattr $C$DW$420, DW_AT_name("rfMode")
    4599                            .dwattr $C$DW$420, DW_AT_TI_symbol_name("rfMode")
    4600                            .dwattr $C$DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4601                            .dwattr $C$DW$420, DW_AT_accessibility(DW_ACCESS_public)
    4602                            .dwattr $C$DW$420, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/r
    4603                            .dwattr $C$DW$420, DW_AT_decl_line(0x2b7)
    4604                            .dwattr $C$DW$420, DW_AT_decl_column(0x0d)
    4605                    
    4606                    $C$DW$421       .dwtag  DW_TAG_member
TI ARM Assembler PC v16.9.4 Mon Mar 05 22:10:59 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{3A1F491F-DFFA-49FC-9E98-211AB27812D8} PAGE   85

    4607                            .dwattr $C$DW$421, DW_AT_type(*$C$DW$T$21)
    4608                            .dwattr $C$DW$421, DW_AT_name("cpePatchFxn")
    4609                            .dwattr $C$DW$421, DW_AT_TI_symbol_name("cpePatchFxn")
    4610                            .dwattr $C$DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4611                            .dwattr $C$DW$421, DW_AT_accessibility(DW_ACCESS_public)
    4612                            .dwattr $C$DW$421, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/r
    4613                            .dwattr $C$DW$421, DW_AT_decl_line(0x2b8)
    4614                            .dwattr $C$DW$421, DW_AT_decl_column(0x0c)
    4615                    
    4616                    $C$DW$422       .dwtag  DW_TAG_member
    4617                            .dwattr $C$DW$422, DW_AT_type(*$C$DW$T$21)
    4618                            .dwattr $C$DW$422, DW_AT_name("mcePatchFxn")
    4619                            .dwattr $C$DW$422, DW_AT_TI_symbol_name("mcePatchFxn")
    4620                            .dwattr $C$DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4621                            .dwattr $C$DW$422, DW_AT_accessibility(DW_ACCESS_public)
    4622                            .dwattr $C$DW$422, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/r
    4623                            .dwattr $C$DW$422, DW_AT_decl_line(0x2b9)
    4624                            .dwattr $C$DW$422, DW_AT_decl_column(0x0c)
    4625                    
    4626                    $C$DW$423       .dwtag  DW_TAG_member
    4627                            .dwattr $C$DW$423, DW_AT_type(*$C$DW$T$21)
    4628                            .dwattr $C$DW$423, DW_AT_name("rfePatchFxn")
    4629                            .dwattr $C$DW$423, DW_AT_TI_symbol_name("rfePatchFxn")
    4630                            .dwattr $C$DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4631                            .dwattr $C$DW$423, DW_AT_accessibility(DW_ACCESS_public)
    4632                            .dwattr $C$DW$423, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/r
    4633                            .dwattr $C$DW$423, DW_AT_decl_line(0x2ba)
    4634                            .dwattr $C$DW$423, DW_AT_decl_column(0x0c)
    4635                    
    4636                            .dwattr $C$DW$T$22, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/
    4637                            .dwattr $C$DW$T$22, DW_AT_decl_line(0x2b6)
    4638                            .dwattr $C$DW$T$22, DW_AT_decl_column(0x10)
    4639                            .dwendtag $C$DW$T$22
    4640                    
    4641                    $C$DW$T$44      .dwtag  DW_TAG_typedef
    4642                            .dwattr $C$DW$T$44, DW_AT_name("RF_Mode")
    4643                            .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$22)
    4644                            .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    4645                            .dwattr $C$DW$T$44, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/
    4646                            .dwattr $C$DW$T$44, DW_AT_decl_line(0x2bb)
    4647                            .dwattr $C$DW$T$44, DW_AT_decl_column(0x03)
    4648                    
    4649                    $C$DW$T$733     .dwtag  DW_TAG_const_type
    4650                            .dwattr $C$DW$T$733, DW_AT_type(*$C$DW$T$44)
    4651                    
    4652                    $C$DW$T$45      .dwtag  DW_TAG_pointer_type
    4653                            .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$44)
    4654                            .dwattr $C$DW$T$45, DW_AT_address_class(0x20)
    4655                    
    4656                    
    4657                    $C$DW$T$23      .dwtag  DW_TAG_structure_type
    4658                            .dwattr $C$DW$T$23, DW_AT_byte_size(0x01)
    4659                    $C$DW$424       .dwtag  DW_TAG_member
    4660                            .dwattr $C$DW$424, DW_AT_type(*$C$DW$T$19)
    4661                            .dwattr $C$DW$424, DW_AT_name("triggerType")
TI ARM Assembler PC v16.9.4 Mon Mar 05 22:10:59 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{3A1F491F-DFFA-49FC-9E98-211AB27812D8} PAGE   86

    4662                            .dwattr $C$DW$424, DW_AT_TI_symbol_name("triggerType")
    4663                            .dwattr $C$DW$424, DW_AT_bit_offset(0x04)
    4664                            .dwattr $C$DW$424, DW_AT_bit_size(0x04)
    4665                            .dwattr $C$DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4666                            .dwattr $C$DW$424, DW_AT_accessibility(DW_ACCESS_public)
    4667                            .dwattr $C$DW$424, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    4668                            .dwattr $C$DW$424, DW_AT_decl_line(0x77)
    4669                            .dwattr $C$DW$424, DW_AT_decl_column(0x0f)
    4670                    
    4671                    $C$DW$425       .dwtag  DW_TAG_member
    4672                            .dwattr $C$DW$425, DW_AT_type(*$C$DW$T$19)
    4673                            .dwattr $C$DW$425, DW_AT_name("bEnaCmd")
    4674                            .dwattr $C$DW$425, DW_AT_TI_symbol_name("bEnaCmd")
    4675                            .dwattr $C$DW$425, DW_AT_bit_offset(0x03)
    4676                            .dwattr $C$DW$425, DW_AT_bit_size(0x01)
    4677                            .dwattr $C$DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4678                            .dwattr $C$DW$425, DW_AT_accessibility(DW_ACCESS_public)
    4679                            .dwattr $C$DW$425, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    4680                            .dwattr $C$DW$425, DW_AT_decl_line(0x78)
    4681                            .dwattr $C$DW$425, DW_AT_decl_column(0x0f)
    4682                    
    4683                    $C$DW$426       .dwtag  DW_TAG_member
    4684                            .dwattr $C$DW$426, DW_AT_type(*$C$DW$T$19)
    4685                            .dwattr $C$DW$426, DW_AT_name("triggerNo")
    4686                            .dwattr $C$DW$426, DW_AT_TI_symbol_name("triggerNo")
    4687                            .dwattr $C$DW$426, DW_AT_bit_offset(0x01)
    4688                            .dwattr $C$DW$426, DW_AT_bit_size(0x02)
    4689                            .dwattr $C$DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4690                            .dwattr $C$DW$426, DW_AT_accessibility(DW_ACCESS_public)
    4691                            .dwattr $C$DW$426, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    4692                            .dwattr $C$DW$426, DW_AT_decl_line(0x7a)
    4693                            .dwattr $C$DW$426, DW_AT_decl_column(0x0f)
    4694                    
    4695                    $C$DW$427       .dwtag  DW_TAG_member
    4696                            .dwattr $C$DW$427, DW_AT_type(*$C$DW$T$19)
    4697                            .dwattr $C$DW$427, DW_AT_name("pastTrig")
    4698                            .dwattr $C$DW$427, DW_AT_TI_symbol_name("pastTrig")
    4699                            .dwattr $C$DW$427, DW_AT_bit_offset(0x00)
    4700                            .dwattr $C$DW$427, DW_AT_bit_size(0x01)
    4701                            .dwattr $C$DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4702                            .dwattr $C$DW$427, DW_AT_accessibility(DW_ACCESS_public)
    4703                            .dwattr $C$DW$427, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    4704                            .dwattr $C$DW$427, DW_AT_decl_line(0x7b)
    4705                            .dwattr $C$DW$427, DW_AT_decl_column(0x0f)
    4706                    
    4707                            .dwattr $C$DW$T$23, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/
    4708                            .dwattr $C$DW$T$23, DW_AT_decl_line(0x76)
    4709                            .dwattr $C$DW$T$23, DW_AT_decl_column(0x0b)
    4710                            .dwendtag $C$DW$T$23
    4711                    
    4712                    
    4713                    $C$DW$T$24      .dwtag  DW_TAG_structure_type
    4714                            .dwattr $C$DW$T$24, DW_AT_byte_size(0x01)
    4715                    $C$DW$428       .dwtag  DW_TAG_member
    4716                            .dwattr $C$DW$428, DW_AT_type(*$C$DW$T$19)
TI ARM Assembler PC v16.9.4 Mon Mar 05 22:10:59 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{3A1F491F-DFFA-49FC-9E98-211AB27812D8} PAGE   87

    4717                            .dwattr $C$DW$428, DW_AT_name("rule")
    4718                            .dwattr $C$DW$428, DW_AT_TI_symbol_name("rule")
    4719                            .dwattr $C$DW$428, DW_AT_bit_offset(0x04)
    4720                            .dwattr $C$DW$428, DW_AT_bit_size(0x04)
    4721                            .dwattr $C$DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4722                            .dwattr $C$DW$428, DW_AT_accessibility(DW_ACCESS_public)
    4723                            .dwattr $C$DW$428, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    4724                            .dwattr $C$DW$428, DW_AT_decl_line(0x7f)
    4725                            .dwattr $C$DW$428, DW_AT_decl_column(0x0f)
    4726                    
    4727                    $C$DW$429       .dwtag  DW_TAG_member
    4728                            .dwattr $C$DW$429, DW_AT_type(*$C$DW$T$19)
    4729                            .dwattr $C$DW$429, DW_AT_name("nSkip")
    4730                            .dwattr $C$DW$429, DW_AT_TI_symbol_name("nSkip")
    4731                            .dwattr $C$DW$429, DW_AT_bit_offset(0x00)
    4732                            .dwattr $C$DW$429, DW_AT_bit_size(0x04)
    4733                            .dwattr $C$DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4734                            .dwattr $C$DW$429, DW_AT_accessibility(DW_ACCESS_public)
    4735                            .dwattr $C$DW$429, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    4736                            .dwattr $C$DW$429, DW_AT_decl_line(0x80)
    4737                            .dwattr $C$DW$429, DW_AT_decl_column(0x0f)
    4738                    
    4739                            .dwattr $C$DW$T$24, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/
    4740                            .dwattr $C$DW$T$24, DW_AT_decl_line(0x7e)
    4741                            .dwattr $C$DW$T$24, DW_AT_decl_column(0x0b)
    4742                            .dwendtag $C$DW$T$24
    4743                    
    4744                    
    4745                    $C$DW$T$25      .dwtag  DW_TAG_structure_type
    4746                            .dwattr $C$DW$T$25, DW_AT_byte_size(0x01)
    4747                    $C$DW$430       .dwtag  DW_TAG_member
    4748                            .dwattr $C$DW$430, DW_AT_type(*$C$DW$T$19)
    4749                            .dwattr $C$DW$430, DW_AT_name("triggerType")
    4750                            .dwattr $C$DW$430, DW_AT_TI_symbol_name("triggerType")
    4751                            .dwattr $C$DW$430, DW_AT_bit_offset(0x04)
    4752                            .dwattr $C$DW$430, DW_AT_bit_size(0x04)
    4753                            .dwattr $C$DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4754                            .dwattr $C$DW$430, DW_AT_accessibility(DW_ACCESS_public)
    4755                            .dwattr $C$DW$430, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    4756                            .dwattr $C$DW$430, DW_AT_decl_line(0xad)
    4757                            .dwattr $C$DW$430, DW_AT_decl_column(0x0f)
    4758                    
    4759                    $C$DW$431       .dwtag  DW_TAG_member
    4760                            .dwattr $C$DW$431, DW_AT_type(*$C$DW$T$19)
    4761                            .dwattr $C$DW$431, DW_AT_name("bEnaCmd")
    4762                            .dwattr $C$DW$431, DW_AT_TI_symbol_name("bEnaCmd")
    4763                            .dwattr $C$DW$431, DW_AT_bit_offset(0x03)
    4764                            .dwattr $C$DW$431, DW_AT_bit_size(0x01)
    4765                            .dwattr $C$DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4766                            .dwattr $C$DW$431, DW_AT_accessibility(DW_ACCESS_public)
    4767                            .dwattr $C$DW$431, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    4768                            .dwattr $C$DW$431, DW_AT_decl_line(0xae)
    4769                            .dwattr $C$DW$431, DW_AT_decl_column(0x0f)
    4770                    
    4771                    $C$DW$432       .dwtag  DW_TAG_member
TI ARM Assembler PC v16.9.4 Mon Mar 05 22:10:59 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{3A1F491F-DFFA-49FC-9E98-211AB27812D8} PAGE   88

    4772                            .dwattr $C$DW$432, DW_AT_type(*$C$DW$T$19)
    4773                            .dwattr $C$DW$432, DW_AT_name("triggerNo")
    4774                            .dwattr $C$DW$432, DW_AT_TI_symbol_name("triggerNo")
    4775                            .dwattr $C$DW$432, DW_AT_bit_offset(0x01)
    4776                            .dwattr $C$DW$432, DW_AT_bit_size(0x02)
    4777                            .dwattr $C$DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4778                            .dwattr $C$DW$432, DW_AT_accessibility(DW_ACCESS_public)
    4779                            .dwattr $C$DW$432, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    4780                            .dwattr $C$DW$432, DW_AT_decl_line(0xb0)
    4781                            .dwattr $C$DW$432, DW_AT_decl_column(0x0f)
    4782                    
    4783                    $C$DW$433       .dwtag  DW_TAG_member
    4784                            .dwattr $C$DW$433, DW_AT_type(*$C$DW$T$19)
    4785                            .dwattr $C$DW$433, DW_AT_name("pastTrig")
    4786                            .dwattr $C$DW$433, DW_AT_TI_symbol_name("pastTrig")
    4787                            .dwattr $C$DW$433, DW_AT_bit_offset(0x00)
    4788                            .dwattr $C$DW$433, DW_AT_bit_size(0x01)
    4789                            .dwattr $C$DW$433, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4790                            .dwattr $C$DW$433, DW_AT_accessibility(DW_ACCESS_public)
    4791                            .dwattr $C$DW$433, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    4792                            .dwattr $C$DW$433, DW_AT_decl_line(0xb1)
    4793                            .dwattr $C$DW$433, DW_AT_decl_column(0x0f)
    4794                    
    4795                            .dwattr $C$DW$T$25, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/
    4796                            .dwattr $C$DW$T$25, DW_AT_decl_line(0xac)
    4797                            .dwattr $C$DW$T$25, DW_AT_decl_column(0x0b)
    4798                            .dwendtag $C$DW$T$25
    4799                    
    4800                    
    4801                    $C$DW$T$26      .dwtag  DW_TAG_structure_type
    4802                            .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
    4803                    $C$DW$434       .dwtag  DW_TAG_member
    4804                            .dwattr $C$DW$434, DW_AT_type(*$C$DW$T$19)
    4805                            .dwattr $C$DW$434, DW_AT_name("rule")
    4806                            .dwattr $C$DW$434, DW_AT_TI_symbol_name("rule")
    4807                            .dwattr $C$DW$434, DW_AT_bit_offset(0x04)
    4808                            .dwattr $C$DW$434, DW_AT_bit_size(0x04)
    4809                            .dwattr $C$DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4810                            .dwattr $C$DW$434, DW_AT_accessibility(DW_ACCESS_public)
    4811                            .dwattr $C$DW$434, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    4812                            .dwattr $C$DW$434, DW_AT_decl_line(0xb5)
    4813                            .dwattr $C$DW$434, DW_AT_decl_column(0x0f)
    4814                    
    4815                    $C$DW$435       .dwtag  DW_TAG_member
    4816                            .dwattr $C$DW$435, DW_AT_type(*$C$DW$T$19)
    4817                            .dwattr $C$DW$435, DW_AT_name("nSkip")
    4818                            .dwattr $C$DW$435, DW_AT_TI_symbol_name("nSkip")
    4819                            .dwattr $C$DW$435, DW_AT_bit_offset(0x00)
    4820                            .dwattr $C$DW$435, DW_AT_bit_size(0x04)
    4821                            .dwattr $C$DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4822                            .dwattr $C$DW$435, DW_AT_accessibility(DW_ACCESS_public)
    4823                            .dwattr $C$DW$435, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    4824                            .dwattr $C$DW$435, DW_AT_decl_line(0xb6)
    4825                            .dwattr $C$DW$435, DW_AT_decl_column(0x0f)
    4826                    
TI ARM Assembler PC v16.9.4 Mon Mar 05 22:10:59 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{3A1F491F-DFFA-49FC-9E98-211AB27812D8} PAGE   89

    4827                            .dwattr $C$DW$T$26, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/
    4828                            .dwattr $C$DW$T$26, DW_AT_decl_line(0xb4)
    4829                            .dwattr $C$DW$T$26, DW_AT_decl_column(0x0b)
    4830                            .dwendtag $C$DW$T$26
    4831                    
    4832                    
    4833                    $C$DW$T$28      .dwtag  DW_TAG_structure_type
    4834                            .dwattr $C$DW$T$28, DW_AT_byte_size(0x02)
    4835                    $C$DW$436       .dwtag  DW_TAG_member
    4836                            .dwattr $C$DW$436, DW_AT_type(*$C$DW$T$27)
    4837                            .dwattr $C$DW$436, DW_AT_name("frontEndMode")
    4838                            .dwattr $C$DW$436, DW_AT_TI_symbol_name("frontEndMode")
    4839                            .dwattr $C$DW$436, DW_AT_bit_offset(0x0d)
    4840                            .dwattr $C$DW$436, DW_AT_bit_size(0x03)
    4841                            .dwattr $C$DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4842                            .dwattr $C$DW$436, DW_AT_accessibility(DW_ACCESS_public)
    4843                            .dwattr $C$DW$436, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    4844                            .dwattr $C$DW$436, DW_AT_decl_line(0xc3)
    4845                            .dwattr $C$DW$436, DW_AT_decl_column(0x10)
    4846                    
    4847                    $C$DW$437       .dwtag  DW_TAG_member
    4848                            .dwattr $C$DW$437, DW_AT_type(*$C$DW$T$27)
    4849                            .dwattr $C$DW$437, DW_AT_name("biasMode")
    4850                            .dwattr $C$DW$437, DW_AT_TI_symbol_name("biasMode")
    4851                            .dwattr $C$DW$437, DW_AT_bit_offset(0x0c)
    4852                            .dwattr $C$DW$437, DW_AT_bit_size(0x01)
    4853                            .dwattr $C$DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4854                            .dwattr $C$DW$437, DW_AT_accessibility(DW_ACCESS_public)
    4855                            .dwattr $C$DW$437, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    4856                            .dwattr $C$DW$437, DW_AT_decl_line(0xc9)
    4857                            .dwattr $C$DW$437, DW_AT_decl_column(0x10)
    4858                    
    4859                    $C$DW$438       .dwtag  DW_TAG_member
    4860                            .dwattr $C$DW$438, DW_AT_type(*$C$DW$T$27)
    4861                            .dwattr $C$DW$438, DW_AT_name("analogCfgMode")
    4862                            .dwattr $C$DW$438, DW_AT_TI_symbol_name("analogCfgMode")
    4863                            .dwattr $C$DW$438, DW_AT_bit_offset(0x06)
    4864                            .dwattr $C$DW$438, DW_AT_bit_size(0x06)
    4865                            .dwattr $C$DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4866                            .dwattr $C$DW$438, DW_AT_accessibility(DW_ACCESS_public)
    4867                            .dwattr $C$DW$438, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    4868                            .dwattr $C$DW$438, DW_AT_decl_line(0xcb)
    4869                            .dwattr $C$DW$438, DW_AT_decl_column(0x10)
    4870                    
    4871                    $C$DW$439       .dwtag  DW_TAG_member
    4872                            .dwattr $C$DW$439, DW_AT_type(*$C$DW$T$27)
    4873                            .dwattr $C$DW$439, DW_AT_name("bNoFsPowerUp")
    4874                            .dwattr $C$DW$439, DW_AT_TI_symbol_name("bNoFsPowerUp")
    4875                            .dwattr $C$DW$439, DW_AT_bit_offset(0x05)
    4876                            .dwattr $C$DW$439, DW_AT_bit_size(0x01)
    4877                            .dwattr $C$DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4878                            .dwattr $C$DW$439, DW_AT_accessibility(DW_ACCESS_public)
    4879                            .dwattr $C$DW$439, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    4880                            .dwattr $C$DW$439, DW_AT_decl_line(0xd2)
    4881                            .dwattr $C$DW$439, DW_AT_decl_column(0x10)
TI ARM Assembler PC v16.9.4 Mon Mar 05 22:10:59 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{3A1F491F-DFFA-49FC-9E98-211AB27812D8} PAGE   90

    4882                    
    4883                            .dwattr $C$DW$T$28, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/
    4884                            .dwattr $C$DW$T$28, DW_AT_decl_line(0xc2)
    4885                            .dwattr $C$DW$T$28, DW_AT_decl_column(0x0b)
    4886                            .dwendtag $C$DW$T$28
    4887                    
    4888                    
    4889                    $C$DW$T$29      .dwtag  DW_TAG_structure_type
    4890                            .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
    4891                    $C$DW$440       .dwtag  DW_TAG_member
    4892                            .dwattr $C$DW$440, DW_AT_type(*$C$DW$T$19)
    4893                            .dwattr $C$DW$440, DW_AT_name("triggerType")
    4894                            .dwattr $C$DW$440, DW_AT_TI_symbol_name("triggerType")
    4895                            .dwattr $C$DW$440, DW_AT_bit_offset(0x04)
    4896                            .dwattr $C$DW$440, DW_AT_bit_size(0x04)
    4897                            .dwattr $C$DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4898                            .dwattr $C$DW$440, DW_AT_accessibility(DW_ACCESS_public)
    4899                            .dwattr $C$DW$440, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    4900                            .dwattr $C$DW$440, DW_AT_decl_line(0x1c9)
    4901                            .dwattr $C$DW$440, DW_AT_decl_column(0x0f)
    4902                    
    4903                    $C$DW$441       .dwtag  DW_TAG_member
    4904                            .dwattr $C$DW$441, DW_AT_type(*$C$DW$T$19)
    4905                            .dwattr $C$DW$441, DW_AT_name("bEnaCmd")
    4906                            .dwattr $C$DW$441, DW_AT_TI_symbol_name("bEnaCmd")
    4907                            .dwattr $C$DW$441, DW_AT_bit_offset(0x03)
    4908                            .dwattr $C$DW$441, DW_AT_bit_size(0x01)
    4909                            .dwattr $C$DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4910                            .dwattr $C$DW$441, DW_AT_accessibility(DW_ACCESS_public)
    4911                            .dwattr $C$DW$441, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    4912                            .dwattr $C$DW$441, DW_AT_decl_line(0x1ca)
    4913                            .dwattr $C$DW$441, DW_AT_decl_column(0x0f)
    4914                    
    4915                    $C$DW$442       .dwtag  DW_TAG_member
    4916                            .dwattr $C$DW$442, DW_AT_type(*$C$DW$T$19)
    4917                            .dwattr $C$DW$442, DW_AT_name("triggerNo")
    4918                            .dwattr $C$DW$442, DW_AT_TI_symbol_name("triggerNo")
    4919                            .dwattr $C$DW$442, DW_AT_bit_offset(0x01)
    4920                            .dwattr $C$DW$442, DW_AT_bit_size(0x02)
    4921                            .dwattr $C$DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4922                            .dwattr $C$DW$442, DW_AT_accessibility(DW_ACCESS_public)
    4923                            .dwattr $C$DW$442, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    4924                            .dwattr $C$DW$442, DW_AT_decl_line(0x1cc)
    4925                            .dwattr $C$DW$442, DW_AT_decl_column(0x0f)
    4926                    
    4927                    $C$DW$443       .dwtag  DW_TAG_member
    4928                            .dwattr $C$DW$443, DW_AT_type(*$C$DW$T$19)
    4929                            .dwattr $C$DW$443, DW_AT_name("pastTrig")
    4930                            .dwattr $C$DW$443, DW_AT_TI_symbol_name("pastTrig")
    4931                            .dwattr $C$DW$443, DW_AT_bit_offset(0x00)
    4932                            .dwattr $C$DW$443, DW_AT_bit_size(0x01)
    4933                            .dwattr $C$DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4934                            .dwattr $C$DW$443, DW_AT_accessibility(DW_ACCESS_public)
    4935                            .dwattr $C$DW$443, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    4936                            .dwattr $C$DW$443, DW_AT_decl_line(0x1cd)
TI ARM Assembler PC v16.9.4 Mon Mar 05 22:10:59 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{3A1F491F-DFFA-49FC-9E98-211AB27812D8} PAGE   91

    4937                            .dwattr $C$DW$443, DW_AT_decl_column(0x0f)
    4938                    
    4939                            .dwattr $C$DW$T$29, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/
    4940                            .dwattr $C$DW$T$29, DW_AT_decl_line(0x1c8)
    4941                            .dwattr $C$DW$T$29, DW_AT_decl_column(0x0b)
    4942                            .dwendtag $C$DW$T$29
    4943                    
    4944                    
    4945                    $C$DW$T$30      .dwtag  DW_TAG_structure_type
    4946                            .dwattr $C$DW$T$30, DW_AT_byte_size(0x01)
    4947                    $C$DW$444       .dwtag  DW_TAG_member
    4948                            .dwattr $C$DW$444, DW_AT_type(*$C$DW$T$19)
    4949                            .dwattr $C$DW$444, DW_AT_name("rule")
    4950                            .dwattr $C$DW$444, DW_AT_TI_symbol_name("rule")
    4951                            .dwattr $C$DW$444, DW_AT_bit_offset(0x04)
    4952                            .dwattr $C$DW$444, DW_AT_bit_size(0x04)
    4953                            .dwattr $C$DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4954                            .dwattr $C$DW$444, DW_AT_accessibility(DW_ACCESS_public)
    4955                            .dwattr $C$DW$444, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    4956                            .dwattr $C$DW$444, DW_AT_decl_line(0x1d1)
    4957                            .dwattr $C$DW$444, DW_AT_decl_column(0x0f)
    4958                    
    4959                    $C$DW$445       .dwtag  DW_TAG_member
    4960                            .dwattr $C$DW$445, DW_AT_type(*$C$DW$T$19)
    4961                            .dwattr $C$DW$445, DW_AT_name("nSkip")
    4962                            .dwattr $C$DW$445, DW_AT_TI_symbol_name("nSkip")
    4963                            .dwattr $C$DW$445, DW_AT_bit_offset(0x00)
    4964                            .dwattr $C$DW$445, DW_AT_bit_size(0x04)
    4965                            .dwattr $C$DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4966                            .dwattr $C$DW$445, DW_AT_accessibility(DW_ACCESS_public)
    4967                            .dwattr $C$DW$445, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    4968                            .dwattr $C$DW$445, DW_AT_decl_line(0x1d2)
    4969                            .dwattr $C$DW$445, DW_AT_decl_column(0x0f)
    4970                    
    4971                            .dwattr $C$DW$T$30, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/
    4972                            .dwattr $C$DW$T$30, DW_AT_decl_line(0x1d0)
    4973                            .dwattr $C$DW$T$30, DW_AT_decl_column(0x0b)
    4974                            .dwendtag $C$DW$T$30
    4975                    
    4976                    
    4977                    $C$DW$T$31      .dwtag  DW_TAG_structure_type
    4978                            .dwattr $C$DW$T$31, DW_AT_byte_size(0x02)
    4979                    $C$DW$446       .dwtag  DW_TAG_member
    4980                            .dwattr $C$DW$446, DW_AT_type(*$C$DW$T$27)
    4981                            .dwattr $C$DW$446, DW_AT_name("modType")
    4982                            .dwattr $C$DW$446, DW_AT_TI_symbol_name("modType")
    4983                            .dwattr $C$DW$446, DW_AT_bit_offset(0x0d)
    4984                            .dwattr $C$DW$446, DW_AT_bit_size(0x03)
    4985                            .dwattr $C$DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4986                            .dwattr $C$DW$446, DW_AT_accessibility(DW_ACCESS_public)
    4987                            .dwattr $C$DW$446, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    4988                            .dwattr $C$DW$446, DW_AT_decl_line(0x1d5)
    4989                            .dwattr $C$DW$446, DW_AT_decl_column(0x10)
    4990                    
    4991                    $C$DW$447       .dwtag  DW_TAG_member
TI ARM Assembler PC v16.9.4 Mon Mar 05 22:10:59 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{3A1F491F-DFFA-49FC-9E98-211AB27812D8} PAGE   92

    4992                            .dwattr $C$DW$447, DW_AT_type(*$C$DW$T$27)
    4993                            .dwattr $C$DW$447, DW_AT_name("deviation")
    4994                            .dwattr $C$DW$447, DW_AT_TI_symbol_name("deviation")
    4995                            .dwattr $C$DW$447, DW_AT_bit_offset(0x00)
    4996                            .dwattr $C$DW$447, DW_AT_bit_size(0x0d)
    4997                            .dwattr $C$DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4998                            .dwattr $C$DW$447, DW_AT_accessibility(DW_ACCESS_public)
    4999                            .dwattr $C$DW$447, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    5000                            .dwattr $C$DW$447, DW_AT_decl_line(0x1d8)
    5001                            .dwattr $C$DW$447, DW_AT_decl_column(0x10)
    5002                    
    5003                            .dwattr $C$DW$T$31, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/
    5004                            .dwattr $C$DW$T$31, DW_AT_decl_line(0x1d4)
    5005                            .dwattr $C$DW$T$31, DW_AT_decl_column(0x0b)
    5006                            .dwendtag $C$DW$T$31
    5007                    
    5008                    
    5009                    $C$DW$T$33      .dwtag  DW_TAG_structure_type
    5010                            .dwattr $C$DW$T$33, DW_AT_byte_size(0x04)
    5011                    $C$DW$448       .dwtag  DW_TAG_member
    5012                            .dwattr $C$DW$448, DW_AT_type(*$C$DW$T$32)
    5013                            .dwattr $C$DW$448, DW_AT_name("preScale")
    5014                            .dwattr $C$DW$448, DW_AT_TI_symbol_name("preScale")
    5015                            .dwattr $C$DW$448, DW_AT_bit_offset(0x1c)
    5016                            .dwattr $C$DW$448, DW_AT_bit_size(0x04)
    5017                            .dwattr $C$DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5018                            .dwattr $C$DW$448, DW_AT_accessibility(DW_ACCESS_public)
    5019                            .dwattr $C$DW$448, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    5020                            .dwattr $C$DW$448, DW_AT_decl_line(0x1db)
    5021                            .dwattr $C$DW$448, DW_AT_decl_column(0x10)
    5022                    
    5023                    $C$DW$449       .dwtag  DW_TAG_member
    5024                            .dwattr $C$DW$449, DW_AT_type(*$C$DW$T$32)
    5025                            .dwattr $C$DW$449, DW_AT_name("rateWord")
    5026                            .dwattr $C$DW$449, DW_AT_TI_symbol_name("rateWord")
    5027                            .dwattr $C$DW$449, DW_AT_bit_offset(0x03)
    5028                            .dwattr $C$DW$449, DW_AT_bit_size(0x15)
    5029                            .dwattr $C$DW$449, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5030                            .dwattr $C$DW$449, DW_AT_accessibility(DW_ACCESS_public)
    5031                            .dwattr $C$DW$449, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    5032                            .dwattr $C$DW$449, DW_AT_decl_line(0x1dd)
    5033                            .dwattr $C$DW$449, DW_AT_decl_column(0x10)
    5034                    
    5035                    $C$DW$450       .dwtag  DW_TAG_member
    5036                            .dwattr $C$DW$450, DW_AT_type(*$C$DW$T$32)
    5037                            .dwattr $C$DW$450, DW_AT_name("decimMode")
    5038                            .dwattr $C$DW$450, DW_AT_TI_symbol_name("decimMode")
    5039                            .dwattr $C$DW$450, DW_AT_bit_offset(0x00)
    5040                            .dwattr $C$DW$450, DW_AT_bit_size(0x03)
    5041                            .dwattr $C$DW$450, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5042                            .dwattr $C$DW$450, DW_AT_accessibility(DW_ACCESS_public)
    5043                            .dwattr $C$DW$450, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    5044                            .dwattr $C$DW$450, DW_AT_decl_line(0x1de)
    5045                            .dwattr $C$DW$450, DW_AT_decl_column(0x10)
    5046                    
TI ARM Assembler PC v16.9.4 Mon Mar 05 22:10:59 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{3A1F491F-DFFA-49FC-9E98-211AB27812D8} PAGE   93

    5047                            .dwattr $C$DW$T$33, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/
    5048                            .dwattr $C$DW$T$33, DW_AT_decl_line(0x1da)
    5049                            .dwattr $C$DW$T$33, DW_AT_decl_column(0x0b)
    5050                            .dwendtag $C$DW$T$33
    5051                    
    5052                    
    5053                    $C$DW$T$34      .dwtag  DW_TAG_structure_type
    5054                            .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
    5055                    $C$DW$451       .dwtag  DW_TAG_member
    5056                            .dwattr $C$DW$451, DW_AT_type(*$C$DW$T$19)
    5057                            .dwattr $C$DW$451, DW_AT_name("nPreamBytes")
    5058                            .dwattr $C$DW$451, DW_AT_TI_symbol_name("nPreamBytes")
    5059                            .dwattr $C$DW$451, DW_AT_bit_offset(0x02)
    5060                            .dwattr $C$DW$451, DW_AT_bit_size(0x06)
    5061                            .dwattr $C$DW$451, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5062                            .dwattr $C$DW$451, DW_AT_accessibility(DW_ACCESS_public)
    5063                            .dwattr $C$DW$451, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    5064                            .dwattr $C$DW$451, DW_AT_decl_line(0x1e6)
    5065                            .dwattr $C$DW$451, DW_AT_decl_column(0x0f)
    5066                    
    5067                    $C$DW$452       .dwtag  DW_TAG_member
    5068                            .dwattr $C$DW$452, DW_AT_type(*$C$DW$T$19)
    5069                            .dwattr $C$DW$452, DW_AT_name("preamMode")
    5070                            .dwattr $C$DW$452, DW_AT_TI_symbol_name("preamMode")
    5071                            .dwattr $C$DW$452, DW_AT_bit_offset(0x00)
    5072                            .dwattr $C$DW$452, DW_AT_bit_size(0x02)
    5073                            .dwattr $C$DW$452, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5074                            .dwattr $C$DW$452, DW_AT_accessibility(DW_ACCESS_public)
    5075                            .dwattr $C$DW$452, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    5076                            .dwattr $C$DW$452, DW_AT_decl_line(0x1ec)
    5077                            .dwattr $C$DW$452, DW_AT_decl_column(0x0f)
    5078                    
    5079                            .dwattr $C$DW$T$34, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/
    5080                            .dwattr $C$DW$T$34, DW_AT_decl_line(0x1e5)
    5081                            .dwattr $C$DW$T$34, DW_AT_decl_column(0x0b)
    5082                            .dwendtag $C$DW$T$34
    5083                    
    5084                    
    5085                    $C$DW$T$35      .dwtag  DW_TAG_structure_type
    5086                            .dwattr $C$DW$T$35, DW_AT_byte_size(0x02)
    5087                    $C$DW$453       .dwtag  DW_TAG_member
    5088                            .dwattr $C$DW$453, DW_AT_type(*$C$DW$T$27)
    5089                            .dwattr $C$DW$453, DW_AT_name("nSwBits")
    5090                            .dwattr $C$DW$453, DW_AT_TI_symbol_name("nSwBits")
    5091                            .dwattr $C$DW$453, DW_AT_bit_offset(0x0a)
    5092                            .dwattr $C$DW$453, DW_AT_bit_size(0x06)
    5093                            .dwattr $C$DW$453, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5094                            .dwattr $C$DW$453, DW_AT_accessibility(DW_ACCESS_public)
    5095                            .dwattr $C$DW$453, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    5096                            .dwattr $C$DW$453, DW_AT_decl_line(0x1f2)
    5097                            .dwattr $C$DW$453, DW_AT_decl_column(0x10)
    5098                    
    5099                    $C$DW$454       .dwtag  DW_TAG_member
    5100                            .dwattr $C$DW$454, DW_AT_type(*$C$DW$T$27)
    5101                            .dwattr $C$DW$454, DW_AT_name("bBitReversal")
TI ARM Assembler PC v16.9.4 Mon Mar 05 22:10:59 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{3A1F491F-DFFA-49FC-9E98-211AB27812D8} PAGE   94

    5102                            .dwattr $C$DW$454, DW_AT_TI_symbol_name("bBitReversal")
    5103                            .dwattr $C$DW$454, DW_AT_bit_offset(0x09)
    5104                            .dwattr $C$DW$454, DW_AT_bit_size(0x01)
    5105                            .dwattr $C$DW$454, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5106                            .dwattr $C$DW$454, DW_AT_accessibility(DW_ACCESS_public)
    5107                            .dwattr $C$DW$454, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    5108                            .dwattr $C$DW$454, DW_AT_decl_line(0x1f3)
    5109                            .dwattr $C$DW$454, DW_AT_decl_column(0x10)
    5110                    
    5111                    $C$DW$455       .dwtag  DW_TAG_member
    5112                            .dwattr $C$DW$455, DW_AT_type(*$C$DW$T$27)
    5113                            .dwattr $C$DW$455, DW_AT_name("bMsbFirst")
    5114                            .dwattr $C$DW$455, DW_AT_TI_symbol_name("bMsbFirst")
    5115                            .dwattr $C$DW$455, DW_AT_bit_offset(0x08)
    5116                            .dwattr $C$DW$455, DW_AT_bit_size(0x01)
    5117                            .dwattr $C$DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5118                            .dwattr $C$DW$455, DW_AT_accessibility(DW_ACCESS_public)
    5119                            .dwattr $C$DW$455, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    5120                            .dwattr $C$DW$455, DW_AT_decl_line(0x1f5)
    5121                            .dwattr $C$DW$455, DW_AT_decl_column(0x10)
    5122                    
    5123                    $C$DW$456       .dwtag  DW_TAG_member
    5124                            .dwattr $C$DW$456, DW_AT_type(*$C$DW$T$27)
    5125                            .dwattr $C$DW$456, DW_AT_name("fecMode")
    5126                            .dwattr $C$DW$456, DW_AT_TI_symbol_name("fecMode")
    5127                            .dwattr $C$DW$456, DW_AT_bit_offset(0x04)
    5128                            .dwattr $C$DW$456, DW_AT_bit_size(0x04)
    5129                            .dwattr $C$DW$456, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5130                            .dwattr $C$DW$456, DW_AT_accessibility(DW_ACCESS_public)
    5131                            .dwattr $C$DW$456, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    5132                            .dwattr $C$DW$456, DW_AT_decl_line(0x1f7)
    5133                            .dwattr $C$DW$456, DW_AT_decl_column(0x10)
    5134                    
    5135                    $C$DW$457       .dwtag  DW_TAG_member
    5136                            .dwattr $C$DW$457, DW_AT_type(*$C$DW$T$27)
    5137                            .dwattr $C$DW$457, DW_AT_name("whitenMode")
    5138                            .dwattr $C$DW$457, DW_AT_TI_symbol_name("whitenMode")
    5139                            .dwattr $C$DW$457, DW_AT_bit_offset(0x00)
    5140                            .dwattr $C$DW$457, DW_AT_bit_size(0x03)
    5141                            .dwattr $C$DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5142                            .dwattr $C$DW$457, DW_AT_accessibility(DW_ACCESS_public)
    5143                            .dwattr $C$DW$457, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    5144                            .dwattr $C$DW$457, DW_AT_decl_line(0x1fd)
    5145                            .dwattr $C$DW$457, DW_AT_decl_column(0x10)
    5146                    
    5147                            .dwattr $C$DW$T$35, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/
    5148                            .dwattr $C$DW$T$35, DW_AT_decl_line(0x1f1)
    5149                            .dwattr $C$DW$T$35, DW_AT_decl_column(0x0b)
    5150                            .dwendtag $C$DW$T$35
    5151                    
    5152                    
    5153                    $C$DW$T$36      .dwtag  DW_TAG_structure_type
    5154                            .dwattr $C$DW$T$36, DW_AT_byte_size(0x02)
    5155                    $C$DW$458       .dwtag  DW_TAG_member
    5156                            .dwattr $C$DW$458, DW_AT_type(*$C$DW$T$27)
TI ARM Assembler PC v16.9.4 Mon Mar 05 22:10:59 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{3A1F491F-DFFA-49FC-9E98-211AB27812D8} PAGE   95

    5157                            .dwattr $C$DW$458, DW_AT_name("frontEndMode")
    5158                            .dwattr $C$DW$458, DW_AT_TI_symbol_name("frontEndMode")
    5159                            .dwattr $C$DW$458, DW_AT_bit_offset(0x0d)
    5160                            .dwattr $C$DW$458, DW_AT_bit_size(0x03)
    5161                            .dwattr $C$DW$458, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5162                            .dwattr $C$DW$458, DW_AT_accessibility(DW_ACCESS_public)
    5163                            .dwattr $C$DW$458, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    5164                            .dwattr $C$DW$458, DW_AT_decl_line(0x207)
    5165                            .dwattr $C$DW$458, DW_AT_decl_column(0x10)
    5166                    
    5167                    $C$DW$459       .dwtag  DW_TAG_member
    5168                            .dwattr $C$DW$459, DW_AT_type(*$C$DW$T$27)
    5169                            .dwattr $C$DW$459, DW_AT_name("biasMode")
    5170                            .dwattr $C$DW$459, DW_AT_TI_symbol_name("biasMode")
    5171                            .dwattr $C$DW$459, DW_AT_bit_offset(0x0c)
    5172                            .dwattr $C$DW$459, DW_AT_bit_size(0x01)
    5173                            .dwattr $C$DW$459, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5174                            .dwattr $C$DW$459, DW_AT_accessibility(DW_ACCESS_public)
    5175                            .dwattr $C$DW$459, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    5176                            .dwattr $C$DW$459, DW_AT_decl_line(0x20d)
    5177                            .dwattr $C$DW$459, DW_AT_decl_column(0x10)
    5178                    
    5179                    $C$DW$460       .dwtag  DW_TAG_member
    5180                            .dwattr $C$DW$460, DW_AT_type(*$C$DW$T$27)
    5181                            .dwattr $C$DW$460, DW_AT_name("analogCfgMode")
    5182                            .dwattr $C$DW$460, DW_AT_TI_symbol_name("analogCfgMode")
    5183                            .dwattr $C$DW$460, DW_AT_bit_offset(0x06)
    5184                            .dwattr $C$DW$460, DW_AT_bit_size(0x06)
    5185                            .dwattr $C$DW$460, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5186                            .dwattr $C$DW$460, DW_AT_accessibility(DW_ACCESS_public)
    5187                            .dwattr $C$DW$460, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    5188                            .dwattr $C$DW$460, DW_AT_decl_line(0x20f)
    5189                            .dwattr $C$DW$460, DW_AT_decl_column(0x10)
    5190                    
    5191                    $C$DW$461       .dwtag  DW_TAG_member
    5192                            .dwattr $C$DW$461, DW_AT_type(*$C$DW$T$27)
    5193                            .dwattr $C$DW$461, DW_AT_name("bNoFsPowerUp")
    5194                            .dwattr $C$DW$461, DW_AT_TI_symbol_name("bNoFsPowerUp")
    5195                            .dwattr $C$DW$461, DW_AT_bit_offset(0x05)
    5196                            .dwattr $C$DW$461, DW_AT_bit_size(0x01)
    5197                            .dwattr $C$DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5198                            .dwattr $C$DW$461, DW_AT_accessibility(DW_ACCESS_public)
    5199                            .dwattr $C$DW$461, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    5200                            .dwattr $C$DW$461, DW_AT_decl_line(0x216)
    5201                            .dwattr $C$DW$461, DW_AT_decl_column(0x10)
    5202                    
    5203                            .dwattr $C$DW$T$36, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/
    5204                            .dwattr $C$DW$T$36, DW_AT_decl_line(0x206)
    5205                            .dwattr $C$DW$T$36, DW_AT_decl_column(0x0b)
    5206                            .dwendtag $C$DW$T$36
    5207                    
    5208                    
    5209                    $C$DW$T$37      .dwtag  DW_TAG_structure_type
    5210                            .dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
    5211                    $C$DW$462       .dwtag  DW_TAG_member
TI ARM Assembler PC v16.9.4 Mon Mar 05 22:10:59 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{3A1F491F-DFFA-49FC-9E98-211AB27812D8} PAGE   96

    5212                            .dwattr $C$DW$462, DW_AT_type(*$C$DW$T$19)
    5213                            .dwattr $C$DW$462, DW_AT_name("triggerType")
    5214                            .dwattr $C$DW$462, DW_AT_TI_symbol_name("triggerType")
    5215                            .dwattr $C$DW$462, DW_AT_bit_offset(0x04)
    5216                            .dwattr $C$DW$462, DW_AT_bit_size(0x04)
    5217                            .dwattr $C$DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5218                            .dwattr $C$DW$462, DW_AT_accessibility(DW_ACCESS_public)
    5219                            .dwattr $C$DW$462, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    5220                            .dwattr $C$DW$462, DW_AT_decl_line(0x22d)
    5221                            .dwattr $C$DW$462, DW_AT_decl_column(0x0f)
    5222                    
    5223                    $C$DW$463       .dwtag  DW_TAG_member
    5224                            .dwattr $C$DW$463, DW_AT_type(*$C$DW$T$19)
    5225                            .dwattr $C$DW$463, DW_AT_name("bEnaCmd")
    5226                            .dwattr $C$DW$463, DW_AT_TI_symbol_name("bEnaCmd")
    5227                            .dwattr $C$DW$463, DW_AT_bit_offset(0x03)
    5228                            .dwattr $C$DW$463, DW_AT_bit_size(0x01)
    5229                            .dwattr $C$DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5230                            .dwattr $C$DW$463, DW_AT_accessibility(DW_ACCESS_public)
    5231                            .dwattr $C$DW$463, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    5232                            .dwattr $C$DW$463, DW_AT_decl_line(0x22e)
    5233                            .dwattr $C$DW$463, DW_AT_decl_column(0x0f)
    5234                    
    5235                    $C$DW$464       .dwtag  DW_TAG_member
    5236                            .dwattr $C$DW$464, DW_AT_type(*$C$DW$T$19)
    5237                            .dwattr $C$DW$464, DW_AT_name("triggerNo")
    5238                            .dwattr $C$DW$464, DW_AT_TI_symbol_name("triggerNo")
    5239                            .dwattr $C$DW$464, DW_AT_bit_offset(0x01)
    5240                            .dwattr $C$DW$464, DW_AT_bit_size(0x02)
    5241                            .dwattr $C$DW$464, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5242                            .dwattr $C$DW$464, DW_AT_accessibility(DW_ACCESS_public)
    5243                            .dwattr $C$DW$464, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    5244                            .dwattr $C$DW$464, DW_AT_decl_line(0x230)
    5245                            .dwattr $C$DW$464, DW_AT_decl_column(0x0f)
    5246                    
    5247                    $C$DW$465       .dwtag  DW_TAG_member
    5248                            .dwattr $C$DW$465, DW_AT_type(*$C$DW$T$19)
    5249                            .dwattr $C$DW$465, DW_AT_name("pastTrig")
    5250                            .dwattr $C$DW$465, DW_AT_TI_symbol_name("pastTrig")
    5251                            .dwattr $C$DW$465, DW_AT_bit_offset(0x00)
    5252                            .dwattr $C$DW$465, DW_AT_bit_size(0x01)
    5253                            .dwattr $C$DW$465, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5254                            .dwattr $C$DW$465, DW_AT_accessibility(DW_ACCESS_public)
    5255                            .dwattr $C$DW$465, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    5256                            .dwattr $C$DW$465, DW_AT_decl_line(0x231)
    5257                            .dwattr $C$DW$465, DW_AT_decl_column(0x0f)
    5258                    
    5259                            .dwattr $C$DW$T$37, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/
    5260                            .dwattr $C$DW$T$37, DW_AT_decl_line(0x22c)
    5261                            .dwattr $C$DW$T$37, DW_AT_decl_column(0x0b)
    5262                            .dwendtag $C$DW$T$37
    5263                    
    5264                    
    5265                    $C$DW$T$38      .dwtag  DW_TAG_structure_type
    5266                            .dwattr $C$DW$T$38, DW_AT_byte_size(0x01)
TI ARM Assembler PC v16.9.4 Mon Mar 05 22:10:59 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{3A1F491F-DFFA-49FC-9E98-211AB27812D8} PAGE   97

    5267                    $C$DW$466       .dwtag  DW_TAG_member
    5268                            .dwattr $C$DW$466, DW_AT_type(*$C$DW$T$19)
    5269                            .dwattr $C$DW$466, DW_AT_name("rule")
    5270                            .dwattr $C$DW$466, DW_AT_TI_symbol_name("rule")
    5271                            .dwattr $C$DW$466, DW_AT_bit_offset(0x04)
    5272                            .dwattr $C$DW$466, DW_AT_bit_size(0x04)
    5273                            .dwattr $C$DW$466, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5274                            .dwattr $C$DW$466, DW_AT_accessibility(DW_ACCESS_public)
    5275                            .dwattr $C$DW$466, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    5276                            .dwattr $C$DW$466, DW_AT_decl_line(0x235)
    5277                            .dwattr $C$DW$466, DW_AT_decl_column(0x0f)
    5278                    
    5279                    $C$DW$467       .dwtag  DW_TAG_member
    5280                            .dwattr $C$DW$467, DW_AT_type(*$C$DW$T$19)
    5281                            .dwattr $C$DW$467, DW_AT_name("nSkip")
    5282                            .dwattr $C$DW$467, DW_AT_TI_symbol_name("nSkip")
    5283                            .dwattr $C$DW$467, DW_AT_bit_offset(0x00)
    5284                            .dwattr $C$DW$467, DW_AT_bit_size(0x04)
    5285                            .dwattr $C$DW$467, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5286                            .dwattr $C$DW$467, DW_AT_accessibility(DW_ACCESS_public)
    5287                            .dwattr $C$DW$467, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    5288                            .dwattr $C$DW$467, DW_AT_decl_line(0x236)
    5289                            .dwattr $C$DW$467, DW_AT_decl_column(0x0f)
    5290                    
    5291                            .dwattr $C$DW$T$38, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/
    5292                            .dwattr $C$DW$T$38, DW_AT_decl_line(0x234)
    5293                            .dwattr $C$DW$T$38, DW_AT_decl_column(0x0b)
    5294                            .dwendtag $C$DW$T$38
    5295                    
    5296                    
    5297                    $C$DW$T$39      .dwtag  DW_TAG_structure_type
    5298                            .dwattr $C$DW$T$39, DW_AT_byte_size(0x02)
    5299                    $C$DW$468       .dwtag  DW_TAG_member
    5300                            .dwattr $C$DW$468, DW_AT_type(*$C$DW$T$27)
    5301                            .dwattr $C$DW$468, DW_AT_name("modType")
    5302                            .dwattr $C$DW$468, DW_AT_TI_symbol_name("modType")
    5303                            .dwattr $C$DW$468, DW_AT_bit_offset(0x0d)
    5304                            .dwattr $C$DW$468, DW_AT_bit_size(0x03)
    5305                            .dwattr $C$DW$468, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5306                            .dwattr $C$DW$468, DW_AT_accessibility(DW_ACCESS_public)
    5307                            .dwattr $C$DW$468, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    5308                            .dwattr $C$DW$468, DW_AT_decl_line(0x239)
    5309                            .dwattr $C$DW$468, DW_AT_decl_column(0x10)
    5310                    
    5311                    $C$DW$469       .dwtag  DW_TAG_member
    5312                            .dwattr $C$DW$469, DW_AT_type(*$C$DW$T$27)
    5313                            .dwattr $C$DW$469, DW_AT_name("deviation")
    5314                            .dwattr $C$DW$469, DW_AT_TI_symbol_name("deviation")
    5315                            .dwattr $C$DW$469, DW_AT_bit_offset(0x00)
    5316                            .dwattr $C$DW$469, DW_AT_bit_size(0x0d)
    5317                            .dwattr $C$DW$469, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5318                            .dwattr $C$DW$469, DW_AT_accessibility(DW_ACCESS_public)
    5319                            .dwattr $C$DW$469, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    5320                            .dwattr $C$DW$469, DW_AT_decl_line(0x23c)
    5321                            .dwattr $C$DW$469, DW_AT_decl_column(0x10)
TI ARM Assembler PC v16.9.4 Mon Mar 05 22:10:59 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{3A1F491F-DFFA-49FC-9E98-211AB27812D8} PAGE   98

    5322                    
    5323                            .dwattr $C$DW$T$39, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/
    5324                            .dwattr $C$DW$T$39, DW_AT_decl_line(0x238)
    5325                            .dwattr $C$DW$T$39, DW_AT_decl_column(0x0b)
    5326                            .dwendtag $C$DW$T$39
    5327                    
    5328                    
    5329                    $C$DW$T$40      .dwtag  DW_TAG_structure_type
    5330                            .dwattr $C$DW$T$40, DW_AT_byte_size(0x04)
    5331                    $C$DW$470       .dwtag  DW_TAG_member
    5332                            .dwattr $C$DW$470, DW_AT_type(*$C$DW$T$32)
    5333                            .dwattr $C$DW$470, DW_AT_name("preScale")
    5334                            .dwattr $C$DW$470, DW_AT_TI_symbol_name("preScale")
    5335                            .dwattr $C$DW$470, DW_AT_bit_offset(0x1c)
    5336                            .dwattr $C$DW$470, DW_AT_bit_size(0x04)
    5337                            .dwattr $C$DW$470, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5338                            .dwattr $C$DW$470, DW_AT_accessibility(DW_ACCESS_public)
    5339                            .dwattr $C$DW$470, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    5340                            .dwattr $C$DW$470, DW_AT_decl_line(0x23f)
    5341                            .dwattr $C$DW$470, DW_AT_decl_column(0x10)
    5342                    
    5343                    $C$DW$471       .dwtag  DW_TAG_member
    5344                            .dwattr $C$DW$471, DW_AT_type(*$C$DW$T$32)
    5345                            .dwattr $C$DW$471, DW_AT_name("rateWord")
    5346                            .dwattr $C$DW$471, DW_AT_TI_symbol_name("rateWord")
    5347                            .dwattr $C$DW$471, DW_AT_bit_offset(0x03)
    5348                            .dwattr $C$DW$471, DW_AT_bit_size(0x15)
    5349                            .dwattr $C$DW$471, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5350                            .dwattr $C$DW$471, DW_AT_accessibility(DW_ACCESS_public)
    5351                            .dwattr $C$DW$471, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    5352                            .dwattr $C$DW$471, DW_AT_decl_line(0x241)
    5353                            .dwattr $C$DW$471, DW_AT_decl_column(0x10)
    5354                    
    5355                    $C$DW$472       .dwtag  DW_TAG_member
    5356                            .dwattr $C$DW$472, DW_AT_type(*$C$DW$T$32)
    5357                            .dwattr $C$DW$472, DW_AT_name("decimMode")
    5358                            .dwattr $C$DW$472, DW_AT_TI_symbol_name("decimMode")
    5359                            .dwattr $C$DW$472, DW_AT_bit_offset(0x00)
    5360                            .dwattr $C$DW$472, DW_AT_bit_size(0x03)
    5361                            .dwattr $C$DW$472, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5362                            .dwattr $C$DW$472, DW_AT_accessibility(DW_ACCESS_public)
    5363                            .dwattr $C$DW$472, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    5364                            .dwattr $C$DW$472, DW_AT_decl_line(0x242)
    5365                            .dwattr $C$DW$472, DW_AT_decl_column(0x10)
    5366                    
    5367                            .dwattr $C$DW$T$40, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/
    5368                            .dwattr $C$DW$T$40, DW_AT_decl_line(0x23e)
    5369                            .dwattr $C$DW$T$40, DW_AT_decl_column(0x0b)
    5370                            .dwendtag $C$DW$T$40
    5371                    
    5372                    
    5373                    $C$DW$T$41      .dwtag  DW_TAG_structure_type
    5374                            .dwattr $C$DW$T$41, DW_AT_byte_size(0x01)
    5375                    $C$DW$473       .dwtag  DW_TAG_member
    5376                            .dwattr $C$DW$473, DW_AT_type(*$C$DW$T$19)
TI ARM Assembler PC v16.9.4 Mon Mar 05 22:10:59 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{3A1F491F-DFFA-49FC-9E98-211AB27812D8} PAGE   99

    5377                            .dwattr $C$DW$473, DW_AT_name("nPreamBytes")
    5378                            .dwattr $C$DW$473, DW_AT_TI_symbol_name("nPreamBytes")
    5379                            .dwattr $C$DW$473, DW_AT_bit_offset(0x02)
    5380                            .dwattr $C$DW$473, DW_AT_bit_size(0x06)
    5381                            .dwattr $C$DW$473, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5382                            .dwattr $C$DW$473, DW_AT_accessibility(DW_ACCESS_public)
    5383                            .dwattr $C$DW$473, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    5384                            .dwattr $C$DW$473, DW_AT_decl_line(0x24a)
    5385                            .dwattr $C$DW$473, DW_AT_decl_column(0x0f)
    5386                    
    5387                    $C$DW$474       .dwtag  DW_TAG_member
    5388                            .dwattr $C$DW$474, DW_AT_type(*$C$DW$T$19)
    5389                            .dwattr $C$DW$474, DW_AT_name("preamMode")
    5390                            .dwattr $C$DW$474, DW_AT_TI_symbol_name("preamMode")
    5391                            .dwattr $C$DW$474, DW_AT_bit_offset(0x00)
    5392                            .dwattr $C$DW$474, DW_AT_bit_size(0x02)
    5393                            .dwattr $C$DW$474, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5394                            .dwattr $C$DW$474, DW_AT_accessibility(DW_ACCESS_public)
    5395                            .dwattr $C$DW$474, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    5396                            .dwattr $C$DW$474, DW_AT_decl_line(0x250)
    5397                            .dwattr $C$DW$474, DW_AT_decl_column(0x0f)
    5398                    
    5399                            .dwattr $C$DW$T$41, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/
    5400                            .dwattr $C$DW$T$41, DW_AT_decl_line(0x249)
    5401                            .dwattr $C$DW$T$41, DW_AT_decl_column(0x0b)
    5402                            .dwendtag $C$DW$T$41
    5403                    
    5404                    
    5405                    $C$DW$T$42      .dwtag  DW_TAG_structure_type
    5406                            .dwattr $C$DW$T$42, DW_AT_byte_size(0x02)
    5407                    $C$DW$475       .dwtag  DW_TAG_member
    5408                            .dwattr $C$DW$475, DW_AT_type(*$C$DW$T$27)
    5409                            .dwattr $C$DW$475, DW_AT_name("nSwBits")
    5410                            .dwattr $C$DW$475, DW_AT_TI_symbol_name("nSwBits")
    5411                            .dwattr $C$DW$475, DW_AT_bit_offset(0x0a)
    5412                            .dwattr $C$DW$475, DW_AT_bit_size(0x06)
    5413                            .dwattr $C$DW$475, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5414                            .dwattr $C$DW$475, DW_AT_accessibility(DW_ACCESS_public)
    5415                            .dwattr $C$DW$475, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    5416                            .dwattr $C$DW$475, DW_AT_decl_line(0x256)
    5417                            .dwattr $C$DW$475, DW_AT_decl_column(0x10)
    5418                    
    5419                    $C$DW$476       .dwtag  DW_TAG_member
    5420                            .dwattr $C$DW$476, DW_AT_type(*$C$DW$T$27)
    5421                            .dwattr $C$DW$476, DW_AT_name("bBitReversal")
    5422                            .dwattr $C$DW$476, DW_AT_TI_symbol_name("bBitReversal")
    5423                            .dwattr $C$DW$476, DW_AT_bit_offset(0x09)
    5424                            .dwattr $C$DW$476, DW_AT_bit_size(0x01)
    5425                            .dwattr $C$DW$476, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5426                            .dwattr $C$DW$476, DW_AT_accessibility(DW_ACCESS_public)
    5427                            .dwattr $C$DW$476, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    5428                            .dwattr $C$DW$476, DW_AT_decl_line(0x257)
    5429                            .dwattr $C$DW$476, DW_AT_decl_column(0x10)
    5430                    
    5431                    $C$DW$477       .dwtag  DW_TAG_member
TI ARM Assembler PC v16.9.4 Mon Mar 05 22:10:59 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{3A1F491F-DFFA-49FC-9E98-211AB27812D8} PAGE  100

    5432                            .dwattr $C$DW$477, DW_AT_type(*$C$DW$T$27)
    5433                            .dwattr $C$DW$477, DW_AT_name("bMsbFirst")
    5434                            .dwattr $C$DW$477, DW_AT_TI_symbol_name("bMsbFirst")
    5435                            .dwattr $C$DW$477, DW_AT_bit_offset(0x08)
    5436                            .dwattr $C$DW$477, DW_AT_bit_size(0x01)
    5437                            .dwattr $C$DW$477, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5438                            .dwattr $C$DW$477, DW_AT_accessibility(DW_ACCESS_public)
    5439                            .dwattr $C$DW$477, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    5440                            .dwattr $C$DW$477, DW_AT_decl_line(0x259)
    5441                            .dwattr $C$DW$477, DW_AT_decl_column(0x10)
    5442                    
    5443                    $C$DW$478       .dwtag  DW_TAG_member
    5444                            .dwattr $C$DW$478, DW_AT_type(*$C$DW$T$27)
    5445                            .dwattr $C$DW$478, DW_AT_name("fecMode")
    5446                            .dwattr $C$DW$478, DW_AT_TI_symbol_name("fecMode")
    5447                            .dwattr $C$DW$478, DW_AT_bit_offset(0x04)
    5448                            .dwattr $C$DW$478, DW_AT_bit_size(0x04)
    5449                            .dwattr $C$DW$478, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5450                            .dwattr $C$DW$478, DW_AT_accessibility(DW_ACCESS_public)
    5451                            .dwattr $C$DW$478, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    5452                            .dwattr $C$DW$478, DW_AT_decl_line(0x25b)
    5453                            .dwattr $C$DW$478, DW_AT_decl_column(0x10)
    5454                    
    5455                    $C$DW$479       .dwtag  DW_TAG_member
    5456                            .dwattr $C$DW$479, DW_AT_type(*$C$DW$T$27)
    5457                            .dwattr $C$DW$479, DW_AT_name("whitenMode")
    5458                            .dwattr $C$DW$479, DW_AT_TI_symbol_name("whitenMode")
    5459                            .dwattr $C$DW$479, DW_AT_bit_offset(0x00)
    5460                            .dwattr $C$DW$479, DW_AT_bit_size(0x03)
    5461                            .dwattr $C$DW$479, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5462                            .dwattr $C$DW$479, DW_AT_accessibility(DW_ACCESS_public)
    5463                            .dwattr $C$DW$479, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    5464                            .dwattr $C$DW$479, DW_AT_decl_line(0x261)
    5465                            .dwattr $C$DW$479, DW_AT_decl_column(0x10)
    5466                    
    5467                            .dwattr $C$DW$T$42, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/
    5468                            .dwattr $C$DW$T$42, DW_AT_decl_line(0x255)
    5469                            .dwattr $C$DW$T$42, DW_AT_decl_column(0x0b)
    5470                            .dwendtag $C$DW$T$42
    5471                    
    5472                    
    5473                    $C$DW$T$43      .dwtag  DW_TAG_structure_type
    5474                            .dwattr $C$DW$T$43, DW_AT_byte_size(0x02)
    5475                    $C$DW$480       .dwtag  DW_TAG_member
    5476                            .dwattr $C$DW$480, DW_AT_type(*$C$DW$T$27)
    5477                            .dwattr $C$DW$480, DW_AT_name("frontEndMode")
    5478                            .dwattr $C$DW$480, DW_AT_TI_symbol_name("frontEndMode")
    5479                            .dwattr $C$DW$480, DW_AT_bit_offset(0x0d)
    5480                            .dwattr $C$DW$480, DW_AT_bit_size(0x03)
    5481                            .dwattr $C$DW$480, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5482                            .dwattr $C$DW$480, DW_AT_accessibility(DW_ACCESS_public)
    5483                            .dwattr $C$DW$480, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    5484                            .dwattr $C$DW$480, DW_AT_decl_line(0x26b)
    5485                            .dwattr $C$DW$480, DW_AT_decl_column(0x10)
    5486                    
TI ARM Assembler PC v16.9.4 Mon Mar 05 22:10:59 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{3A1F491F-DFFA-49FC-9E98-211AB27812D8} PAGE  101

    5487                    $C$DW$481       .dwtag  DW_TAG_member
    5488                            .dwattr $C$DW$481, DW_AT_type(*$C$DW$T$27)
    5489                            .dwattr $C$DW$481, DW_AT_name("biasMode")
    5490                            .dwattr $C$DW$481, DW_AT_TI_symbol_name("biasMode")
    5491                            .dwattr $C$DW$481, DW_AT_bit_offset(0x0c)
    5492                            .dwattr $C$DW$481, DW_AT_bit_size(0x01)
    5493                            .dwattr $C$DW$481, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5494                            .dwattr $C$DW$481, DW_AT_accessibility(DW_ACCESS_public)
    5495                            .dwattr $C$DW$481, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    5496                            .dwattr $C$DW$481, DW_AT_decl_line(0x271)
    5497                            .dwattr $C$DW$481, DW_AT_decl_column(0x10)
    5498                    
    5499                    $C$DW$482       .dwtag  DW_TAG_member
    5500                            .dwattr $C$DW$482, DW_AT_type(*$C$DW$T$27)
    5501                            .dwattr $C$DW$482, DW_AT_name("analogCfgMode")
    5502                            .dwattr $C$DW$482, DW_AT_TI_symbol_name("analogCfgMode")
    5503                            .dwattr $C$DW$482, DW_AT_bit_offset(0x06)
    5504                            .dwattr $C$DW$482, DW_AT_bit_size(0x06)
    5505                            .dwattr $C$DW$482, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5506                            .dwattr $C$DW$482, DW_AT_accessibility(DW_ACCESS_public)
    5507                            .dwattr $C$DW$482, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    5508                            .dwattr $C$DW$482, DW_AT_decl_line(0x273)
    5509                            .dwattr $C$DW$482, DW_AT_decl_column(0x10)
    5510                    
    5511                    $C$DW$483       .dwtag  DW_TAG_member
    5512                            .dwattr $C$DW$483, DW_AT_type(*$C$DW$T$27)
    5513                            .dwattr $C$DW$483, DW_AT_name("bNoFsPowerUp")
    5514                            .dwattr $C$DW$483, DW_AT_TI_symbol_name("bNoFsPowerUp")
    5515                            .dwattr $C$DW$483, DW_AT_bit_offset(0x05)
    5516                            .dwattr $C$DW$483, DW_AT_bit_size(0x01)
    5517                            .dwattr $C$DW$483, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5518                            .dwattr $C$DW$483, DW_AT_accessibility(DW_ACCESS_public)
    5519                            .dwattr $C$DW$483, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    5520                            .dwattr $C$DW$483, DW_AT_decl_line(0x27a)
    5521                            .dwattr $C$DW$483, DW_AT_decl_column(0x10)
    5522                    
    5523                            .dwattr $C$DW$T$43, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/
    5524                            .dwattr $C$DW$T$43, DW_AT_decl_line(0x26a)
    5525                            .dwattr $C$DW$T$43, DW_AT_decl_column(0x0b)
    5526                            .dwendtag $C$DW$T$43
    5527                    
    5528                    
    5529                    $C$DW$T$50      .dwtag  DW_TAG_structure_type
    5530                            .dwattr $C$DW$T$50, DW_AT_byte_size(0x24)
    5531                    $C$DW$484       .dwtag  DW_TAG_member
    5532                            .dwattr $C$DW$484, DW_AT_type(*$C$DW$T$32)
    5533                            .dwattr $C$DW$484, DW_AT_name("nInactivityTimeout")
    5534                            .dwattr $C$DW$484, DW_AT_TI_symbol_name("nInactivityTimeout")
    5535                            .dwattr $C$DW$484, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5536                            .dwattr $C$DW$484, DW_AT_accessibility(DW_ACCESS_public)
    5537                            .dwattr $C$DW$484, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/r
    5538                            .dwattr $C$DW$484, DW_AT_decl_line(0x381)
    5539                            .dwattr $C$DW$484, DW_AT_decl_column(0x1d)
    5540                    
    5541                    $C$DW$485       .dwtag  DW_TAG_member
TI ARM Assembler PC v16.9.4 Mon Mar 05 22:10:59 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{3A1F491F-DFFA-49FC-9E98-211AB27812D8} PAGE  102

    5542                            .dwattr $C$DW$485, DW_AT_type(*$C$DW$T$45)
    5543                            .dwattr $C$DW$485, DW_AT_name("pRfMode")
    5544                            .dwattr $C$DW$485, DW_AT_TI_symbol_name("pRfMode")
    5545                            .dwattr $C$DW$485, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5546                            .dwattr $C$DW$485, DW_AT_accessibility(DW_ACCESS_public)
    5547                            .dwattr $C$DW$485, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/r
    5548                            .dwattr $C$DW$485, DW_AT_decl_line(0x382)
    5549                            .dwattr $C$DW$485, DW_AT_decl_column(0x1d)
    5550                    
    5551                    $C$DW$486       .dwtag  DW_TAG_member
    5552                            .dwattr $C$DW$486, DW_AT_type(*$C$DW$T$47)
    5553                            .dwattr $C$DW$486, DW_AT_name("pOpSetup")
    5554                            .dwattr $C$DW$486, DW_AT_TI_symbol_name("pOpSetup")
    5555                            .dwattr $C$DW$486, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5556                            .dwattr $C$DW$486, DW_AT_accessibility(DW_ACCESS_public)
    5557                            .dwattr $C$DW$486, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/r
    5558                            .dwattr $C$DW$486, DW_AT_decl_line(0x383)
    5559                            .dwattr $C$DW$486, DW_AT_decl_column(0x1d)
    5560                    
    5561                    $C$DW$487       .dwtag  DW_TAG_member
    5562                            .dwattr $C$DW$487, DW_AT_type(*$C$DW$T$32)
    5563                            .dwattr $C$DW$487, DW_AT_name("nPowerUpDuration")
    5564                            .dwattr $C$DW$487, DW_AT_TI_symbol_name("nPowerUpDuration")
    5565                            .dwattr $C$DW$487, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5566                            .dwattr $C$DW$487, DW_AT_accessibility(DW_ACCESS_public)
    5567                            .dwattr $C$DW$487, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/r
    5568                            .dwattr $C$DW$487, DW_AT_decl_line(0x384)
    5569                            .dwattr $C$DW$487, DW_AT_decl_column(0x1d)
    5570                    
    5571                    $C$DW$488       .dwtag  DW_TAG_member
    5572                            .dwattr $C$DW$488, DW_AT_type(*$C$DW$T$48)
    5573                            .dwattr $C$DW$488, DW_AT_name("bPowerUpXOSC")
    5574                            .dwattr $C$DW$488, DW_AT_TI_symbol_name("bPowerUpXOSC")
    5575                            .dwattr $C$DW$488, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5576                            .dwattr $C$DW$488, DW_AT_accessibility(DW_ACCESS_public)
    5577                            .dwattr $C$DW$488, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/r
    5578                            .dwattr $C$DW$488, DW_AT_decl_line(0x385)
    5579                            .dwattr $C$DW$488, DW_AT_decl_column(0x1d)
    5580                    
    5581                    $C$DW$489       .dwtag  DW_TAG_member
    5582                            .dwattr $C$DW$489, DW_AT_type(*$C$DW$T$48)
    5583                            .dwattr $C$DW$489, DW_AT_name("bUpdateSetup")
    5584                            .dwattr $C$DW$489, DW_AT_TI_symbol_name("bUpdateSetup")
    5585                            .dwattr $C$DW$489, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    5586                            .dwattr $C$DW$489, DW_AT_accessibility(DW_ACCESS_public)
    5587                            .dwattr $C$DW$489, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/r
    5588                            .dwattr $C$DW$489, DW_AT_decl_line(0x386)
    5589                            .dwattr $C$DW$489, DW_AT_decl_column(0x1d)
    5590                    
    5591                    $C$DW$490       .dwtag  DW_TAG_member
    5592                            .dwattr $C$DW$490, DW_AT_type(*$C$DW$T$27)
    5593                            .dwattr $C$DW$490, DW_AT_name("nPowerUpDurationMargin")
    5594                            .dwattr $C$DW$490, DW_AT_TI_symbol_name("nPowerUpDurationMargin")
    5595                            .dwattr $C$DW$490, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    5596                            .dwattr $C$DW$490, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v16.9.4 Mon Mar 05 22:10:59 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{3A1F491F-DFFA-49FC-9E98-211AB27812D8} PAGE  103

    5597                            .dwattr $C$DW$490, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/r
    5598                            .dwattr $C$DW$490, DW_AT_decl_line(0x387)
    5599                            .dwattr $C$DW$490, DW_AT_decl_column(0x1d)
    5600                    
    5601                    $C$DW$491       .dwtag  DW_TAG_member
    5602                            .dwattr $C$DW$491, DW_AT_type(*$C$DW$T$3)
    5603                            .dwattr $C$DW$491, DW_AT_name("pPowerCb")
    5604                            .dwattr $C$DW$491, DW_AT_TI_symbol_name("pPowerCb")
    5605                            .dwattr $C$DW$491, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    5606                            .dwattr $C$DW$491, DW_AT_accessibility(DW_ACCESS_public)
    5607                            .dwattr $C$DW$491, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/r
    5608                            .dwattr $C$DW$491, DW_AT_decl_line(0x388)
    5609                            .dwattr $C$DW$491, DW_AT_decl_column(0x1d)
    5610                    
    5611                    $C$DW$492       .dwtag  DW_TAG_member
    5612                            .dwattr $C$DW$492, DW_AT_type(*$C$DW$T$3)
    5613                            .dwattr $C$DW$492, DW_AT_name("pErrCb")
    5614                            .dwattr $C$DW$492, DW_AT_TI_symbol_name("pErrCb")
    5615                            .dwattr $C$DW$492, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    5616                            .dwattr $C$DW$492, DW_AT_accessibility(DW_ACCESS_public)
    5617                            .dwattr $C$DW$492, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/r
    5618                            .dwattr $C$DW$492, DW_AT_decl_line(0x389)
    5619                            .dwattr $C$DW$492, DW_AT_decl_column(0x1d)
    5620                    
    5621                    $C$DW$493       .dwtag  DW_TAG_member
    5622                            .dwattr $C$DW$493, DW_AT_type(*$C$DW$T$3)
    5623                            .dwattr $C$DW$493, DW_AT_name("pClientEventCb")
    5624                            .dwattr $C$DW$493, DW_AT_TI_symbol_name("pClientEventCb")
    5625                            .dwattr $C$DW$493, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    5626                            .dwattr $C$DW$493, DW_AT_accessibility(DW_ACCESS_public)
    5627                            .dwattr $C$DW$493, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/r
    5628                            .dwattr $C$DW$493, DW_AT_decl_line(0x38a)
    5629                            .dwattr $C$DW$493, DW_AT_decl_column(0x1d)
    5630                    
    5631                    $C$DW$494       .dwtag  DW_TAG_member
    5632                            .dwattr $C$DW$494, DW_AT_type(*$C$DW$T$49)
    5633                            .dwattr $C$DW$494, DW_AT_name("nClientEventMask")
    5634                            .dwattr $C$DW$494, DW_AT_TI_symbol_name("nClientEventMask")
    5635                            .dwattr $C$DW$494, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    5636                            .dwattr $C$DW$494, DW_AT_accessibility(DW_ACCESS_public)
    5637                            .dwattr $C$DW$494, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/r
    5638                            .dwattr $C$DW$494, DW_AT_decl_line(0x38b)
    5639                            .dwattr $C$DW$494, DW_AT_decl_column(0x1d)
    5640                    
    5641                            .dwattr $C$DW$T$50, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/
    5642                            .dwattr $C$DW$T$50, DW_AT_decl_line(0x380)
    5643                            .dwattr $C$DW$T$50, DW_AT_decl_column(0x0c)
    5644                            .dwendtag $C$DW$T$50
    5645                    
    5646                    
    5647                    $C$DW$T$51      .dwtag  DW_TAG_structure_type
    5648                            .dwattr $C$DW$T$51, DW_AT_byte_size(0x01)
    5649                    $C$DW$495       .dwtag  DW_TAG_member
    5650                            .dwattr $C$DW$495, DW_AT_type(*$C$DW$T$19)
    5651                            .dwattr $C$DW$495, DW_AT_name("triggerType")
TI ARM Assembler PC v16.9.4 Mon Mar 05 22:10:59 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{3A1F491F-DFFA-49FC-9E98-211AB27812D8} PAGE  104

    5652                            .dwattr $C$DW$495, DW_AT_TI_symbol_name("triggerType")
    5653                            .dwattr $C$DW$495, DW_AT_bit_offset(0x04)
    5654                            .dwattr $C$DW$495, DW_AT_bit_size(0x04)
    5655                            .dwattr $C$DW$495, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5656                            .dwattr $C$DW$495, DW_AT_accessibility(DW_ACCESS_public)
    5657                            .dwattr $C$DW$495, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    5658                            .dwattr $C$DW$495, DW_AT_decl_line(0xe8)
    5659                            .dwattr $C$DW$495, DW_AT_decl_column(0x0f)
    5660                    
    5661                    $C$DW$496       .dwtag  DW_TAG_member
    5662                            .dwattr $C$DW$496, DW_AT_type(*$C$DW$T$19)
    5663                            .dwattr $C$DW$496, DW_AT_name("bEnaCmd")
    5664                            .dwattr $C$DW$496, DW_AT_TI_symbol_name("bEnaCmd")
    5665                            .dwattr $C$DW$496, DW_AT_bit_offset(0x03)
    5666                            .dwattr $C$DW$496, DW_AT_bit_size(0x01)
    5667                            .dwattr $C$DW$496, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5668                            .dwattr $C$DW$496, DW_AT_accessibility(DW_ACCESS_public)
    5669                            .dwattr $C$DW$496, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    5670                            .dwattr $C$DW$496, DW_AT_decl_line(0xe9)
    5671                            .dwattr $C$DW$496, DW_AT_decl_column(0x0f)
    5672                    
    5673                    $C$DW$497       .dwtag  DW_TAG_member
    5674                            .dwattr $C$DW$497, DW_AT_type(*$C$DW$T$19)
    5675                            .dwattr $C$DW$497, DW_AT_name("triggerNo")
    5676                            .dwattr $C$DW$497, DW_AT_TI_symbol_name("triggerNo")
    5677                            .dwattr $C$DW$497, DW_AT_bit_offset(0x01)
    5678                            .dwattr $C$DW$497, DW_AT_bit_size(0x02)
    5679                            .dwattr $C$DW$497, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5680                            .dwattr $C$DW$497, DW_AT_accessibility(DW_ACCESS_public)
    5681                            .dwattr $C$DW$497, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    5682                            .dwattr $C$DW$497, DW_AT_decl_line(0xeb)
    5683                            .dwattr $C$DW$497, DW_AT_decl_column(0x0f)
    5684                    
    5685                    $C$DW$498       .dwtag  DW_TAG_member
    5686                            .dwattr $C$DW$498, DW_AT_type(*$C$DW$T$19)
    5687                            .dwattr $C$DW$498, DW_AT_name("pastTrig")
    5688                            .dwattr $C$DW$498, DW_AT_TI_symbol_name("pastTrig")
    5689                            .dwattr $C$DW$498, DW_AT_bit_offset(0x00)
    5690                            .dwattr $C$DW$498, DW_AT_bit_size(0x01)
    5691                            .dwattr $C$DW$498, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5692                            .dwattr $C$DW$498, DW_AT_accessibility(DW_ACCESS_public)
    5693                            .dwattr $C$DW$498, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    5694                            .dwattr $C$DW$498, DW_AT_decl_line(0xec)
    5695                            .dwattr $C$DW$498, DW_AT_decl_column(0x0f)
    5696                    
    5697                            .dwattr $C$DW$T$51, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/
    5698                            .dwattr $C$DW$T$51, DW_AT_decl_line(0xe7)
    5699                            .dwattr $C$DW$T$51, DW_AT_decl_column(0x0b)
    5700                            .dwendtag $C$DW$T$51
    5701                    
    5702                    
    5703                    $C$DW$T$52      .dwtag  DW_TAG_structure_type
    5704                            .dwattr $C$DW$T$52, DW_AT_byte_size(0x01)
    5705                    $C$DW$499       .dwtag  DW_TAG_member
    5706                            .dwattr $C$DW$499, DW_AT_type(*$C$DW$T$19)
TI ARM Assembler PC v16.9.4 Mon Mar 05 22:10:59 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
