TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:30 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{44D418E8-2356-4786-AA21-8FD71E70A7F7} PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                        PC v16.9.4.LTS *
       3                    ;* Date/Time created: Sat Nov 18 18:46:29 2017                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../Application/MAC/StartUp/macstack.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v16.9.4.LTS Copyright (c) 1996-20
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Kevin\workspace_v7\sensor_cc1310lp\sensor_cc1310lp"
      13                    
      14                    $C$DW$1 .dwtag  DW_TAG_subprogram

    5240                            .dwattr $C$DW$530, DW_AT_name("MAC_FH_SET_REQ")
    5241                            .dwattr $C$DW$530, DW_AT_const_value(0xf4)
    5242                            .dwattr $C$DW$530, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    5243                            .dwattr $C$DW$530, DW_AT_decl_line(0x5e)
    5244                            .dwattr $C$DW$530, DW_AT_decl_column(0x03)
    5245                    
    5246                    $C$DW$531       .dwtag  DW_TAG_enumerator
    5247                            .dwattr $C$DW$531, DW_AT_name("MAC_FH_GET_REQ")
    5248                            .dwattr $C$DW$531, DW_AT_const_value(0xf5)
    5249                            .dwattr $C$DW$531, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    5250                            .dwattr $C$DW$531, DW_AT_decl_line(0x5f)
    5251                            .dwattr $C$DW$531, DW_AT_decl_column(0x03)
    5252                    
    5253                    $C$DW$532       .dwtag  DW_TAG_enumerator
    5254                            .dwattr $C$DW$532, DW_AT_name("MAC_MLME_WS_ASYNC_REQ")
    5255                            .dwattr $C$DW$532, DW_AT_const_value(0xf6)
    5256                            .dwattr $C$DW$532, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    5257                            .dwattr $C$DW$532, DW_AT_decl_line(0x60)
    5258                            .dwattr $C$DW$532, DW_AT_decl_column(0x03)
    5259                    
    5260                    $C$DW$533       .dwtag  DW_TAG_enumerator
    5261                            .dwattr $C$DW$533, DW_AT_name("MAC_SEC_ADD_DEVICE")
    5262                            .dwattr $C$DW$533, DW_AT_const_value(0xf7)
    5263                            .dwattr $C$DW$533, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    5264                            .dwattr $C$DW$533, DW_AT_decl_line(0x61)
    5265                            .dwattr $C$DW$533, DW_AT_decl_column(0x03)
    5266                    
    5267                    $C$DW$534       .dwtag  DW_TAG_enumerator
    5268                            .dwattr $C$DW$534, DW_AT_name("MAC_SEC_DEL_DEVICE")
    5269                            .dwattr $C$DW$534, DW_AT_const_value(0xf8)
    5270                            .dwattr $C$DW$534, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    5271                            .dwattr $C$DW$534, DW_AT_decl_line(0x62)
    5272                            .dwattr $C$DW$534, DW_AT_decl_column(0x03)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:30 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{44D418E8-2356-4786-AA21-8FD71E70A7F7} PAGE   97

    5273                    
    5274                    $C$DW$535       .dwtag  DW_TAG_enumerator
    5275                            .dwattr $C$DW$535, DW_AT_name("MAC_SEC_DEL_KEY_AND_DEVICES")
    5276                            .dwattr $C$DW$535, DW_AT_const_value(0xf9)
    5277                            .dwattr $C$DW$535, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    5278                            .dwattr $C$DW$535, DW_AT_decl_line(0x63)
    5279                            .dwattr $C$DW$535, DW_AT_decl_column(0x03)
    5280                    
    5281                    $C$DW$536       .dwtag  DW_TAG_enumerator
    5282                            .dwattr $C$DW$536, DW_AT_name("MAC_SEC_DEL_ALL_DEVICES")
    5283                            .dwattr $C$DW$536, DW_AT_const_value(0xfa)
    5284                            .dwattr $C$DW$536, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    5285                            .dwattr $C$DW$536, DW_AT_decl_line(0x64)
    5286                            .dwattr $C$DW$536, DW_AT_decl_column(0x03)
    5287                    
    5288                    $C$DW$537       .dwtag  DW_TAG_enumerator
    5289                            .dwattr $C$DW$537, DW_AT_name("MAC_SEC_GET_DEFAULT_SOURCE_KEY")
    5290                            .dwattr $C$DW$537, DW_AT_const_value(0xfb)
    5291                            .dwattr $C$DW$537, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    5292                            .dwattr $C$DW$537, DW_AT_decl_line(0x65)
    5293                            .dwattr $C$DW$537, DW_AT_decl_column(0x03)
    5294                    
    5295                    $C$DW$538       .dwtag  DW_TAG_enumerator
    5296                            .dwattr $C$DW$538, DW_AT_name("MAC_SEC_ADD_KEY_INIT_FC")
    5297                            .dwattr $C$DW$538, DW_AT_const_value(0xfc)
    5298                            .dwattr $C$DW$538, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    5299                            .dwattr $C$DW$538, DW_AT_decl_line(0x66)
    5300                            .dwattr $C$DW$538, DW_AT_decl_column(0x03)
    5301                    
    5302                            .dwattr $C$DW$T$747, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154st
    5303                            .dwattr $C$DW$T$747, DW_AT_decl_line(0x39)
    5304                            .dwattr $C$DW$T$747, DW_AT_decl_column(0x01)
    5305                            .dwendtag $C$DW$T$747
    5306                    
    5307                    
    5308                    $C$DW$T$20      .dwtag  DW_TAG_structure_type
    5309                            .dwattr $C$DW$T$20, DW_AT_byte_size(0x02)
    5310                    $C$DW$539       .dwtag  DW_TAG_member
    5311                            .dwattr $C$DW$539, DW_AT_type(*$C$DW$T$19)
    5312                            .dwattr $C$DW$539, DW_AT_name("event")
    5313                            .dwattr $C$DW$539, DW_AT_TI_symbol_name("event")
    5314                            .dwattr $C$DW$539, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5315                            .dwattr $C$DW$539, DW_AT_accessibility(DW_ACCESS_public)
    5316                            .dwattr $C$DW$539, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    5317                            .dwattr $C$DW$539, DW_AT_decl_line(0x2a6)
    5318                            .dwattr $C$DW$539, DW_AT_decl_column(0x0b)
    5319                    
    5320                    $C$DW$540       .dwtag  DW_TAG_member
    5321                            .dwattr $C$DW$540, DW_AT_type(*$C$DW$T$19)
    5322                            .dwattr $C$DW$540, DW_AT_name("status")
    5323                            .dwattr $C$DW$540, DW_AT_TI_symbol_name("status")
    5324                            .dwattr $C$DW$540, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5325                            .dwattr $C$DW$540, DW_AT_accessibility(DW_ACCESS_public)
    5326                            .dwattr $C$DW$540, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    5327                            .dwattr $C$DW$540, DW_AT_decl_line(0x2a7)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:30 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{44D418E8-2356-4786-AA21-8FD71E70A7F7} PAGE   98

    5328                            .dwattr $C$DW$540, DW_AT_decl_column(0x0b)
    5329                    
    5330                            .dwattr $C$DW$T$20, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/M
    5331                            .dwattr $C$DW$T$20, DW_AT_decl_line(0x2a5)
    5332                            .dwattr $C$DW$T$20, DW_AT_decl_column(0x01)
    5333                            .dwendtag $C$DW$T$20
    5334                    
    5335                    $C$DW$T$34      .dwtag  DW_TAG_typedef
    5336                            .dwattr $C$DW$T$34, DW_AT_name("macEventHdr_t")
    5337                            .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$20)
    5338                            .dwattr $C$DW$T$34, DW_AT_language(DW_LANG_C)
    5339                            .dwattr $C$DW$T$34, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/M
    5340                            .dwattr $C$DW$T$34, DW_AT_decl_line(0x2a8)
    5341                            .dwattr $C$DW$T$34, DW_AT_decl_column(0x03)
    5342                    
    5343                    
    5344                    $C$DW$T$23      .dwtag  DW_TAG_structure_type
    5345                            .dwattr $C$DW$T$23, DW_AT_byte_size(0x0a)
    5346                    $C$DW$541       .dwtag  DW_TAG_member
    5347                            .dwattr $C$DW$541, DW_AT_type(*$C$DW$T$265)
    5348                            .dwattr $C$DW$541, DW_AT_name("addr")
    5349                            .dwattr $C$DW$541, DW_AT_TI_symbol_name("addr")
    5350                            .dwattr $C$DW$541, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5351                            .dwattr $C$DW$541, DW_AT_accessibility(DW_ACCESS_public)
    5352                            .dwattr $C$DW$541, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/ap
    5353                            .dwattr $C$DW$541, DW_AT_decl_line(0x4a7)
    5354                            .dwattr $C$DW$541, DW_AT_decl_column(0x07)
    5355                    
    5356                    $C$DW$542       .dwtag  DW_TAG_member
    5357                            .dwattr $C$DW$542, DW_AT_type(*$C$DW$T$22)
    5358                            .dwattr $C$DW$542, DW_AT_name("addrMode")
    5359                            .dwattr $C$DW$542, DW_AT_TI_symbol_name("addrMode")
    5360                            .dwattr $C$DW$542, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5361                            .dwattr $C$DW$542, DW_AT_accessibility(DW_ACCESS_public)
    5362                            .dwattr $C$DW$542, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/ap
    5363                            .dwattr $C$DW$542, DW_AT_decl_line(0x4aa)
    5364                            .dwattr $C$DW$542, DW_AT_decl_column(0x17)
    5365                    
    5366                            .dwattr $C$DW$T$23, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/a
    5367                            .dwattr $C$DW$T$23, DW_AT_decl_line(0x49c)
    5368                            .dwattr $C$DW$T$23, DW_AT_decl_column(0x01)
    5369                            .dwendtag $C$DW$T$23
    5370                    
    5371                    $C$DW$T$463     .dwtag  DW_TAG_typedef
    5372                            .dwattr $C$DW$T$463, DW_AT_name("ApiMac_sAddr_t")
    5373                            .dwattr $C$DW$T$463, DW_AT_type(*$C$DW$T$23)
    5374                            .dwattr $C$DW$T$463, DW_AT_language(DW_LANG_C)
    5375                            .dwattr $C$DW$T$463, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/
    5376                            .dwattr $C$DW$T$463, DW_AT_decl_line(0x4ab)
    5377                            .dwattr $C$DW$T$463, DW_AT_decl_column(0x03)
    5378                    
    5379                    
    5380                    $C$DW$T$24      .dwtag  DW_TAG_structure_type
    5381                            .dwattr $C$DW$T$24, DW_AT_byte_size(0x0a)
    5382                    $C$DW$543       .dwtag  DW_TAG_member
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:30 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{44D418E8-2356-4786-AA21-8FD71E70A7F7} PAGE   99

    5383                            .dwattr $C$DW$543, DW_AT_type(*$C$DW$T$266)
    5384                            .dwattr $C$DW$543, DW_AT_name("addr")
    5385                            .dwattr $C$DW$543, DW_AT_TI_symbol_name("addr")
    5386                            .dwattr $C$DW$543, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5387                            .dwattr $C$DW$543, DW_AT_accessibility(DW_ACCESS_public)
    5388                            .dwattr $C$DW$543, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/Se
    5389                            .dwattr $C$DW$543, DW_AT_decl_line(0x52)
    5390                            .dwattr $C$DW$543, DW_AT_decl_column(0x05)
    5391                    
    5392                    $C$DW$544       .dwtag  DW_TAG_member
    5393                            .dwattr $C$DW$544, DW_AT_type(*$C$DW$T$19)
    5394                            .dwattr $C$DW$544, DW_AT_name("addrMode")
    5395                            .dwattr $C$DW$544, DW_AT_TI_symbol_name("addrMode")
    5396                            .dwattr $C$DW$544, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5397                            .dwattr $C$DW$544, DW_AT_accessibility(DW_ACCESS_public)
    5398                            .dwattr $C$DW$544, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/Se
    5399                            .dwattr $C$DW$544, DW_AT_decl_line(0x53)
    5400                            .dwattr $C$DW$544, DW_AT_decl_column(0x11)
    5401                    
    5402                            .dwattr $C$DW$T$24, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/S
    5403                            .dwattr $C$DW$T$24, DW_AT_decl_line(0x4d)
    5404                            .dwattr $C$DW$T$24, DW_AT_decl_column(0x01)
    5405                            .dwendtag $C$DW$T$24
    5406                    
    5407                    $C$DW$T$25      .dwtag  DW_TAG_typedef
    5408                            .dwattr $C$DW$T$25, DW_AT_name("sAddr_t")
    5409                            .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$24)
    5410                            .dwattr $C$DW$T$25, DW_AT_language(DW_LANG_C)
    5411                            .dwattr $C$DW$T$25, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/S
    5412                            .dwattr $C$DW$T$25, DW_AT_decl_line(0x54)
    5413                            .dwattr $C$DW$T$25, DW_AT_decl_column(0x03)
    5414                    
    5415                    $C$DW$T$89      .dwtag  DW_TAG_pointer_type
    5416                            .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$25)
    5417                            .dwattr $C$DW$T$89, DW_AT_address_class(0x20)
    5418                    
    5419                    
    5420                    $C$DW$T$30      .dwtag  DW_TAG_structure_type
    5421                            .dwattr $C$DW$T$30, DW_AT_byte_size(0x24)
    5422                    $C$DW$545       .dwtag  DW_TAG_member
    5423                            .dwattr $C$DW$545, DW_AT_type(*$C$DW$T$25)
    5424                            .dwattr $C$DW$545, DW_AT_name("coordAddress")
    5425                            .dwattr $C$DW$545, DW_AT_TI_symbol_name("coordAddress")
    5426                            .dwattr $C$DW$545, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5427                            .dwattr $C$DW$545, DW_AT_accessibility(DW_ACCESS_public)
    5428                            .dwattr $C$DW$545, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    5429                            .dwattr $C$DW$545, DW_AT_decl_line(0x3cb)
    5430                            .dwattr $C$DW$545, DW_AT_decl_column(0x11)
    5431                    
    5432                    $C$DW$546       .dwtag  DW_TAG_member
    5433                            .dwattr $C$DW$546, DW_AT_type(*$C$DW$T$26)
    5434                            .dwattr $C$DW$546, DW_AT_name("coordPanId")
    5435                            .dwattr $C$DW$546, DW_AT_TI_symbol_name("coordPanId")
    5436                            .dwattr $C$DW$546, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5437                            .dwattr $C$DW$546, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:30 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{44D418E8-2356-4786-AA21-8FD71E70A7F7} PAGE  100

    5438                            .dwattr $C$DW$546, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    5439                            .dwattr $C$DW$546, DW_AT_decl_line(0x3cc)
    5440                            .dwattr $C$DW$546, DW_AT_decl_column(0x11)
    5441                    
    5442                    $C$DW$547       .dwtag  DW_TAG_member
    5443                            .dwattr $C$DW$547, DW_AT_type(*$C$DW$T$26)
    5444                            .dwattr $C$DW$547, DW_AT_name("superframeSpec")
    5445                            .dwattr $C$DW$547, DW_AT_TI_symbol_name("superframeSpec")
    5446                            .dwattr $C$DW$547, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5447                            .dwattr $C$DW$547, DW_AT_accessibility(DW_ACCESS_public)
    5448                            .dwattr $C$DW$547, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    5449                            .dwattr $C$DW$547, DW_AT_decl_line(0x3cd)
    5450                            .dwattr $C$DW$547, DW_AT_decl_column(0x11)
    5451                    
    5452                    $C$DW$548       .dwtag  DW_TAG_member
    5453                            .dwattr $C$DW$548, DW_AT_type(*$C$DW$T$19)
    5454                            .dwattr $C$DW$548, DW_AT_name("logicalChannel")
    5455                            .dwattr $C$DW$548, DW_AT_TI_symbol_name("logicalChannel")
    5456                            .dwattr $C$DW$548, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    5457                            .dwattr $C$DW$548, DW_AT_accessibility(DW_ACCESS_public)
    5458                            .dwattr $C$DW$548, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    5459                            .dwattr $C$DW$548, DW_AT_decl_line(0x3ce)
    5460                            .dwattr $C$DW$548, DW_AT_decl_column(0x11)
    5461                    
    5462                    $C$DW$549       .dwtag  DW_TAG_member
    5463                            .dwattr $C$DW$549, DW_AT_type(*$C$DW$T$19)
    5464                            .dwattr $C$DW$549, DW_AT_name("channelPage")
    5465                            .dwattr $C$DW$549, DW_AT_TI_symbol_name("channelPage")
    5466                            .dwattr $C$DW$549, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    5467                            .dwattr $C$DW$549, DW_AT_accessibility(DW_ACCESS_public)
    5468                            .dwattr $C$DW$549, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    5469                            .dwattr $C$DW$549, DW_AT_decl_line(0x3cf)
    5470                            .dwattr $C$DW$549, DW_AT_decl_column(0x11)
    5471                    
    5472                    $C$DW$550       .dwtag  DW_TAG_member
    5473                            .dwattr $C$DW$550, DW_AT_type(*$C$DW$T$27)
    5474                            .dwattr $C$DW$550, DW_AT_name("gtsPermit")
    5475                            .dwattr $C$DW$550, DW_AT_TI_symbol_name("gtsPermit")
    5476                            .dwattr $C$DW$550, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5477                            .dwattr $C$DW$550, DW_AT_accessibility(DW_ACCESS_public)
    5478                            .dwattr $C$DW$550, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    5479                            .dwattr $C$DW$550, DW_AT_decl_line(0x3d0)
    5480                            .dwattr $C$DW$550, DW_AT_decl_column(0x11)
    5481                    
    5482                    $C$DW$551       .dwtag  DW_TAG_member
    5483                            .dwattr $C$DW$551, DW_AT_type(*$C$DW$T$19)
    5484                            .dwattr $C$DW$551, DW_AT_name("linkQuality")
    5485                            .dwattr $C$DW$551, DW_AT_TI_symbol_name("linkQuality")
    5486                            .dwattr $C$DW$551, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    5487                            .dwattr $C$DW$551, DW_AT_accessibility(DW_ACCESS_public)
    5488                            .dwattr $C$DW$551, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    5489                            .dwattr $C$DW$551, DW_AT_decl_line(0x3d1)
    5490                            .dwattr $C$DW$551, DW_AT_decl_column(0x11)
    5491                    
    5492                    $C$DW$552       .dwtag  DW_TAG_member
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:30 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{44D418E8-2356-4786-AA21-8FD71E70A7F7} PAGE  101

    5493                            .dwattr $C$DW$552, DW_AT_type(*$C$DW$T$28)
    5494                            .dwattr $C$DW$552, DW_AT_name("timestamp")
    5495                            .dwattr $C$DW$552, DW_AT_TI_symbol_name("timestamp")
    5496                            .dwattr $C$DW$552, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    5497                            .dwattr $C$DW$552, DW_AT_accessibility(DW_ACCESS_public)
    5498                            .dwattr $C$DW$552, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    5499                            .dwattr $C$DW$552, DW_AT_decl_line(0x3d2)
    5500                            .dwattr $C$DW$552, DW_AT_decl_column(0x11)
    5501                    
    5502                    $C$DW$553       .dwtag  DW_TAG_member
    5503                            .dwattr $C$DW$553, DW_AT_type(*$C$DW$T$27)
    5504                            .dwattr $C$DW$553, DW_AT_name("securityFailure")
    5505                            .dwattr $C$DW$553, DW_AT_TI_symbol_name("securityFailure")
    5506                            .dwattr $C$DW$553, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    5507                            .dwattr $C$DW$553, DW_AT_accessibility(DW_ACCESS_public)
    5508                            .dwattr $C$DW$553, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    5509                            .dwattr $C$DW$553, DW_AT_decl_line(0x3d3)
    5510                            .dwattr $C$DW$553, DW_AT_decl_column(0x11)
    5511                    
    5512                    $C$DW$554       .dwtag  DW_TAG_member
    5513                            .dwattr $C$DW$554, DW_AT_type(*$C$DW$T$29)
    5514                            .dwattr $C$DW$554, DW_AT_name("sec")
    5515                            .dwattr $C$DW$554, DW_AT_TI_symbol_name("sec")
    5516                            .dwattr $C$DW$554, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    5517                            .dwattr $C$DW$554, DW_AT_accessibility(DW_ACCESS_public)
    5518                            .dwattr $C$DW$554, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    5519                            .dwattr $C$DW$554, DW_AT_decl_line(0x3d4)
    5520                            .dwattr $C$DW$554, DW_AT_decl_column(0x11)
    5521                    
    5522                            .dwattr $C$DW$T$30, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/M
    5523                            .dwattr $C$DW$T$30, DW_AT_decl_line(0x3ca)
    5524                            .dwattr $C$DW$T$30, DW_AT_decl_column(0x01)
    5525                            .dwendtag $C$DW$T$30
    5526                    
    5527                    $C$DW$T$72      .dwtag  DW_TAG_typedef
    5528                            .dwattr $C$DW$T$72, DW_AT_name("macPanDesc_t")
    5529                            .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$30)
    5530                            .dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
    5531                            .dwattr $C$DW$T$72, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/M
    5532                            .dwattr $C$DW$T$72, DW_AT_decl_line(0x3d5)
    5533                            .dwattr $C$DW$T$72, DW_AT_decl_column(0x03)
    5534                    
    5535                    $C$DW$T$73      .dwtag  DW_TAG_pointer_type
    5536                            .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$72)
    5537                            .dwattr $C$DW$T$73, DW_AT_address_class(0x20)
    5538                    
    5539                    
    5540                    $C$DW$T$32      .dwtag  DW_TAG_structure_type
    5541                            .dwattr $C$DW$T$32, DW_AT_byte_size(0x2c)
    5542                    $C$DW$555       .dwtag  DW_TAG_member
    5543                            .dwattr $C$DW$555, DW_AT_type(*$C$DW$T$31)
    5544                            .dwattr $C$DW$555, DW_AT_name("scanChannels")
    5545                            .dwattr $C$DW$555, DW_AT_TI_symbol_name("scanChannels")
    5546                            .dwattr $C$DW$555, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5547                            .dwattr $C$DW$555, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:30 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{44D418E8-2356-4786-AA21-8FD71E70A7F7} PAGE  102

    5548                            .dwattr $C$DW$555, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    5549                            .dwattr $C$DW$555, DW_AT_decl_line(0x40b)
    5550                            .dwattr $C$DW$555, DW_AT_decl_column(0x14)
    5551                    
    5552                    $C$DW$556       .dwtag  DW_TAG_member
    5553                            .dwattr $C$DW$556, DW_AT_type(*$C$DW$T$19)
    5554                            .dwattr $C$DW$556, DW_AT_name("scanType")
    5555                            .dwattr $C$DW$556, DW_AT_TI_symbol_name("scanType")
    5556                            .dwattr $C$DW$556, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    5557                            .dwattr $C$DW$556, DW_AT_accessibility(DW_ACCESS_public)
    5558                            .dwattr $C$DW$556, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    5559                            .dwattr $C$DW$556, DW_AT_decl_line(0x40c)
    5560                            .dwattr $C$DW$556, DW_AT_decl_column(0x14)
    5561                    
    5562                    $C$DW$557       .dwtag  DW_TAG_member
    5563                            .dwattr $C$DW$557, DW_AT_type(*$C$DW$T$19)
    5564                            .dwattr $C$DW$557, DW_AT_name("scanDuration")
    5565                            .dwattr $C$DW$557, DW_AT_TI_symbol_name("scanDuration")
    5566                            .dwattr $C$DW$557, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    5567                            .dwattr $C$DW$557, DW_AT_accessibility(DW_ACCESS_public)
    5568                            .dwattr $C$DW$557, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    5569                            .dwattr $C$DW$557, DW_AT_decl_line(0x40d)
    5570                            .dwattr $C$DW$557, DW_AT_decl_column(0x14)
    5571                    
    5572                    $C$DW$558       .dwtag  DW_TAG_member
    5573                            .dwattr $C$DW$558, DW_AT_type(*$C$DW$T$19)
    5574                            .dwattr $C$DW$558, DW_AT_name("channelPage")
    5575                            .dwattr $C$DW$558, DW_AT_TI_symbol_name("channelPage")
    5576                            .dwattr $C$DW$558, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    5577                            .dwattr $C$DW$558, DW_AT_accessibility(DW_ACCESS_public)
    5578                            .dwattr $C$DW$558, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    5579                            .dwattr $C$DW$558, DW_AT_decl_line(0x40e)
    5580                            .dwattr $C$DW$558, DW_AT_decl_column(0x14)
    5581                    
    5582                    $C$DW$559       .dwtag  DW_TAG_member
    5583                            .dwattr $C$DW$559, DW_AT_type(*$C$DW$T$19)
    5584                            .dwattr $C$DW$559, DW_AT_name("phyID")
    5585                            .dwattr $C$DW$559, DW_AT_TI_symbol_name("phyID")
    5586                            .dwattr $C$DW$559, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    5587                            .dwattr $C$DW$559, DW_AT_accessibility(DW_ACCESS_public)
    5588                            .dwattr $C$DW$559, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    5589                            .dwattr $C$DW$559, DW_AT_decl_line(0x40f)
    5590                            .dwattr $C$DW$559, DW_AT_decl_column(0x14)
    5591                    
    5592                    $C$DW$560       .dwtag  DW_TAG_member
    5593                            .dwattr $C$DW$560, DW_AT_type(*$C$DW$T$19)
    5594                            .dwattr $C$DW$560, DW_AT_name("maxResults")
    5595                            .dwattr $C$DW$560, DW_AT_TI_symbol_name("maxResults")
    5596                            .dwattr $C$DW$560, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    5597                            .dwattr $C$DW$560, DW_AT_accessibility(DW_ACCESS_public)
    5598                            .dwattr $C$DW$560, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    5599                            .dwattr $C$DW$560, DW_AT_decl_line(0x410)
    5600                            .dwattr $C$DW$560, DW_AT_decl_column(0x14)
    5601                    
    5602                    $C$DW$561       .dwtag  DW_TAG_member
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:30 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{44D418E8-2356-4786-AA21-8FD71E70A7F7} PAGE  103

    5603                            .dwattr $C$DW$561, DW_AT_type(*$C$DW$T$27)
    5604                            .dwattr $C$DW$561, DW_AT_name("permitJoining")
    5605                            .dwattr $C$DW$561, DW_AT_TI_symbol_name("permitJoining")
    5606                            .dwattr $C$DW$561, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    5607                            .dwattr $C$DW$561, DW_AT_accessibility(DW_ACCESS_public)
    5608                            .dwattr $C$DW$561, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    5609                            .dwattr $C$DW$561, DW_AT_decl_line(0x411)
    5610                            .dwattr $C$DW$561, DW_AT_decl_column(0x14)
    5611                    
    5612                    $C$DW$562       .dwtag  DW_TAG_member
    5613                            .dwattr $C$DW$562, DW_AT_type(*$C$DW$T$19)
    5614                            .dwattr $C$DW$562, DW_AT_name("linkQuality")
    5615                            .dwattr $C$DW$562, DW_AT_TI_symbol_name("linkQuality")
    5616                            .dwattr $C$DW$562, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    5617                            .dwattr $C$DW$562, DW_AT_accessibility(DW_ACCESS_public)
    5618                            .dwattr $C$DW$562, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    5619                            .dwattr $C$DW$562, DW_AT_decl_line(0x413)
    5620                            .dwattr $C$DW$562, DW_AT_decl_column(0x14)
    5621                    
    5622                    $C$DW$563       .dwtag  DW_TAG_member
    5623                            .dwattr $C$DW$563, DW_AT_type(*$C$DW$T$19)
    5624                            .dwattr $C$DW$563, DW_AT_name("percentFilter")
    5625                            .dwattr $C$DW$563, DW_AT_TI_symbol_name("percentFilter")
    5626                            .dwattr $C$DW$563, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    5627                            .dwattr $C$DW$563, DW_AT_accessibility(DW_ACCESS_public)
    5628                            .dwattr $C$DW$563, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    5629                            .dwattr $C$DW$563, DW_AT_decl_line(0x415)
    5630                            .dwattr $C$DW$563, DW_AT_decl_column(0x14)
    5631                    
    5632                    $C$DW$564       .dwtag  DW_TAG_member
    5633                            .dwattr $C$DW$564, DW_AT_type(*$C$DW$T$29)
    5634                            .dwattr $C$DW$564, DW_AT_name("sec")
    5635                            .dwattr $C$DW$564, DW_AT_TI_symbol_name("sec")
    5636                            .dwattr $C$DW$564, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    5637                            .dwattr $C$DW$564, DW_AT_accessibility(DW_ACCESS_public)
    5638                            .dwattr $C$DW$564, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    5639                            .dwattr $C$DW$564, DW_AT_decl_line(0x418)
    5640                            .dwattr $C$DW$564, DW_AT_decl_column(0x14)
    5641                    
    5642                    $C$DW$565       .dwtag  DW_TAG_member
    5643                            .dwattr $C$DW$565, DW_AT_type(*$C$DW$T$27)
    5644                            .dwattr $C$DW$565, DW_AT_name("MPMScan")
    5645                            .dwattr $C$DW$565, DW_AT_TI_symbol_name("MPMScan")
    5646                            .dwattr $C$DW$565, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    5647                            .dwattr $C$DW$565, DW_AT_accessibility(DW_ACCESS_public)
    5648                            .dwattr $C$DW$565, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    5649                            .dwattr $C$DW$565, DW_AT_decl_line(0x419)
    5650                            .dwattr $C$DW$565, DW_AT_decl_column(0x14)
    5651                    
    5652                    $C$DW$566       .dwtag  DW_TAG_member
    5653                            .dwattr $C$DW$566, DW_AT_type(*$C$DW$T$19)
    5654                            .dwattr $C$DW$566, DW_AT_name("MPMScanType")
    5655                            .dwattr $C$DW$566, DW_AT_TI_symbol_name("MPMScanType")
    5656                            .dwattr $C$DW$566, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    5657                            .dwattr $C$DW$566, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:30 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{44D418E8-2356-4786-AA21-8FD71E70A7F7} PAGE  104

    5658                            .dwattr $C$DW$566, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    5659                            .dwattr $C$DW$566, DW_AT_decl_line(0x41b)
    5660                            .dwattr $C$DW$566, DW_AT_decl_column(0x14)
    5661                    
    5662                    $C$DW$567       .dwtag  DW_TAG_member
    5663                            .dwattr $C$DW$567, DW_AT_type(*$C$DW$T$26)
    5664                            .dwattr $C$DW$567, DW_AT_name("MPMScanDuration")
    5665                            .dwattr $C$DW$567, DW_AT_TI_symbol_name("MPMScanDuration")
    5666                            .dwattr $C$DW$567, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    5667                            .dwattr $C$DW$567, DW_AT_accessibility(DW_ACCESS_public)
    5668                            .dwattr $C$DW$567, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    5669                            .dwattr $C$DW$567, DW_AT_decl_line(0x41c)
    5670                            .dwattr $C$DW$567, DW_AT_decl_column(0x14)
    5671                    
    5672                    $C$DW$568       .dwtag  DW_TAG_member
    5673                            .dwattr $C$DW$568, DW_AT_type(*$C$DW$T$267)
    5674                            .dwattr $C$DW$568, DW_AT_name("result")
    5675                            .dwattr $C$DW$568, DW_AT_TI_symbol_name("result")
    5676                            .dwattr $C$DW$568, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    5677                            .dwattr $C$DW$568, DW_AT_accessibility(DW_ACCESS_public)
    5678                            .dwattr $C$DW$568, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    5679                            .dwattr $C$DW$568, DW_AT_decl_line(0x42a)
    5680                            .dwattr $C$DW$568, DW_AT_decl_column(0x05)
    5681                    
    5682                            .dwattr $C$DW$T$32, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/M
    5683                            .dwattr $C$DW$T$32, DW_AT_decl_line(0x40a)
    5684                            .dwattr $C$DW$T$32, DW_AT_decl_column(0x01)
    5685                            .dwendtag $C$DW$T$32
    5686                    
    5687                    $C$DW$T$268     .dwtag  DW_TAG_typedef
    5688                            .dwattr $C$DW$T$268, DW_AT_name("macMlmeScanReq_t")
    5689                            .dwattr $C$DW$T$268, DW_AT_type(*$C$DW$T$32)
    5690                            .dwattr $C$DW$T$268, DW_AT_language(DW_LANG_C)
    5691                            .dwattr $C$DW$T$268, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/
    5692                            .dwattr $C$DW$T$268, DW_AT_decl_line(0x42b)
    5693                            .dwattr $C$DW$T$268, DW_AT_decl_column(0x03)
    5694                    
    5695                    
    5696                    $C$DW$T$33      .dwtag  DW_TAG_structure_type
    5697                            .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
    5698                    $C$DW$569       .dwtag  DW_TAG_member
    5699                            .dwattr $C$DW$569, DW_AT_type(*$C$DW$T$19)
    5700                            .dwattr $C$DW$569, DW_AT_name("msduHandle")
    5701                            .dwattr $C$DW$569, DW_AT_TI_symbol_name("msduHandle")
    5702                            .dwattr $C$DW$569, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5703                            .dwattr $C$DW$569, DW_AT_accessibility(DW_ACCESS_public)
    5704                            .dwattr $C$DW$569, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    5705                            .dwattr $C$DW$569, DW_AT_decl_line(0x15f)
    5706                            .dwattr $C$DW$569, DW_AT_decl_column(0x1f)
    5707                    
    5708                            .dwattr $C$DW$T$33, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154sta
    5709                            .dwattr $C$DW$T$33, DW_AT_decl_line(0x15e)
    5710                            .dwattr $C$DW$T$33, DW_AT_decl_column(0x01)
    5711                            .dwendtag $C$DW$T$33
    5712                    
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:30 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{44D418E8-2356-4786-AA21-8FD71E70A7F7} PAGE  105

    5713                    $C$DW$T$269     .dwtag  DW_TAG_typedef
    5714                            .dwattr $C$DW$T$269, DW_AT_name("macMcpsPurgeReq_t")
    5715                            .dwattr $C$DW$T$269, DW_AT_type(*$C$DW$T$33)
    5716                            .dwattr $C$DW$T$269, DW_AT_language(DW_LANG_C)
    5717                            .dwattr $C$DW$T$269, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154st
    5718                            .dwattr $C$DW$T$269, DW_AT_decl_line(0x160)
    5719                            .dwattr $C$DW$T$269, DW_AT_decl_column(0x03)
    5720                    
    5721                    
    5722                    $C$DW$T$35      .dwtag  DW_TAG_structure_type
    5723                            .dwattr $C$DW$T$35, DW_AT_byte_size(0x38)
    5724                    $C$DW$570       .dwtag  DW_TAG_member
    5725                            .dwattr $C$DW$570, DW_AT_type(*$C$DW$T$34)
    5726                            .dwattr $C$DW$570, DW_AT_name("hdr")
    5727                            .dwattr $C$DW$570, DW_AT_TI_symbol_name("hdr")
    5728                            .dwattr $C$DW$570, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5729                            .dwattr $C$DW$570, DW_AT_accessibility(DW_ACCESS_public)
    5730                            .dwattr $C$DW$570, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    5731                            .dwattr $C$DW$570, DW_AT_decl_line(0x166)
    5732                            .dwattr $C$DW$570, DW_AT_decl_column(0x1f)
    5733                    
    5734                    $C$DW$571       .dwtag  DW_TAG_member
    5735                            .dwattr $C$DW$571, DW_AT_type(*$C$DW$T$270)
    5736                            .dwattr $C$DW$571, DW_AT_name("mac")
    5737                            .dwattr $C$DW$571, DW_AT_TI_symbol_name("mac")
    5738                            .dwattr $C$DW$571, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5739                            .dwattr $C$DW$571, DW_AT_accessibility(DW_ACCESS_public)
    5740                            .dwattr $C$DW$571, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    5741                            .dwattr $C$DW$571, DW_AT_decl_line(0x16f)
    5742                            .dwattr $C$DW$571, DW_AT_decl_column(0x05)
    5743                    
    5744                            .dwattr $C$DW$T$35, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154sta
    5745                            .dwattr $C$DW$T$35, DW_AT_decl_line(0x165)
    5746                            .dwattr $C$DW$T$35, DW_AT_decl_column(0x01)
    5747                            .dwendtag $C$DW$T$35
    5748                    
    5749                    $C$DW$T$278     .dwtag  DW_TAG_typedef
    5750                            .dwattr $C$DW$T$278, DW_AT_name("macApiEvent_t")
    5751                            .dwattr $C$DW$T$278, DW_AT_type(*$C$DW$T$35)
    5752                            .dwattr $C$DW$T$278, DW_AT_language(DW_LANG_C)
    5753                            .dwattr $C$DW$T$278, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154st
    5754                            .dwattr $C$DW$T$278, DW_AT_decl_line(0x170)
    5755                            .dwattr $C$DW$T$278, DW_AT_decl_column(0x03)
    5756                    
    5757                    
    5758                    $C$DW$T$37      .dwtag  DW_TAG_structure_type
    5759                            .dwattr $C$DW$T$37, DW_AT_byte_size(0x08)
    5760                    $C$DW$572       .dwtag  DW_TAG_member
    5761                            .dwattr $C$DW$572, DW_AT_type(*$C$DW$T$36)
    5762                            .dwattr $C$DW$572, DW_AT_name("p")
    5763                            .dwattr $C$DW$572, DW_AT_TI_symbol_name("p")
    5764                            .dwattr $C$DW$572, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5765                            .dwattr $C$DW$572, DW_AT_accessibility(DW_ACCESS_public)
    5766                            .dwattr $C$DW$572, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/Se
    5767                            .dwattr $C$DW$572, DW_AT_decl_line(0x3d)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:30 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{44D418E8-2356-4786-AA21-8FD71E70A7F7} PAGE  106

    5768                            .dwattr $C$DW$572, DW_AT_decl_column(0x0e)
    5769                    
    5770                    $C$DW$573       .dwtag  DW_TAG_member
    5771                            .dwattr $C$DW$573, DW_AT_type(*$C$DW$T$26)
    5772                            .dwattr $C$DW$573, DW_AT_name("len")
    5773                            .dwattr $C$DW$573, DW_AT_TI_symbol_name("len")
    5774                            .dwattr $C$DW$573, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5775                            .dwattr $C$DW$573, DW_AT_accessibility(DW_ACCESS_public)
    5776                            .dwattr $C$DW$573, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/Se
    5777                            .dwattr $C$DW$573, DW_AT_decl_line(0x3e)
    5778                            .dwattr $C$DW$573, DW_AT_decl_column(0x0e)
    5779                    
    5780                            .dwattr $C$DW$T$37, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/S
    5781                            .dwattr $C$DW$T$37, DW_AT_decl_line(0x3c)
    5782                            .dwattr $C$DW$T$37, DW_AT_decl_column(0x01)
    5783                            .dwendtag $C$DW$T$37
    5784                    
    5785                    $C$DW$T$58      .dwtag  DW_TAG_typedef
    5786                            .dwattr $C$DW$T$58, DW_AT_name("sData_t")
    5787                            .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$37)
    5788                            .dwattr $C$DW$T$58, DW_AT_language(DW_LANG_C)
    5789                            .dwattr $C$DW$T$58, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/S
    5790                            .dwattr $C$DW$T$58, DW_AT_decl_line(0x3f)
    5791                            .dwattr $C$DW$T$58, DW_AT_decl_column(0x03)
    5792                    
    5793                    
    5794                    $C$DW$T$39      .dwtag  DW_TAG_structure_type
    5795                            .dwattr $C$DW$T$39, DW_AT_byte_size(0x0a)
    5796                    $C$DW$574       .dwtag  DW_TAG_member
    5797                            .dwattr $C$DW$574, DW_AT_type(*$C$DW$T$38)
    5798                            .dwattr $C$DW$574, DW_AT_name("lookupData")
    5799                            .dwattr $C$DW$574, DW_AT_TI_symbol_name("lookupData")
    5800                            .dwattr $C$DW$574, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5801                            .dwattr $C$DW$574, DW_AT_accessibility(DW_ACCESS_public)
    5802                            .dwattr $C$DW$574, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    5803                            .dwattr $C$DW$574, DW_AT_decl_line(0x2b6)
    5804                            .dwattr $C$DW$574, DW_AT_decl_column(0x16)
    5805                    
    5806                    $C$DW$575       .dwtag  DW_TAG_member
    5807                            .dwattr $C$DW$575, DW_AT_type(*$C$DW$T$19)
    5808                            .dwattr $C$DW$575, DW_AT_name("lookupDataSize")
    5809                            .dwattr $C$DW$575, DW_AT_TI_symbol_name("lookupDataSize")
    5810                            .dwattr $C$DW$575, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    5811                            .dwattr $C$DW$575, DW_AT_accessibility(DW_ACCESS_public)
    5812                            .dwattr $C$DW$575, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    5813                            .dwattr $C$DW$575, DW_AT_decl_line(0x2b7)
    5814                            .dwattr $C$DW$575, DW_AT_decl_column(0x16)
    5815                    
    5816                            .dwattr $C$DW$T$39, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/M
    5817                            .dwattr $C$DW$T$39, DW_AT_decl_line(0x2b5)
    5818                            .dwattr $C$DW$T$39, DW_AT_decl_column(0x01)
    5819                            .dwendtag $C$DW$T$39
    5820                    
    5821                    $C$DW$T$42      .dwtag  DW_TAG_typedef
    5822                            .dwattr $C$DW$T$42, DW_AT_name("keyIdLookupDescriptor_t")
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:30 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{44D418E8-2356-4786-AA21-8FD71E70A7F7} PAGE  107

    5823                            .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$39)
    5824                            .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    5825                            .dwattr $C$DW$T$42, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/M
    5826                            .dwattr $C$DW$T$42, DW_AT_decl_line(0x2b8)
    5827                            .dwattr $C$DW$T$42, DW_AT_decl_column(0x03)
    5828                    
    5829                    $C$DW$T$43      .dwtag  DW_TAG_pointer_type
    5830                            .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$42)
    5831                            .dwattr $C$DW$T$43, DW_AT_address_class(0x20)
    5832                    
    5833                    
    5834                    $C$DW$T$251     .dwtag  DW_TAG_array_type
    5835                            .dwattr $C$DW$T$251, DW_AT_type(*$C$DW$T$42)
    5836                            .dwattr $C$DW$T$251, DW_AT_language(DW_LANG_C)
    5837                            .dwattr $C$DW$T$251, DW_AT_byte_size(0x0a)
    5838                    $C$DW$576       .dwtag  DW_TAG_subrange_type
    5839                            .dwattr $C$DW$576, DW_AT_upper_bound(0x00)
    5840                    
    5841                            .dwendtag $C$DW$T$251
    5842                    
    5843                    
    5844                    $C$DW$T$252     .dwtag  DW_TAG_array_type
    5845                            .dwattr $C$DW$T$252, DW_AT_type(*$C$DW$T$42)
    5846                            .dwattr $C$DW$T$252, DW_AT_language(DW_LANG_C)
    5847                            .dwattr $C$DW$T$252, DW_AT_byte_size(0x14)
    5848                    $C$DW$577       .dwtag  DW_TAG_subrange_type
    5849                            .dwattr $C$DW$577, DW_AT_upper_bound(0x01)
    5850                    
    5851                    $C$DW$578       .dwtag  DW_TAG_subrange_type
    5852                            .dwattr $C$DW$578, DW_AT_upper_bound(0x00)
    5853                    
    5854                            .dwendtag $C$DW$T$252
    5855                    
    5856                    
    5857                    $C$DW$T$40      .dwtag  DW_TAG_structure_type
    5858                            .dwattr $C$DW$T$40, DW_AT_byte_size(0x03)
    5859                    $C$DW$579       .dwtag  DW_TAG_member
    5860                            .dwattr $C$DW$579, DW_AT_type(*$C$DW$T$19)
    5861                            .dwattr $C$DW$579, DW_AT_name("deviceDescriptorHandle")
    5862                            .dwattr $C$DW$579, DW_AT_TI_symbol_name("deviceDescriptorHandle")
    5863                            .dwattr $C$DW$579, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5864                            .dwattr $C$DW$579, DW_AT_accessibility(DW_ACCESS_public)
    5865                            .dwattr $C$DW$579, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    5866                            .dwattr $C$DW$579, DW_AT_decl_line(0x2bd)
    5867                            .dwattr $C$DW$579, DW_AT_decl_column(0x16)
    5868                    
    5869                    $C$DW$580       .dwtag  DW_TAG_member
    5870                            .dwattr $C$DW$580, DW_AT_type(*$C$DW$T$27)
    5871                            .dwattr $C$DW$580, DW_AT_name("uniqueDevice")
    5872                            .dwattr $C$DW$580, DW_AT_TI_symbol_name("uniqueDevice")
    5873                            .dwattr $C$DW$580, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5874                            .dwattr $C$DW$580, DW_AT_accessibility(DW_ACCESS_public)
    5875                            .dwattr $C$DW$580, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    5876                            .dwattr $C$DW$580, DW_AT_decl_line(0x2be)
    5877                            .dwattr $C$DW$580, DW_AT_decl_column(0x16)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:30 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{44D418E8-2356-4786-AA21-8FD71E70A7F7} PAGE  108

    5878                    
    5879                    $C$DW$581       .dwtag  DW_TAG_member
    5880                            .dwattr $C$DW$581, DW_AT_type(*$C$DW$T$27)
    5881                            .dwattr $C$DW$581, DW_AT_name("blackListed")
    5882                            .dwattr $C$DW$581, DW_AT_TI_symbol_name("blackListed")
    5883                            .dwattr $C$DW$581, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5884                            .dwattr $C$DW$581, DW_AT_accessibility(DW_ACCESS_public)
    5885                            .dwattr $C$DW$581, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    5886                            .dwattr $C$DW$581, DW_AT_decl_line(0x2bf)
    5887                            .dwattr $C$DW$581, DW_AT_decl_column(0x16)
    5888                    
    5889                            .dwattr $C$DW$T$40, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/M
    5890                            .dwattr $C$DW$T$40, DW_AT_decl_line(0x2bc)
    5891                            .dwattr $C$DW$T$40, DW_AT_decl_column(0x01)
    5892                            .dwendtag $C$DW$T$40
    5893                    
    5894                    $C$DW$T$44      .dwtag  DW_TAG_typedef
    5895                            .dwattr $C$DW$T$44, DW_AT_name("keyDeviceDescriptor_t")
    5896                            .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$40)
    5897                            .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    5898                            .dwattr $C$DW$T$44, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/M
    5899                            .dwattr $C$DW$T$44, DW_AT_decl_line(0x2c0)
    5900                            .dwattr $C$DW$T$44, DW_AT_decl_column(0x03)
    5901                    
    5902                    $C$DW$T$45      .dwtag  DW_TAG_pointer_type
    5903                            .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$44)
    5904                            .dwattr $C$DW$T$45, DW_AT_address_class(0x20)
    5905                    
    5906                    
    5907                    $C$DW$T$253     .dwtag  DW_TAG_array_type
    5908                            .dwattr $C$DW$T$253, DW_AT_type(*$C$DW$T$44)
    5909                            .dwattr $C$DW$T$253, DW_AT_language(DW_LANG_C)
    5910                            .dwattr $C$DW$T$253, DW_AT_byte_size(0x09)
    5911                    $C$DW$582       .dwtag  DW_TAG_subrange_type
    5912                            .dwattr $C$DW$582, DW_AT_upper_bound(0x02)
    5913                    
    5914                            .dwendtag $C$DW$T$253
    5915                    
    5916                    
    5917                    $C$DW$T$254     .dwtag  DW_TAG_array_type
    5918                            .dwattr $C$DW$T$254, DW_AT_type(*$C$DW$T$44)
    5919                            .dwattr $C$DW$T$254, DW_AT_language(DW_LANG_C)
    5920                            .dwattr $C$DW$T$254, DW_AT_byte_size(0x12)
    5921                    $C$DW$583       .dwtag  DW_TAG_subrange_type
    5922                            .dwattr $C$DW$583, DW_AT_upper_bound(0x01)
    5923                    
    5924                    $C$DW$584       .dwtag  DW_TAG_subrange_type
    5925                            .dwattr $C$DW$584, DW_AT_upper_bound(0x02)
    5926                    
    5927                            .dwendtag $C$DW$T$254
    5928                    
    5929                    
    5930                    $C$DW$T$41      .dwtag  DW_TAG_structure_type
    5931                            .dwattr $C$DW$T$41, DW_AT_byte_size(0x02)
    5932                    $C$DW$585       .dwtag  DW_TAG_member
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:30 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{44D418E8-2356-4786-AA21-8FD71E70A7F7} PAGE  109

    5933                            .dwattr $C$DW$585, DW_AT_type(*$C$DW$T$19)
    5934                            .dwattr $C$DW$585, DW_AT_name("frameType")
    5935                            .dwattr $C$DW$585, DW_AT_TI_symbol_name("frameType")
    5936                            .dwattr $C$DW$585, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5937                            .dwattr $C$DW$585, DW_AT_accessibility(DW_ACCESS_public)
    5938                            .dwattr $C$DW$585, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    5939                            .dwattr $C$DW$585, DW_AT_decl_line(0x2c5)
    5940                            .dwattr $C$DW$585, DW_AT_decl_column(0x16)
    5941                    
    5942                    $C$DW$586       .dwtag  DW_TAG_member
    5943                            .dwattr $C$DW$586, DW_AT_type(*$C$DW$T$19)
    5944                            .dwattr $C$DW$586, DW_AT_name("cmdFrameId")
    5945                            .dwattr $C$DW$586, DW_AT_TI_symbol_name("cmdFrameId")
    5946                            .dwattr $C$DW$586, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5947                            .dwattr $C$DW$586, DW_AT_accessibility(DW_ACCESS_public)
    5948                            .dwattr $C$DW$586, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    5949                            .dwattr $C$DW$586, DW_AT_decl_line(0x2c6)
    5950                            .dwattr $C$DW$586, DW_AT_decl_column(0x16)
    5951                    
    5952                            .dwattr $C$DW$T$41, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/M
    5953                            .dwattr $C$DW$T$41, DW_AT_decl_line(0x2c4)
    5954                            .dwattr $C$DW$T$41, DW_AT_decl_column(0x01)
    5955                            .dwendtag $C$DW$T$41
    5956                    
    5957                    $C$DW$T$46      .dwtag  DW_TAG_typedef
    5958                            .dwattr $C$DW$T$46, DW_AT_name("keyUsageDescriptor_t")
    5959                            .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$41)
    5960                            .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    5961                            .dwattr $C$DW$T$46, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/M
    5962                            .dwattr $C$DW$T$46, DW_AT_decl_line(0x2c7)
    5963                            .dwattr $C$DW$T$46, DW_AT_decl_column(0x03)
    5964                    
    5965                    $C$DW$T$47      .dwtag  DW_TAG_pointer_type
    5966                            .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$46)
    5967                            .dwattr $C$DW$T$47, DW_AT_address_class(0x20)
    5968                    
    5969                    
    5970                    $C$DW$T$255     .dwtag  DW_TAG_array_type
    5971                            .dwattr $C$DW$T$255, DW_AT_type(*$C$DW$T$46)
    5972                            .dwattr $C$DW$T$255, DW_AT_language(DW_LANG_C)
    5973                            .dwattr $C$DW$T$255, DW_AT_byte_size(0x04)
    5974                    $C$DW$587       .dwtag  DW_TAG_subrange_type
    5975                            .dwattr $C$DW$587, DW_AT_upper_bound(0x01)
    5976                    
    5977                            .dwendtag $C$DW$T$255
    5978                    
    5979                    
    5980                    $C$DW$T$256     .dwtag  DW_TAG_array_type
    5981                            .dwattr $C$DW$T$256, DW_AT_type(*$C$DW$T$46)
    5982                            .dwattr $C$DW$T$256, DW_AT_language(DW_LANG_C)
    5983                            .dwattr $C$DW$T$256, DW_AT_byte_size(0x08)
    5984                    $C$DW$588       .dwtag  DW_TAG_subrange_type
    5985                            .dwattr $C$DW$588, DW_AT_upper_bound(0x01)
    5986                    
    5987                    $C$DW$589       .dwtag  DW_TAG_subrange_type
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:30 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{44D418E8-2356-4786-AA21-8FD71E70A7F7} PAGE  110

    5988                            .dwattr $C$DW$589, DW_AT_upper_bound(0x01)
    5989                    
    5990                            .dwendtag $C$DW$T$256
    5991                    
    5992                    
    5993                    $C$DW$T$49      .dwtag  DW_TAG_structure_type
    5994                            .dwattr $C$DW$T$49, DW_AT_byte_size(0x2c)
    5995                    $C$DW$590       .dwtag  DW_TAG_member
    5996                            .dwattr $C$DW$590, DW_AT_type(*$C$DW$T$43)
    5997                            .dwattr $C$DW$590, DW_AT_name("keyIdLookupList")
    5998                            .dwattr $C$DW$590, DW_AT_TI_symbol_name("keyIdLookupList")
    5999                            .dwattr $C$DW$590, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6000                            .dwattr $C$DW$590, DW_AT_accessibility(DW_ACCESS_public)
    6001                            .dwattr $C$DW$590, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    6002                            .dwattr $C$DW$590, DW_AT_decl_line(0x2cc)
    6003                            .dwattr $C$DW$590, DW_AT_decl_column(0x1d)
    6004                    
    6005                    $C$DW$591       .dwtag  DW_TAG_member
    6006                            .dwattr $C$DW$591, DW_AT_type(*$C$DW$T$19)
    6007                            .dwattr $C$DW$591, DW_AT_name("keyIdLookupEntries")
    6008                            .dwattr $C$DW$591, DW_AT_TI_symbol_name("keyIdLookupEntries")
    6009                            .dwattr $C$DW$591, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6010                            .dwattr $C$DW$591, DW_AT_accessibility(DW_ACCESS_public)
    6011                            .dwattr $C$DW$591, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    6012                            .dwattr $C$DW$591, DW_AT_decl_line(0x2cd)
    6013                            .dwattr $C$DW$591, DW_AT_decl_column(0x1c)
    6014                    
    6015                    $C$DW$592       .dwtag  DW_TAG_member
    6016                            .dwattr $C$DW$592, DW_AT_type(*$C$DW$T$45)
    6017                            .dwattr $C$DW$592, DW_AT_name("keyDeviceList")
    6018                            .dwattr $C$DW$592, DW_AT_TI_symbol_name("keyDeviceList")
    6019                            .dwattr $C$DW$592, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6020                            .dwattr $C$DW$592, DW_AT_accessibility(DW_ACCESS_public)
    6021                            .dwattr $C$DW$592, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    6022                            .dwattr $C$DW$592, DW_AT_decl_line(0x2cf)
    6023                            .dwattr $C$DW$592, DW_AT_decl_column(0x1d)
    6024                    
    6025                    $C$DW$593       .dwtag  DW_TAG_member
    6026                            .dwattr $C$DW$593, DW_AT_type(*$C$DW$T$19)
    6027                            .dwattr $C$DW$593, DW_AT_name("keyDeviceListEntries")
    6028                            .dwattr $C$DW$593, DW_AT_TI_symbol_name("keyDeviceListEntries")
    6029                            .dwattr $C$DW$593, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6030                            .dwattr $C$DW$593, DW_AT_accessibility(DW_ACCESS_public)
    6031                            .dwattr $C$DW$593, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    6032                            .dwattr $C$DW$593, DW_AT_decl_line(0x2d2)
    6033                            .dwattr $C$DW$593, DW_AT_decl_column(0x1c)
    6034                    
    6035                    $C$DW$594       .dwtag  DW_TAG_member
    6036                            .dwattr $C$DW$594, DW_AT_type(*$C$DW$T$47)
    6037                            .dwattr $C$DW$594, DW_AT_name("keyUsageList")
    6038                            .dwattr $C$DW$594, DW_AT_TI_symbol_name("keyUsageList")
    6039                            .dwattr $C$DW$594, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6040                            .dwattr $C$DW$594, DW_AT_accessibility(DW_ACCESS_public)
    6041                            .dwattr $C$DW$594, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    6042                            .dwattr $C$DW$594, DW_AT_decl_line(0x2d4)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:30 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{44D418E8-2356-4786-AA21-8FD71E70A7F7} PAGE  111

    6043                            .dwattr $C$DW$594, DW_AT_decl_column(0x1d)
    6044                    
    6045                    $C$DW$595       .dwtag  DW_TAG_member
    6046                            .dwattr $C$DW$595, DW_AT_type(*$C$DW$T$19)
    6047                            .dwattr $C$DW$595, DW_AT_name("keyUsageListEntries")
    6048                            .dwattr $C$DW$595, DW_AT_TI_symbol_name("keyUsageListEntries")
    6049                            .dwattr $C$DW$595, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    6050                            .dwattr $C$DW$595, DW_AT_accessibility(DW_ACCESS_public)
    6051                            .dwattr $C$DW$595, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    6052                            .dwattr $C$DW$595, DW_AT_decl_line(0x2d6)
    6053                            .dwattr $C$DW$595, DW_AT_decl_column(0x1c)
    6054                    
    6055                    $C$DW$596       .dwtag  DW_TAG_member
    6056                            .dwattr $C$DW$596, DW_AT_type(*$C$DW$T$48)
    6057                            .dwattr $C$DW$596, DW_AT_name("key")
    6058                            .dwattr $C$DW$596, DW_AT_TI_symbol_name("key")
    6059                            .dwattr $C$DW$596, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    6060                            .dwattr $C$DW$596, DW_AT_accessibility(DW_ACCESS_public)
    6061                            .dwattr $C$DW$596, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    6062                            .dwattr $C$DW$596, DW_AT_decl_line(0x2d8)
    6063                            .dwattr $C$DW$596, DW_AT_decl_column(0x1c)
    6064                    
    6065                    $C$DW$597       .dwtag  DW_TAG_member
    6066                            .dwattr $C$DW$597, DW_AT_type(*$C$DW$T$28)
    6067                            .dwattr $C$DW$597, DW_AT_name("frameCounter")
    6068                            .dwattr $C$DW$597, DW_AT_TI_symbol_name("frameCounter")
    6069                            .dwattr $C$DW$597, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    6070                            .dwattr $C$DW$597, DW_AT_accessibility(DW_ACCESS_public)
    6071                            .dwattr $C$DW$597, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    6072                            .dwattr $C$DW$597, DW_AT_decl_line(0x2d9)
    6073                            .dwattr $C$DW$597, DW_AT_decl_column(0x1c)
    6074                    
    6075                            .dwattr $C$DW$T$49, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/M
    6076                            .dwattr $C$DW$T$49, DW_AT_decl_line(0x2cb)
    6077                            .dwattr $C$DW$T$49, DW_AT_decl_column(0x01)
    6078                            .dwendtag $C$DW$T$49
    6079                    
    6080                    $C$DW$T$51      .dwtag  DW_TAG_typedef
    6081                            .dwattr $C$DW$T$51, DW_AT_name("keyDescriptor_t")
    6082                            .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$49)
    6083                            .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
    6084                            .dwattr $C$DW$T$51, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/M
    6085                            .dwattr $C$DW$T$51, DW_AT_decl_line(0x2dc)
    6086                            .dwattr $C$DW$T$51, DW_AT_decl_column(0x03)
    6087                    
    6088                    $C$DW$T$52      .dwtag  DW_TAG_pointer_type
    6089                            .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$51)
    6090                            .dwattr $C$DW$T$52, DW_AT_address_class(0x20)
    6091                    
    6092                    
    6093                    $C$DW$T$250     .dwtag  DW_TAG_array_type
    6094                            .dwattr $C$DW$T$250, DW_AT_type(*$C$DW$T$51)
    6095                            .dwattr $C$DW$T$250, DW_AT_language(DW_LANG_C)
    6096                            .dwattr $C$DW$T$250, DW_AT_byte_size(0x58)
    6097                    $C$DW$598       .dwtag  DW_TAG_subrange_type
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:30 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{44D418E8-2356-4786-AA21-8FD71E70A7F7} PAGE  112

    6098                            .dwattr $C$DW$598, DW_AT_upper_bound(0x01)
    6099                    
    6100                            .dwendtag $C$DW$T$250
    6101                    
    6102                    
    6103                    $C$DW$T$57      .dwtag  DW_TAG_structure_type
    6104                            .dwattr $C$DW$T$57, DW_AT_byte_size(0x74)
    6105                    $C$DW$599       .dwtag  DW_TAG_member
    6106                            .dwattr $C$DW$599, DW_AT_type(*$C$DW$T$28)
    6107                            .dwattr $C$DW$599, DW_AT_name("timestamp")
    6108                            .dwattr $C$DW$599, DW_AT_TI_symbol_name("timestamp")
    6109                            .dwattr $C$DW$599, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6110                            .dwattr $C$DW$599, DW_AT_accessibility(DW_ACCESS_public)
    6111                            .dwattr $C$DW$599, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    6112                            .dwattr $C$DW$599, DW_AT_decl_line(0x33e)
    6113                            .dwattr $C$DW$599, DW_AT_decl_column(0x19)
    6114                    
    6115                    $C$DW$600       .dwtag  DW_TAG_member
    6116                            .dwattr $C$DW$600, DW_AT_type(*$C$DW$T$26)
    6117                            .dwattr $C$DW$600, DW_AT_name("timestamp2")
    6118                            .dwattr $C$DW$600, DW_AT_TI_symbol_name("timestamp2")
    6119                            .dwattr $C$DW$600, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6120                            .dwattr $C$DW$600, DW_AT_accessibility(DW_ACCESS_public)
    6121                            .dwattr $C$DW$600, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    6122                            .dwattr $C$DW$600, DW_AT_decl_line(0x33f)
    6123                            .dwattr $C$DW$600, DW_AT_decl_column(0x19)
    6124                    
    6125                    $C$DW$601       .dwtag  DW_TAG_member
    6126                            .dwattr $C$DW$601, DW_AT_type(*$C$DW$T$26)
    6127                            .dwattr $C$DW$601, DW_AT_name("timeToLive")
    6128                            .dwattr $C$DW$601, DW_AT_TI_symbol_name("timeToLive")
    6129                            .dwattr $C$DW$601, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6130                            .dwattr $C$DW$601, DW_AT_accessibility(DW_ACCESS_public)
    6131                            .dwattr $C$DW$601, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    6132                            .dwattr $C$DW$601, DW_AT_decl_line(0x340)
    6133                            .dwattr $C$DW$601, DW_AT_decl_column(0x19)
    6134                    
    6135                    $C$DW$602       .dwtag  DW_TAG_member
    6136                            .dwattr $C$DW$602, DW_AT_type(*$C$DW$T$19)
    6137                            .dwattr $C$DW$602, DW_AT_name("frameType")
    6138                            .dwattr $C$DW$602, DW_AT_TI_symbol_name("frameType")
    6139                            .dwattr $C$DW$602, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6140                            .dwattr $C$DW$602, DW_AT_accessibility(DW_ACCESS_public)
    6141                            .dwattr $C$DW$602, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    6142                            .dwattr $C$DW$602, DW_AT_decl_line(0x341)
    6143                            .dwattr $C$DW$602, DW_AT_decl_column(0x19)
    6144                    
    6145                    $C$DW$603       .dwtag  DW_TAG_member
    6146                            .dwattr $C$DW$603, DW_AT_type(*$C$DW$T$26)
    6147                            .dwattr $C$DW$603, DW_AT_name("txOptions")
    6148                            .dwattr $C$DW$603, DW_AT_TI_symbol_name("txOptions")
    6149                            .dwattr $C$DW$603, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6150                            .dwattr $C$DW$603, DW_AT_accessibility(DW_ACCESS_public)
    6151                            .dwattr $C$DW$603, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    6152                            .dwattr $C$DW$603, DW_AT_decl_line(0x342)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:30 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{44D418E8-2356-4786-AA21-8FD71E70A7F7} PAGE  113

    6153                            .dwattr $C$DW$603, DW_AT_decl_column(0x19)
    6154                    
    6155                    $C$DW$604       .dwtag  DW_TAG_member
    6156                            .dwattr $C$DW$604, DW_AT_type(*$C$DW$T$19)
    6157                            .dwattr $C$DW$604, DW_AT_name("txMode")
    6158                            .dwattr $C$DW$604, DW_AT_TI_symbol_name("txMode")
    6159                            .dwattr $C$DW$604, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6160                            .dwattr $C$DW$604, DW_AT_accessibility(DW_ACCESS_public)
    6161                            .dwattr $C$DW$604, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    6162                            .dwattr $C$DW$604, DW_AT_decl_line(0x343)
    6163                            .dwattr $C$DW$604, DW_AT_decl_column(0x19)
    6164                    
    6165                    $C$DW$605       .dwtag  DW_TAG_member
    6166                            .dwattr $C$DW$605, DW_AT_type(*$C$DW$T$19)
    6167                            .dwattr $C$DW$605, DW_AT_name("txSched")
    6168                            .dwattr $C$DW$605, DW_AT_TI_symbol_name("txSched")
    6169                            .dwattr $C$DW$605, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    6170                            .dwattr $C$DW$605, DW_AT_accessibility(DW_ACCESS_public)
    6171                            .dwattr $C$DW$605, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    6172                            .dwattr $C$DW$605, DW_AT_decl_line(0x344)
    6173                            .dwattr $C$DW$605, DW_AT_decl_column(0x19)
    6174                    
    6175                    $C$DW$606       .dwtag  DW_TAG_member
    6176                            .dwattr $C$DW$606, DW_AT_type(*$C$DW$T$19)
    6177                            .dwattr $C$DW$606, DW_AT_name("retries")
    6178                            .dwattr $C$DW$606, DW_AT_TI_symbol_name("retries")
    6179                            .dwattr $C$DW$606, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    6180                            .dwattr $C$DW$606, DW_AT_accessibility(DW_ACCESS_public)
    6181                            .dwattr $C$DW$606, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    6182                            .dwattr $C$DW$606, DW_AT_decl_line(0x345)
    6183                            .dwattr $C$DW$606, DW_AT_decl_column(0x19)
    6184                    
    6185                    $C$DW$607       .dwtag  DW_TAG_member
    6186                            .dwattr $C$DW$607, DW_AT_type(*$C$DW$T$19)
    6187                            .dwattr $C$DW$607, DW_AT_name("channel")
    6188                            .dwattr $C$DW$607, DW_AT_TI_symbol_name("channel")
    6189                            .dwattr $C$DW$607, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    6190                            .dwattr $C$DW$607, DW_AT_accessibility(DW_ACCESS_public)
    6191                            .dwattr $C$DW$607, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    6192                            .dwattr $C$DW$607, DW_AT_decl_line(0x346)
    6193                            .dwattr $C$DW$607, DW_AT_decl_column(0x19)
    6194                    
    6195                    $C$DW$608       .dwtag  DW_TAG_member
    6196                            .dwattr $C$DW$608, DW_AT_type(*$C$DW$T$19)
    6197                            .dwattr $C$DW$608, DW_AT_name("power")
    6198                            .dwattr $C$DW$608, DW_AT_TI_symbol_name("power")
    6199                            .dwattr $C$DW$608, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6200                            .dwattr $C$DW$608, DW_AT_accessibility(DW_ACCESS_public)
    6201                            .dwattr $C$DW$608, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    6202                            .dwattr $C$DW$608, DW_AT_decl_line(0x347)
    6203                            .dwattr $C$DW$608, DW_AT_decl_column(0x19)
    6204                    
    6205                    $C$DW$609       .dwtag  DW_TAG_member
    6206                            .dwattr $C$DW$609, DW_AT_type(*$C$DW$T$19)
    6207                            .dwattr $C$DW$609, DW_AT_name("mpduLinkQuality")
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:30 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{44D418E8-2356-4786-AA21-8FD71E70A7F7} PAGE  114

    6208                            .dwattr $C$DW$609, DW_AT_TI_symbol_name("mpduLinkQuality")
    6209                            .dwattr $C$DW$609, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    6210                            .dwattr $C$DW$609, DW_AT_accessibility(DW_ACCESS_public)
    6211                            .dwattr $C$DW$609, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    6212                            .dwattr $C$DW$609, DW_AT_decl_line(0x348)
    6213                            .dwattr $C$DW$609, DW_AT_decl_column(0x19)
    6214                    
    6215                    $C$DW$610       .dwtag  DW_TAG_member
    6216                            .dwattr $C$DW$610, DW_AT_type(*$C$DW$T$19)
    6217                            .dwattr $C$DW$610, DW_AT_name("correlation")
    6218                            .dwattr $C$DW$610, DW_AT_TI_symbol_name("correlation")
    6219                            .dwattr $C$DW$610, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    6220                            .dwattr $C$DW$610, DW_AT_accessibility(DW_ACCESS_public)
    6221                            .dwattr $C$DW$610, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    6222                            .dwattr $C$DW$610, DW_AT_decl_line(0x349)
    6223                            .dwattr $C$DW$610, DW_AT_decl_column(0x19)
    6224                    
    6225                    $C$DW$611       .dwtag  DW_TAG_member
    6226                            .dwattr $C$DW$611, DW_AT_type(*$C$DW$T$50)
    6227                            .dwattr $C$DW$611, DW_AT_name("rssi")
    6228                            .dwattr $C$DW$611, DW_AT_TI_symbol_name("rssi")
    6229                            .dwattr $C$DW$611, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    6230                            .dwattr $C$DW$611, DW_AT_accessibility(DW_ACCESS_public)
    6231                            .dwattr $C$DW$611, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    6232                            .dwattr $C$DW$611, DW_AT_decl_line(0x34a)
    6233                            .dwattr $C$DW$611, DW_AT_decl_column(0x19)
    6234                    
    6235                    $C$DW$612       .dwtag  DW_TAG_member
    6236                            .dwattr $C$DW$612, DW_AT_type(*$C$DW$T$36)
    6237                            .dwattr $C$DW$612, DW_AT_name("ptrMData")
    6238                            .dwattr $C$DW$612, DW_AT_TI_symbol_name("ptrMData")
    6239                            .dwattr $C$DW$612, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    6240                            .dwattr $C$DW$612, DW_AT_accessibility(DW_ACCESS_public)
    6241                            .dwattr $C$DW$612, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    6242                            .dwattr $C$DW$612, DW_AT_decl_line(0x34c)
    6243                            .dwattr $C$DW$612, DW_AT_decl_column(0x19)
    6244                    
    6245                    $C$DW$613       .dwtag  DW_TAG_member
    6246                            .dwattr $C$DW$613, DW_AT_type(*$C$DW$T$52)
    6247                            .dwattr $C$DW$613, DW_AT_name("pKeyDesc")
    6248                            .dwattr $C$DW$613, DW_AT_TI_symbol_name("pKeyDesc")
    6249                            .dwattr $C$DW$613, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    6250                            .dwattr $C$DW$613, DW_AT_accessibility(DW_ACCESS_public)
    6251                            .dwattr $C$DW$613, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    6252                            .dwattr $C$DW$613, DW_AT_decl_line(0x34d)
    6253                            .dwattr $C$DW$613, DW_AT_decl_column(0x19)
    6254                    
    6255                    $C$DW$614       .dwtag  DW_TAG_member
    6256                            .dwattr $C$DW$614, DW_AT_type(*$C$DW$T$28)
    6257                            .dwattr $C$DW$614, DW_AT_name("frameCntr")
    6258                            .dwattr $C$DW$614, DW_AT_TI_symbol_name("frameCntr")
    6259                            .dwattr $C$DW$614, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    6260                            .dwattr $C$DW$614, DW_AT_accessibility(DW_ACCESS_public)
    6261                            .dwattr $C$DW$614, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    6262                            .dwattr $C$DW$614, DW_AT_decl_line(0x34e)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:30 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{44D418E8-2356-4786-AA21-8FD71E70A7F7} PAGE  115

    6263                            .dwattr $C$DW$614, DW_AT_decl_column(0x19)
    6264                    
    6265                    $C$DW$615       .dwtag  DW_TAG_member
    6266                            .dwattr $C$DW$615, DW_AT_type(*$C$DW$T$54)
    6267                            .dwattr $C$DW$615, DW_AT_name("payloadIeInfo")
    6268                            .dwattr $C$DW$615, DW_AT_TI_symbol_name("payloadIeInfo")
    6269                            .dwattr $C$DW$615, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    6270                            .dwattr $C$DW$615, DW_AT_accessibility(DW_ACCESS_public)
    6271                            .dwattr $C$DW$615, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    6272                            .dwattr $C$DW$615, DW_AT_decl_line(0x350)
    6273                            .dwattr $C$DW$615, DW_AT_decl_column(0x19)
    6274                    
    6275                    $C$DW$616       .dwtag  DW_TAG_member
    6276                            .dwattr $C$DW$616, DW_AT_type(*$C$DW$T$56)
    6277                            .dwattr $C$DW$616, DW_AT_name("headerIeInfo")
    6278                            .dwattr $C$DW$616, DW_AT_TI_symbol_name("headerIeInfo")
    6279                            .dwattr $C$DW$616, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    6280                            .dwattr $C$DW$616, DW_AT_accessibility(DW_ACCESS_public)
    6281                            .dwattr $C$DW$616, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    6282                            .dwattr $C$DW$616, DW_AT_decl_line(0x351)
    6283                            .dwattr $C$DW$616, DW_AT_decl_column(0x19)
    6284                    
    6285                    $C$DW$617       .dwtag  DW_TAG_member
    6286                            .dwattr $C$DW$617, DW_AT_type(*$C$DW$T$26)
    6287                            .dwattr $C$DW$617, DW_AT_name("totalLen")
    6288                            .dwattr $C$DW$617, DW_AT_TI_symbol_name("totalLen")
    6289                            .dwattr $C$DW$617, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    6290                            .dwattr $C$DW$617, DW_AT_accessibility(DW_ACCESS_public)
    6291                            .dwattr $C$DW$617, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    6292                            .dwattr $C$DW$617, DW_AT_decl_line(0x352)
    6293                            .dwattr $C$DW$617, DW_AT_decl_column(0x19)
    6294                    
    6295                    $C$DW$618       .dwtag  DW_TAG_member
    6296                            .dwattr $C$DW$618, DW_AT_type(*$C$DW$T$36)
    6297                            .dwattr $C$DW$618, DW_AT_name("ptrHeaderIE")
    6298                            .dwattr $C$DW$618, DW_AT_TI_symbol_name("ptrHeaderIE")
    6299                            .dwattr $C$DW$618, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    6300                            .dwattr $C$DW$618, DW_AT_accessibility(DW_ACCESS_public)
    6301                            .dwattr $C$DW$618, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    6302                            .dwattr $C$DW$618, DW_AT_decl_line(0x353)
    6303                            .dwattr $C$DW$618, DW_AT_decl_column(0x19)
    6304                    
    6305                    $C$DW$619       .dwtag  DW_TAG_member
    6306                            .dwattr $C$DW$619, DW_AT_type(*$C$DW$T$26)
    6307                            .dwattr $C$DW$619, DW_AT_name("headerIesLen")
    6308                            .dwattr $C$DW$619, DW_AT_TI_symbol_name("headerIesLen")
    6309                            .dwattr $C$DW$619, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    6310                            .dwattr $C$DW$619, DW_AT_accessibility(DW_ACCESS_public)
    6311                            .dwattr $C$DW$619, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    6312                            .dwattr $C$DW$619, DW_AT_decl_line(0x354)
    6313                            .dwattr $C$DW$619, DW_AT_decl_column(0x19)
    6314                    
    6315                    $C$DW$620       .dwtag  DW_TAG_member
    6316                            .dwattr $C$DW$620, DW_AT_type(*$C$DW$T$36)
    6317                            .dwattr $C$DW$620, DW_AT_name("ptrPayloadIE")
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:30 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{44D418E8-2356-4786-AA21-8FD71E70A7F7} PAGE  116

    6318                            .dwattr $C$DW$620, DW_AT_TI_symbol_name("ptrPayloadIE")
    6319                            .dwattr $C$DW$620, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    6320                            .dwattr $C$DW$620, DW_AT_accessibility(DW_ACCESS_public)
    6321                            .dwattr $C$DW$620, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    6322                            .dwattr $C$DW$620, DW_AT_decl_line(0x355)
    6323                            .dwattr $C$DW$620, DW_AT_decl_column(0x19)
    6324                    
    6325                    $C$DW$621       .dwtag  DW_TAG_member
    6326                            .dwattr $C$DW$621, DW_AT_type(*$C$DW$T$36)
    6327                            .dwattr $C$DW$621, DW_AT_name("ptrUTIE")
    6328                            .dwattr $C$DW$621, DW_AT_TI_symbol_name("ptrUTIE")
    6329                            .dwattr $C$DW$621, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    6330                            .dwattr $C$DW$621, DW_AT_accessibility(DW_ACCESS_public)
    6331                            .dwattr $C$DW$621, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    6332                            .dwattr $C$DW$621, DW_AT_decl_line(0x356)
    6333                            .dwattr $C$DW$621, DW_AT_decl_column(0x19)
    6334                    
    6335                    $C$DW$622       .dwtag  DW_TAG_member
    6336                            .dwattr $C$DW$622, DW_AT_type(*$C$DW$T$36)
    6337                            .dwattr $C$DW$622, DW_AT_name("ptrBTIE")
    6338                            .dwattr $C$DW$622, DW_AT_TI_symbol_name("ptrBTIE")
    6339                            .dwattr $C$DW$622, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
    6340                            .dwattr $C$DW$622, DW_AT_accessibility(DW_ACCESS_public)
    6341                            .dwattr $C$DW$622, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    6342                            .dwattr $C$DW$622, DW_AT_decl_line(0x357)
    6343                            .dwattr $C$DW$622, DW_AT_decl_column(0x19)
    6344                    
    6345                    $C$DW$623       .dwtag  DW_TAG_member
    6346                            .dwattr $C$DW$623, DW_AT_type(*$C$DW$T$36)
    6347                            .dwattr $C$DW$623, DW_AT_name("ptrFrameCnt")
    6348                            .dwattr $C$DW$623, DW_AT_TI_symbol_name("ptrFrameCnt")
    6349                            .dwattr $C$DW$623, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    6350                            .dwattr $C$DW$623, DW_AT_accessibility(DW_ACCESS_public)
    6351                            .dwattr $C$DW$623, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    6352                            .dwattr $C$DW$623, DW_AT_decl_line(0x358)
    6353                            .dwattr $C$DW$623, DW_AT_decl_column(0x19)
    6354                    
    6355                    $C$DW$624       .dwtag  DW_TAG_member
    6356                            .dwattr $C$DW$624, DW_AT_type(*$C$DW$T$19)
    6357                            .dwattr $C$DW$624, DW_AT_name("rsl")
    6358                            .dwattr $C$DW$624, DW_AT_TI_symbol_name("rsl")
    6359                            .dwattr $C$DW$624, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    6360                            .dwattr $C$DW$624, DW_AT_accessibility(DW_ACCESS_public)
    6361                            .dwattr $C$DW$624, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    6362                            .dwattr $C$DW$624, DW_AT_decl_line(0x359)
    6363                            .dwattr $C$DW$624, DW_AT_decl_column(0x19)
    6364                    
    6365                    $C$DW$625       .dwtag  DW_TAG_member
    6366                            .dwattr $C$DW$625, DW_AT_type(*$C$DW$T$19)
    6367                            .dwattr $C$DW$625, DW_AT_name("nb")
    6368                            .dwattr $C$DW$625, DW_AT_TI_symbol_name("nb")
    6369                            .dwattr $C$DW$625, DW_AT_data_member_location[DW_OP_plus_uconst 0x5d]
    6370                            .dwattr $C$DW$625, DW_AT_accessibility(DW_ACCESS_public)
    6371                            .dwattr $C$DW$625, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    6372                            .dwattr $C$DW$625, DW_AT_decl_line(0x35a)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:30 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{44D418E8-2356-4786-AA21-8FD71E70A7F7} PAGE  117

    6373                            .dwattr $C$DW$625, DW_AT_decl_column(0x19)
    6374                    
    6375                    $C$DW$626       .dwtag  DW_TAG_member
    6376                            .dwattr $C$DW$626, DW_AT_type(*$C$DW$T$19)
    6377                            .dwattr $C$DW$626, DW_AT_name("be")
    6378                            .dwattr $C$DW$626, DW_AT_TI_symbol_name("be")
    6379                            .dwattr $C$DW$626, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    6380                            .dwattr $C$DW$626, DW_AT_accessibility(DW_ACCESS_public)
    6381                            .dwattr $C$DW$626, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    6382                            .dwattr $C$DW$626, DW_AT_decl_line(0x35b)
    6383                            .dwattr $C$DW$626, DW_AT_decl_column(0x19)
    6384                    
    6385                    $C$DW$627       .dwtag  DW_TAG_member
    6386                            .dwattr $C$DW$627, DW_AT_type(*$C$DW$T$19)
    6387                            .dwattr $C$DW$627, DW_AT_name("fhFrameType")
    6388                            .dwattr $C$DW$627, DW_AT_TI_symbol_name("fhFrameType")
    6389                            .dwattr $C$DW$627, DW_AT_data_member_location[DW_OP_plus_uconst 0x5f]
    6390                            .dwattr $C$DW$627, DW_AT_accessibility(DW_ACCESS_public)
    6391                            .dwattr $C$DW$627, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    6392                            .dwattr $C$DW$627, DW_AT_decl_line(0x35c)
    6393                            .dwattr $C$DW$627, DW_AT_decl_column(0x19)
    6394                    
    6395                    $C$DW$628       .dwtag  DW_TAG_member
    6396                            .dwattr $C$DW$628, DW_AT_type(*$C$DW$T$273)
    6397                            .dwattr $C$DW$628, DW_AT_name("dest")
    6398                            .dwattr $C$DW$628, DW_AT_TI_symbol_name("dest")
    6399                            .dwattr $C$DW$628, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    6400                            .dwattr $C$DW$628, DW_AT_accessibility(DW_ACCESS_public)
    6401                            .dwattr $C$DW$628, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    6402                            .dwattr $C$DW$628, DW_AT_decl_line(0x367)
    6403                            .dwattr $C$DW$628, DW_AT_decl_column(0x05)
    6404                    
    6405                            .dwattr $C$DW$T$57, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/M
    6406                            .dwattr $C$DW$T$57, DW_AT_decl_line(0x33d)
    6407                            .dwattr $C$DW$T$57, DW_AT_decl_column(0x01)
    6408                            .dwendtag $C$DW$T$57
    6409                    
    6410                    $C$DW$T$59      .dwtag  DW_TAG_typedef
    6411                            .dwattr $C$DW$T$59, DW_AT_name("macTxIntData_t")
    6412                            .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$57)
    6413                            .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
    6414                            .dwattr $C$DW$T$59, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/M
    6415                            .dwattr $C$DW$T$59, DW_AT_decl_line(0x368)
    6416                            .dwattr $C$DW$T$59, DW_AT_decl_column(0x03)
    6417                    
    6418                    
    6419                    $C$DW$T$60      .dwtag  DW_TAG_structure_type
    6420                            .dwattr $C$DW$T$60, DW_AT_byte_size(0xa0)
    6421                    $C$DW$629       .dwtag  DW_TAG_member
    6422                            .dwattr $C$DW$629, DW_AT_type(*$C$DW$T$34)
    6423                            .dwattr $C$DW$629, DW_AT_name("hdr")
    6424                            .dwattr $C$DW$629, DW_AT_TI_symbol_name("hdr")
    6425                            .dwattr $C$DW$629, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6426                            .dwattr $C$DW$629, DW_AT_accessibility(DW_ACCESS_public)
    6427                            .dwattr $C$DW$629, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
