TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:33 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{B7878DB6-863A-4C28-A009-988D30102D8B} PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                        PC v16.9.4.LTS *
       3                    ;* Date/Time created: Sat Nov 18 18:46:31 2017                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../Application/Services/nvoctp.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v16.9.4.LTS Copyright (c) 1996-20
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Kevin\workspace_v7\sensor_cc1310lp\sensor_cc1310lp"
      13                    
      14                    $C$DW$1 .dwtag  DW_TAG_subprogram

    6368                    
    6369                    $C$DW$T$664     .dwtag  DW_TAG_typedef
    6370                            .dwattr $C$DW$T$664, DW_AT_name("tFlashStateCommandsType")
    6371                            .dwattr $C$DW$T$664, DW_AT_type(*$C$DW$T$663)
    6372                            .dwattr $C$DW$T$664, DW_AT_language(DW_LANG_C)
    6373                            .dwattr $C$DW$T$664, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices
    6374                            .dwattr $C$DW$T$664, DW_AT_decl_line(0xb0)
    6375                            .dwattr $C$DW$T$664, DW_AT_decl_column(0x03)
    6376                    
    6377                    
    6378                    $C$DW$T$665     .dwtag  DW_TAG_enumeration_type
    6379                            .dwattr $C$DW$T$665, DW_AT_byte_size(0x01)
    6380                    $C$DW$415       .dwtag  DW_TAG_enumerator
    6381                            .dwattr $C$DW$415, DW_AT_name("ICALL_RTI_APP_CMD_EVENT")
    6382                            .dwattr $C$DW$415, DW_AT_const_value(0xe0)
    6383                            .dwattr $C$DW$415, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    6384                            .dwattr $C$DW$415, DW_AT_decl_line(0x3de)
    6385                            .dwattr $C$DW$415, DW_AT_decl_column(0x04)
    6386                    
    6387                    $C$DW$416       .dwtag  DW_TAG_enumerator
    6388                            .dwattr $C$DW$416, DW_AT_name("ICALL_RTI_STACK_CMD_EVENT")
    6389                            .dwattr $C$DW$416, DW_AT_const_value(0xe1)
    6390                            .dwattr $C$DW$416, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    6391                            .dwattr $C$DW$416, DW_AT_decl_line(0x3e0)
    6392                            .dwattr $C$DW$416, DW_AT_decl_column(0x04)
    6393                    
    6394                    $C$DW$417       .dwtag  DW_TAG_enumerator
    6395                            .dwattr $C$DW$417, DW_AT_name("ICALL_RTI_APP_ASYNC_CMD_EVENT")
    6396                            .dwattr $C$DW$417, DW_AT_const_value(0xe2)
    6397                            .dwattr $C$DW$417, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    6398                            .dwattr $C$DW$417, DW_AT_decl_line(0x3e2)
    6399                            .dwattr $C$DW$417, DW_AT_decl_column(0x04)
    6400                    
    6401                    $C$DW$418       .dwtag  DW_TAG_enumerator
    6402                            .dwattr $C$DW$418, DW_AT_name("ICALL_RTI_APP_SYNC_CMD_EVENT")
    6403                            .dwattr $C$DW$418, DW_AT_const_value(0xe3)
    6404                            .dwattr $C$DW$418, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    6405                            .dwattr $C$DW$418, DW_AT_decl_line(0x3e4)
    6406                            .dwattr $C$DW$418, DW_AT_decl_column(0x04)
    6407                    
    6408                    $C$DW$419       .dwtag  DW_TAG_enumerator
    6409                            .dwattr $C$DW$419, DW_AT_name("ICALL_RCN_APP_ASYNC_CMD_EVENT")
    6410                            .dwattr $C$DW$419, DW_AT_const_value(0xe4)
    6411                            .dwattr $C$DW$419, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    6412                            .dwattr $C$DW$419, DW_AT_decl_line(0x3e6)
    6413                            .dwattr $C$DW$419, DW_AT_decl_column(0x04)
    6414                    
    6415                    $C$DW$420       .dwtag  DW_TAG_enumerator
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:33 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{B7878DB6-863A-4C28-A009-988D30102D8B} PAGE  118

    6416                            .dwattr $C$DW$420, DW_AT_name("ICALL_RCN_APP_SYNC_CMD_EVENT")
    6417                            .dwattr $C$DW$420, DW_AT_const_value(0xe5)
    6418                            .dwattr $C$DW$420, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    6419                            .dwattr $C$DW$420, DW_AT_decl_line(0x3e8)
    6420                            .dwattr $C$DW$420, DW_AT_decl_column(0x04)
    6421                    
    6422                            .dwattr $C$DW$T$665, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154st
    6423                            .dwattr $C$DW$T$665, DW_AT_decl_line(0x3dc)
    6424                            .dwattr $C$DW$T$665, DW_AT_decl_column(0x01)
    6425                            .dwendtag $C$DW$T$665
    6426                    
    6427                    $C$DW$T$666     .dwtag  DW_TAG_typedef
    6428                            .dwattr $C$DW$T$666, DW_AT_name("ICall_RemotiCmdEvent_t")
    6429                            .dwattr $C$DW$T$666, DW_AT_type(*$C$DW$T$665)
    6430                            .dwattr $C$DW$T$666, DW_AT_language(DW_LANG_C)
    6431                            .dwattr $C$DW$T$666, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154st
    6432                            .dwattr $C$DW$T$666, DW_AT_decl_line(0x3e9)
    6433                            .dwattr $C$DW$T$666, DW_AT_decl_column(0x02)
    6434                    
    6435                    
    6436                    $C$DW$T$127     .dwtag  DW_TAG_structure_type
    6437                            .dwattr $C$DW$T$127, DW_AT_byte_size(0x10)
    6438                    $C$DW$421       .dwtag  DW_TAG_member
    6439                            .dwattr $C$DW$421, DW_AT_type(*$C$DW$T$124)
    6440                            .dwattr $C$DW$421, DW_AT_name("cmpid")
    6441                            .dwattr $C$DW$421, DW_AT_TI_symbol_name("cmpid")
    6442                            .dwattr $C$DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6443                            .dwattr $C$DW$421, DW_AT_accessibility(DW_ACCESS_public)
    6444                            .dwattr $C$DW$421, DW_AT_decl_file("../Application/Services/nvoctp.c")
    6445                            .dwattr $C$DW$421, DW_AT_decl_line(0xdc)
    6446                            .dwattr $C$DW$421, DW_AT_decl_column(0x0e)
    6447                    
    6448                    $C$DW$422       .dwtag  DW_TAG_member
    6449                            .dwattr $C$DW$422, DW_AT_type(*$C$DW$T$125)
    6450                            .dwattr $C$DW$422, DW_AT_name("subid")
    6451                            .dwattr $C$DW$422, DW_AT_TI_symbol_name("subid")
    6452                            .dwattr $C$DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6453                            .dwattr $C$DW$422, DW_AT_accessibility(DW_ACCESS_public)
    6454                            .dwattr $C$DW$422, DW_AT_decl_file("../Application/Services/nvoctp.c")
    6455                            .dwattr $C$DW$422, DW_AT_decl_line(0xdd)
    6456                            .dwattr $C$DW$422, DW_AT_decl_column(0x0e)
    6457                    
    6458                    $C$DW$423       .dwtag  DW_TAG_member
    6459                            .dwattr $C$DW$423, DW_AT_type(*$C$DW$T$125)
    6460                            .dwattr $C$DW$423, DW_AT_name("itmid")
    6461                            .dwattr $C$DW$423, DW_AT_TI_symbol_name("itmid")
    6462                            .dwattr $C$DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6463                            .dwattr $C$DW$423, DW_AT_accessibility(DW_ACCESS_public)
    6464                            .dwattr $C$DW$423, DW_AT_decl_file("../Application/Services/nvoctp.c")
    6465                            .dwattr $C$DW$423, DW_AT_decl_line(0xde)
    6466                            .dwattr $C$DW$423, DW_AT_decl_column(0x0e)
    6467                    
    6468                    $C$DW$424       .dwtag  DW_TAG_member
    6469                            .dwattr $C$DW$424, DW_AT_type(*$C$DW$T$126)
    6470                            .dwattr $C$DW$424, DW_AT_name("sysid")
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:33 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{B7878DB6-863A-4C28-A009-988D30102D8B} PAGE  119

    6471                            .dwattr $C$DW$424, DW_AT_TI_symbol_name("sysid")
    6472                            .dwattr $C$DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6473                            .dwattr $C$DW$424, DW_AT_accessibility(DW_ACCESS_public)
    6474                            .dwattr $C$DW$424, DW_AT_decl_file("../Application/Services/nvoctp.c")
    6475                            .dwattr $C$DW$424, DW_AT_decl_line(0xdf)
    6476                            .dwattr $C$DW$424, DW_AT_decl_column(0x0e)
    6477                    
    6478                    $C$DW$425       .dwtag  DW_TAG_member
    6479                            .dwattr $C$DW$425, DW_AT_type(*$C$DW$T$126)
    6480                            .dwattr $C$DW$425, DW_AT_name("stats")
    6481                            .dwattr $C$DW$425, DW_AT_TI_symbol_name("stats")
    6482                            .dwattr $C$DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    6483                            .dwattr $C$DW$425, DW_AT_accessibility(DW_ACCESS_public)
    6484                            .dwattr $C$DW$425, DW_AT_decl_file("../Application/Services/nvoctp.c")
    6485                            .dwattr $C$DW$425, DW_AT_decl_line(0xe0)
    6486                            .dwattr $C$DW$425, DW_AT_decl_column(0x0e)
    6487                    
    6488                    $C$DW$426       .dwtag  DW_TAG_member
    6489                            .dwattr $C$DW$426, DW_AT_type(*$C$DW$T$125)
    6490                            .dwattr $C$DW$426, DW_AT_name("hofs")
    6491                            .dwattr $C$DW$426, DW_AT_TI_symbol_name("hofs")
    6492                            .dwattr $C$DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6493                            .dwattr $C$DW$426, DW_AT_accessibility(DW_ACCESS_public)
    6494                            .dwattr $C$DW$426, DW_AT_decl_file("../Application/Services/nvoctp.c")
    6495                            .dwattr $C$DW$426, DW_AT_decl_line(0xe1)
    6496                            .dwattr $C$DW$426, DW_AT_decl_column(0x0e)
    6497                    
    6498                    $C$DW$427       .dwtag  DW_TAG_member
    6499                            .dwattr $C$DW$427, DW_AT_type(*$C$DW$T$125)
    6500                            .dwattr $C$DW$427, DW_AT_name("len")
    6501                            .dwattr $C$DW$427, DW_AT_TI_symbol_name("len")
    6502                            .dwattr $C$DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6503                            .dwattr $C$DW$427, DW_AT_accessibility(DW_ACCESS_public)
    6504                            .dwattr $C$DW$427, DW_AT_decl_file("../Application/Services/nvoctp.c")
    6505                            .dwattr $C$DW$427, DW_AT_decl_line(0xe2)
    6506                            .dwattr $C$DW$427, DW_AT_decl_column(0x0e)
    6507                    
    6508                            .dwattr $C$DW$T$127, DW_AT_decl_file("../Application/Services/nvoctp.c")
    6509                            .dwattr $C$DW$T$127, DW_AT_decl_line(0xdb)
    6510                            .dwattr $C$DW$T$127, DW_AT_decl_column(0x01)
    6511                            .dwendtag $C$DW$T$127
    6512                    
    6513                    $C$DW$T$128     .dwtag  DW_TAG_typedef
    6514                            .dwattr $C$DW$T$128, DW_AT_name("NVOCTP_itemHdr_t")
    6515                            .dwattr $C$DW$T$128, DW_AT_type(*$C$DW$T$127)
    6516                            .dwattr $C$DW$T$128, DW_AT_language(DW_LANG_C)
    6517                            .dwattr $C$DW$T$128, DW_AT_decl_file("../Application/Services/nvoctp.c")
    6518                            .dwattr $C$DW$T$128, DW_AT_decl_line(0xe3)
    6519                            .dwattr $C$DW$T$128, DW_AT_decl_column(0x03)
    6520                    
    6521                    $C$DW$T$129     .dwtag  DW_TAG_pointer_type
    6522                            .dwattr $C$DW$T$129, DW_AT_type(*$C$DW$T$128)
    6523                            .dwattr $C$DW$T$129, DW_AT_address_class(0x20)
    6524                    
    6525                    $C$DW$T$667     .dwtag  DW_TAG_const_type
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:33 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{B7878DB6-863A-4C28-A009-988D30102D8B} PAGE  120

    6526                            .dwattr $C$DW$T$667, DW_AT_type(*$C$DW$T$129)
    6527                    
    6528                    
    6529                    $C$DW$T$131     .dwtag  DW_TAG_structure_type
    6530                            .dwattr $C$DW$T$131, DW_AT_byte_size(0x10)
    6531                    $C$DW$428       .dwtag  DW_TAG_member
    6532                            .dwattr $C$DW$428, DW_AT_type(*$C$DW$T$129)
    6533                            .dwattr $C$DW$428, DW_AT_name("iHdr")
    6534                            .dwattr $C$DW$428, DW_AT_TI_symbol_name("iHdr")
    6535                            .dwattr $C$DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6536                            .dwattr $C$DW$428, DW_AT_accessibility(DW_ACCESS_public)
    6537                            .dwattr $C$DW$428, DW_AT_decl_file("../Application/Services/nvoctp.c")
    6538                            .dwattr $C$DW$428, DW_AT_decl_line(0x109)
    6539                            .dwattr $C$DW$428, DW_AT_decl_column(0x17)
    6540                    
    6541                    $C$DW$429       .dwtag  DW_TAG_member
    6542                            .dwattr $C$DW$429, DW_AT_type(*$C$DW$T$125)
    6543                            .dwattr $C$DW$429, DW_AT_name("dOfs")
    6544                            .dwattr $C$DW$429, DW_AT_TI_symbol_name("dOfs")
    6545                            .dwattr $C$DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6546                            .dwattr $C$DW$429, DW_AT_accessibility(DW_ACCESS_public)
    6547                            .dwattr $C$DW$429, DW_AT_decl_file("../Application/Services/nvoctp.c")
    6548                            .dwattr $C$DW$429, DW_AT_decl_line(0x10a)
    6549                            .dwattr $C$DW$429, DW_AT_decl_column(0x17)
    6550                    
    6551                    $C$DW$430       .dwtag  DW_TAG_member
    6552                            .dwattr $C$DW$430, DW_AT_type(*$C$DW$T$125)
    6553                            .dwattr $C$DW$430, DW_AT_name("bOfs")
    6554                            .dwattr $C$DW$430, DW_AT_TI_symbol_name("bOfs")
    6555                            .dwattr $C$DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6556                            .dwattr $C$DW$430, DW_AT_accessibility(DW_ACCESS_public)
    6557                            .dwattr $C$DW$430, DW_AT_decl_file("../Application/Services/nvoctp.c")
    6558                            .dwattr $C$DW$430, DW_AT_decl_line(0x10b)
    6559                            .dwattr $C$DW$430, DW_AT_decl_column(0x17)
    6560                    
    6561                    $C$DW$431       .dwtag  DW_TAG_member
    6562                            .dwattr $C$DW$431, DW_AT_type(*$C$DW$T$125)
    6563                            .dwattr $C$DW$431, DW_AT_name("bLen")
    6564                            .dwattr $C$DW$431, DW_AT_TI_symbol_name("bLen")
    6565                            .dwattr $C$DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6566                            .dwattr $C$DW$431, DW_AT_accessibility(DW_ACCESS_public)
    6567                            .dwattr $C$DW$431, DW_AT_decl_file("../Application/Services/nvoctp.c")
    6568                            .dwattr $C$DW$431, DW_AT_decl_line(0x10c)
    6569                            .dwattr $C$DW$431, DW_AT_decl_column(0x17)
    6570                    
    6571                    $C$DW$432       .dwtag  DW_TAG_member
    6572                            .dwattr $C$DW$432, DW_AT_type(*$C$DW$T$130)
    6573                            .dwattr $C$DW$432, DW_AT_name("pBuf")
    6574                            .dwattr $C$DW$432, DW_AT_TI_symbol_name("pBuf")
    6575                            .dwattr $C$DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6576                            .dwattr $C$DW$432, DW_AT_accessibility(DW_ACCESS_public)
    6577                            .dwattr $C$DW$432, DW_AT_decl_file("../Application/Services/nvoctp.c")
    6578                            .dwattr $C$DW$432, DW_AT_decl_line(0x10d)
    6579                            .dwattr $C$DW$432, DW_AT_decl_column(0x17)
    6580                    
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:33 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{B7878DB6-863A-4C28-A009-988D30102D8B} PAGE  121

    6581                            .dwattr $C$DW$T$131, DW_AT_decl_file("../Application/Services/nvoctp.c")
    6582                            .dwattr $C$DW$T$131, DW_AT_decl_line(0x108)
    6583                            .dwattr $C$DW$T$131, DW_AT_decl_column(0x01)
    6584                            .dwendtag $C$DW$T$131
    6585                    
    6586                    $C$DW$T$671     .dwtag  DW_TAG_typedef
    6587                            .dwattr $C$DW$T$671, DW_AT_name("NVOCTP_itemWrp_t")
    6588                            .dwattr $C$DW$T$671, DW_AT_type(*$C$DW$T$131)
    6589                            .dwattr $C$DW$T$671, DW_AT_language(DW_LANG_C)
    6590                            .dwattr $C$DW$T$671, DW_AT_decl_file("../Application/Services/nvoctp.c")
    6591                            .dwattr $C$DW$T$671, DW_AT_decl_line(0x10e)
    6592                            .dwattr $C$DW$T$671, DW_AT_decl_column(0x03)
    6593                    
    6594                    $C$DW$T$672     .dwtag  DW_TAG_pointer_type
    6595                            .dwattr $C$DW$T$672, DW_AT_type(*$C$DW$T$671)
    6596                            .dwattr $C$DW$T$672, DW_AT_address_class(0x20)
    6597                    
    6598                    $C$DW$T$673     .dwtag  DW_TAG_const_type
    6599                            .dwattr $C$DW$T$673, DW_AT_type(*$C$DW$T$672)
    6600                    
    6601                    
    6602                    $C$DW$T$132     .dwtag  DW_TAG_structure_type
    6603                            .dwattr $C$DW$T$132, DW_AT_byte_size(0x04)
    6604                    $C$DW$433       .dwtag  DW_TAG_member
    6605                            .dwattr $C$DW$433, DW_AT_type(*$C$DW$T$126)
    6606                            .dwattr $C$DW$433, DW_AT_name("state")
    6607                            .dwattr $C$DW$433, DW_AT_TI_symbol_name("state")
    6608                            .dwattr $C$DW$433, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6609                            .dwattr $C$DW$433, DW_AT_accessibility(DW_ACCESS_public)
    6610                            .dwattr $C$DW$433, DW_AT_decl_file("../Application/Services/nvoctp.c")
    6611                            .dwattr $C$DW$433, DW_AT_decl_line(0xb6)
    6612                            .dwattr $C$DW$433, DW_AT_decl_column(0x0d)
    6613                    
    6614                    $C$DW$434       .dwtag  DW_TAG_member
    6615                            .dwattr $C$DW$434, DW_AT_type(*$C$DW$T$126)
    6616                            .dwattr $C$DW$434, DW_AT_name("cycle")
    6617                            .dwattr $C$DW$434, DW_AT_TI_symbol_name("cycle")
    6618                            .dwattr $C$DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6619                            .dwattr $C$DW$434, DW_AT_accessibility(DW_ACCESS_public)
    6620                            .dwattr $C$DW$434, DW_AT_decl_file("../Application/Services/nvoctp.c")
    6621                            .dwattr $C$DW$434, DW_AT_decl_line(0xb7)
    6622                            .dwattr $C$DW$434, DW_AT_decl_column(0x0d)
    6623                    
    6624                    $C$DW$435       .dwtag  DW_TAG_member
    6625                            .dwattr $C$DW$435, DW_AT_type(*$C$DW$T$126)
    6626                            .dwattr $C$DW$435, DW_AT_name("version")
    6627                            .dwattr $C$DW$435, DW_AT_TI_symbol_name("version")
    6628                            .dwattr $C$DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6629                            .dwattr $C$DW$435, DW_AT_accessibility(DW_ACCESS_public)
    6630                            .dwattr $C$DW$435, DW_AT_decl_file("../Application/Services/nvoctp.c")
    6631                            .dwattr $C$DW$435, DW_AT_decl_line(0xb8)
    6632                            .dwattr $C$DW$435, DW_AT_decl_column(0x0d)
    6633                    
    6634                    $C$DW$436       .dwtag  DW_TAG_member
    6635                            .dwattr $C$DW$436, DW_AT_type(*$C$DW$T$126)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:33 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{B7878DB6-863A-4C28-A009-988D30102D8B} PAGE  122

    6636                            .dwattr $C$DW$436, DW_AT_name("signature")
    6637                            .dwattr $C$DW$436, DW_AT_TI_symbol_name("signature")
    6638                            .dwattr $C$DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    6639                            .dwattr $C$DW$436, DW_AT_accessibility(DW_ACCESS_public)
    6640                            .dwattr $C$DW$436, DW_AT_decl_file("../Application/Services/nvoctp.c")
    6641                            .dwattr $C$DW$436, DW_AT_decl_line(0xb9)
    6642                            .dwattr $C$DW$436, DW_AT_decl_column(0x0d)
    6643                    
    6644                            .dwattr $C$DW$T$132, DW_AT_decl_file("../Application/Services/nvoctp.c")
    6645                            .dwattr $C$DW$T$132, DW_AT_decl_line(0xb5)
    6646                            .dwattr $C$DW$T$132, DW_AT_decl_column(0x01)
    6647                            .dwendtag $C$DW$T$132
    6648                    
    6649                    $C$DW$T$676     .dwtag  DW_TAG_typedef
    6650                            .dwattr $C$DW$T$676, DW_AT_name("NVOCTP_pageHdr_t")
    6651                            .dwattr $C$DW$T$676, DW_AT_type(*$C$DW$T$132)
    6652                            .dwattr $C$DW$T$676, DW_AT_language(DW_LANG_C)
    6653                            .dwattr $C$DW$T$676, DW_AT_decl_file("../Application/Services/nvoctp.c")
    6654                            .dwattr $C$DW$T$676, DW_AT_decl_line(0xba)
    6655                            .dwattr $C$DW$T$676, DW_AT_decl_column(0x03)
    6656                    
    6657                    
    6658                    $C$DW$T$133     .dwtag  DW_TAG_structure_type
    6659                            .dwattr $C$DW$T$133, DW_AT_byte_size(0x0c)
    6660                    $C$DW$437       .dwtag  DW_TAG_member
    6661                            .dwattr $C$DW$437, DW_AT_type(*$C$DW$T$124)
    6662                            .dwattr $C$DW$437, DW_AT_name("compacts")
    6663                            .dwattr $C$DW$437, DW_AT_TI_symbol_name("compacts")
    6664                            .dwattr $C$DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6665                            .dwattr $C$DW$437, DW_AT_accessibility(DW_ACCESS_public)
    6666                            .dwattr $C$DW$437, DW_AT_decl_file("..\Application\Services\nvoctp.h")
    6667                            .dwattr $C$DW$437, DW_AT_decl_line(0x46)
    6668                            .dwattr $C$DW$437, DW_AT_decl_column(0x0e)
    6669                    
    6670                    $C$DW$438       .dwtag  DW_TAG_member
    6671                            .dwattr $C$DW$438, DW_AT_type(*$C$DW$T$125)
    6672                            .dwattr $C$DW$438, DW_AT_name("resets")
    6673                            .dwattr $C$DW$438, DW_AT_TI_symbol_name("resets")
    6674                            .dwattr $C$DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6675                            .dwattr $C$DW$438, DW_AT_accessibility(DW_ACCESS_public)
    6676                            .dwattr $C$DW$438, DW_AT_decl_file("..\Application\Services\nvoctp.h")
    6677                            .dwattr $C$DW$438, DW_AT_decl_line(0x47)
    6678                            .dwattr $C$DW$438, DW_AT_decl_column(0x0e)
    6679                    
    6680                    $C$DW$439       .dwtag  DW_TAG_member
    6681                            .dwattr $C$DW$439, DW_AT_type(*$C$DW$T$125)
    6682                            .dwattr $C$DW$439, DW_AT_name("available")
    6683                            .dwattr $C$DW$439, DW_AT_TI_symbol_name("available")
    6684                            .dwattr $C$DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6685                            .dwattr $C$DW$439, DW_AT_accessibility(DW_ACCESS_public)
    6686                            .dwattr $C$DW$439, DW_AT_decl_file("..\Application\Services\nvoctp.h")
    6687                            .dwattr $C$DW$439, DW_AT_decl_line(0x48)
    6688                            .dwattr $C$DW$439, DW_AT_decl_column(0x0e)
    6689                    
    6690                    $C$DW$440       .dwtag  DW_TAG_member
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:33 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{B7878DB6-863A-4C28-A009-988D30102D8B} PAGE  123

    6691                            .dwattr $C$DW$440, DW_AT_type(*$C$DW$T$125)
    6692                            .dwattr $C$DW$440, DW_AT_name("active")
    6693                            .dwattr $C$DW$440, DW_AT_TI_symbol_name("active")
    6694                            .dwattr $C$DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6695                            .dwattr $C$DW$440, DW_AT_accessibility(DW_ACCESS_public)
    6696                            .dwattr $C$DW$440, DW_AT_decl_file("..\Application\Services\nvoctp.h")
    6697                            .dwattr $C$DW$440, DW_AT_decl_line(0x49)
    6698                            .dwattr $C$DW$440, DW_AT_decl_column(0x0e)
    6699                    
    6700                    $C$DW$441       .dwtag  DW_TAG_member
    6701                            .dwattr $C$DW$441, DW_AT_type(*$C$DW$T$125)
    6702                            .dwattr $C$DW$441, DW_AT_name("reserved")
    6703                            .dwattr $C$DW$441, DW_AT_TI_symbol_name("reserved")
    6704                            .dwattr $C$DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6705                            .dwattr $C$DW$441, DW_AT_accessibility(DW_ACCESS_public)
    6706                            .dwattr $C$DW$441, DW_AT_decl_file("..\Application\Services\nvoctp.h")
    6707                            .dwattr $C$DW$441, DW_AT_decl_line(0x4a)
    6708                            .dwattr $C$DW$441, DW_AT_decl_column(0x0e)
    6709                    
    6710                            .dwattr $C$DW$T$133, DW_AT_decl_file("..\Application\Services\nvoctp.h")
    6711                            .dwattr $C$DW$T$133, DW_AT_decl_line(0x45)
    6712                            .dwattr $C$DW$T$133, DW_AT_decl_column(0x01)
    6713                            .dwendtag $C$DW$T$133
    6714                    
    6715                    $C$DW$T$677     .dwtag  DW_TAG_typedef
    6716                            .dwattr $C$DW$T$677, DW_AT_name("NVOCTP_diag_t")
    6717                            .dwattr $C$DW$T$677, DW_AT_type(*$C$DW$T$133)
    6718                            .dwattr $C$DW$T$677, DW_AT_language(DW_LANG_C)
    6719                            .dwattr $C$DW$T$677, DW_AT_decl_file("..\Application\Services\nvoctp.h")
    6720                            .dwattr $C$DW$T$677, DW_AT_decl_line(0x4c)
    6721                            .dwattr $C$DW$T$677, DW_AT_decl_column(0x01)
    6722                    
    6723                    
    6724                    $C$DW$T$136     .dwtag  DW_TAG_structure_type
    6725                            .dwattr $C$DW$T$136, DW_AT_byte_size(0x08)
    6726                    $C$DW$442       .dwtag  DW_TAG_member
    6727                            .dwattr $C$DW$442, DW_AT_type(*$C$DW$T$10)
    6728                            .dwattr $C$DW$442, DW_AT_name("length")
    6729                            .dwattr $C$DW$442, DW_AT_TI_symbol_name("length")
    6730                            .dwattr $C$DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6731                            .dwattr $C$DW$442, DW_AT_accessibility(DW_ACCESS_public)
    6732                            .dwattr $C$DW$442, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/kernel/tirtos/packa
    6733                            .dwattr $C$DW$442, DW_AT_decl_line(0x165)
    6734                            .dwattr $C$DW$442, DW_AT_decl_column(0x16)
    6735                    
    6736                    $C$DW$443       .dwtag  DW_TAG_member
    6737                            .dwattr $C$DW$443, DW_AT_type(*$C$DW$T$135)
    6738                            .dwattr $C$DW$443, DW_AT_name("elem")
    6739                            .dwattr $C$DW$443, DW_AT_TI_symbol_name("elem")
    6740                            .dwattr $C$DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6741                            .dwattr $C$DW$443, DW_AT_accessibility(DW_ACCESS_public)
    6742                            .dwattr $C$DW$443, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/kernel/tirtos/packa
    6743                            .dwattr $C$DW$443, DW_AT_decl_line(0x165)
    6744                            .dwattr $C$DW$443, DW_AT_decl_column(0x3a)
    6745                    
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:33 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{B7878DB6-863A-4C28-A009-988D30102D8B} PAGE  124

    6746                            .dwattr $C$DW$T$136, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/kernel/tirtos/pac
    6747                            .dwattr $C$DW$T$136, DW_AT_decl_line(0x165)
    6748                            .dwattr $C$DW$T$136, DW_AT_decl_column(0x10)
    6749                            .dwendtag $C$DW$T$136
    6750                    
    6751                    $C$DW$T$678     .dwtag  DW_TAG_typedef
    6752                            .dwattr $C$DW$T$678, DW_AT_name("__ARRAY1_ti_sysbios_knl_Swi_hooks")
    6753                            .dwattr $C$DW$T$678, DW_AT_type(*$C$DW$T$136)
    6754                            .dwattr $C$DW$T$678, DW_AT_language(DW_LANG_C)
    6755                            .dwattr $C$DW$T$678, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/kernel/tirtos/pac
    6756                            .dwattr $C$DW$T$678, DW_AT_decl_line(0x165)
    6757                            .dwattr $C$DW$T$678, DW_AT_decl_column(0x42)
    6758                    
    6759                    
    6760                    $C$DW$T$139     .dwtag  DW_TAG_structure_type
    6761                            .dwattr $C$DW$T$139, DW_AT_byte_size(0x08)
    6762                    $C$DW$444       .dwtag  DW_TAG_member
    6763                            .dwattr $C$DW$444, DW_AT_type(*$C$DW$T$10)
    6764                            .dwattr $C$DW$444, DW_AT_name("length")
    6765                            .dwattr $C$DW$444, DW_AT_TI_symbol_name("length")
    6766                            .dwattr $C$DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6767                            .dwattr $C$DW$444, DW_AT_accessibility(DW_ACCESS_public)
    6768                            .dwattr $C$DW$444, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/kernel/tirtos/packa
    6769                            .dwattr $C$DW$444, DW_AT_decl_line(0x166)
    6770                            .dwattr $C$DW$444, DW_AT_decl_column(0x16)
    6771                    
    6772                    $C$DW$445       .dwtag  DW_TAG_member
    6773                            .dwattr $C$DW$445, DW_AT_type(*$C$DW$T$138)
    6774                            .dwattr $C$DW$445, DW_AT_name("elem")
    6775                            .dwattr $C$DW$445, DW_AT_TI_symbol_name("elem")
    6776                            .dwattr $C$DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6777                            .dwattr $C$DW$445, DW_AT_accessibility(DW_ACCESS_public)
    6778                            .dwattr $C$DW$445, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/kernel/tirtos/packa
    6779                            .dwattr $C$DW$445, DW_AT_decl_line(0x166)
    6780                            .dwattr $C$DW$445, DW_AT_decl_column(0x40)
    6781                    
    6782                            .dwattr $C$DW$T$139, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/kernel/tirtos/pac
    6783                            .dwattr $C$DW$T$139, DW_AT_decl_line(0x166)
    6784                            .dwattr $C$DW$T$139, DW_AT_decl_column(0x10)
    6785                            .dwendtag $C$DW$T$139
    6786                    
    6787                    $C$DW$T$679     .dwtag  DW_TAG_typedef
    6788                            .dwattr $C$DW$T$679, DW_AT_name("__CARRAY1_ti_sysbios_knl_Swi_hooks")
    6789                            .dwattr $C$DW$T$679, DW_AT_type(*$C$DW$T$139)
    6790                            .dwattr $C$DW$T$679, DW_AT_language(DW_LANG_C)
    6791                            .dwattr $C$DW$T$679, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/kernel/tirtos/pac
    6792                            .dwattr $C$DW$T$679, DW_AT_decl_line(0x166)
    6793                            .dwattr $C$DW$T$679, DW_AT_decl_column(0x48)
    6794                    
    6795                    $C$DW$T$680     .dwtag  DW_TAG_typedef
    6796                            .dwattr $C$DW$T$680, DW_AT_name("CT__ti_sysbios_knl_Swi_hooks")
    6797                            .dwattr $C$DW$T$680, DW_AT_type(*$C$DW$T$679)
    6798                            .dwattr $C$DW$T$680, DW_AT_language(DW_LANG_C)
    6799                            .dwattr $C$DW$T$680, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/kernel/tirtos/pac
    6800                            .dwattr $C$DW$T$680, DW_AT_decl_line(0x168)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:33 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{B7878DB6-863A-4C28-A009-988D30102D8B} PAGE  125

    6801                            .dwattr $C$DW$T$680, DW_AT_decl_column(0x2c)
    6802                    
    6803                    $C$DW$T$681     .dwtag  DW_TAG_typedef
    6804                            .dwattr $C$DW$T$681, DW_AT_name("__TA_ti_sysbios_knl_Swi_hooks")
    6805                            .dwattr $C$DW$T$681, DW_AT_type(*$C$DW$T$679)
    6806                            .dwattr $C$DW$T$681, DW_AT_language(DW_LANG_C)
    6807                            .dwattr $C$DW$T$681, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/kernel/tirtos/pac
    6808                            .dwattr $C$DW$T$681, DW_AT_decl_line(0x167)
    6809                            .dwattr $C$DW$T$681, DW_AT_decl_column(0x2c)
    6810                    
    6811                    
    6812                    $C$DW$T$142     .dwtag  DW_TAG_structure_type
    6813                            .dwattr $C$DW$T$142, DW_AT_byte_size(0x08)
    6814                    $C$DW$446       .dwtag  DW_TAG_member
    6815                            .dwattr $C$DW$446, DW_AT_type(*$C$DW$T$10)
    6816                            .dwattr $C$DW$446, DW_AT_name("length")
    6817                            .dwattr $C$DW$446, DW_AT_TI_symbol_name("length")
    6818                            .dwattr $C$DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6819                            .dwattr $C$DW$446, DW_AT_accessibility(DW_ACCESS_public)
    6820                            .dwattr $C$DW$446, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/kernel/tirtos/packa
    6821                            .dwattr $C$DW$446, DW_AT_decl_line(0x29b)
    6822                            .dwattr $C$DW$446, DW_AT_decl_column(0x16)
    6823                    
    6824                    $C$DW$447       .dwtag  DW_TAG_member
    6825                            .dwattr $C$DW$447, DW_AT_type(*$C$DW$T$141)
    6826                            .dwattr $C$DW$447, DW_AT_name("elem")
    6827                            .dwattr $C$DW$447, DW_AT_TI_symbol_name("elem")
    6828                            .dwattr $C$DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6829                            .dwattr $C$DW$447, DW_AT_accessibility(DW_ACCESS_public)
    6830                            .dwattr $C$DW$447, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/kernel/tirtos/packa
    6831                            .dwattr $C$DW$447, DW_AT_decl_line(0x29b)
    6832                            .dwattr $C$DW$447, DW_AT_decl_column(0x3b)
    6833                    
    6834                            .dwattr $C$DW$T$142, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/kernel/tirtos/pac
    6835                            .dwattr $C$DW$T$142, DW_AT_decl_line(0x29b)
    6836                            .dwattr $C$DW$T$142, DW_AT_decl_column(0x10)
    6837                            .dwendtag $C$DW$T$142
    6838                    
    6839                    $C$DW$T$682     .dwtag  DW_TAG_typedef
    6840                            .dwattr $C$DW$T$682, DW_AT_name("__ARRAY1_ti_sysbios_knl_Task_hooks")
    6841                            .dwattr $C$DW$T$682, DW_AT_type(*$C$DW$T$142)
    6842                            .dwattr $C$DW$T$682, DW_AT_language(DW_LANG_C)
    6843                            .dwattr $C$DW$T$682, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/kernel/tirtos/pac
    6844                            .dwattr $C$DW$T$682, DW_AT_decl_line(0x29b)
    6845                            .dwattr $C$DW$T$682, DW_AT_decl_column(0x43)
    6846                    
    6847                    
    6848                    $C$DW$T$145     .dwtag  DW_TAG_structure_type
    6849                            .dwattr $C$DW$T$145, DW_AT_byte_size(0x08)
    6850                    $C$DW$448       .dwtag  DW_TAG_member
    6851                            .dwattr $C$DW$448, DW_AT_type(*$C$DW$T$10)
    6852                            .dwattr $C$DW$448, DW_AT_name("length")
    6853                            .dwattr $C$DW$448, DW_AT_TI_symbol_name("length")
    6854                            .dwattr $C$DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6855                            .dwattr $C$DW$448, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:33 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{B7878DB6-863A-4C28-A009-988D30102D8B} PAGE  126

    6856                            .dwattr $C$DW$448, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/kernel/tirtos/packa
    6857                            .dwattr $C$DW$448, DW_AT_decl_line(0x29c)
    6858                            .dwattr $C$DW$448, DW_AT_decl_column(0x16)
    6859                    
    6860                    $C$DW$449       .dwtag  DW_TAG_member
    6861                            .dwattr $C$DW$449, DW_AT_type(*$C$DW$T$144)
    6862                            .dwattr $C$DW$449, DW_AT_name("elem")
    6863                            .dwattr $C$DW$449, DW_AT_TI_symbol_name("elem")
    6864                            .dwattr $C$DW$449, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6865                            .dwattr $C$DW$449, DW_AT_accessibility(DW_ACCESS_public)
    6866                            .dwattr $C$DW$449, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/kernel/tirtos/packa
    6867                            .dwattr $C$DW$449, DW_AT_decl_line(0x29c)
    6868                            .dwattr $C$DW$449, DW_AT_decl_column(0x41)
    6869                    
    6870                            .dwattr $C$DW$T$145, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/kernel/tirtos/pac
    6871                            .dwattr $C$DW$T$145, DW_AT_decl_line(0x29c)
    6872                            .dwattr $C$DW$T$145, DW_AT_decl_column(0x10)
    6873                            .dwendtag $C$DW$T$145
    6874                    
    6875                    $C$DW$T$683     .dwtag  DW_TAG_typedef
    6876                            .dwattr $C$DW$T$683, DW_AT_name("__CARRAY1_ti_sysbios_knl_Task_hooks")
    6877                            .dwattr $C$DW$T$683, DW_AT_type(*$C$DW$T$145)
    6878                            .dwattr $C$DW$T$683, DW_AT_language(DW_LANG_C)
    6879                            .dwattr $C$DW$T$683, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/kernel/tirtos/pac
    6880                            .dwattr $C$DW$T$683, DW_AT_decl_line(0x29c)
    6881                            .dwattr $C$DW$T$683, DW_AT_decl_column(0x49)
    6882                    
    6883                    $C$DW$T$684     .dwtag  DW_TAG_typedef
    6884                            .dwattr $C$DW$T$684, DW_AT_name("CT__ti_sysbios_knl_Task_hooks")
    6885                            .dwattr $C$DW$T$684, DW_AT_type(*$C$DW$T$683)
    6886                            .dwattr $C$DW$T$684, DW_AT_language(DW_LANG_C)
    6887                            .dwattr $C$DW$T$684, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/kernel/tirtos/pac
    6888                            .dwattr $C$DW$T$684, DW_AT_decl_line(0x29e)
    6889                            .dwattr $C$DW$T$684, DW_AT_decl_column(0x2d)
    6890                    
    6891                    $C$DW$T$685     .dwtag  DW_TAG_typedef
    6892                            .dwattr $C$DW$T$685, DW_AT_name("__TA_ti_sysbios_knl_Task_hooks")
    6893                            .dwattr $C$DW$T$685, DW_AT_type(*$C$DW$T$683)
    6894                            .dwattr $C$DW$T$685, DW_AT_language(DW_LANG_C)
    6895                            .dwattr $C$DW$T$685, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/kernel/tirtos/pac
    6896                            .dwattr $C$DW$T$685, DW_AT_decl_line(0x29d)
    6897                            .dwattr $C$DW$T$685, DW_AT_decl_column(0x2d)
    6898                    
    6899                    
    6900                    $C$DW$T$183     .dwtag  DW_TAG_structure_type
    6901                            .dwattr $C$DW$T$183, DW_AT_byte_size(0x4c)
    6902                    $C$DW$450       .dwtag  DW_TAG_member
    6903                            .dwattr $C$DW$450, DW_AT_type(*$C$DW$T$148)
    6904                            .dwattr $C$DW$450, DW_AT_name("Crc32")
    6905                            .dwattr $C$DW$450, DW_AT_TI_symbol_name("Crc32")
    6906                            .dwattr $C$DW$450, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6907                            .dwattr $C$DW$450, DW_AT_accessibility(DW_ACCESS_public)
    6908                            .dwattr $C$DW$450, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    6909                            .dwattr $C$DW$450, DW_AT_decl_line(0x76)
    6910                            .dwattr $C$DW$450, DW_AT_decl_column(0x25)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:33 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{B7878DB6-863A-4C28-A009-988D30102D8B} PAGE  127

    6911                    
    6912                    $C$DW$451       .dwtag  DW_TAG_member
    6913                            .dwattr $C$DW$451, DW_AT_type(*$C$DW$T$151)
    6914                            .dwattr $C$DW$451, DW_AT_name("FlashGetSize")
    6915                            .dwattr $C$DW$451, DW_AT_TI_symbol_name("FlashGetSize")
    6916                            .dwattr $C$DW$451, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6917                            .dwattr $C$DW$451, DW_AT_accessibility(DW_ACCESS_public)
    6918                            .dwattr $C$DW$451, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    6919                            .dwattr $C$DW$451, DW_AT_decl_line(0x77)
    6920                            .dwattr $C$DW$451, DW_AT_decl_column(0x25)
    6921                    
    6922                    $C$DW$452       .dwtag  DW_TAG_member
    6923                            .dwattr $C$DW$452, DW_AT_type(*$C$DW$T$152)
    6924                            .dwattr $C$DW$452, DW_AT_name("GetChipId")
    6925                            .dwattr $C$DW$452, DW_AT_TI_symbol_name("GetChipId")
    6926                            .dwattr $C$DW$452, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6927                            .dwattr $C$DW$452, DW_AT_accessibility(DW_ACCESS_public)
    6928                            .dwattr $C$DW$452, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    6929                            .dwattr $C$DW$452, DW_AT_decl_line(0x78)
    6930                            .dwattr $C$DW$452, DW_AT_decl_column(0x25)
    6931                    
    6932                    $C$DW$453       .dwtag  DW_TAG_member
    6933                            .dwattr $C$DW$453, DW_AT_type(*$C$DW$T$155)
    6934                            .dwattr $C$DW$453, DW_AT_name("ReservedLocation1")
    6935                            .dwattr $C$DW$453, DW_AT_TI_symbol_name("ReservedLocation1")
    6936                            .dwattr $C$DW$453, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6937                            .dwattr $C$DW$453, DW_AT_accessibility(DW_ACCESS_public)
    6938                            .dwattr $C$DW$453, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    6939                            .dwattr $C$DW$453, DW_AT_decl_line(0x79)
    6940                            .dwattr $C$DW$453, DW_AT_decl_column(0x25)
    6941                    
    6942                    $C$DW$454       .dwtag  DW_TAG_member
    6943                            .dwattr $C$DW$454, DW_AT_type(*$C$DW$T$156)
    6944                            .dwattr $C$DW$454, DW_AT_name("ReservedLocation2")
    6945                            .dwattr $C$DW$454, DW_AT_TI_symbol_name("ReservedLocation2")
    6946                            .dwattr $C$DW$454, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6947                            .dwattr $C$DW$454, DW_AT_accessibility(DW_ACCESS_public)
    6948                            .dwattr $C$DW$454, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    6949                            .dwattr $C$DW$454, DW_AT_decl_line(0x7a)
    6950                            .dwattr $C$DW$454, DW_AT_decl_column(0x25)
    6951                    
    6952                    $C$DW$455       .dwtag  DW_TAG_member
    6953                            .dwattr $C$DW$455, DW_AT_type(*$C$DW$T$157)
    6954                            .dwattr $C$DW$455, DW_AT_name("ReservedLocation3")
    6955                            .dwattr $C$DW$455, DW_AT_TI_symbol_name("ReservedLocation3")
    6956                            .dwattr $C$DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    6957                            .dwattr $C$DW$455, DW_AT_accessibility(DW_ACCESS_public)
    6958                            .dwattr $C$DW$455, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    6959                            .dwattr $C$DW$455, DW_AT_decl_line(0x7b)
    6960                            .dwattr $C$DW$455, DW_AT_decl_column(0x25)
    6961                    
    6962                    $C$DW$456       .dwtag  DW_TAG_member
    6963                            .dwattr $C$DW$456, DW_AT_type(*$C$DW$T$160)
    6964                            .dwattr $C$DW$456, DW_AT_name("ResetDevice")
    6965                            .dwattr $C$DW$456, DW_AT_TI_symbol_name("ResetDevice")
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:33 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{B7878DB6-863A-4C28-A009-988D30102D8B} PAGE  128

    6966                            .dwattr $C$DW$456, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    6967                            .dwattr $C$DW$456, DW_AT_accessibility(DW_ACCESS_public)
    6968                            .dwattr $C$DW$456, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    6969                            .dwattr $C$DW$456, DW_AT_decl_line(0x7c)
    6970                            .dwattr $C$DW$456, DW_AT_decl_column(0x25)
    6971                    
    6972                    $C$DW$457       .dwtag  DW_TAG_member
    6973                            .dwattr $C$DW$457, DW_AT_type(*$C$DW$T$164)
    6974                            .dwattr $C$DW$457, DW_AT_name("Fletcher32")
    6975                            .dwattr $C$DW$457, DW_AT_TI_symbol_name("Fletcher32")
    6976                            .dwattr $C$DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    6977                            .dwattr $C$DW$457, DW_AT_accessibility(DW_ACCESS_public)
    6978                            .dwattr $C$DW$457, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    6979                            .dwattr $C$DW$457, DW_AT_decl_line(0x7d)
    6980                            .dwattr $C$DW$457, DW_AT_decl_column(0x25)
    6981                    
    6982                    $C$DW$458       .dwtag  DW_TAG_member
    6983                            .dwattr $C$DW$458, DW_AT_type(*$C$DW$T$168)
    6984                            .dwattr $C$DW$458, DW_AT_name("MinValue")
    6985                            .dwattr $C$DW$458, DW_AT_TI_symbol_name("MinValue")
    6986                            .dwattr $C$DW$458, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    6987                            .dwattr $C$DW$458, DW_AT_accessibility(DW_ACCESS_public)
    6988                            .dwattr $C$DW$458, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    6989                            .dwattr $C$DW$458, DW_AT_decl_line(0x7e)
    6990                            .dwattr $C$DW$458, DW_AT_decl_column(0x25)
    6991                    
    6992                    $C$DW$459       .dwtag  DW_TAG_member
    6993                            .dwattr $C$DW$459, DW_AT_type(*$C$DW$T$169)
    6994                            .dwattr $C$DW$459, DW_AT_name("MaxValue")
    6995                            .dwattr $C$DW$459, DW_AT_TI_symbol_name("MaxValue")
    6996                            .dwattr $C$DW$459, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    6997                            .dwattr $C$DW$459, DW_AT_accessibility(DW_ACCESS_public)
    6998                            .dwattr $C$DW$459, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    6999                            .dwattr $C$DW$459, DW_AT_decl_line(0x7f)
    7000                            .dwattr $C$DW$459, DW_AT_decl_column(0x25)
    7001                    
    7002                    $C$DW$460       .dwtag  DW_TAG_member
    7003                            .dwattr $C$DW$460, DW_AT_type(*$C$DW$T$170)
    7004                            .dwattr $C$DW$460, DW_AT_name("MeanValue")
    7005                            .dwattr $C$DW$460, DW_AT_TI_symbol_name("MeanValue")
    7006                            .dwattr $C$DW$460, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    7007                            .dwattr $C$DW$460, DW_AT_accessibility(DW_ACCESS_public)
    7008                            .dwattr $C$DW$460, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    7009                            .dwattr $C$DW$460, DW_AT_decl_line(0x80)
    7010                            .dwattr $C$DW$460, DW_AT_decl_column(0x25)
    7011                    
    7012                    $C$DW$461       .dwtag  DW_TAG_member
    7013                            .dwattr $C$DW$461, DW_AT_type(*$C$DW$T$171)
    7014                            .dwattr $C$DW$461, DW_AT_name("StandDeviationValue")
    7015                            .dwattr $C$DW$461, DW_AT_TI_symbol_name("StandDeviationValue")
    7016                            .dwattr $C$DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    7017                            .dwattr $C$DW$461, DW_AT_accessibility(DW_ACCESS_public)
    7018                            .dwattr $C$DW$461, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    7019                            .dwattr $C$DW$461, DW_AT_decl_line(0x81)
    7020                            .dwattr $C$DW$461, DW_AT_decl_column(0x25)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:33 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{B7878DB6-863A-4C28-A009-988D30102D8B} PAGE  129

    7021                    
    7022                    $C$DW$462       .dwtag  DW_TAG_member
    7023                            .dwattr $C$DW$462, DW_AT_type(*$C$DW$T$174)
    7024                            .dwattr $C$DW$462, DW_AT_name("ReservedLocation4")
    7025                            .dwattr $C$DW$462, DW_AT_TI_symbol_name("ReservedLocation4")
    7026                            .dwattr $C$DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    7027                            .dwattr $C$DW$462, DW_AT_accessibility(DW_ACCESS_public)
    7028                            .dwattr $C$DW$462, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    7029                            .dwattr $C$DW$462, DW_AT_decl_line(0x82)
    7030                            .dwattr $C$DW$462, DW_AT_decl_column(0x25)
    7031                    
    7032                    $C$DW$463       .dwtag  DW_TAG_member
    7033                            .dwattr $C$DW$463, DW_AT_type(*$C$DW$T$175)
    7034                            .dwattr $C$DW$463, DW_AT_name("ReservedLocation5")
    7035                            .dwattr $C$DW$463, DW_AT_TI_symbol_name("ReservedLocation5")
    7036                            .dwattr $C$DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    7037                            .dwattr $C$DW$463, DW_AT_accessibility(DW_ACCESS_public)
    7038                            .dwattr $C$DW$463, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    7039                            .dwattr $C$DW$463, DW_AT_decl_line(0x83)
    7040                            .dwattr $C$DW$463, DW_AT_decl_column(0x25)
    7041                    
    7042                    $C$DW$464       .dwtag  DW_TAG_member
    7043                            .dwattr $C$DW$464, DW_AT_type(*$C$DW$T$176)
    7044                            .dwattr $C$DW$464, DW_AT_name("HFSourceSafeSwitch")
    7045                            .dwattr $C$DW$464, DW_AT_TI_symbol_name("HFSourceSafeSwitch")
    7046                            .dwattr $C$DW$464, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    7047                            .dwattr $C$DW$464, DW_AT_accessibility(DW_ACCESS_public)
    7048                            .dwattr $C$DW$464, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    7049                            .dwattr $C$DW$464, DW_AT_decl_line(0x84)
    7050                            .dwattr $C$DW$464, DW_AT_decl_column(0x25)
    7051                    
    7052                    $C$DW$465       .dwtag  DW_TAG_member
    7053                            .dwattr $C$DW$465, DW_AT_type(*$C$DW$T$179)
    7054                            .dwattr $C$DW$465, DW_AT_name("SelectCompAInput")
    7055                            .dwattr $C$DW$465, DW_AT_TI_symbol_name("SelectCompAInput")
    7056                            .dwattr $C$DW$465, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    7057                            .dwattr $C$DW$465, DW_AT_accessibility(DW_ACCESS_public)
    7058                            .dwattr $C$DW$465, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    7059                            .dwattr $C$DW$465, DW_AT_decl_line(0x85)
    7060                            .dwattr $C$DW$465, DW_AT_decl_column(0x25)
    7061                    
    7062                    $C$DW$466       .dwtag  DW_TAG_member
    7063                            .dwattr $C$DW$466, DW_AT_type(*$C$DW$T$180)
    7064                            .dwattr $C$DW$466, DW_AT_name("SelectCompARef")
    7065                            .dwattr $C$DW$466, DW_AT_TI_symbol_name("SelectCompARef")
    7066                            .dwattr $C$DW$466, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    7067                            .dwattr $C$DW$466, DW_AT_accessibility(DW_ACCESS_public)
    7068                            .dwattr $C$DW$466, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    7069                            .dwattr $C$DW$466, DW_AT_decl_line(0x86)
    7070                            .dwattr $C$DW$466, DW_AT_decl_column(0x25)
    7071                    
    7072                    $C$DW$467       .dwtag  DW_TAG_member
    7073                            .dwattr $C$DW$467, DW_AT_type(*$C$DW$T$181)
    7074                            .dwattr $C$DW$467, DW_AT_name("SelectADCCompBInput")
    7075                            .dwattr $C$DW$467, DW_AT_TI_symbol_name("SelectADCCompBInput")
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:33 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{B7878DB6-863A-4C28-A009-988D30102D8B} PAGE  130

    7076                            .dwattr $C$DW$467, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    7077                            .dwattr $C$DW$467, DW_AT_accessibility(DW_ACCESS_public)
    7078                            .dwattr $C$DW$467, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    7079                            .dwattr $C$DW$467, DW_AT_decl_line(0x87)
    7080                            .dwattr $C$DW$467, DW_AT_decl_column(0x25)
    7081                    
    7082                    $C$DW$468       .dwtag  DW_TAG_member
    7083                            .dwattr $C$DW$468, DW_AT_type(*$C$DW$T$182)
    7084                            .dwattr $C$DW$468, DW_AT_name("SelectCompBRef")
    7085                            .dwattr $C$DW$468, DW_AT_TI_symbol_name("SelectCompBRef")
    7086                            .dwattr $C$DW$468, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    7087                            .dwattr $C$DW$468, DW_AT_accessibility(DW_ACCESS_public)
    7088                            .dwattr $C$DW$468, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    7089                            .dwattr $C$DW$468, DW_AT_decl_line(0x88)
    7090                            .dwattr $C$DW$468, DW_AT_decl_column(0x25)
    7091                    
    7092                            .dwattr $C$DW$T$183, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices
    7093                            .dwattr $C$DW$T$183, DW_AT_decl_line(0x75)
    7094                            .dwattr $C$DW$T$183, DW_AT_decl_column(0x01)
    7095                            .dwendtag $C$DW$T$183
    7096                    
    7097                    $C$DW$T$686     .dwtag  DW_TAG_typedef
    7098                            .dwattr $C$DW$T$686, DW_AT_name("HARD_API_T")
    7099                            .dwattr $C$DW$T$686, DW_AT_type(*$C$DW$T$183)
    7100                            .dwattr $C$DW$T$686, DW_AT_language(DW_LANG_C)
    7101                            .dwattr $C$DW$T$686, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices
    7102                            .dwattr $C$DW$T$686, DW_AT_decl_line(0x89)
    7103                            .dwattr $C$DW$T$686, DW_AT_decl_column(0x03)
    7104                    
    7105                    
    7106                    $C$DW$T$184     .dwtag  DW_TAG_structure_type
    7107                            .dwattr $C$DW$T$184, DW_AT_byte_size(0x08)
    7108                    $C$DW$469       .dwtag  DW_TAG_member
    7109                            .dwattr $C$DW$469, DW_AT_type(*$C$DW$T$10)
    7110                            .dwattr $C$DW$469, DW_AT_name("quot")
    7111                            .dwattr $C$DW$469, DW_AT_TI_symbol_name("quot")
    7112                            .dwattr $C$DW$469, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7113                            .dwattr $C$DW$469, DW_AT_accessibility(DW_ACCESS_public)
    7114                            .dwattr $C$DW$469, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/s
    7115                            .dwattr $C$DW$469, DW_AT_decl_line(0x5c)
    7116                            .dwattr $C$DW$469, DW_AT_decl_column(0x16)
    7117                    
    7118                    $C$DW$470       .dwtag  DW_TAG_member
    7119                            .dwattr $C$DW$470, DW_AT_type(*$C$DW$T$10)
    7120                            .dwattr $C$DW$470, DW_AT_name("rem")
    7121                            .dwattr $C$DW$470, DW_AT_TI_symbol_name("rem")
    7122                            .dwattr $C$DW$470, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7123                            .dwattr $C$DW$470, DW_AT_accessibility(DW_ACCESS_public)
    7124                            .dwattr $C$DW$470, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/s
    7125                            .dwattr $C$DW$470, DW_AT_decl_line(0x5c)
    7126                            .dwattr $C$DW$470, DW_AT_decl_column(0x1c)
    7127                    
    7128                            .dwattr $C$DW$T$184, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include
    7129                            .dwattr $C$DW$T$184, DW_AT_decl_line(0x5c)
    7130                            .dwattr $C$DW$T$184, DW_AT_decl_column(0x10)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:33 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{B7878DB6-863A-4C28-A009-988D30102D8B} PAGE  131

    7131                            .dwendtag $C$DW$T$184
    7132                    
    7133                    $C$DW$T$687     .dwtag  DW_TAG_typedef
    7134                            .dwattr $C$DW$T$687, DW_AT_name("div_t")
    7135                            .dwattr $C$DW$T$687, DW_AT_type(*$C$DW$T$184)
    7136                            .dwattr $C$DW$T$687, DW_AT_language(DW_LANG_C)
    7137                            .dwattr $C$DW$T$687, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include
    7138                            .dwattr $C$DW$T$687, DW_AT_decl_line(0x5c)
    7139                            .dwattr $C$DW$T$687, DW_AT_decl_column(0x23)
    7140                    
    7141                    
    7142                    $C$DW$T$185     .dwtag  DW_TAG_structure_type
    7143                            .dwattr $C$DW$T$185, DW_AT_byte_size(0x08)
    7144                    $C$DW$471       .dwtag  DW_TAG_member
    7145                            .dwattr $C$DW$471, DW_AT_type(*$C$DW$T$10)
    7146                            .dwattr $C$DW$471, DW_AT_name("quot")
    7147                            .dwattr $C$DW$471, DW_AT_TI_symbol_name("quot")
    7148                            .dwattr $C$DW$471, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7149                            .dwattr $C$DW$471, DW_AT_accessibility(DW_ACCESS_public)
    7150                            .dwattr $C$DW$471, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/s
    7151                            .dwattr $C$DW$471, DW_AT_decl_line(0x5e)
    7152                            .dwattr $C$DW$471, DW_AT_decl_column(0x16)
    7153                    
    7154                    $C$DW$472       .dwtag  DW_TAG_member
    7155                            .dwattr $C$DW$472, DW_AT_type(*$C$DW$T$10)
    7156                            .dwattr $C$DW$472, DW_AT_name("rem")
    7157                            .dwattr $C$DW$472, DW_AT_TI_symbol_name("rem")
    7158                            .dwattr $C$DW$472, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7159                            .dwattr $C$DW$472, DW_AT_accessibility(DW_ACCESS_public)
    7160                            .dwattr $C$DW$472, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/s
    7161                            .dwattr $C$DW$472, DW_AT_decl_line(0x5e)
    7162                            .dwattr $C$DW$472, DW_AT_decl_column(0x1c)
    7163                    
    7164                            .dwattr $C$DW$T$185, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include
    7165                            .dwattr $C$DW$T$185, DW_AT_decl_line(0x5e)
    7166                            .dwattr $C$DW$T$185, DW_AT_decl_column(0x10)
    7167                            .dwendtag $C$DW$T$185
    7168                    
    7169                    $C$DW$T$688     .dwtag  DW_TAG_typedef
    7170                            .dwattr $C$DW$T$688, DW_AT_name("ldiv_t")
    7171                            .dwattr $C$DW$T$688, DW_AT_type(*$C$DW$T$185)
    7172                            .dwattr $C$DW$T$688, DW_AT_language(DW_LANG_C)
    7173                            .dwattr $C$DW$T$688, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include
    7174                            .dwattr $C$DW$T$688, DW_AT_decl_line(0x5e)
    7175                            .dwattr $C$DW$T$688, DW_AT_decl_column(0x23)
    7176                    
    7177                    
    7178                    $C$DW$T$186     .dwtag  DW_TAG_structure_type
    7179                            .dwattr $C$DW$T$186, DW_AT_byte_size(0x10)
    7180                    $C$DW$473       .dwtag  DW_TAG_member
    7181                            .dwattr $C$DW$473, DW_AT_type(*$C$DW$T$14)
    7182                            .dwattr $C$DW$473, DW_AT_name("quot")
    7183                            .dwattr $C$DW$473, DW_AT_TI_symbol_name("quot")
    7184                            .dwattr $C$DW$473, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7185                            .dwattr $C$DW$473, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:33 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{B7878DB6-863A-4C28-A009-988D30102D8B} PAGE  132

    7186                            .dwattr $C$DW$473, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/s
    7187                            .dwattr $C$DW$473, DW_AT_decl_line(0x61)
    7188                            .dwattr $C$DW$473, DW_AT_decl_column(0x1c)
    7189                    
    7190                    $C$DW$474       .dwtag  DW_TAG_member
    7191                            .dwattr $C$DW$474, DW_AT_type(*$C$DW$T$14)
    7192                            .dwattr $C$DW$474, DW_AT_name("rem")
    7193                            .dwattr $C$DW$474, DW_AT_TI_symbol_name("rem")
    7194                            .dwattr $C$DW$474, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7195                            .dwattr $C$DW$474, DW_AT_accessibility(DW_ACCESS_public)
    7196                            .dwattr $C$DW$474, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/s
    7197                            .dwattr $C$DW$474, DW_AT_decl_line(0x61)
    7198                            .dwattr $C$DW$474, DW_AT_decl_column(0x22)
    7199                    
    7200                            .dwattr $C$DW$T$186, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include
    7201                            .dwattr $C$DW$T$186, DW_AT_decl_line(0x61)
    7202                            .dwattr $C$DW$T$186, DW_AT_decl_column(0x10)
    7203                            .dwendtag $C$DW$T$186
    7204                    
    7205                    $C$DW$T$689     .dwtag  DW_TAG_typedef
    7206                            .dwattr $C$DW$T$689, DW_AT_name("lldiv_t")
    7207                            .dwattr $C$DW$T$689, DW_AT_type(*$C$DW$T$186)
    7208                            .dwattr $C$DW$T$689, DW_AT_language(DW_LANG_C)
    7209                            .dwattr $C$DW$T$689, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include
    7210                            .dwattr $C$DW$T$689, DW_AT_decl_line(0x61)
    7211                            .dwattr $C$DW$T$689, DW_AT_decl_column(0x29)
    7212                    
    7213                    
    7214                    $C$DW$T$190     .dwtag  DW_TAG_structure_type
    7215                            .dwattr $C$DW$T$190, DW_AT_byte_size(0x08)
    7216                    $C$DW$475       .dwtag  DW_TAG_member
    7217                            .dwattr $C$DW$475, DW_AT_type(*$C$DW$T$188)
    7218                            .dwattr $C$DW$475, DW_AT_name("pointerStack")
    7219                            .dwattr $C$DW$475, DW_AT_TI_symbol_name("pointerStack")
    7220                            .dwattr $C$DW$475, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7221                            .dwattr $C$DW$475, DW_AT_accessibility(DW_ACCESS_public)
    7222                            .dwattr $C$DW$475, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    7223                            .dwattr $C$DW$475, DW_AT_decl_line(0x3f5)
    7224                            .dwattr $C$DW$475, DW_AT_decl_column(0x16)
    7225                    
    7226                    $C$DW$476       .dwtag  DW_TAG_member
    7227                            .dwattr $C$DW$476, DW_AT_type(*$C$DW$T$189)
    7228                            .dwattr $C$DW$476, DW_AT_name("directAPI")
    7229                            .dwattr $C$DW$476, DW_AT_TI_symbol_name("directAPI")
    7230                            .dwattr $C$DW$476, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7231                            .dwattr $C$DW$476, DW_AT_accessibility(DW_ACCESS_public)
    7232                            .dwattr $C$DW$476, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    7233                            .dwattr $C$DW$476, DW_AT_decl_line(0x3f6)
    7234                            .dwattr $C$DW$476, DW_AT_decl_column(0x15)
    7235                    
    7236                            .dwattr $C$DW$T$190, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154st
    7237                            .dwattr $C$DW$T$190, DW_AT_decl_line(0x3f4)
    7238                            .dwattr $C$DW$T$190, DW_AT_decl_column(0x01)
    7239                            .dwendtag $C$DW$T$190
    7240                    
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:33 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{B7878DB6-863A-4C28-A009-988D30102D8B} PAGE  133

    7241                    $C$DW$T$192     .dwtag  DW_TAG_typedef
    7242                            .dwattr $C$DW$T$192, DW_AT_name("icall_directAPIMsg_t")
    7243                            .dwattr $C$DW$T$192, DW_AT_type(*$C$DW$T$190)
    7244                            .dwattr $C$DW$T$192, DW_AT_language(DW_LANG_C)
    7245                            .dwattr $C$DW$T$192, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154st
    7246                            .dwattr $C$DW$T$192, DW_AT_decl_line(0x3f7)
    7247                            .dwattr $C$DW$T$192, DW_AT_decl_column(0x03)
    7248                    
    7249                    
    7250                    $C$DW$T$193     .dwtag  DW_TAG_structure_type
    7251                            .dwattr $C$DW$T$193, DW_AT_byte_size(0x14)
    7252                    $C$DW$477       .dwtag  DW_TAG_member
    7253                            .dwattr $C$DW$477, DW_AT_type(*$C$DW$T$191)
    7254                            .dwattr $C$DW$477, DW_AT_name("hdr")
    7255                            .dwattr $C$DW$477, DW_AT_TI_symbol_name("hdr")
    7256                            .dwattr $C$DW$477, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7257                            .dwattr $C$DW$477, DW_AT_accessibility(DW_ACCESS_public)
    7258                            .dwattr $C$DW$477, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    7259                            .dwattr $C$DW$477, DW_AT_decl_line(0x3fb)
    7260                            .dwattr $C$DW$477, DW_AT_decl_column(0x10)
    7261                    
    7262                    $C$DW$478       .dwtag  DW_TAG_member
    7263                            .dwattr $C$DW$478, DW_AT_type(*$C$DW$T$192)
    7264                            .dwattr $C$DW$478, DW_AT_name("msg")
    7265                            .dwattr $C$DW$478, DW_AT_TI_symbol_name("msg")
    7266                            .dwattr $C$DW$478, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7267                            .dwattr $C$DW$478, DW_AT_accessibility(DW_ACCESS_public)
    7268                            .dwattr $C$DW$478, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    7269                            .dwattr $C$DW$478, DW_AT_decl_line(0x3fc)
    7270                            .dwattr $C$DW$478, DW_AT_decl_column(0x1a)
    7271                    
    7272                            .dwattr $C$DW$T$193, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154st
    7273                            .dwattr $C$DW$T$193, DW_AT_decl_line(0x3fa)
    7274                            .dwattr $C$DW$T$193, DW_AT_decl_column(0x01)
    7275                            .dwendtag $C$DW$T$193
    7276                    
    7277                    $C$DW$T$690     .dwtag  DW_TAG_typedef
    7278                            .dwattr $C$DW$T$690, DW_AT_name("icallLiteMsg_t")
    7279                            .dwattr $C$DW$T$690, DW_AT_type(*$C$DW$T$193)
    7280                            .dwattr $C$DW$T$690, DW_AT_language(DW_LANG_C)
    7281                            .dwattr $C$DW$T$690, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154st
    7282                            .dwattr $C$DW$T$690, DW_AT_decl_line(0x3fd)
    7283                            .dwattr $C$DW$T$690, DW_AT_decl_column(0x03)
    7284                    
    7285                    
    7286                    $C$DW$T$197     .dwtag  DW_TAG_union_type
    7287                            .dwattr $C$DW$T$197, DW_AT_byte_size(0x04)
    7288                    $C$DW$479       .dwtag  DW_TAG_member
    7289                            .dwattr $C$DW$479, DW_AT_type(*$C$DW$T$194)
    7290                            .dwattr $C$DW$479, DW_AT_name("f")
    7291                            .dwattr $C$DW$479, DW_AT_TI_symbol_name("f")
    7292                            .dwattr $C$DW$479, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7293                            .dwattr $C$DW$479, DW_AT_accessibility(DW_ACCESS_public)
    7294                            .dwattr $C$DW$479, DW_AT_decl_file("C:/ti/xdctools_3_50_03_33_core/packages/xdc/std.h")
    7295                            .dwattr $C$DW$479, DW_AT_decl_line(0xb7)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:33 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{B7878DB6-863A-4C28-A009-988D30102D8B} PAGE  134

    7296                            .dwattr $C$DW$479, DW_AT_decl_column(0x0f)
    7297                    
    7298                    $C$DW$480       .dwtag  DW_TAG_member
    7299                            .dwattr $C$DW$480, DW_AT_type(*$C$DW$T$196)
    7300                            .dwattr $C$DW$480, DW_AT_name("a")
    7301                            .dwattr $C$DW$480, DW_AT_TI_symbol_name("a")
    7302                            .dwattr $C$DW$480, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7303                            .dwattr $C$DW$480, DW_AT_accessibility(DW_ACCESS_public)
    7304                            .dwattr $C$DW$480, DW_AT_decl_file("C:/ti/xdctools_3_50_03_33_core/packages/xdc/std.h")
    7305                            .dwattr $C$DW$480, DW_AT_decl_line(0xb8)
    7306                            .dwattr $C$DW$480, DW_AT_decl_column(0x0f)
    7307                    
    7308                            .dwattr $C$DW$T$197, DW_AT_decl_file("C:/ti/xdctools_3_50_03_33_core/packages/xdc/std.h")
    7309                            .dwattr $C$DW$T$197, DW_AT_decl_line(0xb6)
    7310                            .dwattr $C$DW$T$197, DW_AT_decl_column(0x0f)
    7311                            .dwendtag $C$DW$T$197
    7312                    
    7313                    $C$DW$T$691     .dwtag  DW_TAG_typedef
    7314                            .dwattr $C$DW$T$691, DW_AT_name("xdc_FloatData")
    7315                            .dwattr $C$DW$T$691, DW_AT_type(*$C$DW$T$197)
    7316                            .dwattr $C$DW$T$691, DW_AT_language(DW_LANG_C)
    7317                            .dwattr $C$DW$T$691, DW_AT_decl_file("C:/ti/xdctools_3_50_03_33_core/packages/xdc/std.h")
    7318                            .dwattr $C$DW$T$691, DW_AT_decl_line(0xb9)
    7319                            .dwattr $C$DW$T$691, DW_AT_decl_column(0x03)
    7320                    
    7321                    
    7322                    $C$DW$T$202     .dwtag  DW_TAG_union_type
    7323                            .dwattr $C$DW$T$202, DW_AT_byte_size(0x02)
    7324                    $C$DW$481       .dwtag  DW_TAG_member
    7325                            .dwattr $C$DW$481, DW_AT_type(*$C$DW$T$199)
    7326                            .dwattr $C$DW$481, DW_AT_name("entityId")
    7327                            .dwattr $C$DW$481, DW_AT_TI_symbol_name("entityId")
    7328                            .dwattr $C$DW$481, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7329                            .dwattr $C$DW$481, DW_AT_accessibility(DW_ACCESS_public)
    7330                            .dwattr $C$DW$481, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    7331                            .dwattr $C$DW$481, DW_AT_decl_line(0x1fe)
    7332                            .dwattr $C$DW$481, DW_AT_decl_column(0x14)
    7333                    
    7334                    $C$DW$482       .dwtag  DW_TAG_member
    7335                            .dwattr $C$DW$482, DW_AT_type(*$C$DW$T$201)
    7336                            .dwattr $C$DW$482, DW_AT_name("servId")
    7337                            .dwattr $C$DW$482, DW_AT_TI_symbol_name("servId")
    7338                            .dwattr $C$DW$482, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7339                            .dwattr $C$DW$482, DW_AT_accessibility(DW_ACCESS_public)
    7340                            .dwattr $C$DW$482, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    7341                            .dwattr $C$DW$482, DW_AT_decl_line(0x200)
    7342                            .dwattr $C$DW$482, DW_AT_decl_column(0x17)
    7343                    
    7344                            .dwattr $C$DW$T$202, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154st
    7345                            .dwattr $C$DW$T$202, DW_AT_decl_line(0x1fc)
    7346                            .dwattr $C$DW$T$202, DW_AT_decl_column(0x03)
    7347                            .dwendtag $C$DW$T$202
    7348                    
    7349                    
    7350                    $C$DW$T$203     .dwtag  DW_TAG_union_type
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:33 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{B7878DB6-863A-4C28-A009-988D30102D8B} PAGE  135

    7351                            .dwattr $C$DW$T$203, DW_AT_byte_size(0x02)
    7352                    $C$DW$483       .dwtag  DW_TAG_member
    7353                            .dwattr $C$DW$483, DW_AT_type(*$C$DW$T$201)
    7354                            .dwattr $C$DW$483, DW_AT_name("servId")
    7355                            .dwattr $C$DW$483, DW_AT_TI_symbol_name("servId")
    7356                            .dwattr $C$DW$483, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7357                            .dwattr $C$DW$483, DW_AT_accessibility(DW_ACCESS_public)
    7358                            .dwattr $C$DW$483, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    7359                            .dwattr $C$DW$483, DW_AT_decl_line(0x211)
    7360                            .dwattr $C$DW$483, DW_AT_decl_column(0x17)
    7361                    
    7362                    $C$DW$484       .dwtag  DW_TAG_member
    7363                            .dwattr $C$DW$484, DW_AT_type(*$C$DW$T$199)
    7364                            .dwattr $C$DW$484, DW_AT_name("entityId")
    7365                            .dwattr $C$DW$484, DW_AT_TI_symbol_name("entityId")
    7366                            .dwattr $C$DW$484, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7367                            .dwattr $C$DW$484, DW_AT_accessibility(DW_ACCESS_public)
    7368                            .dwattr $C$DW$484, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    7369                            .dwattr $C$DW$484, DW_AT_decl_line(0x213)
    7370                            .dwattr $C$DW$484, DW_AT_decl_column(0x14)
    7371                    
    7372                            .dwattr $C$DW$T$203, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154st
    7373                            .dwattr $C$DW$T$203, DW_AT_decl_line(0x20f)
    7374                            .dwattr $C$DW$T$203, DW_AT_decl_column(0x03)
    7375                            .dwendtag $C$DW$T$203
    7376                    
    7377                    
    7378                    $C$DW$T$206     .dwtag  DW_TAG_structure_type
    7379                            .dwattr $C$DW$T$206, DW_AT_name(".ggroup1")
    7380                            .dwattr $C$DW$T$206, DW_AT_byte_size(0x0c)
    7381                    $C$DW$485       .dwtag  DW_TAG_member
    7382                            .dwattr $C$DW$485, DW_AT_type(*$C$DW$T$204)
    7383                            .dwattr $C$DW$485, DW_AT_name("nvBegPage")
    7384                            .dwattr $C$DW$485, DW_AT_TI_symbol_name("nvBegPage")
    7385                            .dwattr $C$DW$485, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7386                            .dwattr $C$DW$485, DW_AT_accessibility(DW_ACCESS_public)
    7387                    
    7388                    $C$DW$486       .dwtag  DW_TAG_member
    7389                            .dwattr $C$DW$486, DW_AT_type(*$C$DW$T$204)
    7390                            .dwattr $C$DW$486, DW_AT_name("nvEndPage")
    7391                            .dwattr $C$DW$486, DW_AT_TI_symbol_name("nvEndPage")
    7392                            .dwattr $C$DW$486, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7393                            .dwattr $C$DW$486, DW_AT_accessibility(DW_ACCESS_public)
    7394                    
    7395                    $C$DW$487       .dwtag  DW_TAG_member
    7396                            .dwattr $C$DW$487, DW_AT_type(*$C$DW$T$6)
    7397                            .dwattr $C$DW$487, DW_AT_name("activePg")
    7398                            .dwattr $C$DW$487, DW_AT_TI_symbol_name("activePg")
    7399                            .dwattr $C$DW$487, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7400                            .dwattr $C$DW$487, DW_AT_accessibility(DW_ACCESS_public)
    7401                    
    7402                    $C$DW$488       .dwtag  DW_TAG_member
    7403                            .dwattr $C$DW$488, DW_AT_type(*$C$DW$T$6)
    7404                            .dwattr $C$DW$488, DW_AT_name("pgCycle")
    7405                            .dwattr $C$DW$488, DW_AT_TI_symbol_name("pgCycle")
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:33 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{B7878DB6-863A-4C28-A009-988D30102D8B} PAGE  136

    7406                            .dwattr $C$DW$488, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    7407                            .dwattr $C$DW$488, DW_AT_accessibility(DW_ACCESS_public)
    7408                    
    7409                    $C$DW$489       .dwtag  DW_TAG_member
    7410                            .dwattr $C$DW$489, DW_AT_type(*$C$DW$T$6)
    7411                            .dwattr $C$DW$489, DW_AT_name("failF")
    7412                            .dwattr $C$DW$489, DW_AT_TI_symbol_name("failF")
    7413                            .dwattr $C$DW$489, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7414                            .dwattr $C$DW$489, DW_AT_accessibility(DW_ACCESS_public)
    7415                    
    7416                    $C$DW$490       .dwtag  DW_TAG_member
    7417                            .dwattr $C$DW$490, DW_AT_type(*$C$DW$T$6)
    7418                            .dwattr $C$DW$490, DW_AT_name("failW")
    7419                            .dwattr $C$DW$490, DW_AT_TI_symbol_name("failW")
    7420                            .dwattr $C$DW$490, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    7421                            .dwattr $C$DW$490, DW_AT_accessibility(DW_ACCESS_public)
    7422                    
    7423                    $C$DW$491       .dwtag  DW_TAG_member
    7424                            .dwattr $C$DW$491, DW_AT_type(*$C$DW$T$9)
    7425                            .dwattr $C$DW$491, DW_AT_name("pgOff")
    7426                            .dwattr $C$DW$491, DW_AT_TI_symbol_name("pgOff")
    7427                            .dwattr $C$DW$491, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7428                            .dwattr $C$DW$491, DW_AT_accessibility(DW_ACCESS_public)
    7429                    
    7430                    $C$DW$492       .dwtag  DW_TAG_member
    7431                            .dwattr $C$DW$492, DW_AT_type(*$C$DW$T$205)
    7432                            .dwattr $C$DW$492, DW_AT_name("nvMutex")
    7433                            .dwattr $C$DW$492, DW_AT_TI_symbol_name("nvMutex")
    7434                            .dwattr $C$DW$492, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7435                            .dwattr $C$DW$492, DW_AT_accessibility(DW_ACCESS_public)
    7436                    
    7437                            .dwendtag $C$DW$T$206
    7438                    
    7439                    
    7440                    $C$DW$T$207     .dwtag  DW_TAG_structure_type
    7441                            .dwattr $C$DW$T$207, DW_AT_name("S3_1")
    7442                            .dwattr $C$DW$T$207, DW_AT_declaration
    7443                            .dwendtag $C$DW$T$207
    7444                    
    7445                    
    7446                    $C$DW$T$208     .dwtag  DW_TAG_structure_type
    7447                            .dwattr $C$DW$T$208, DW_AT_name("S3_1")
    7448                            .dwattr $C$DW$T$208, DW_AT_declaration
    7449                            .dwendtag $C$DW$T$208
    7450                    
    7451                    
    7452                    $C$DW$T$209     .dwtag  DW_TAG_structure_type
    7453                            .dwattr $C$DW$T$209, DW_AT_name("S3_3")
    7454                            .dwattr $C$DW$T$209, DW_AT_declaration
    7455                            .dwendtag $C$DW$T$209
    7456                    
    7457                    
    7458                    $C$DW$T$210     .dwtag  DW_TAG_structure_type
    7459                            .dwattr $C$DW$T$210, DW_AT_name("S4_4")
    7460                            .dwattr $C$DW$T$210, DW_AT_declaration
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:33 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{B7878DB6-863A-4C28-A009-988D30102D8B} PAGE  137

    7461                            .dwendtag $C$DW$T$210
    7462                    
    7463                    
    7464                    $C$DW$T$211     .dwtag  DW_TAG_structure_type
    7465                            .dwattr $C$DW$T$211, DW_AT_name("S4_6")
    7466                            .dwattr $C$DW$T$211, DW_AT_declaration
    7467                            .dwendtag $C$DW$T$211
    7468                    
    7469                    
    7470                    $C$DW$T$212     .dwtag  DW_TAG_structure_type
    7471                            .dwattr $C$DW$T$212, DW_AT_name("S4_6")
    7472                            .dwattr $C$DW$T$212, DW_AT_declaration
    7473                            .dwendtag $C$DW$T$212
    7474                    
    7475                    
    7476                    $C$DW$T$19      .dwtag  DW_TAG_structure_type
    7477                            .dwattr $C$DW$T$19, DW_AT_name("S5_8")
    7478                            .dwattr $C$DW$T$19, DW_AT_declaration
    7479                            .dwendtag $C$DW$T$19
    7480                    
    7481                    
    7482                    $C$DW$T$213     .dwtag  DW_TAG_union_type
    7483                            .dwattr $C$DW$T$213, DW_AT_name("U3_0")
    7484                            .dwattr $C$DW$T$213, DW_AT_declaration
    7485                            .dwendtag $C$DW$T$213
    7486                    
    7487                    
    7488                    $C$DW$T$214     .dwtag  DW_TAG_union_type
    7489                            .dwattr $C$DW$T$214, DW_AT_name("U3_0")
    7490                            .dwattr $C$DW$T$214, DW_AT_declaration
    7491                            .dwendtag $C$DW$T$214
    7492                    
    7493                    
    7494                    $C$DW$T$215     .dwtag  DW_TAG_union_type
    7495                            .dwattr $C$DW$T$215, DW_AT_name("U4_3")
    7496                            .dwattr $C$DW$T$215, DW_AT_declaration
    7497                            .dwendtag $C$DW$T$215
    7498                    
    7499                    
    7500                    $C$DW$T$216     .dwtag  DW_TAG_union_type
    7501                            .dwattr $C$DW$T$216, DW_AT_name("U4_5")
    7502                            .dwattr $C$DW$T$216, DW_AT_declaration
    7503                            .dwendtag $C$DW$T$216
    7504                    
    7505                    
    7506                    $C$DW$T$217     .dwtag  DW_TAG_union_type
    7507                            .dwattr $C$DW$T$217, DW_AT_name("U5_7")
    7508                            .dwattr $C$DW$T$217, DW_AT_declaration
    7509                            .dwendtag $C$DW$T$217
    7510                    
    7511                    
    7512                    $C$DW$T$218     .dwtag  DW_TAG_structure_type
    7513                            .dwattr $C$DW$T$218, DW_AT_name("_ICall_LiteCmdStatus_")
    7514                            .dwattr $C$DW$T$218, DW_AT_byte_size(0x01)
    7515                    $C$DW$493       .dwtag  DW_TAG_member
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:33 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{B7878DB6-863A-4C28-A009-988D30102D8B} PAGE  138

    7516                            .dwattr $C$DW$493, DW_AT_type(*$C$DW$T$198)
    7517                            .dwattr $C$DW$493, DW_AT_name("cmdId")
    7518                            .dwattr $C$DW$493, DW_AT_TI_symbol_name("cmdId")
    7519                            .dwattr $C$DW$493, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7520                            .dwattr $C$DW$493, DW_AT_accessibility(DW_ACCESS_public)
    7521                            .dwattr $C$DW$493, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    7522                            .dwattr $C$DW$493, DW_AT_decl_line(0x3f0)
    7523                            .dwattr $C$DW$493, DW_AT_decl_column(0x11)
    7524                    
    7525                            .dwattr $C$DW$T$218, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154st
    7526                            .dwattr $C$DW$T$218, DW_AT_decl_line(0x3ee)
    7527                            .dwattr $C$DW$T$218, DW_AT_decl_column(0x10)
    7528                            .dwendtag $C$DW$T$218
    7529                    
    7530                    $C$DW$T$695     .dwtag  DW_TAG_typedef
    7531                            .dwattr $C$DW$T$695, DW_AT_name("ICall_LiteCmdStatus")
    7532                            .dwattr $C$DW$T$695, DW_AT_type(*$C$DW$T$218)
    7533                            .dwattr $C$DW$T$695, DW_AT_language(DW_LANG_C)
    7534                            .dwattr $C$DW$T$695, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154st
    7535                            .dwattr $C$DW$T$695, DW_AT_decl_line(0x3f1)
    7536                            .dwattr $C$DW$T$695, DW_AT_decl_column(0x03)
    7537                    
    7538                    $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    7539                            .dwattr $C$DW$T$2, DW_AT_name("void")
    7540                    
    7541                    $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    7542                            .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
    7543                            .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
    7544                    
    7545                    $C$DW$T$696     .dwtag  DW_TAG_typedef
    7546                            .dwattr $C$DW$T$696, DW_AT_name("ICall_Semaphore")
    7547                            .dwattr $C$DW$T$696, DW_AT_type(*$C$DW$T$3)
    7548                            .dwattr $C$DW$T$696, DW_AT_language(DW_LANG_C)
    7549                            .dwattr $C$DW$T$696, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154st
    7550                            .dwattr $C$DW$T$696, DW_AT_decl_line(0x1ac)
    7551                            .dwattr $C$DW$T$696, DW_AT_decl_column(0x0f)
    7552                    
    7553                    $C$DW$T$233     .dwtag  DW_TAG_typedef
    7554                            .dwattr $C$DW$T$233, DW_AT_name("ICall_SyncHandle")
    7555                            .dwattr $C$DW$T$233, DW_AT_type(*$C$DW$T$3)
    7556                            .dwattr $C$DW$T$233, DW_AT_language(DW_LANG_C)
    7557                            .dwattr $C$DW$T$233, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154st
    7558                            .dwattr $C$DW$T$233, DW_AT_decl_line(0x1aa)
    7559                            .dwattr $C$DW$T$233, DW_AT_decl_column(0x0f)
    7560                    
    7561                    $C$DW$T$278     .dwtag  DW_TAG_typedef
    7562                            .dwattr $C$DW$T$278, DW_AT_name("ICall_TimerID")
    7563                            .dwattr $C$DW$T$278, DW_AT_type(*$C$DW$T$3)
    7564                            .dwattr $C$DW$T$278, DW_AT_language(DW_LANG_C)
    7565                            .dwattr $C$DW$T$278, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154st
    7566                            .dwattr $C$DW$T$278, DW_AT_decl_line(0x1b7)
    7567                            .dwattr $C$DW$T$278, DW_AT_decl_column(0x0f)
    7568                    
    7569                    $C$DW$T$699     .dwtag  DW_TAG_const_type
    7570                            .dwattr $C$DW$T$699, DW_AT_type(*$C$DW$T$3)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:33 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{B7878DB6-863A-4C28-A009-988D30102D8B} PAGE  139

    7571                    
    7572                    $C$DW$T$353     .dwtag  DW_TAG_typedef
    7573                            .dwattr $C$DW$T$353, DW_AT_name("xdc_Ptr")
    7574                            .dwattr $C$DW$T$353, DW_AT_type(*$C$DW$T$3)
    7575                            .dwattr $C$DW$T$353, DW_AT_language(DW_LANG_C)
    7576                            .dwattr $C$DW$T$353, DW_AT_decl_file("C:/ti/xdctools_3_50_03_33_core/packages/xdc/std.h")
    7577                            .dwattr $C$DW$T$353, DW_AT_decl_line(0x2e)
    7578                            .dwattr $C$DW$T$353, DW_AT_decl_column(0x1a)
    7579                    
    7580                    $C$DW$T$700     .dwtag  DW_TAG_typedef
