TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:27 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{9B2EE82F-52CD-4481-81F1-F17C456C1149} PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                        PC v16.9.4.LTS *
       3                    ;* Date/Time created: Sat Nov 18 18:46:27 2017                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../Application/MAC/OSAL/osal_clock.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v16.9.4.LTS Copyright (c) 1996-20
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Kevin\workspace_v7\sensor_cc1310lp\sensor_cc1310lp"
      13                    
      14                    $C$DW$1 .dwtag  DW_TAG_subprogram

    1159                            .dwendtag $C$DW$T$171
    1160                    
    1161                    $C$DW$T$172     .dwtag  DW_TAG_typedef
    1162                            .dwattr $C$DW$T$172, DW_AT_name("tFlashStateCommandsType")
    1163                            .dwattr $C$DW$T$172, DW_AT_type(*$C$DW$T$171)
    1164                            .dwattr $C$DW$T$172, DW_AT_language(DW_LANG_C)
    1165                            .dwattr $C$DW$T$172, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices
    1166                            .dwattr $C$DW$T$172, DW_AT_decl_line(0xb0)
    1167                            .dwattr $C$DW$T$172, DW_AT_decl_column(0x03)
    1168                    
    1169                    
    1170                    $C$DW$T$173     .dwtag  DW_TAG_enumeration_type
    1171                            .dwattr $C$DW$T$173, DW_AT_byte_size(0x01)
    1172                    $C$DW$60        .dwtag  DW_TAG_enumerator
    1173                            .dwattr $C$DW$60, DW_AT_name("ICALL_RTI_APP_CMD_EVENT")
    1174                            .dwattr $C$DW$60, DW_AT_const_value(0xe0)
    1175                            .dwattr $C$DW$60, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stack
    1176                            .dwattr $C$DW$60, DW_AT_decl_line(0x3de)
    1177                            .dwattr $C$DW$60, DW_AT_decl_column(0x04)
    1178                    
    1179                    $C$DW$61        .dwtag  DW_TAG_enumerator
    1180                            .dwattr $C$DW$61, DW_AT_name("ICALL_RTI_STACK_CMD_EVENT")
    1181                            .dwattr $C$DW$61, DW_AT_const_value(0xe1)
    1182                            .dwattr $C$DW$61, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stack
    1183                            .dwattr $C$DW$61, DW_AT_decl_line(0x3e0)
    1184                            .dwattr $C$DW$61, DW_AT_decl_column(0x04)
    1185                    
    1186                    $C$DW$62        .dwtag  DW_TAG_enumerator
    1187                            .dwattr $C$DW$62, DW_AT_name("ICALL_RTI_APP_ASYNC_CMD_EVENT")
    1188                            .dwattr $C$DW$62, DW_AT_const_value(0xe2)
    1189                            .dwattr $C$DW$62, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stack
    1190                            .dwattr $C$DW$62, DW_AT_decl_line(0x3e2)
    1191                            .dwattr $C$DW$62, DW_AT_decl_column(0x04)
    1192                    
    1193                    $C$DW$63        .dwtag  DW_TAG_enumerator
    1194                            .dwattr $C$DW$63, DW_AT_name("ICALL_RTI_APP_SYNC_CMD_EVENT")
    1195                            .dwattr $C$DW$63, DW_AT_const_value(0xe3)
    1196                            .dwattr $C$DW$63, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stack
    1197                            .dwattr $C$DW$63, DW_AT_decl_line(0x3e4)
    1198                            .dwattr $C$DW$63, DW_AT_decl_column(0x04)
    1199                    
    1200                    $C$DW$64        .dwtag  DW_TAG_enumerator
    1201                            .dwattr $C$DW$64, DW_AT_name("ICALL_RCN_APP_ASYNC_CMD_EVENT")
    1202                            .dwattr $C$DW$64, DW_AT_const_value(0xe4)
    1203                            .dwattr $C$DW$64, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stack
    1204                            .dwattr $C$DW$64, DW_AT_decl_line(0x3e6)
    1205                            .dwattr $C$DW$64, DW_AT_decl_column(0x04)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:27 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{9B2EE82F-52CD-4481-81F1-F17C456C1149} PAGE   23

    1206                    
    1207                    $C$DW$65        .dwtag  DW_TAG_enumerator
    1208                            .dwattr $C$DW$65, DW_AT_name("ICALL_RCN_APP_SYNC_CMD_EVENT")
    1209                            .dwattr $C$DW$65, DW_AT_const_value(0xe5)
    1210                            .dwattr $C$DW$65, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stack
    1211                            .dwattr $C$DW$65, DW_AT_decl_line(0x3e8)
    1212                            .dwattr $C$DW$65, DW_AT_decl_column(0x04)
    1213                    
    1214                            .dwattr $C$DW$T$173, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154st
    1215                            .dwattr $C$DW$T$173, DW_AT_decl_line(0x3dc)
    1216                            .dwattr $C$DW$T$173, DW_AT_decl_column(0x01)
    1217                            .dwendtag $C$DW$T$173
    1218                    
    1219                    $C$DW$T$174     .dwtag  DW_TAG_typedef
    1220                            .dwattr $C$DW$T$174, DW_AT_name("ICall_RemotiCmdEvent_t")
    1221                            .dwattr $C$DW$T$174, DW_AT_type(*$C$DW$T$173)
    1222                            .dwattr $C$DW$T$174, DW_AT_language(DW_LANG_C)
    1223                            .dwattr $C$DW$T$174, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154st
    1224                            .dwattr $C$DW$T$174, DW_AT_decl_line(0x3e9)
    1225                            .dwattr $C$DW$T$174, DW_AT_decl_column(0x02)
    1226                    
    1227                    
    1228                    $C$DW$T$21      .dwtag  DW_TAG_structure_type
    1229                            .dwattr $C$DW$T$21, DW_AT_byte_size(0x08)
    1230                    $C$DW$66        .dwtag  DW_TAG_member
    1231                            .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$19)
    1232                            .dwattr $C$DW$66, DW_AT_name("seconds")
    1233                            .dwattr $C$DW$66, DW_AT_TI_symbol_name("seconds")
    1234                            .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1235                            .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
    1236                            .dwattr $C$DW$66, DW_AT_decl_file("..\Application\MAC\OSAL\osal_clock.h")
    1237                            .dwattr $C$DW$66, DW_AT_decl_line(0x50)
    1238                            .dwattr $C$DW$66, DW_AT_decl_column(0x09)
    1239                    
    1240                    $C$DW$67        .dwtag  DW_TAG_member
    1241                            .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$19)
    1242                            .dwattr $C$DW$67, DW_AT_name("minutes")
    1243                            .dwattr $C$DW$67, DW_AT_TI_symbol_name("minutes")
    1244                            .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1245                            .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
    1246                            .dwattr $C$DW$67, DW_AT_decl_file("..\Application\MAC\OSAL\osal_clock.h")
    1247                            .dwattr $C$DW$67, DW_AT_decl_line(0x51)
    1248                            .dwattr $C$DW$67, DW_AT_decl_column(0x09)
    1249                    
    1250                    $C$DW$68        .dwtag  DW_TAG_member
    1251                            .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$19)
    1252                            .dwattr $C$DW$68, DW_AT_name("hour")
    1253                            .dwattr $C$DW$68, DW_AT_TI_symbol_name("hour")
    1254                            .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1255                            .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
    1256                            .dwattr $C$DW$68, DW_AT_decl_file("..\Application\MAC\OSAL\osal_clock.h")
    1257                            .dwattr $C$DW$68, DW_AT_decl_line(0x52)
    1258                            .dwattr $C$DW$68, DW_AT_decl_column(0x09)
    1259                    
    1260                    $C$DW$69        .dwtag  DW_TAG_member
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:27 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{9B2EE82F-52CD-4481-81F1-F17C456C1149} PAGE   24

    1261                            .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$19)
    1262                            .dwattr $C$DW$69, DW_AT_name("day")
    1263                            .dwattr $C$DW$69, DW_AT_TI_symbol_name("day")
    1264                            .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1265                            .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
    1266                            .dwattr $C$DW$69, DW_AT_decl_file("..\Application\MAC\OSAL\osal_clock.h")
    1267                            .dwattr $C$DW$69, DW_AT_decl_line(0x53)
    1268                            .dwattr $C$DW$69, DW_AT_decl_column(0x09)
    1269                    
    1270                    $C$DW$70        .dwtag  DW_TAG_member
    1271                            .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$19)
    1272                            .dwattr $C$DW$70, DW_AT_name("month")
    1273                            .dwattr $C$DW$70, DW_AT_TI_symbol_name("month")
    1274                            .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1275                            .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
    1276                            .dwattr $C$DW$70, DW_AT_decl_file("..\Application\MAC\OSAL\osal_clock.h")
    1277                            .dwattr $C$DW$70, DW_AT_decl_line(0x54)
    1278                            .dwattr $C$DW$70, DW_AT_decl_column(0x09)
    1279                    
    1280                    $C$DW$71        .dwtag  DW_TAG_member
    1281                            .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$20)
    1282                            .dwattr $C$DW$71, DW_AT_name("year")
    1283                            .dwattr $C$DW$71, DW_AT_TI_symbol_name("year")
    1284                            .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1285                            .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
    1286                            .dwattr $C$DW$71, DW_AT_decl_file("..\Application\MAC\OSAL\osal_clock.h")
    1287                            .dwattr $C$DW$71, DW_AT_decl_line(0x55)
    1288                            .dwattr $C$DW$71, DW_AT_decl_column(0x0a)
    1289                    
    1290                            .dwattr $C$DW$T$21, DW_AT_decl_file("..\Application\MAC\OSAL\osal_clock.h")
    1291                            .dwattr $C$DW$T$21, DW_AT_decl_line(0x4f)
    1292                            .dwattr $C$DW$T$21, DW_AT_decl_column(0x01)
    1293                            .dwendtag $C$DW$T$21
    1294                    
    1295                    $C$DW$T$175     .dwtag  DW_TAG_typedef
    1296                            .dwattr $C$DW$T$175, DW_AT_name("UTCTimeStruct")
    1297                            .dwattr $C$DW$T$175, DW_AT_type(*$C$DW$T$21)
    1298                            .dwattr $C$DW$T$175, DW_AT_language(DW_LANG_C)
    1299                            .dwattr $C$DW$T$175, DW_AT_decl_file("..\Application\MAC\OSAL\osal_clock.h")
    1300                            .dwattr $C$DW$T$175, DW_AT_decl_line(0x56)
    1301                            .dwattr $C$DW$T$175, DW_AT_decl_column(0x03)
    1302                    
    1303                    $C$DW$T$176     .dwtag  DW_TAG_pointer_type
    1304                            .dwattr $C$DW$T$176, DW_AT_type(*$C$DW$T$175)
    1305                            .dwattr $C$DW$T$176, DW_AT_address_class(0x20)
    1306                    
    1307                    $C$DW$T$177     .dwtag  DW_TAG_const_type
    1308                            .dwattr $C$DW$T$177, DW_AT_type(*$C$DW$T$176)
    1309                    
    1310                    
    1311                    $C$DW$T$63      .dwtag  DW_TAG_structure_type
    1312                            .dwattr $C$DW$T$63, DW_AT_byte_size(0x4c)
    1313                    $C$DW$72        .dwtag  DW_TAG_member
    1314                            .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$27)
    1315                            .dwattr $C$DW$72, DW_AT_name("Crc32")
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:27 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{9B2EE82F-52CD-4481-81F1-F17C456C1149} PAGE   25

    1316                            .dwattr $C$DW$72, DW_AT_TI_symbol_name("Crc32")
    1317                            .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1318                            .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
    1319                            .dwattr $C$DW$72, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\cc
    1320                            .dwattr $C$DW$72, DW_AT_decl_line(0x76)
    1321                            .dwattr $C$DW$72, DW_AT_decl_column(0x25)
    1322                    
    1323                    $C$DW$73        .dwtag  DW_TAG_member
    1324                            .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$30)
    1325                            .dwattr $C$DW$73, DW_AT_name("FlashGetSize")
    1326                            .dwattr $C$DW$73, DW_AT_TI_symbol_name("FlashGetSize")
    1327                            .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1328                            .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
    1329                            .dwattr $C$DW$73, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\cc
    1330                            .dwattr $C$DW$73, DW_AT_decl_line(0x77)
    1331                            .dwattr $C$DW$73, DW_AT_decl_column(0x25)
    1332                    
    1333                    $C$DW$74        .dwtag  DW_TAG_member
    1334                            .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$31)
    1335                            .dwattr $C$DW$74, DW_AT_name("GetChipId")
    1336                            .dwattr $C$DW$74, DW_AT_TI_symbol_name("GetChipId")
    1337                            .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1338                            .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
    1339                            .dwattr $C$DW$74, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\cc
    1340                            .dwattr $C$DW$74, DW_AT_decl_line(0x78)
    1341                            .dwattr $C$DW$74, DW_AT_decl_column(0x25)
    1342                    
    1343                    $C$DW$75        .dwtag  DW_TAG_member
    1344                            .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$34)
    1345                            .dwattr $C$DW$75, DW_AT_name("ReservedLocation1")
    1346                            .dwattr $C$DW$75, DW_AT_TI_symbol_name("ReservedLocation1")
    1347                            .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1348                            .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
    1349                            .dwattr $C$DW$75, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\cc
    1350                            .dwattr $C$DW$75, DW_AT_decl_line(0x79)
    1351                            .dwattr $C$DW$75, DW_AT_decl_column(0x25)
    1352                    
    1353                    $C$DW$76        .dwtag  DW_TAG_member
    1354                            .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$35)
    1355                            .dwattr $C$DW$76, DW_AT_name("ReservedLocation2")
    1356                            .dwattr $C$DW$76, DW_AT_TI_symbol_name("ReservedLocation2")
    1357                            .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1358                            .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1359                            .dwattr $C$DW$76, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\cc
    1360                            .dwattr $C$DW$76, DW_AT_decl_line(0x7a)
    1361                            .dwattr $C$DW$76, DW_AT_decl_column(0x25)
    1362                    
    1363                    $C$DW$77        .dwtag  DW_TAG_member
    1364                            .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$36)
    1365                            .dwattr $C$DW$77, DW_AT_name("ReservedLocation3")
    1366                            .dwattr $C$DW$77, DW_AT_TI_symbol_name("ReservedLocation3")
    1367                            .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1368                            .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1369                            .dwattr $C$DW$77, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\cc
    1370                            .dwattr $C$DW$77, DW_AT_decl_line(0x7b)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:27 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{9B2EE82F-52CD-4481-81F1-F17C456C1149} PAGE   26

    1371                            .dwattr $C$DW$77, DW_AT_decl_column(0x25)
    1372                    
    1373                    $C$DW$78        .dwtag  DW_TAG_member
    1374                            .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$39)
    1375                            .dwattr $C$DW$78, DW_AT_name("ResetDevice")
    1376                            .dwattr $C$DW$78, DW_AT_TI_symbol_name("ResetDevice")
    1377                            .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1378                            .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1379                            .dwattr $C$DW$78, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\cc
    1380                            .dwattr $C$DW$78, DW_AT_decl_line(0x7c)
    1381                            .dwattr $C$DW$78, DW_AT_decl_column(0x25)
    1382                    
    1383                    $C$DW$79        .dwtag  DW_TAG_member
    1384                            .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$44)
    1385                            .dwattr $C$DW$79, DW_AT_name("Fletcher32")
    1386                            .dwattr $C$DW$79, DW_AT_TI_symbol_name("Fletcher32")
    1387                            .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1388                            .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1389                            .dwattr $C$DW$79, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\cc
    1390                            .dwattr $C$DW$79, DW_AT_decl_line(0x7d)
    1391                            .dwattr $C$DW$79, DW_AT_decl_column(0x25)
    1392                    
    1393                    $C$DW$80        .dwtag  DW_TAG_member
    1394                            .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$48)
    1395                            .dwattr $C$DW$80, DW_AT_name("MinValue")
    1396                            .dwattr $C$DW$80, DW_AT_TI_symbol_name("MinValue")
    1397                            .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1398                            .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1399                            .dwattr $C$DW$80, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\cc
    1400                            .dwattr $C$DW$80, DW_AT_decl_line(0x7e)
    1401                            .dwattr $C$DW$80, DW_AT_decl_column(0x25)
    1402                    
    1403                    $C$DW$81        .dwtag  DW_TAG_member
    1404                            .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$49)
    1405                            .dwattr $C$DW$81, DW_AT_name("MaxValue")
    1406                            .dwattr $C$DW$81, DW_AT_TI_symbol_name("MaxValue")
    1407                            .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1408                            .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1409                            .dwattr $C$DW$81, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\cc
    1410                            .dwattr $C$DW$81, DW_AT_decl_line(0x7f)
    1411                            .dwattr $C$DW$81, DW_AT_decl_column(0x25)
    1412                    
    1413                    $C$DW$82        .dwtag  DW_TAG_member
    1414                            .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$50)
    1415                            .dwattr $C$DW$82, DW_AT_name("MeanValue")
    1416                            .dwattr $C$DW$82, DW_AT_TI_symbol_name("MeanValue")
    1417                            .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    1418                            .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1419                            .dwattr $C$DW$82, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\cc
    1420                            .dwattr $C$DW$82, DW_AT_decl_line(0x80)
    1421                            .dwattr $C$DW$82, DW_AT_decl_column(0x25)
    1422                    
    1423                    $C$DW$83        .dwtag  DW_TAG_member
    1424                            .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$51)
    1425                            .dwattr $C$DW$83, DW_AT_name("StandDeviationValue")
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:27 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{9B2EE82F-52CD-4481-81F1-F17C456C1149} PAGE   27

    1426                            .dwattr $C$DW$83, DW_AT_TI_symbol_name("StandDeviationValue")
    1427                            .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    1428                            .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1429                            .dwattr $C$DW$83, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\cc
    1430                            .dwattr $C$DW$83, DW_AT_decl_line(0x81)
    1431                            .dwattr $C$DW$83, DW_AT_decl_column(0x25)
    1432                    
    1433                    $C$DW$84        .dwtag  DW_TAG_member
    1434                            .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$54)
    1435                            .dwattr $C$DW$84, DW_AT_name("ReservedLocation4")
    1436                            .dwattr $C$DW$84, DW_AT_TI_symbol_name("ReservedLocation4")
    1437                            .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    1438                            .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1439                            .dwattr $C$DW$84, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\cc
    1440                            .dwattr $C$DW$84, DW_AT_decl_line(0x82)
    1441                            .dwattr $C$DW$84, DW_AT_decl_column(0x25)
    1442                    
    1443                    $C$DW$85        .dwtag  DW_TAG_member
    1444                            .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$55)
    1445                            .dwattr $C$DW$85, DW_AT_name("ReservedLocation5")
    1446                            .dwattr $C$DW$85, DW_AT_TI_symbol_name("ReservedLocation5")
    1447                            .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    1448                            .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1449                            .dwattr $C$DW$85, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\cc
    1450                            .dwattr $C$DW$85, DW_AT_decl_line(0x83)
    1451                            .dwattr $C$DW$85, DW_AT_decl_column(0x25)
    1452                    
    1453                    $C$DW$86        .dwtag  DW_TAG_member
    1454                            .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$56)
    1455                            .dwattr $C$DW$86, DW_AT_name("HFSourceSafeSwitch")
    1456                            .dwattr $C$DW$86, DW_AT_TI_symbol_name("HFSourceSafeSwitch")
    1457                            .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    1458                            .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1459                            .dwattr $C$DW$86, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\cc
    1460                            .dwattr $C$DW$86, DW_AT_decl_line(0x84)
    1461                            .dwattr $C$DW$86, DW_AT_decl_column(0x25)
    1462                    
    1463                    $C$DW$87        .dwtag  DW_TAG_member
    1464                            .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$59)
    1465                            .dwattr $C$DW$87, DW_AT_name("SelectCompAInput")
    1466                            .dwattr $C$DW$87, DW_AT_TI_symbol_name("SelectCompAInput")
    1467                            .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    1468                            .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1469                            .dwattr $C$DW$87, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\cc
    1470                            .dwattr $C$DW$87, DW_AT_decl_line(0x85)
    1471                            .dwattr $C$DW$87, DW_AT_decl_column(0x25)
    1472                    
    1473                    $C$DW$88        .dwtag  DW_TAG_member
    1474                            .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$60)
    1475                            .dwattr $C$DW$88, DW_AT_name("SelectCompARef")
    1476                            .dwattr $C$DW$88, DW_AT_TI_symbol_name("SelectCompARef")
    1477                            .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    1478                            .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1479                            .dwattr $C$DW$88, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\cc
    1480                            .dwattr $C$DW$88, DW_AT_decl_line(0x86)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:27 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{9B2EE82F-52CD-4481-81F1-F17C456C1149} PAGE   28

    1481                            .dwattr $C$DW$88, DW_AT_decl_column(0x25)
    1482                    
    1483                    $C$DW$89        .dwtag  DW_TAG_member
    1484                            .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$61)
    1485                            .dwattr $C$DW$89, DW_AT_name("SelectADCCompBInput")
    1486                            .dwattr $C$DW$89, DW_AT_TI_symbol_name("SelectADCCompBInput")
    1487                            .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    1488                            .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1489                            .dwattr $C$DW$89, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\cc
    1490                            .dwattr $C$DW$89, DW_AT_decl_line(0x87)
    1491                            .dwattr $C$DW$89, DW_AT_decl_column(0x25)
    1492                    
    1493                    $C$DW$90        .dwtag  DW_TAG_member
    1494                            .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$62)
    1495                            .dwattr $C$DW$90, DW_AT_name("SelectCompBRef")
    1496                            .dwattr $C$DW$90, DW_AT_TI_symbol_name("SelectCompBRef")
    1497                            .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    1498                            .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1499                            .dwattr $C$DW$90, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\cc
    1500                            .dwattr $C$DW$90, DW_AT_decl_line(0x88)
    1501                            .dwattr $C$DW$90, DW_AT_decl_column(0x25)
    1502                    
    1503                            .dwattr $C$DW$T$63, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\
    1504                            .dwattr $C$DW$T$63, DW_AT_decl_line(0x75)
    1505                            .dwattr $C$DW$T$63, DW_AT_decl_column(0x01)
    1506                            .dwendtag $C$DW$T$63
    1507                    
    1508                    $C$DW$T$180     .dwtag  DW_TAG_typedef
    1509                            .dwattr $C$DW$T$180, DW_AT_name("HARD_API_T")
    1510                            .dwattr $C$DW$T$180, DW_AT_type(*$C$DW$T$63)
    1511                            .dwattr $C$DW$T$180, DW_AT_language(DW_LANG_C)
    1512                            .dwattr $C$DW$T$180, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices
    1513                            .dwattr $C$DW$T$180, DW_AT_decl_line(0x89)
    1514                            .dwattr $C$DW$T$180, DW_AT_decl_column(0x03)
    1515                    
    1516                    
    1517                    $C$DW$T$64      .dwtag  DW_TAG_structure_type
    1518                            .dwattr $C$DW$T$64, DW_AT_byte_size(0x08)
    1519                    $C$DW$91        .dwtag  DW_TAG_member
    1520                            .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$10)
    1521                            .dwattr $C$DW$91, DW_AT_name("quot")
    1522                            .dwattr $C$DW$91, DW_AT_TI_symbol_name("quot")
    1523                            .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1524                            .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1525                            .dwattr $C$DW$91, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/st
    1526                            .dwattr $C$DW$91, DW_AT_decl_line(0x5c)
    1527                            .dwattr $C$DW$91, DW_AT_decl_column(0x16)
    1528                    
    1529                    $C$DW$92        .dwtag  DW_TAG_member
    1530                            .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$10)
    1531                            .dwattr $C$DW$92, DW_AT_name("rem")
    1532                            .dwattr $C$DW$92, DW_AT_TI_symbol_name("rem")
    1533                            .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1534                            .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1535                            .dwattr $C$DW$92, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/st
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:27 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{9B2EE82F-52CD-4481-81F1-F17C456C1149} PAGE   29

    1536                            .dwattr $C$DW$92, DW_AT_decl_line(0x5c)
    1537                            .dwattr $C$DW$92, DW_AT_decl_column(0x1c)
    1538                    
    1539                            .dwattr $C$DW$T$64, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/
    1540                            .dwattr $C$DW$T$64, DW_AT_decl_line(0x5c)
    1541                            .dwattr $C$DW$T$64, DW_AT_decl_column(0x10)
    1542                            .dwendtag $C$DW$T$64
    1543                    
    1544                    $C$DW$T$181     .dwtag  DW_TAG_typedef
    1545                            .dwattr $C$DW$T$181, DW_AT_name("div_t")
    1546                            .dwattr $C$DW$T$181, DW_AT_type(*$C$DW$T$64)
    1547                            .dwattr $C$DW$T$181, DW_AT_language(DW_LANG_C)
    1548                            .dwattr $C$DW$T$181, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include
    1549                            .dwattr $C$DW$T$181, DW_AT_decl_line(0x5c)
    1550                            .dwattr $C$DW$T$181, DW_AT_decl_column(0x23)
    1551                    
    1552                    
    1553                    $C$DW$T$65      .dwtag  DW_TAG_structure_type
    1554                            .dwattr $C$DW$T$65, DW_AT_byte_size(0x08)
    1555                    $C$DW$93        .dwtag  DW_TAG_member
    1556                            .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$10)
    1557                            .dwattr $C$DW$93, DW_AT_name("quot")
    1558                            .dwattr $C$DW$93, DW_AT_TI_symbol_name("quot")
    1559                            .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1560                            .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1561                            .dwattr $C$DW$93, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/st
    1562                            .dwattr $C$DW$93, DW_AT_decl_line(0x5e)
    1563                            .dwattr $C$DW$93, DW_AT_decl_column(0x16)
    1564                    
    1565                    $C$DW$94        .dwtag  DW_TAG_member
    1566                            .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$10)
    1567                            .dwattr $C$DW$94, DW_AT_name("rem")
    1568                            .dwattr $C$DW$94, DW_AT_TI_symbol_name("rem")
    1569                            .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1570                            .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1571                            .dwattr $C$DW$94, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/st
    1572                            .dwattr $C$DW$94, DW_AT_decl_line(0x5e)
    1573                            .dwattr $C$DW$94, DW_AT_decl_column(0x1c)
    1574                    
    1575                            .dwattr $C$DW$T$65, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/
    1576                            .dwattr $C$DW$T$65, DW_AT_decl_line(0x5e)
    1577                            .dwattr $C$DW$T$65, DW_AT_decl_column(0x10)
    1578                            .dwendtag $C$DW$T$65
    1579                    
    1580                    $C$DW$T$182     .dwtag  DW_TAG_typedef
    1581                            .dwattr $C$DW$T$182, DW_AT_name("ldiv_t")
    1582                            .dwattr $C$DW$T$182, DW_AT_type(*$C$DW$T$65)
    1583                            .dwattr $C$DW$T$182, DW_AT_language(DW_LANG_C)
    1584                            .dwattr $C$DW$T$182, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include
    1585                            .dwattr $C$DW$T$182, DW_AT_decl_line(0x5e)
    1586                            .dwattr $C$DW$T$182, DW_AT_decl_column(0x23)
    1587                    
    1588                    
    1589                    $C$DW$T$66      .dwtag  DW_TAG_structure_type
    1590                            .dwattr $C$DW$T$66, DW_AT_byte_size(0x10)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:27 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{9B2EE82F-52CD-4481-81F1-F17C456C1149} PAGE   30

    1591                    $C$DW$95        .dwtag  DW_TAG_member
    1592                            .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$14)
    1593                            .dwattr $C$DW$95, DW_AT_name("quot")
    1594                            .dwattr $C$DW$95, DW_AT_TI_symbol_name("quot")
    1595                            .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1596                            .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1597                            .dwattr $C$DW$95, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/st
    1598                            .dwattr $C$DW$95, DW_AT_decl_line(0x61)
    1599                            .dwattr $C$DW$95, DW_AT_decl_column(0x1c)
    1600                    
    1601                    $C$DW$96        .dwtag  DW_TAG_member
    1602                            .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$14)
    1603                            .dwattr $C$DW$96, DW_AT_name("rem")
    1604                            .dwattr $C$DW$96, DW_AT_TI_symbol_name("rem")
    1605                            .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1606                            .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1607                            .dwattr $C$DW$96, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/st
    1608                            .dwattr $C$DW$96, DW_AT_decl_line(0x61)
    1609                            .dwattr $C$DW$96, DW_AT_decl_column(0x22)
    1610                    
    1611                            .dwattr $C$DW$T$66, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/
    1612                            .dwattr $C$DW$T$66, DW_AT_decl_line(0x61)
    1613                            .dwattr $C$DW$T$66, DW_AT_decl_column(0x10)
    1614                            .dwendtag $C$DW$T$66
    1615                    
    1616                    $C$DW$T$183     .dwtag  DW_TAG_typedef
    1617                            .dwattr $C$DW$T$183, DW_AT_name("lldiv_t")
    1618                            .dwattr $C$DW$T$183, DW_AT_type(*$C$DW$T$66)
    1619                            .dwattr $C$DW$T$183, DW_AT_language(DW_LANG_C)
    1620                            .dwattr $C$DW$T$183, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include
    1621                            .dwattr $C$DW$T$183, DW_AT_decl_line(0x61)
    1622                            .dwattr $C$DW$T$183, DW_AT_decl_column(0x29)
    1623                    
    1624                    
    1625                    $C$DW$T$70      .dwtag  DW_TAG_structure_type
    1626                            .dwattr $C$DW$T$70, DW_AT_byte_size(0x08)
    1627                    $C$DW$97        .dwtag  DW_TAG_member
    1628                            .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$68)
    1629                            .dwattr $C$DW$97, DW_AT_name("pointerStack")
    1630                            .dwattr $C$DW$97, DW_AT_TI_symbol_name("pointerStack")
    1631                            .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1632                            .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1633                            .dwattr $C$DW$97, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stack
    1634                            .dwattr $C$DW$97, DW_AT_decl_line(0x3f5)
    1635                            .dwattr $C$DW$97, DW_AT_decl_column(0x16)
    1636                    
    1637                    $C$DW$98        .dwtag  DW_TAG_member
    1638                            .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$69)
    1639                            .dwattr $C$DW$98, DW_AT_name("directAPI")
    1640                            .dwattr $C$DW$98, DW_AT_TI_symbol_name("directAPI")
    1641                            .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1642                            .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1643                            .dwattr $C$DW$98, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stack
    1644                            .dwattr $C$DW$98, DW_AT_decl_line(0x3f6)
    1645                            .dwattr $C$DW$98, DW_AT_decl_column(0x15)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:27 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{9B2EE82F-52CD-4481-81F1-F17C456C1149} PAGE   31

    1646                    
    1647                            .dwattr $C$DW$T$70, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154sta
    1648                            .dwattr $C$DW$T$70, DW_AT_decl_line(0x3f4)
    1649                            .dwattr $C$DW$T$70, DW_AT_decl_column(0x01)
    1650                            .dwendtag $C$DW$T$70
    1651                    
    1652                    $C$DW$T$72      .dwtag  DW_TAG_typedef
    1653                            .dwattr $C$DW$T$72, DW_AT_name("icall_directAPIMsg_t")
    1654                            .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$70)
    1655                            .dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
    1656                            .dwattr $C$DW$T$72, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154sta
    1657                            .dwattr $C$DW$T$72, DW_AT_decl_line(0x3f7)
    1658                            .dwattr $C$DW$T$72, DW_AT_decl_column(0x03)
    1659                    
    1660                    
    1661                    $C$DW$T$73      .dwtag  DW_TAG_structure_type
    1662                            .dwattr $C$DW$T$73, DW_AT_byte_size(0x14)
    1663                    $C$DW$99        .dwtag  DW_TAG_member
    1664                            .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$71)
    1665                            .dwattr $C$DW$99, DW_AT_name("hdr")
    1666                            .dwattr $C$DW$99, DW_AT_TI_symbol_name("hdr")
    1667                            .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1668                            .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1669                            .dwattr $C$DW$99, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stack
    1670                            .dwattr $C$DW$99, DW_AT_decl_line(0x3fb)
    1671                            .dwattr $C$DW$99, DW_AT_decl_column(0x10)
    1672                    
    1673                    $C$DW$100       .dwtag  DW_TAG_member
    1674                            .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$72)
    1675                            .dwattr $C$DW$100, DW_AT_name("msg")
    1676                            .dwattr $C$DW$100, DW_AT_TI_symbol_name("msg")
    1677                            .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1678                            .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1679                            .dwattr $C$DW$100, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    1680                            .dwattr $C$DW$100, DW_AT_decl_line(0x3fc)
    1681                            .dwattr $C$DW$100, DW_AT_decl_column(0x1a)
    1682                    
    1683                            .dwattr $C$DW$T$73, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154sta
    1684                            .dwattr $C$DW$T$73, DW_AT_decl_line(0x3fa)
    1685                            .dwattr $C$DW$T$73, DW_AT_decl_column(0x01)
    1686                            .dwendtag $C$DW$T$73
    1687                    
    1688                    $C$DW$T$184     .dwtag  DW_TAG_typedef
    1689                            .dwattr $C$DW$T$184, DW_AT_name("icallLiteMsg_t")
    1690                            .dwattr $C$DW$T$184, DW_AT_type(*$C$DW$T$73)
    1691                            .dwattr $C$DW$T$184, DW_AT_language(DW_LANG_C)
    1692                            .dwattr $C$DW$T$184, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154st
    1693                            .dwattr $C$DW$T$184, DW_AT_decl_line(0x3fd)
    1694                            .dwattr $C$DW$T$184, DW_AT_decl_column(0x03)
    1695                    
    1696                    
    1697                    $C$DW$T$76      .dwtag  DW_TAG_structure_type
    1698                            .dwattr $C$DW$T$76, DW_AT_byte_size(0x0c)
    1699                    $C$DW$101       .dwtag  DW_TAG_member
    1700                            .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$74)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:27 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{9B2EE82F-52CD-4481-81F1-F17C456C1149} PAGE   32

    1701                            .dwattr $C$DW$101, DW_AT_name("bufferHead")
    1702                            .dwattr $C$DW$101, DW_AT_TI_symbol_name("bufferHead")
    1703                            .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1704                            .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1705                            .dwattr $C$DW$101, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    1706                            .dwattr $C$DW$101, DW_AT_decl_line(0x80)
    1707                            .dwattr $C$DW$101, DW_AT_decl_column(0x13)
    1708                    
    1709                    $C$DW$102       .dwtag  DW_TAG_member
    1710                            .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$74)
    1711                            .dwattr $C$DW$102, DW_AT_name("bufferTail")
    1712                            .dwattr $C$DW$102, DW_AT_TI_symbol_name("bufferTail")
    1713                            .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1714                            .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1715                            .dwattr $C$DW$102, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    1716                            .dwattr $C$DW$102, DW_AT_decl_line(0x81)
    1717                            .dwattr $C$DW$102, DW_AT_decl_column(0x13)
    1718                    
    1719                    $C$DW$103       .dwtag  DW_TAG_member
    1720                            .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$20)
    1721                            .dwattr $C$DW$103, DW_AT_name("maxBufSize")
    1722                            .dwattr $C$DW$103, DW_AT_TI_symbol_name("maxBufSize")
    1723                            .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1724                            .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1725                            .dwattr $C$DW$103, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    1726                            .dwattr $C$DW$103, DW_AT_decl_line(0x82)
    1727                            .dwattr $C$DW$103, DW_AT_decl_column(0x0a)
    1728                    
    1729                    $C$DW$104       .dwtag  DW_TAG_member
    1730                            .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$75)
    1731                            .dwattr $C$DW$104, DW_AT_name("pBuffer")
    1732                            .dwattr $C$DW$104, DW_AT_TI_symbol_name("pBuffer")
    1733                            .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1734                            .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1735                            .dwattr $C$DW$104, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    1736                            .dwattr $C$DW$104, DW_AT_decl_line(0x83)
    1737                            .dwattr $C$DW$104, DW_AT_decl_column(0x0a)
    1738                    
    1739                            .dwattr $C$DW$T$76, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154sta
    1740                            .dwattr $C$DW$T$76, DW_AT_decl_line(0x7e)
    1741                            .dwattr $C$DW$T$76, DW_AT_decl_column(0x01)
    1742                            .dwendtag $C$DW$T$76
    1743                    
    1744                    $C$DW$T$78      .dwtag  DW_TAG_typedef
    1745                            .dwattr $C$DW$T$78, DW_AT_name("halUARTBufControl_t")
    1746                            .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$76)
    1747                            .dwattr $C$DW$T$78, DW_AT_language(DW_LANG_C)
    1748                            .dwattr $C$DW$T$78, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154sta
    1749                            .dwattr $C$DW$T$78, DW_AT_decl_line(0x84)
    1750                            .dwattr $C$DW$T$78, DW_AT_decl_column(0x03)
    1751                    
    1752                    
    1753                    $C$DW$T$83      .dwtag  DW_TAG_structure_type
    1754                            .dwattr $C$DW$T$83, DW_AT_byte_size(0x2c)
    1755                    $C$DW$105       .dwtag  DW_TAG_member
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:27 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{9B2EE82F-52CD-4481-81F1-F17C456C1149} PAGE   33

    1756                            .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$77)
    1757                            .dwattr $C$DW$105, DW_AT_name("configured")
    1758                            .dwattr $C$DW$105, DW_AT_TI_symbol_name("configured")
    1759                            .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1760                            .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1761                            .dwattr $C$DW$105, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    1762                            .dwattr $C$DW$105, DW_AT_decl_line(0x88)
    1763                            .dwattr $C$DW$105, DW_AT_decl_column(0x17)
    1764                    
    1765                    $C$DW$106       .dwtag  DW_TAG_member
    1766                            .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$19)
    1767                            .dwattr $C$DW$106, DW_AT_name("baudRate")
    1768                            .dwattr $C$DW$106, DW_AT_TI_symbol_name("baudRate")
    1769                            .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1770                            .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1771                            .dwattr $C$DW$106, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    1772                            .dwattr $C$DW$106, DW_AT_decl_line(0x89)
    1773                            .dwattr $C$DW$106, DW_AT_decl_column(0x17)
    1774                    
    1775                    $C$DW$107       .dwtag  DW_TAG_member
    1776                            .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$77)
    1777                            .dwattr $C$DW$107, DW_AT_name("flowControl")
    1778                            .dwattr $C$DW$107, DW_AT_TI_symbol_name("flowControl")
    1779                            .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1780                            .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1781                            .dwattr $C$DW$107, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    1782                            .dwattr $C$DW$107, DW_AT_decl_line(0x8a)
    1783                            .dwattr $C$DW$107, DW_AT_decl_column(0x17)
    1784                    
    1785                    $C$DW$108       .dwtag  DW_TAG_member
    1786                            .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$20)
    1787                            .dwattr $C$DW$108, DW_AT_name("flowControlThreshold")
    1788                            .dwattr $C$DW$108, DW_AT_TI_symbol_name("flowControlThreshold")
    1789                            .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1790                            .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1791                            .dwattr $C$DW$108, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    1792                            .dwattr $C$DW$108, DW_AT_decl_line(0x8b)
    1793                            .dwattr $C$DW$108, DW_AT_decl_column(0x17)
    1794                    
    1795                    $C$DW$109       .dwtag  DW_TAG_member
    1796                            .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
    1797                            .dwattr $C$DW$109, DW_AT_name("idleTimeout")
    1798                            .dwattr $C$DW$109, DW_AT_TI_symbol_name("idleTimeout")
    1799                            .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1800                            .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1801                            .dwattr $C$DW$109, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    1802                            .dwattr $C$DW$109, DW_AT_decl_line(0x8c)
    1803                            .dwattr $C$DW$109, DW_AT_decl_column(0x17)
    1804                    
    1805                    $C$DW$110       .dwtag  DW_TAG_member
    1806                            .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$78)
    1807                            .dwattr $C$DW$110, DW_AT_name("rx")
    1808                            .dwattr $C$DW$110, DW_AT_TI_symbol_name("rx")
    1809                            .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1810                            .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:27 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{9B2EE82F-52CD-4481-81F1-F17C456C1149} PAGE   34

    1811                            .dwattr $C$DW$110, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    1812                            .dwattr $C$DW$110, DW_AT_decl_line(0x8d)
    1813                            .dwattr $C$DW$110, DW_AT_decl_column(0x17)
    1814                    
    1815                    $C$DW$111       .dwtag  DW_TAG_member
    1816                            .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$78)
    1817                            .dwattr $C$DW$111, DW_AT_name("tx")
    1818                            .dwattr $C$DW$111, DW_AT_TI_symbol_name("tx")
    1819                            .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1820                            .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1821                            .dwattr $C$DW$111, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    1822                            .dwattr $C$DW$111, DW_AT_decl_line(0x8e)
    1823                            .dwattr $C$DW$111, DW_AT_decl_column(0x17)
    1824                    
    1825                    $C$DW$112       .dwtag  DW_TAG_member
    1826                            .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$77)
    1827                            .dwattr $C$DW$112, DW_AT_name("intEnable")
    1828                            .dwattr $C$DW$112, DW_AT_TI_symbol_name("intEnable")
    1829                            .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1830                            .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1831                            .dwattr $C$DW$112, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    1832                            .dwattr $C$DW$112, DW_AT_decl_line(0x8f)
    1833                            .dwattr $C$DW$112, DW_AT_decl_column(0x17)
    1834                    
    1835                    $C$DW$113       .dwtag  DW_TAG_member
    1836                            .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$79)
    1837                            .dwattr $C$DW$113, DW_AT_name("rxChRvdTime")
    1838                            .dwattr $C$DW$113, DW_AT_TI_symbol_name("rxChRvdTime")
    1839                            .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1840                            .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1841                            .dwattr $C$DW$113, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    1842                            .dwattr $C$DW$113, DW_AT_decl_line(0x90)
    1843                            .dwattr $C$DW$113, DW_AT_decl_column(0x17)
    1844                    
    1845                    $C$DW$114       .dwtag  DW_TAG_member
    1846                            .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$82)
    1847                            .dwattr $C$DW$114, DW_AT_name("callBackFunc")
    1848                            .dwattr $C$DW$114, DW_AT_TI_symbol_name("callBackFunc")
    1849                            .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    1850                            .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1851                            .dwattr $C$DW$114, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    1852                            .dwattr $C$DW$114, DW_AT_decl_line(0x91)
    1853                            .dwattr $C$DW$114, DW_AT_decl_column(0x17)
    1854                    
    1855                            .dwattr $C$DW$T$83, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154sta
    1856                            .dwattr $C$DW$T$83, DW_AT_decl_line(0x87)
    1857                            .dwattr $C$DW$T$83, DW_AT_decl_column(0x01)
    1858                            .dwendtag $C$DW$T$83
    1859                    
    1860                    $C$DW$T$185     .dwtag  DW_TAG_typedef
    1861                            .dwattr $C$DW$T$185, DW_AT_name("halUARTCfg_t")
    1862                            .dwattr $C$DW$T$185, DW_AT_type(*$C$DW$T$83)
    1863                            .dwattr $C$DW$T$185, DW_AT_language(DW_LANG_C)
    1864                            .dwattr $C$DW$T$185, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154st
    1865                            .dwattr $C$DW$T$185, DW_AT_decl_line(0x92)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:27 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{9B2EE82F-52CD-4481-81F1-F17C456C1149} PAGE   35

    1866                            .dwattr $C$DW$T$185, DW_AT_decl_column(0x02)
    1867                    
    1868                    
    1869                    $C$DW$T$84      .dwtag  DW_TAG_structure_type
    1870                            .dwattr $C$DW$T$84, DW_AT_byte_size(0x02)
    1871                    $C$DW$115       .dwtag  DW_TAG_member
    1872                            .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
    1873                            .dwattr $C$DW$115, DW_AT_name("event")
    1874                            .dwattr $C$DW$115, DW_AT_TI_symbol_name("event")
    1875                            .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1876                            .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1877                            .dwattr $C$DW$115, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    1878                            .dwattr $C$DW$115, DW_AT_decl_line(0x79)
    1879                            .dwattr $C$DW$115, DW_AT_decl_column(0x0a)
    1880                    
    1881                    $C$DW$116       .dwtag  DW_TAG_member
    1882                            .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$19)
    1883                            .dwattr $C$DW$116, DW_AT_name("status")
    1884                            .dwattr $C$DW$116, DW_AT_TI_symbol_name("status")
    1885                            .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1886                            .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1887                            .dwattr $C$DW$116, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    1888                            .dwattr $C$DW$116, DW_AT_decl_line(0x7a)
    1889                            .dwattr $C$DW$116, DW_AT_decl_column(0x0a)
    1890                    
    1891                            .dwattr $C$DW$T$84, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/M
    1892                            .dwattr $C$DW$T$84, DW_AT_decl_line(0x78)
    1893                            .dwattr $C$DW$T$84, DW_AT_decl_column(0x01)
    1894                            .dwendtag $C$DW$T$84
    1895                    
    1896                    $C$DW$T$85      .dwtag  DW_TAG_typedef
    1897                            .dwattr $C$DW$T$85, DW_AT_name("osal_event_hdr_t")
    1898                            .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$84)
    1899                            .dwattr $C$DW$T$85, DW_AT_language(DW_LANG_C)
    1900                            .dwattr $C$DW$T$85, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/M
    1901                            .dwattr $C$DW$T$85, DW_AT_decl_line(0x7b)
    1902                            .dwattr $C$DW$T$85, DW_AT_decl_column(0x03)
    1903                    
    1904                    
    1905                    $C$DW$T$86      .dwtag  DW_TAG_structure_type
    1906                            .dwattr $C$DW$T$86, DW_AT_byte_size(0x04)
    1907                    $C$DW$117       .dwtag  DW_TAG_member
    1908                            .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$85)
    1909                            .dwattr $C$DW$117, DW_AT_name("hdr")
    1910                            .dwattr $C$DW$117, DW_AT_TI_symbol_name("hdr")
    1911                            .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1912                            .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1913                            .dwattr $C$DW$117, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/examples/rtos/CC131
    1914                            .dwattr $C$DW$117, DW_AT_decl_line(0xbc)
    1915                            .dwattr $C$DW$117, DW_AT_decl_column(0x14)
    1916                    
    1917                    $C$DW$118       .dwtag  DW_TAG_member
    1918                            .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$19)
    1919                            .dwattr $C$DW$118, DW_AT_name("state")
    1920                            .dwattr $C$DW$118, DW_AT_TI_symbol_name("state")
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:27 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{9B2EE82F-52CD-4481-81F1-F17C456C1149} PAGE   36

    1921                            .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1922                            .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1923                            .dwattr $C$DW$118, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/examples/rtos/CC131
    1924                            .dwattr $C$DW$118, DW_AT_decl_line(0xbd)
    1925                            .dwattr $C$DW$118, DW_AT_decl_column(0x09)
    1926                    
    1927                    $C$DW$119       .dwtag  DW_TAG_member
    1928                            .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
    1929                            .dwattr $C$DW$119, DW_AT_name("keys")
    1930                            .dwattr $C$DW$119, DW_AT_TI_symbol_name("keys")
    1931                            .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1932                            .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1933                            .dwattr $C$DW$119, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/examples/rtos/CC131
    1934                            .dwattr $C$DW$119, DW_AT_decl_line(0xbe)
    1935                            .dwattr $C$DW$119, DW_AT_decl_column(0x09)
    1936                    
    1937                            .dwattr $C$DW$T$86, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/examples/rtos/CC13
    1938                            .dwattr $C$DW$T$86, DW_AT_decl_line(0xbb)
    1939                            .dwattr $C$DW$T$86, DW_AT_decl_column(0x01)
    1940                            .dwendtag $C$DW$T$86
    1941                    
    1942                    $C$DW$T$186     .dwtag  DW_TAG_typedef
    1943                            .dwattr $C$DW$T$186, DW_AT_name("keyChange_t")
    1944                            .dwattr $C$DW$T$186, DW_AT_type(*$C$DW$T$86)
    1945                            .dwattr $C$DW$T$186, DW_AT_language(DW_LANG_C)
    1946                            .dwattr $C$DW$T$186, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/examples/rtos/CC1
    1947                            .dwattr $C$DW$T$186, DW_AT_decl_line(0xbf)
    1948                            .dwattr $C$DW$T$186, DW_AT_decl_column(0x03)
    1949                    
    1950                    
    1951                    $C$DW$T$91      .dwtag  DW_TAG_union_type
    1952                            .dwattr $C$DW$T$91, DW_AT_byte_size(0x02)
    1953                    $C$DW$120       .dwtag  DW_TAG_member
    1954                            .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$88)
    1955                            .dwattr $C$DW$120, DW_AT_name("entityId")
    1956                            .dwattr $C$DW$120, DW_AT_TI_symbol_name("entityId")
    1957                            .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1958                            .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1959                            .dwattr $C$DW$120, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    1960                            .dwattr $C$DW$120, DW_AT_decl_line(0x1fe)
    1961                            .dwattr $C$DW$120, DW_AT_decl_column(0x14)
    1962                    
    1963                    $C$DW$121       .dwtag  DW_TAG_member
    1964                            .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$90)
    1965                            .dwattr $C$DW$121, DW_AT_name("servId")
    1966                            .dwattr $C$DW$121, DW_AT_TI_symbol_name("servId")
    1967                            .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1968                            .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1969                            .dwattr $C$DW$121, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    1970                            .dwattr $C$DW$121, DW_AT_decl_line(0x200)
    1971                            .dwattr $C$DW$121, DW_AT_decl_column(0x17)
    1972                    
    1973                            .dwattr $C$DW$T$91, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154sta
    1974                            .dwattr $C$DW$T$91, DW_AT_decl_line(0x1fc)
    1975                            .dwattr $C$DW$T$91, DW_AT_decl_column(0x03)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:27 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{9B2EE82F-52CD-4481-81F1-F17C456C1149} PAGE   37

    1976                            .dwendtag $C$DW$T$91
    1977                    
    1978                    
    1979                    $C$DW$T$92      .dwtag  DW_TAG_union_type
    1980                            .dwattr $C$DW$T$92, DW_AT_byte_size(0x02)
    1981                    $C$DW$122       .dwtag  DW_TAG_member
    1982                            .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$90)
    1983                            .dwattr $C$DW$122, DW_AT_name("servId")
    1984                            .dwattr $C$DW$122, DW_AT_TI_symbol_name("servId")
    1985                            .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1986                            .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1987                            .dwattr $C$DW$122, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    1988                            .dwattr $C$DW$122, DW_AT_decl_line(0x211)
    1989                            .dwattr $C$DW$122, DW_AT_decl_column(0x17)
    1990                    
    1991                    $C$DW$123       .dwtag  DW_TAG_member
    1992                            .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$88)
    1993                            .dwattr $C$DW$123, DW_AT_name("entityId")
    1994                            .dwattr $C$DW$123, DW_AT_TI_symbol_name("entityId")
    1995                            .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1996                            .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1997                            .dwattr $C$DW$123, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    1998                            .dwattr $C$DW$123, DW_AT_decl_line(0x213)
    1999                            .dwattr $C$DW$123, DW_AT_decl_column(0x14)
    2000                    
    2001                            .dwattr $C$DW$T$92, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154sta
    2002                            .dwattr $C$DW$T$92, DW_AT_decl_line(0x20f)
    2003                            .dwattr $C$DW$T$92, DW_AT_decl_column(0x03)
    2004                            .dwendtag $C$DW$T$92
    2005                    
    2006                    
    2007                    $C$DW$T$93      .dwtag  DW_TAG_union_type
    2008                            .dwattr $C$DW$T$93, DW_AT_byte_size(0x02)
    2009                    $C$DW$124       .dwtag  DW_TAG_member
    2010                            .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$77)
    2011                            .dwattr $C$DW$124, DW_AT_name("paramCTS")
    2012                            .dwattr $C$DW$124, DW_AT_TI_symbol_name("paramCTS")
    2013                            .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2014                            .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    2015                            .dwattr $C$DW$124, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    2016                            .dwattr $C$DW$124, DW_AT_decl_line(0x96)
    2017                            .dwattr $C$DW$124, DW_AT_decl_column(0x08)
    2018                    
    2019                    $C$DW$125       .dwtag  DW_TAG_member
    2020                            .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$77)
    2021                            .dwattr $C$DW$125, DW_AT_name("paramRTS")
    2022                            .dwattr $C$DW$125, DW_AT_TI_symbol_name("paramRTS")
    2023                            .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2024                            .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    2025                            .dwattr $C$DW$125, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    2026                            .dwattr $C$DW$125, DW_AT_decl_line(0x97)
    2027                            .dwattr $C$DW$125, DW_AT_decl_column(0x08)
    2028                    
    2029                    $C$DW$126       .dwtag  DW_TAG_member
    2030                            .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$77)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:27 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{9B2EE82F-52CD-4481-81F1-F17C456C1149} PAGE   38

    2031                            .dwattr $C$DW$126, DW_AT_name("paramDSR")
    2032                            .dwattr $C$DW$126, DW_AT_TI_symbol_name("paramDSR")
    2033                            .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2034                            .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    2035                            .dwattr $C$DW$126, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    2036                            .dwattr $C$DW$126, DW_AT_decl_line(0x98)
    2037                            .dwattr $C$DW$126, DW_AT_decl_column(0x08)
    2038                    
    2039                    $C$DW$127       .dwtag  DW_TAG_member
    2040                            .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$77)
    2041                            .dwattr $C$DW$127, DW_AT_name("paramDTR")
    2042                            .dwattr $C$DW$127, DW_AT_TI_symbol_name("paramDTR")
    2043                            .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2044                            .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    2045                            .dwattr $C$DW$127, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    2046                            .dwattr $C$DW$127, DW_AT_decl_line(0x99)
    2047                            .dwattr $C$DW$127, DW_AT_decl_column(0x08)
    2048                    
    2049                    $C$DW$128       .dwtag  DW_TAG_member
    2050                            .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$77)
    2051                            .dwattr $C$DW$128, DW_AT_name("paramCD")
    2052                            .dwattr $C$DW$128, DW_AT_TI_symbol_name("paramCD")
    2053                            .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2054                            .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    2055                            .dwattr $C$DW$128, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    2056                            .dwattr $C$DW$128, DW_AT_decl_line(0x9a)
    2057                            .dwattr $C$DW$128, DW_AT_decl_column(0x08)
    2058                    
    2059                    $C$DW$129       .dwtag  DW_TAG_member
    2060                            .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$77)
    2061                            .dwattr $C$DW$129, DW_AT_name("paramRI")
    2062                            .dwattr $C$DW$129, DW_AT_TI_symbol_name("paramRI")
    2063                            .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2064                            .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    2065                            .dwattr $C$DW$129, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    2066                            .dwattr $C$DW$129, DW_AT_decl_line(0x9b)
    2067                            .dwattr $C$DW$129, DW_AT_decl_column(0x08)
    2068                    
    2069                    $C$DW$130       .dwtag  DW_TAG_member
    2070                            .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$20)
    2071                            .dwattr $C$DW$130, DW_AT_name("baudRate")
    2072                            .dwattr $C$DW$130, DW_AT_TI_symbol_name("baudRate")
    2073                            .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2074                            .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    2075                            .dwattr $C$DW$130, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    2076                            .dwattr $C$DW$130, DW_AT_decl_line(0x9c)
    2077                            .dwattr $C$DW$130, DW_AT_decl_column(0x0a)
    2078                    
    2079                    $C$DW$131       .dwtag  DW_TAG_member
    2080                            .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$77)
    2081                            .dwattr $C$DW$131, DW_AT_name("flowControl")
    2082                            .dwattr $C$DW$131, DW_AT_TI_symbol_name("flowControl")
    2083                            .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2084                            .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    2085                            .dwattr $C$DW$131, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:27 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{9B2EE82F-52CD-4481-81F1-F17C456C1149} PAGE   39

    2086                            .dwattr $C$DW$131, DW_AT_decl_line(0x9d)
    2087                            .dwattr $C$DW$131, DW_AT_decl_column(0x08)
    2088                    
    2089                    $C$DW$132       .dwtag  DW_TAG_member
    2090                            .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$77)
    2091                            .dwattr $C$DW$132, DW_AT_name("flushControl")
    2092                            .dwattr $C$DW$132, DW_AT_TI_symbol_name("flushControl")
    2093                            .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2094                            .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    2095                            .dwattr $C$DW$132, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    2096                            .dwattr $C$DW$132, DW_AT_decl_line(0x9e)
    2097                            .dwattr $C$DW$132, DW_AT_decl_column(0x08)
    2098                    
    2099                            .dwattr $C$DW$T$93, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154sta
    2100                            .dwattr $C$DW$T$93, DW_AT_decl_line(0x95)
    2101                            .dwattr $C$DW$T$93, DW_AT_decl_column(0x01)
    2102                            .dwendtag $C$DW$T$93
    2103                    
    2104                    $C$DW$T$187     .dwtag  DW_TAG_typedef
    2105                            .dwattr $C$DW$T$187, DW_AT_name("halUARTIoctl_t")
    2106                            .dwattr $C$DW$T$187, DW_AT_type(*$C$DW$T$93)
    2107                            .dwattr $C$DW$T$187, DW_AT_language(DW_LANG_C)
    2108                            .dwattr $C$DW$T$187, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154st
    2109                            .dwattr $C$DW$T$187, DW_AT_decl_line(0x9f)
    2110                            .dwattr $C$DW$T$187, DW_AT_decl_column(0x02)
    2111                    
    2112                    
    2113                    $C$DW$T$94      .dwtag  DW_TAG_structure_type
    2114                            .dwattr $C$DW$T$94, DW_AT_name(".ggroup1")
    2115                            .dwattr $C$DW$T$94, DW_AT_byte_size(0x08)
    2116                    $C$DW$133       .dwtag  DW_TAG_member
    2117                            .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$11)
    2118                            .dwattr $C$DW$133, DW_AT_name("timeMSec")
    2119                            .dwattr $C$DW$133, DW_AT_TI_symbol_name("timeMSec")
    2120                            .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2121                            .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    2122                    
    2123                    $C$DW$134       .dwtag  DW_TAG_member
    2124                            .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$11)
    2125                            .dwattr $C$DW$134, DW_AT_name("OSAL_timeSeconds")
    2126                            .dwattr $C$DW$134, DW_AT_TI_symbol_name("OSAL_timeSeconds")
    2127                            .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2128                            .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    2129                    
    2130                            .dwendtag $C$DW$T$94
    2131                    
    2132                    
    2133                    $C$DW$T$95      .dwtag  DW_TAG_structure_type
    2134                            .dwattr $C$DW$T$95, DW_AT_name("_ICall_LiteCmdStatus_")
    2135                            .dwattr $C$DW$T$95, DW_AT_byte_size(0x01)
    2136                    $C$DW$135       .dwtag  DW_TAG_member
    2137                            .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$87)
    2138                            .dwattr $C$DW$135, DW_AT_name("cmdId")
    2139                            .dwattr $C$DW$135, DW_AT_TI_symbol_name("cmdId")
    2140                            .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:27 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{9B2EE82F-52CD-4481-81F1-F17C456C1149} PAGE   40

    2141                            .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    2142                            .dwattr $C$DW$135, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    2143                            .dwattr $C$DW$135, DW_AT_decl_line(0x3f0)
    2144                            .dwattr $C$DW$135, DW_AT_decl_column(0x11)
    2145                    
    2146                            .dwattr $C$DW$T$95, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154sta
    2147                            .dwattr $C$DW$T$95, DW_AT_decl_line(0x3ee)
    2148                            .dwattr $C$DW$T$95, DW_AT_decl_column(0x10)
    2149                            .dwendtag $C$DW$T$95
    2150                    
    2151                    $C$DW$T$189     .dwtag  DW_TAG_typedef
    2152                            .dwattr $C$DW$T$189, DW_AT_name("ICall_LiteCmdStatus")
    2153                            .dwattr $C$DW$T$189, DW_AT_type(*$C$DW$T$95)
    2154                            .dwattr $C$DW$T$189, DW_AT_language(DW_LANG_C)
    2155                            .dwattr $C$DW$T$189, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154st
    2156                            .dwattr $C$DW$T$189, DW_AT_decl_line(0x3f1)
    2157                            .dwattr $C$DW$T$189, DW_AT_decl_column(0x03)
    2158                    
    2159                    $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    2160                            .dwattr $C$DW$T$2, DW_AT_name("void")
    2161                    
    2162                    $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    2163                            .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
    2164                            .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
    2165                    
    2166                    $C$DW$T$190     .dwtag  DW_TAG_typedef
    2167                            .dwattr $C$DW$T$190, DW_AT_name("ICall_Semaphore")
    2168                            .dwattr $C$DW$T$190, DW_AT_type(*$C$DW$T$3)
    2169                            .dwattr $C$DW$T$190, DW_AT_language(DW_LANG_C)
    2170                            .dwattr $C$DW$T$190, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154st
    2171                            .dwattr $C$DW$T$190, DW_AT_decl_line(0x1ac)
    2172                            .dwattr $C$DW$T$190, DW_AT_decl_column(0x0f)
    2173                    
    2174                    $C$DW$T$109     .dwtag  DW_TAG_typedef
    2175                            .dwattr $C$DW$T$109, DW_AT_name("ICall_SyncHandle")
    2176                            .dwattr $C$DW$T$109, DW_AT_type(*$C$DW$T$3)
    2177                            .dwattr $C$DW$T$109, DW_AT_language(DW_LANG_C)
    2178                            .dwattr $C$DW$T$109, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154st
    2179                            .dwattr $C$DW$T$109, DW_AT_decl_line(0x1aa)
    2180                            .dwattr $C$DW$T$109, DW_AT_decl_column(0x0f)
    2181                    
    2182                    $C$DW$T$153     .dwtag  DW_TAG_typedef
    2183                            .dwattr $C$DW$T$153, DW_AT_name("ICall_TimerID")
    2184                            .dwattr $C$DW$T$153, DW_AT_type(*$C$DW$T$3)
    2185                            .dwattr $C$DW$T$153, DW_AT_language(DW_LANG_C)
    2186                            .dwattr $C$DW$T$153, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154st
    2187                            .dwattr $C$DW$T$153, DW_AT_decl_line(0x1b7)
    2188                            .dwattr $C$DW$T$153, DW_AT_decl_column(0x0f)
    2189                    
    2190                    $C$DW$T$191     .dwtag  DW_TAG_typedef
    2191                            .dwattr $C$DW$T$191, DW_AT_name("osal_msg_q_t")
    2192                            .dwattr $C$DW$T$191, DW_AT_type(*$C$DW$T$3)
    2193                            .dwattr $C$DW$T$191, DW_AT_language(DW_LANG_C)
    2194                            .dwattr $C$DW$T$191, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/
    2195                            .dwattr $C$DW$T$191, DW_AT_decl_line(0x7d)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:27 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{9B2EE82F-52CD-4481-81F1-F17C456C1149} PAGE   41

    2196                            .dwattr $C$DW$T$191, DW_AT_decl_column(0x10)
    2197                    
    2198                    
    2199                    $C$DW$T$37      .dwtag  DW_TAG_subroutine_type
    2200                            .dwattr $C$DW$T$37, DW_AT_language(DW_LANG_C)
    2201                            .dwendtag $C$DW$T$37
    2202                    
    2203                    $C$DW$T$38      .dwtag  DW_TAG_pointer_type
    2204                            .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$37)
    2205                            .dwattr $C$DW$T$38, DW_AT_address_class(0x20)
    2206                    
    2207                    $C$DW$T$169     .dwtag  DW_TAG_typedef
    2208                            .dwattr $C$DW$T$169, DW_AT_name("APPASRTINTF_callAssrtHndler")
    2209                            .dwattr $C$DW$T$169, DW_AT_type(*$C$DW$T$38)
    2210                            .dwattr $C$DW$T$169, DW_AT_language(DW_LANG_C)
    2211                            .dwattr $C$DW$T$169, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154st
    2212                            .dwattr $C$DW$T$169, DW_AT_decl_line(0x43)
    2213                            .dwattr $C$DW$T$169, DW_AT_decl_column(0x10)
    2214                    
    2215                    $C$DW$T$56      .dwtag  DW_TAG_typedef
    2216                            .dwattr $C$DW$T$56, DW_AT_name("FPTR_HFSOURCESAFESWITCH_T")
    2217                            .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$38)
    2218                            .dwattr $C$DW$T$56, DW_AT_language(DW_LANG_C)
    2219                            .dwattr $C$DW$T$56, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\
    2220                            .dwattr $C$DW$T$56, DW_AT_decl_line(0x5f)
    2221                            .dwattr $C$DW$T$56, DW_AT_decl_column(0x19)
    2222                    
    2223                    $C$DW$T$39      .dwtag  DW_TAG_typedef
    2224                            .dwattr $C$DW$T$39, DW_AT_name("FPTR_RESETDEV_T")
    2225                            .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$38)
    2226                            .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    2227                            .dwattr $C$DW$T$39, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\
    2228                            .dwattr $C$DW$T$39, DW_AT_decl_line(0x4d)
    2229                            .dwattr $C$DW$T$39, DW_AT_decl_column(0x19)
    2230                    
    2231                    $C$DW$T$192     .dwtag  DW_TAG_typedef
    2232                            .dwattr $C$DW$T$192, DW_AT_name("FPTR_VOID_VOID_T")
    2233                            .dwattr $C$DW$T$192, DW_AT_type(*$C$DW$T$38)
    2234                            .dwattr $C$DW$T$192, DW_AT_language(DW_LANG_C)
    2235                            .dwattr $C$DW$T$192, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices
    2236                            .dwattr $C$DW$T$192, DW_AT_decl_line(0x33)
    2237                            .dwattr $C$DW$T$192, DW_AT_decl_column(0x11)
    2238                    
    2239                    $C$DW$T$193     .dwtag  DW_TAG_typedef
    2240                            .dwattr $C$DW$T$193, DW_AT_name("__TI_atexit_fn")
    2241                            .dwattr $C$DW$T$193, DW_AT_type(*$C$DW$T$38)
    2242                            .dwattr $C$DW$T$193, DW_AT_language(DW_LANG_C)
    2243                            .dwattr $C$DW$T$193, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include
    2244                            .dwattr $C$DW$T$193, DW_AT_decl_line(0xb9)
    2245                            .dwattr $C$DW$T$193, DW_AT_decl_column(0x14)
    2246                    
    2247                    
    2248                    $C$DW$T$52      .dwtag  DW_TAG_subroutine_type
    2249                            .dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
    2250                    $C$DW$136       .dwtag  DW_TAG_formal_parameter
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:27 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{9B2EE82F-52CD-4481-81F1-F17C456C1149} PAGE   42

    2251                            .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$22)
    2252                    
    2253                            .dwendtag $C$DW$T$52
    2254                    
    2255                    $C$DW$T$53      .dwtag  DW_TAG_pointer_type
    2256                            .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$52)
    2257                            .dwattr $C$DW$T$53, DW_AT_address_class(0x20)
    2258                    
    2259                    $C$DW$T$54      .dwtag  DW_TAG_typedef
    2260                            .dwattr $C$DW$T$54, DW_AT_name("FPTR_RESERVED4_T")
    2261                            .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$53)
    2262                            .dwattr $C$DW$T$54, DW_AT_language(DW_LANG_C)
    2263                            .dwattr $C$DW$T$54, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\
    2264                            .dwattr $C$DW$T$54, DW_AT_decl_line(0x61)
    2265                            .dwattr $C$DW$T$54, DW_AT_decl_column(0x19)
    2266                    
    2267                    $C$DW$T$55      .dwtag  DW_TAG_typedef
    2268                            .dwattr $C$DW$T$55, DW_AT_name("FPTR_RESERVED5_T")
    2269                            .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$53)
    2270                            .dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C)
    2271                            .dwattr $C$DW$T$55, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\
    2272                            .dwattr $C$DW$T$55, DW_AT_decl_line(0x63)
    2273                            .dwattr $C$DW$T$55, DW_AT_decl_column(0x19)
    2274                    
    2275                    
    2276                    $C$DW$T$57      .dwtag  DW_TAG_subroutine_type
    2277                            .dwattr $C$DW$T$57, DW_AT_language(DW_LANG_C)
    2278                    $C$DW$137       .dwtag  DW_TAG_formal_parameter
    2279                            .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$23)
    2280                    
    2281                            .dwendtag $C$DW$T$57
    2282                    
    2283                    $C$DW$T$58      .dwtag  DW_TAG_pointer_type
    2284                            .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$57)
    2285                            .dwattr $C$DW$T$58, DW_AT_address_class(0x20)
    2286                    
    2287                    $C$DW$T$61      .dwtag  DW_TAG_typedef
    2288                            .dwattr $C$DW$T$61, DW_AT_name("FPTR_ADCCOMPBIN_T")
    2289                            .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$58)
    2290                            .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
    2291                            .dwattr $C$DW$T$61, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\
    2292                            .dwattr $C$DW$T$61, DW_AT_decl_line(0x69)
    2293                            .dwattr $C$DW$T$61, DW_AT_decl_column(0x19)
    2294                    
    2295                    $C$DW$T$59      .dwtag  DW_TAG_typedef
    2296                            .dwattr $C$DW$T$59, DW_AT_name("FPTR_COMPAIN_T")
    2297                            .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$58)
    2298                            .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
    2299                            .dwattr $C$DW$T$59, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\
    2300                            .dwattr $C$DW$T$59, DW_AT_decl_line(0x65)
    2301                            .dwattr $C$DW$T$59, DW_AT_decl_column(0x19)
    2302                    
    2303                    $C$DW$T$60      .dwtag  DW_TAG_typedef
    2304                            .dwattr $C$DW$T$60, DW_AT_name("FPTR_COMPAREF_T")
    2305                            .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$58)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:27 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{9B2EE82F-52CD-4481-81F1-F17C456C1149} PAGE   43

    2306                            .dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
    2307                            .dwattr $C$DW$T$60, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\
    2308                            .dwattr $C$DW$T$60, DW_AT_decl_line(0x67)
    2309                            .dwattr $C$DW$T$60, DW_AT_decl_column(0x19)
    2310                    
    2311                    $C$DW$T$62      .dwtag  DW_TAG_typedef
    2312                            .dwattr $C$DW$T$62, DW_AT_name("FPTR_COMPBREF_T")
    2313                            .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$58)
    2314                            .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
    2315                            .dwattr $C$DW$T$62, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\
    2316                            .dwattr $C$DW$T$62, DW_AT_decl_line(0x6b)
    2317                            .dwattr $C$DW$T$62, DW_AT_decl_column(0x19)
    2318                    
    2319                    $C$DW$T$194     .dwtag  DW_TAG_typedef
    2320                            .dwattr $C$DW$T$194, DW_AT_name("FPTR_VOID_UINT8_T")
    2321                            .dwattr $C$DW$T$194, DW_AT_type(*$C$DW$T$58)
    2322                            .dwattr $C$DW$T$194, DW_AT_language(DW_LANG_C)
    2323                            .dwattr $C$DW$T$194, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices
    2324                            .dwattr $C$DW$T$194, DW_AT_decl_line(0x34)
    2325                            .dwattr $C$DW$T$194, DW_AT_decl_column(0x11)
    2326                    
    2327                    
    2328                    $C$DW$T$80      .dwtag  DW_TAG_subroutine_type
    2329                            .dwattr $C$DW$T$80, DW_AT_language(DW_LANG_C)
    2330                    $C$DW$138       .dwtag  DW_TAG_formal_parameter
    2331                            .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$19)
    2332                    
    2333                    $C$DW$139       .dwtag  DW_TAG_formal_parameter
    2334                            .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$19)
    2335                    
    2336                            .dwendtag $C$DW$T$80
    2337                    
    2338                    $C$DW$T$81      .dwtag  DW_TAG_pointer_type
    2339                            .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$80)
    2340                            .dwattr $C$DW$T$81, DW_AT_address_class(0x20)
    2341                    
    2342                    $C$DW$T$195     .dwtag  DW_TAG_typedef
    2343                            .dwattr $C$DW$T$195, DW_AT_name("assertCback_t")
    2344                            .dwattr $C$DW$T$195, DW_AT_type(*$C$DW$T$81)
    2345                            .dwattr $C$DW$T$195, DW_AT_language(DW_LANG_C)
    2346                            .dwattr $C$DW$T$195, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154st
    2347                            .dwattr $C$DW$T$195, DW_AT_decl_line(0xd3)
    2348                            .dwattr $C$DW$T$195, DW_AT_decl_column(0x10)
    2349                    
    2350                    $C$DW$T$82      .dwtag  DW_TAG_typedef
    2351                            .dwattr $C$DW$T$82, DW_AT_name("halUARTCBack_t")
    2352                            .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$81)
    2353                            .dwattr $C$DW$T$82, DW_AT_language(DW_LANG_C)
    2354                            .dwattr $C$DW$T$82, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154sta
