TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:30 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{24102AC7-264E-4E23-8F1F-41525EB8EC61} PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                        PC v16.9.4.LTS *
       3                    ;* Date/Time created: Sat Nov 18 18:46:29 2017                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../Application/MAC/StartUp/osaltasks.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v16.9.4.LTS Copyright (c) 1996-20
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Kevin\workspace_v7\sensor_cc1310lp\sensor_cc1310lp"
      13                    
      14                    $C$DW$1 .dwtag  DW_TAG_subprogram

    3797                            .dwattr $C$DW$387, DW_AT_const_value(0x08)
    3798                            .dwattr $C$DW$387, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    3799                            .dwattr $C$DW$387, DW_AT_decl_line(0xa8)
    3800                            .dwattr $C$DW$387, DW_AT_decl_column(0x05)
    3801                    
    3802                    $C$DW$388       .dwtag  DW_TAG_enumerator
    3803                            .dwattr $C$DW$388, DW_AT_name("FAPI_VALIDATE_SECTOR")
    3804                            .dwattr $C$DW$388, DW_AT_const_value(0x0e)
    3805                            .dwattr $C$DW$388, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    3806                            .dwattr $C$DW$388, DW_AT_decl_line(0xa9)
    3807                            .dwattr $C$DW$388, DW_AT_decl_column(0x05)
    3808                    
    3809                    $C$DW$389       .dwtag  DW_TAG_enumerator
    3810                            .dwattr $C$DW$389, DW_AT_name("FAPI_CLEAR_STATUS")
    3811                            .dwattr $C$DW$389, DW_AT_const_value(0x10)
    3812                            .dwattr $C$DW$389, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    3813                            .dwattr $C$DW$389, DW_AT_decl_line(0xaa)
    3814                            .dwattr $C$DW$389, DW_AT_decl_column(0x05)
    3815                    
    3816                    $C$DW$390       .dwtag  DW_TAG_enumerator
    3817                            .dwattr $C$DW$390, DW_AT_name("FAPI_PROGRAM_RESUME")
    3818                            .dwattr $C$DW$390, DW_AT_const_value(0x14)
    3819                            .dwattr $C$DW$390, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    3820                            .dwattr $C$DW$390, DW_AT_decl_line(0xab)
    3821                            .dwattr $C$DW$390, DW_AT_decl_column(0x05)
    3822                    
    3823                    $C$DW$391       .dwtag  DW_TAG_enumerator
    3824                            .dwattr $C$DW$391, DW_AT_name("FAPI_ERASE_RESUME")
    3825                            .dwattr $C$DW$391, DW_AT_const_value(0x16)
    3826                            .dwattr $C$DW$391, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    3827                            .dwattr $C$DW$391, DW_AT_decl_line(0xac)
    3828                            .dwattr $C$DW$391, DW_AT_decl_column(0x05)
    3829                    
    3830                    $C$DW$392       .dwtag  DW_TAG_enumerator
    3831                            .dwattr $C$DW$392, DW_AT_name("FAPI_CLEAR_MORE")
    3832                            .dwattr $C$DW$392, DW_AT_const_value(0x18)
    3833                            .dwattr $C$DW$392, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    3834                            .dwattr $C$DW$392, DW_AT_decl_line(0xad)
    3835                            .dwattr $C$DW$392, DW_AT_decl_column(0x05)
    3836                    
    3837                    $C$DW$393       .dwtag  DW_TAG_enumerator
    3838                            .dwattr $C$DW$393, DW_AT_name("FAPI_PROGRAM_SECTOR")
    3839                            .dwattr $C$DW$393, DW_AT_const_value(0x20)
    3840                            .dwattr $C$DW$393, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    3841                            .dwattr $C$DW$393, DW_AT_decl_line(0xae)
    3842                            .dwattr $C$DW$393, DW_AT_decl_column(0x05)
    3843                    
    3844                    $C$DW$394       .dwtag  DW_TAG_enumerator
    3845                            .dwattr $C$DW$394, DW_AT_name("FAPI_ERASE_OTP")
    3846                            .dwattr $C$DW$394, DW_AT_const_value(0x30)
    3847                            .dwattr $C$DW$394, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    3848                            .dwattr $C$DW$394, DW_AT_decl_line(0xaf)
    3849                            .dwattr $C$DW$394, DW_AT_decl_column(0x05)
    3850                    
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:30 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{24102AC7-264E-4E23-8F1F-41525EB8EC61} PAGE   71

    3851                            .dwattr $C$DW$T$1018, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/device
    3852                            .dwattr $C$DW$T$1018, DW_AT_decl_line(0xa5)
    3853                            .dwattr $C$DW$T$1018, DW_AT_decl_column(0x01)
    3854                            .dwendtag $C$DW$T$1018
    3855                    
    3856                    $C$DW$T$1019    .dwtag  DW_TAG_typedef
    3857                            .dwattr $C$DW$T$1019, DW_AT_name("tFlashStateCommandsType")
    3858                            .dwattr $C$DW$T$1019, DW_AT_type(*$C$DW$T$1018)
    3859                            .dwattr $C$DW$T$1019, DW_AT_language(DW_LANG_C)
    3860                            .dwattr $C$DW$T$1019, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/device
    3861                            .dwattr $C$DW$T$1019, DW_AT_decl_line(0xb0)
    3862                            .dwattr $C$DW$T$1019, DW_AT_decl_column(0x03)
    3863                    
    3864                    
    3865                    $C$DW$T$22      .dwtag  DW_TAG_structure_type
    3866                            .dwattr $C$DW$T$22, DW_AT_byte_size(0x10)
    3867                    $C$DW$395       .dwtag  DW_TAG_member
    3868                            .dwattr $C$DW$395, DW_AT_type(*$C$DW$T$19)
    3869                            .dwattr $C$DW$395, DW_AT_name("rfMode")
    3870                            .dwattr $C$DW$395, DW_AT_TI_symbol_name("rfMode")
    3871                            .dwattr $C$DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3872                            .dwattr $C$DW$395, DW_AT_accessibility(DW_ACCESS_public)
    3873                            .dwattr $C$DW$395, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/r
    3874                            .dwattr $C$DW$395, DW_AT_decl_line(0x2b7)
    3875                            .dwattr $C$DW$395, DW_AT_decl_column(0x0d)
    3876                    
    3877                    $C$DW$396       .dwtag  DW_TAG_member
    3878                            .dwattr $C$DW$396, DW_AT_type(*$C$DW$T$21)
    3879                            .dwattr $C$DW$396, DW_AT_name("cpePatchFxn")
    3880                            .dwattr $C$DW$396, DW_AT_TI_symbol_name("cpePatchFxn")
    3881                            .dwattr $C$DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3882                            .dwattr $C$DW$396, DW_AT_accessibility(DW_ACCESS_public)
    3883                            .dwattr $C$DW$396, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/r
    3884                            .dwattr $C$DW$396, DW_AT_decl_line(0x2b8)
    3885                            .dwattr $C$DW$396, DW_AT_decl_column(0x0c)
    3886                    
    3887                    $C$DW$397       .dwtag  DW_TAG_member
    3888                            .dwattr $C$DW$397, DW_AT_type(*$C$DW$T$21)
    3889                            .dwattr $C$DW$397, DW_AT_name("mcePatchFxn")
    3890                            .dwattr $C$DW$397, DW_AT_TI_symbol_name("mcePatchFxn")
    3891                            .dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3892                            .dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_public)
    3893                            .dwattr $C$DW$397, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/r
    3894                            .dwattr $C$DW$397, DW_AT_decl_line(0x2b9)
    3895                            .dwattr $C$DW$397, DW_AT_decl_column(0x0c)
    3896                    
    3897                    $C$DW$398       .dwtag  DW_TAG_member
    3898                            .dwattr $C$DW$398, DW_AT_type(*$C$DW$T$21)
    3899                            .dwattr $C$DW$398, DW_AT_name("rfePatchFxn")
    3900                            .dwattr $C$DW$398, DW_AT_TI_symbol_name("rfePatchFxn")
    3901                            .dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3902                            .dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_public)
    3903                            .dwattr $C$DW$398, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/r
    3904                            .dwattr $C$DW$398, DW_AT_decl_line(0x2ba)
    3905                            .dwattr $C$DW$398, DW_AT_decl_column(0x0c)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:30 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{24102AC7-264E-4E23-8F1F-41525EB8EC61} PAGE   72

    3906                    
    3907                            .dwattr $C$DW$T$22, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/
    3908                            .dwattr $C$DW$T$22, DW_AT_decl_line(0x2b6)
    3909                            .dwattr $C$DW$T$22, DW_AT_decl_column(0x10)
    3910                            .dwendtag $C$DW$T$22
    3911                    
    3912                    $C$DW$T$32      .dwtag  DW_TAG_typedef
    3913                            .dwattr $C$DW$T$32, DW_AT_name("RF_Mode")
    3914                            .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$22)
    3915                            .dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)
    3916                            .dwattr $C$DW$T$32, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/
    3917                            .dwattr $C$DW$T$32, DW_AT_decl_line(0x2bb)
    3918                            .dwattr $C$DW$T$32, DW_AT_decl_column(0x03)
    3919                    
    3920                    $C$DW$T$33      .dwtag  DW_TAG_pointer_type
    3921                            .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
    3922                            .dwattr $C$DW$T$33, DW_AT_address_class(0x20)
    3923                    
    3924                    
    3925                    $C$DW$T$25      .dwtag  DW_TAG_structure_type
    3926                            .dwattr $C$DW$T$25, DW_AT_byte_size(0x03)
    3927                    $C$DW$399       .dwtag  DW_TAG_member
    3928                            .dwattr $C$DW$399, DW_AT_type(*$C$DW$T$23)
    3929                            .dwattr $C$DW$399, DW_AT_name("Pout")
    3930                            .dwattr $C$DW$399, DW_AT_TI_symbol_name("Pout")
    3931                            .dwattr $C$DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3932                            .dwattr $C$DW$399, DW_AT_accessibility(DW_ACCESS_public)
    3933                            .dwattr $C$DW$399, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/ma
    3934                            .dwattr $C$DW$399, DW_AT_decl_line(0x12f)
    3935                            .dwattr $C$DW$399, DW_AT_decl_column(0x0a)
    3936                    
    3937                    $C$DW$400       .dwtag  DW_TAG_member
    3938                            .dwattr $C$DW$400, DW_AT_type(*$C$DW$T$24)
    3939                            .dwattr $C$DW$400, DW_AT_name("txPwrVal")
    3940                            .dwattr $C$DW$400, DW_AT_TI_symbol_name("txPwrVal")
    3941                            .dwattr $C$DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3942                            .dwattr $C$DW$400, DW_AT_accessibility(DW_ACCESS_public)
    3943                            .dwattr $C$DW$400, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/ma
    3944                            .dwattr $C$DW$400, DW_AT_decl_line(0x130)
    3945                            .dwattr $C$DW$400, DW_AT_decl_column(0x0a)
    3946                    
    3947                            .dwattr $C$DW$T$25, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/m
    3948                            .dwattr $C$DW$T$25, DW_AT_decl_line(0x12e)
    3949                            .dwattr $C$DW$T$25, DW_AT_decl_column(0x01)
    3950                            .dwendtag $C$DW$T$25
    3951                    
    3952                    $C$DW$T$26      .dwtag  DW_TAG_const_type
    3953                            .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$25)
    3954                    
    3955                    $C$DW$T$27      .dwtag  DW_TAG_typedef
    3956                            .dwattr $C$DW$T$27, DW_AT_name("txPwrVal_t")
    3957                            .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$26)
    3958                            .dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
    3959                            .dwattr $C$DW$T$27, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/m
    3960                            .dwattr $C$DW$T$27, DW_AT_decl_line(0x131)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:30 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{24102AC7-264E-4E23-8F1F-41525EB8EC61} PAGE   73

    3961                            .dwattr $C$DW$T$27, DW_AT_decl_column(0x03)
    3962                    
    3963                    $C$DW$T$28      .dwtag  DW_TAG_pointer_type
    3964                            .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$27)
    3965                            .dwattr $C$DW$T$28, DW_AT_address_class(0x20)
    3966                    
    3967                    
    3968                    $C$DW$T$30      .dwtag  DW_TAG_structure_type
    3969                            .dwattr $C$DW$T$30, DW_AT_byte_size(0x05)
    3970                    $C$DW$401       .dwtag  DW_TAG_member
    3971                            .dwattr $C$DW$401, DW_AT_type(*$C$DW$T$28)
    3972                            .dwattr $C$DW$401, DW_AT_name("pTxPwrVals")
    3973                            .dwattr $C$DW$401, DW_AT_TI_symbol_name("pTxPwrVals")
    3974                            .dwattr $C$DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3975                            .dwattr $C$DW$401, DW_AT_accessibility(DW_ACCESS_public)
    3976                            .dwattr $C$DW$401, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/ma
    3977                            .dwattr $C$DW$401, DW_AT_decl_line(0x135)
    3978                            .dwattr $C$DW$401, DW_AT_decl_column(0x0f)
    3979                    
    3980                    $C$DW$402       .dwtag  DW_TAG_member
    3981                            .dwattr $C$DW$402, DW_AT_type(*$C$DW$T$29)
    3982                            .dwattr $C$DW$402, DW_AT_name("numTxPwrVals")
    3983                            .dwattr $C$DW$402, DW_AT_TI_symbol_name("numTxPwrVals")
    3984                            .dwattr $C$DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3985                            .dwattr $C$DW$402, DW_AT_accessibility(DW_ACCESS_public)
    3986                            .dwattr $C$DW$402, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/ma
    3987                            .dwattr $C$DW$402, DW_AT_decl_line(0x136)
    3988                            .dwattr $C$DW$402, DW_AT_decl_column(0x0f)
    3989                    
    3990                            .dwattr $C$DW$T$30, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/m
    3991                            .dwattr $C$DW$T$30, DW_AT_decl_line(0x134)
    3992                            .dwattr $C$DW$T$30, DW_AT_decl_column(0x01)
    3993                            .dwendtag $C$DW$T$30
    3994                    
    3995                    $C$DW$T$35      .dwtag  DW_TAG_const_type
    3996                            .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$30)
    3997                    
    3998                    $C$DW$T$36      .dwtag  DW_TAG_typedef
    3999                            .dwattr $C$DW$T$36, DW_AT_name("txPwrTbl_t")
    4000                            .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$35)
    4001                            .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
    4002                            .dwattr $C$DW$T$36, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/m
    4003                            .dwattr $C$DW$T$36, DW_AT_decl_line(0x137)
    4004                            .dwattr $C$DW$T$36, DW_AT_decl_column(0x03)
    4005                    
    4006                    $C$DW$T$37      .dwtag  DW_TAG_pointer_type
    4007                            .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$36)
    4008                            .dwattr $C$DW$T$37, DW_AT_address_class(0x20)
    4009                    
    4010                    
    4011                    $C$DW$T$48      .dwtag  DW_TAG_structure_type
    4012                            .dwattr $C$DW$T$48, DW_AT_byte_size(0x38)
    4013                    $C$DW$403       .dwtag  DW_TAG_member
    4014                            .dwattr $C$DW$403, DW_AT_type(*$C$DW$T$31)
    4015                            .dwattr $C$DW$403, DW_AT_name("getHwRevision")
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:30 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{24102AC7-264E-4E23-8F1F-41525EB8EC61} PAGE   74

    4016                            .dwattr $C$DW$403, DW_AT_TI_symbol_name("getHwRevision")
    4017                            .dwattr $C$DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4018                            .dwattr $C$DW$403, DW_AT_accessibility(DW_ACCESS_public)
    4019                            .dwattr $C$DW$403, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/ma
    4020                            .dwattr $C$DW$403, DW_AT_decl_line(0x143)
    4021                            .dwattr $C$DW$403, DW_AT_decl_column(0x1c)
    4022                    
    4023                    $C$DW$404       .dwtag  DW_TAG_member
    4024                            .dwattr $C$DW$404, DW_AT_type(*$C$DW$T$33)
    4025                            .dwattr $C$DW$404, DW_AT_name("pRfPropTable")
    4026                            .dwattr $C$DW$404, DW_AT_TI_symbol_name("pRfPropTable")
    4027                            .dwattr $C$DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4028                            .dwattr $C$DW$404, DW_AT_accessibility(DW_ACCESS_public)
    4029                            .dwattr $C$DW$404, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/ma
    4030                            .dwattr $C$DW$404, DW_AT_decl_line(0x144)
    4031                            .dwattr $C$DW$404, DW_AT_decl_column(0x1d)
    4032                    
    4033                    $C$DW$405       .dwtag  DW_TAG_member
    4034                            .dwattr $C$DW$405, DW_AT_type(*$C$DW$T$34)
    4035                            .dwattr $C$DW$405, DW_AT_name("pRfDrvTblPtr")
    4036                            .dwattr $C$DW$405, DW_AT_TI_symbol_name("pRfDrvTblPtr")
    4037                            .dwattr $C$DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4038                            .dwattr $C$DW$405, DW_AT_accessibility(DW_ACCESS_public)
    4039                            .dwattr $C$DW$405, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/ma
    4040                            .dwattr $C$DW$405, DW_AT_decl_line(0x145)
    4041                            .dwattr $C$DW$405, DW_AT_decl_column(0x1d)
    4042                    
    4043                    $C$DW$406       .dwtag  DW_TAG_member
    4044                            .dwattr $C$DW$406, DW_AT_type(*$C$DW$T$34)
    4045                            .dwattr $C$DW$406, DW_AT_name("pCryptoDrvTblPtr")
    4046                            .dwattr $C$DW$406, DW_AT_TI_symbol_name("pCryptoDrvTblPtr")
    4047                            .dwattr $C$DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4048                            .dwattr $C$DW$406, DW_AT_accessibility(DW_ACCESS_public)
    4049                            .dwattr $C$DW$406, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/ma
    4050                            .dwattr $C$DW$406, DW_AT_decl_line(0x146)
    4051                            .dwattr $C$DW$406, DW_AT_decl_column(0x1d)
    4052                    
    4053                    $C$DW$407       .dwtag  DW_TAG_member
    4054                            .dwattr $C$DW$407, DW_AT_type(*$C$DW$T$37)
    4055                            .dwattr $C$DW$407, DW_AT_name("pTxPwrTbl")
    4056                            .dwattr $C$DW$407, DW_AT_TI_symbol_name("pTxPwrTbl")
    4057                            .dwattr $C$DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4058                            .dwattr $C$DW$407, DW_AT_accessibility(DW_ACCESS_public)
    4059                            .dwattr $C$DW$407, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/ma
    4060                            .dwattr $C$DW$407, DW_AT_decl_line(0x147)
    4061                            .dwattr $C$DW$407, DW_AT_decl_column(0x1d)
    4062                    
    4063                    $C$DW$408       .dwtag  DW_TAG_member
    4064                            .dwattr $C$DW$408, DW_AT_type(*$C$DW$T$37)
    4065                            .dwattr $C$DW$408, DW_AT_name("pTxPwrTblRe")
    4066                            .dwattr $C$DW$408, DW_AT_TI_symbol_name("pTxPwrTblRe")
    4067                            .dwattr $C$DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4068                            .dwattr $C$DW$408, DW_AT_accessibility(DW_ACCESS_public)
    4069                            .dwattr $C$DW$408, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/ma
    4070                            .dwattr $C$DW$408, DW_AT_decl_line(0x148)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:30 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{24102AC7-264E-4E23-8F1F-41525EB8EC61} PAGE   75

    4071                            .dwattr $C$DW$408, DW_AT_decl_column(0x1d)
    4072                    
    4073                    $C$DW$409       .dwtag  DW_TAG_member
    4074                            .dwattr $C$DW$409, DW_AT_type(*$C$DW$T$38)
    4075                            .dwattr $C$DW$409, DW_AT_name("pOverrides")
    4076                            .dwattr $C$DW$409, DW_AT_TI_symbol_name("pOverrides")
    4077                            .dwattr $C$DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    4078                            .dwattr $C$DW$409, DW_AT_accessibility(DW_ACCESS_public)
    4079                            .dwattr $C$DW$409, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/ma
    4080                            .dwattr $C$DW$409, DW_AT_decl_line(0x149)
    4081                            .dwattr $C$DW$409, DW_AT_decl_column(0x1e)
    4082                    
    4083                    $C$DW$410       .dwtag  DW_TAG_member
    4084                            .dwattr $C$DW$410, DW_AT_type(*$C$DW$T$38)
    4085                            .dwattr $C$DW$410, DW_AT_name("pOverridesRe")
    4086                            .dwattr $C$DW$410, DW_AT_TI_symbol_name("pOverridesRe")
    4087                            .dwattr $C$DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    4088                            .dwattr $C$DW$410, DW_AT_accessibility(DW_ACCESS_public)
    4089                            .dwattr $C$DW$410, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/ma
    4090                            .dwattr $C$DW$410, DW_AT_decl_line(0x14a)
    4091                            .dwattr $C$DW$410, DW_AT_decl_column(0x1e)
    4092                    
    4093                    $C$DW$411       .dwtag  DW_TAG_member
    4094                            .dwattr $C$DW$411, DW_AT_type(*$C$DW$T$39)
    4095                            .dwattr $C$DW$411, DW_AT_name("pLoDivider")
    4096                            .dwattr $C$DW$411, DW_AT_TI_symbol_name("pLoDivider")
    4097                            .dwattr $C$DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    4098                            .dwattr $C$DW$411, DW_AT_accessibility(DW_ACCESS_public)
    4099                            .dwattr $C$DW$411, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/ma
    4100                            .dwattr $C$DW$411, DW_AT_decl_line(0x14b)
    4101                            .dwattr $C$DW$411, DW_AT_decl_column(0x1d)
    4102                    
    4103                    $C$DW$412       .dwtag  DW_TAG_member
    4104                            .dwattr $C$DW$412, DW_AT_type(*$C$DW$T$19)
    4105                            .dwattr $C$DW$412, DW_AT_name("rfFeModeBias")
    4106                            .dwattr $C$DW$412, DW_AT_TI_symbol_name("rfFeModeBias")
    4107                            .dwattr $C$DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    4108                            .dwattr $C$DW$412, DW_AT_accessibility(DW_ACCESS_public)
    4109                            .dwattr $C$DW$412, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/ma
    4110                            .dwattr $C$DW$412, DW_AT_decl_line(0x14c)
    4111                            .dwattr $C$DW$412, DW_AT_decl_column(0x1c)
    4112                    
    4113                    $C$DW$413       .dwtag  DW_TAG_member
    4114                            .dwattr $C$DW$413, DW_AT_type(*$C$DW$T$19)
    4115                            .dwattr $C$DW$413, DW_AT_name("phyId")
    4116                            .dwattr $C$DW$413, DW_AT_TI_symbol_name("phyId")
    4117                            .dwattr $C$DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    4118                            .dwattr $C$DW$413, DW_AT_accessibility(DW_ACCESS_public)
    4119                            .dwattr $C$DW$413, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/ma
    4120                            .dwattr $C$DW$413, DW_AT_decl_line(0x14d)
    4121                            .dwattr $C$DW$413, DW_AT_decl_column(0x1c)
    4122                    
    4123                    $C$DW$414       .dwtag  DW_TAG_member
    4124                            .dwattr $C$DW$414, DW_AT_type(*$C$DW$T$19)
    4125                            .dwattr $C$DW$414, DW_AT_name("last")
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:30 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{24102AC7-264E-4E23-8F1F-41525EB8EC61} PAGE   76

    4126                            .dwattr $C$DW$414, DW_AT_TI_symbol_name("last")
    4127                            .dwattr $C$DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    4128                            .dwattr $C$DW$414, DW_AT_accessibility(DW_ACCESS_public)
    4129                            .dwattr $C$DW$414, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/ma
    4130                            .dwattr $C$DW$414, DW_AT_decl_line(0x14e)
    4131                            .dwattr $C$DW$414, DW_AT_decl_column(0x1c)
    4132                    
    4133                    $C$DW$415       .dwtag  DW_TAG_member
    4134                            .dwattr $C$DW$415, DW_AT_type(*$C$DW$T$42)
    4135                            .dwattr $C$DW$415, DW_AT_name("pSetRE")
    4136                            .dwattr $C$DW$415, DW_AT_TI_symbol_name("pSetRE")
    4137                            .dwattr $C$DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    4138                            .dwattr $C$DW$415, DW_AT_accessibility(DW_ACCESS_public)
    4139                            .dwattr $C$DW$415, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/ma
    4140                            .dwattr $C$DW$415, DW_AT_decl_line(0x14f)
    4141                            .dwattr $C$DW$415, DW_AT_decl_column(0x1c)
    4142                    
    4143                    $C$DW$416       .dwtag  DW_TAG_member
    4144                            .dwattr $C$DW$416, DW_AT_type(*$C$DW$T$43)
    4145                            .dwattr $C$DW$416, DW_AT_name("pAssertFP")
    4146                            .dwattr $C$DW$416, DW_AT_TI_symbol_name("pAssertFP")
    4147                            .dwattr $C$DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    4148                            .dwattr $C$DW$416, DW_AT_accessibility(DW_ACCESS_public)
    4149                            .dwattr $C$DW$416, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/ma
    4150                            .dwattr $C$DW$416, DW_AT_decl_line(0x150)
    4151                            .dwattr $C$DW$416, DW_AT_decl_column(0x1c)
    4152                    
    4153                    $C$DW$417       .dwtag  DW_TAG_member
    4154                            .dwattr $C$DW$417, DW_AT_type(*$C$DW$T$44)
    4155                            .dwattr $C$DW$417, DW_AT_name("pAntSwitchFP")
    4156                            .dwattr $C$DW$417, DW_AT_TI_symbol_name("pAntSwitchFP")
    4157                            .dwattr $C$DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    4158                            .dwattr $C$DW$417, DW_AT_accessibility(DW_ACCESS_public)
    4159                            .dwattr $C$DW$417, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/ma
    4160                            .dwattr $C$DW$417, DW_AT_decl_line(0x151)
    4161                            .dwattr $C$DW$417, DW_AT_decl_column(0x1c)
    4162                    
    4163                    $C$DW$418       .dwtag  DW_TAG_member
    4164                            .dwattr $C$DW$418, DW_AT_type(*$C$DW$T$47)
    4165                            .dwattr $C$DW$418, DW_AT_name("pAntPwrFP")
    4166                            .dwattr $C$DW$418, DW_AT_TI_symbol_name("pAntPwrFP")
    4167                            .dwattr $C$DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    4168                            .dwattr $C$DW$418, DW_AT_accessibility(DW_ACCESS_public)
    4169                            .dwattr $C$DW$418, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/ma
    4170                            .dwattr $C$DW$418, DW_AT_decl_line(0x152)
    4171                            .dwattr $C$DW$418, DW_AT_decl_column(0x1c)
    4172                    
    4173                            .dwattr $C$DW$T$48, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/m
    4174                            .dwattr $C$DW$T$48, DW_AT_decl_line(0x142)
    4175                            .dwattr $C$DW$T$48, DW_AT_decl_column(0x01)
    4176                            .dwendtag $C$DW$T$48
    4177                    
    4178                    $C$DW$T$1021    .dwtag  DW_TAG_typedef
    4179                            .dwattr $C$DW$T$1021, DW_AT_name("macUserCfg_t")
    4180                            .dwattr $C$DW$T$1021, DW_AT_type(*$C$DW$T$48)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:30 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{24102AC7-264E-4E23-8F1F-41525EB8EC61} PAGE   77

    4181                            .dwattr $C$DW$T$1021, DW_AT_language(DW_LANG_C)
    4182                            .dwattr $C$DW$T$1021, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application
    4183                            .dwattr $C$DW$T$1021, DW_AT_decl_line(0x15a)
    4184                            .dwattr $C$DW$T$1021, DW_AT_decl_column(0x03)
    4185                    
    4186                    $C$DW$T$1022    .dwtag  DW_TAG_pointer_type
    4187                            .dwattr $C$DW$T$1022, DW_AT_type(*$C$DW$T$1021)
    4188                            .dwattr $C$DW$T$1022, DW_AT_address_class(0x20)
    4189                    
    4190                    
    4191                    $C$DW$T$49      .dwtag  DW_TAG_structure_type
    4192                            .dwattr $C$DW$T$49, DW_AT_byte_size(0x08)
    4193                    $C$DW$419       .dwtag  DW_TAG_member
    4194                            .dwattr $C$DW$419, DW_AT_type(*$C$DW$T$10)
    4195                            .dwattr $C$DW$419, DW_AT_name("quot")
    4196                            .dwattr $C$DW$419, DW_AT_TI_symbol_name("quot")
    4197                            .dwattr $C$DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4198                            .dwattr $C$DW$419, DW_AT_accessibility(DW_ACCESS_public)
    4199                            .dwattr $C$DW$419, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/s
    4200                            .dwattr $C$DW$419, DW_AT_decl_line(0x5c)
    4201                            .dwattr $C$DW$419, DW_AT_decl_column(0x16)
    4202                    
    4203                    $C$DW$420       .dwtag  DW_TAG_member
    4204                            .dwattr $C$DW$420, DW_AT_type(*$C$DW$T$10)
    4205                            .dwattr $C$DW$420, DW_AT_name("rem")
    4206                            .dwattr $C$DW$420, DW_AT_TI_symbol_name("rem")
    4207                            .dwattr $C$DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4208                            .dwattr $C$DW$420, DW_AT_accessibility(DW_ACCESS_public)
    4209                            .dwattr $C$DW$420, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/s
    4210                            .dwattr $C$DW$420, DW_AT_decl_line(0x5c)
    4211                            .dwattr $C$DW$420, DW_AT_decl_column(0x1c)
    4212                    
    4213                            .dwattr $C$DW$T$49, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/
    4214                            .dwattr $C$DW$T$49, DW_AT_decl_line(0x5c)
    4215                            .dwattr $C$DW$T$49, DW_AT_decl_column(0x10)
    4216                            .dwendtag $C$DW$T$49
    4217                    
    4218                    $C$DW$T$1023    .dwtag  DW_TAG_typedef
    4219                            .dwattr $C$DW$T$1023, DW_AT_name("div_t")
    4220                            .dwattr $C$DW$T$1023, DW_AT_type(*$C$DW$T$49)
    4221                            .dwattr $C$DW$T$1023, DW_AT_language(DW_LANG_C)
    4222                            .dwattr $C$DW$T$1023, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/includ
    4223                            .dwattr $C$DW$T$1023, DW_AT_decl_line(0x5c)
    4224                            .dwattr $C$DW$T$1023, DW_AT_decl_column(0x23)
    4225                    
    4226                    
    4227                    $C$DW$T$50      .dwtag  DW_TAG_structure_type
    4228                            .dwattr $C$DW$T$50, DW_AT_byte_size(0x08)
    4229                    $C$DW$421       .dwtag  DW_TAG_member
    4230                            .dwattr $C$DW$421, DW_AT_type(*$C$DW$T$10)
    4231                            .dwattr $C$DW$421, DW_AT_name("quot")
    4232                            .dwattr $C$DW$421, DW_AT_TI_symbol_name("quot")
    4233                            .dwattr $C$DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4234                            .dwattr $C$DW$421, DW_AT_accessibility(DW_ACCESS_public)
    4235                            .dwattr $C$DW$421, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/s
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:30 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{24102AC7-264E-4E23-8F1F-41525EB8EC61} PAGE   78

    4236                            .dwattr $C$DW$421, DW_AT_decl_line(0x5e)
    4237                            .dwattr $C$DW$421, DW_AT_decl_column(0x16)
    4238                    
    4239                    $C$DW$422       .dwtag  DW_TAG_member
    4240                            .dwattr $C$DW$422, DW_AT_type(*$C$DW$T$10)
    4241                            .dwattr $C$DW$422, DW_AT_name("rem")
    4242                            .dwattr $C$DW$422, DW_AT_TI_symbol_name("rem")
    4243                            .dwattr $C$DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4244                            .dwattr $C$DW$422, DW_AT_accessibility(DW_ACCESS_public)
    4245                            .dwattr $C$DW$422, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/s
    4246                            .dwattr $C$DW$422, DW_AT_decl_line(0x5e)
    4247                            .dwattr $C$DW$422, DW_AT_decl_column(0x1c)
    4248                    
    4249                            .dwattr $C$DW$T$50, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/
    4250                            .dwattr $C$DW$T$50, DW_AT_decl_line(0x5e)
    4251                            .dwattr $C$DW$T$50, DW_AT_decl_column(0x10)
    4252                            .dwendtag $C$DW$T$50
    4253                    
    4254                    $C$DW$T$1024    .dwtag  DW_TAG_typedef
    4255                            .dwattr $C$DW$T$1024, DW_AT_name("ldiv_t")
    4256                            .dwattr $C$DW$T$1024, DW_AT_type(*$C$DW$T$50)
    4257                            .dwattr $C$DW$T$1024, DW_AT_language(DW_LANG_C)
    4258                            .dwattr $C$DW$T$1024, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/includ
    4259                            .dwattr $C$DW$T$1024, DW_AT_decl_line(0x5e)
    4260                            .dwattr $C$DW$T$1024, DW_AT_decl_column(0x23)
    4261                    
    4262                    
    4263                    $C$DW$T$51      .dwtag  DW_TAG_structure_type
    4264                            .dwattr $C$DW$T$51, DW_AT_byte_size(0x10)
    4265                    $C$DW$423       .dwtag  DW_TAG_member
    4266                            .dwattr $C$DW$423, DW_AT_type(*$C$DW$T$14)
    4267                            .dwattr $C$DW$423, DW_AT_name("quot")
    4268                            .dwattr $C$DW$423, DW_AT_TI_symbol_name("quot")
    4269                            .dwattr $C$DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4270                            .dwattr $C$DW$423, DW_AT_accessibility(DW_ACCESS_public)
    4271                            .dwattr $C$DW$423, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/s
    4272                            .dwattr $C$DW$423, DW_AT_decl_line(0x61)
    4273                            .dwattr $C$DW$423, DW_AT_decl_column(0x1c)
    4274                    
    4275                    $C$DW$424       .dwtag  DW_TAG_member
    4276                            .dwattr $C$DW$424, DW_AT_type(*$C$DW$T$14)
    4277                            .dwattr $C$DW$424, DW_AT_name("rem")
    4278                            .dwattr $C$DW$424, DW_AT_TI_symbol_name("rem")
    4279                            .dwattr $C$DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4280                            .dwattr $C$DW$424, DW_AT_accessibility(DW_ACCESS_public)
    4281                            .dwattr $C$DW$424, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/s
    4282                            .dwattr $C$DW$424, DW_AT_decl_line(0x61)
    4283                            .dwattr $C$DW$424, DW_AT_decl_column(0x22)
    4284                    
    4285                            .dwattr $C$DW$T$51, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/
    4286                            .dwattr $C$DW$T$51, DW_AT_decl_line(0x61)
    4287                            .dwattr $C$DW$T$51, DW_AT_decl_column(0x10)
    4288                            .dwendtag $C$DW$T$51
    4289                    
    4290                    $C$DW$T$1025    .dwtag  DW_TAG_typedef
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:30 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{24102AC7-264E-4E23-8F1F-41525EB8EC61} PAGE   79

    4291                            .dwattr $C$DW$T$1025, DW_AT_name("lldiv_t")
    4292                            .dwattr $C$DW$T$1025, DW_AT_type(*$C$DW$T$51)
    4293                            .dwattr $C$DW$T$1025, DW_AT_language(DW_LANG_C)
    4294                            .dwattr $C$DW$T$1025, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/includ
    4295                            .dwattr $C$DW$T$1025, DW_AT_decl_line(0x61)
    4296                            .dwattr $C$DW$T$1025, DW_AT_decl_column(0x29)
    4297                    
    4298                    
    4299                    $C$DW$T$55      .dwtag  DW_TAG_structure_type
    4300                            .dwattr $C$DW$T$55, DW_AT_byte_size(0x08)
    4301                    $C$DW$425       .dwtag  DW_TAG_member
    4302                            .dwattr $C$DW$425, DW_AT_type(*$C$DW$T$53)
    4303                            .dwattr $C$DW$425, DW_AT_name("pointerStack")
    4304                            .dwattr $C$DW$425, DW_AT_TI_symbol_name("pointerStack")
    4305                            .dwattr $C$DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4306                            .dwattr $C$DW$425, DW_AT_accessibility(DW_ACCESS_public)
    4307                            .dwattr $C$DW$425, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    4308                            .dwattr $C$DW$425, DW_AT_decl_line(0x3f5)
    4309                            .dwattr $C$DW$425, DW_AT_decl_column(0x16)
    4310                    
    4311                    $C$DW$426       .dwtag  DW_TAG_member
    4312                            .dwattr $C$DW$426, DW_AT_type(*$C$DW$T$54)
    4313                            .dwattr $C$DW$426, DW_AT_name("directAPI")
    4314                            .dwattr $C$DW$426, DW_AT_TI_symbol_name("directAPI")
    4315                            .dwattr $C$DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4316                            .dwattr $C$DW$426, DW_AT_accessibility(DW_ACCESS_public)
    4317                            .dwattr $C$DW$426, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    4318                            .dwattr $C$DW$426, DW_AT_decl_line(0x3f6)
    4319                            .dwattr $C$DW$426, DW_AT_decl_column(0x15)
    4320                    
    4321                            .dwattr $C$DW$T$55, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154sta
    4322                            .dwattr $C$DW$T$55, DW_AT_decl_line(0x3f4)
    4323                            .dwattr $C$DW$T$55, DW_AT_decl_column(0x01)
    4324                            .dwendtag $C$DW$T$55
    4325                    
    4326                    $C$DW$T$57      .dwtag  DW_TAG_typedef
    4327                            .dwattr $C$DW$T$57, DW_AT_name("icall_directAPIMsg_t")
    4328                            .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$55)
    4329                            .dwattr $C$DW$T$57, DW_AT_language(DW_LANG_C)
    4330                            .dwattr $C$DW$T$57, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154sta
    4331                            .dwattr $C$DW$T$57, DW_AT_decl_line(0x3f7)
    4332                            .dwattr $C$DW$T$57, DW_AT_decl_column(0x03)
    4333                    
    4334                    
    4335                    $C$DW$T$58      .dwtag  DW_TAG_structure_type
    4336                            .dwattr $C$DW$T$58, DW_AT_byte_size(0x14)
    4337                    $C$DW$427       .dwtag  DW_TAG_member
    4338                            .dwattr $C$DW$427, DW_AT_type(*$C$DW$T$56)
    4339                            .dwattr $C$DW$427, DW_AT_name("hdr")
    4340                            .dwattr $C$DW$427, DW_AT_TI_symbol_name("hdr")
    4341                            .dwattr $C$DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4342                            .dwattr $C$DW$427, DW_AT_accessibility(DW_ACCESS_public)
    4343                            .dwattr $C$DW$427, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    4344                            .dwattr $C$DW$427, DW_AT_decl_line(0x3fb)
    4345                            .dwattr $C$DW$427, DW_AT_decl_column(0x10)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:30 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{24102AC7-264E-4E23-8F1F-41525EB8EC61} PAGE   80

    4346                    
    4347                    $C$DW$428       .dwtag  DW_TAG_member
    4348                            .dwattr $C$DW$428, DW_AT_type(*$C$DW$T$57)
    4349                            .dwattr $C$DW$428, DW_AT_name("msg")
    4350                            .dwattr $C$DW$428, DW_AT_TI_symbol_name("msg")
    4351                            .dwattr $C$DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4352                            .dwattr $C$DW$428, DW_AT_accessibility(DW_ACCESS_public)
    4353                            .dwattr $C$DW$428, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    4354                            .dwattr $C$DW$428, DW_AT_decl_line(0x3fc)
    4355                            .dwattr $C$DW$428, DW_AT_decl_column(0x1a)
    4356                    
    4357                            .dwattr $C$DW$T$58, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154sta
    4358                            .dwattr $C$DW$T$58, DW_AT_decl_line(0x3fa)
    4359                            .dwattr $C$DW$T$58, DW_AT_decl_column(0x01)
    4360                            .dwendtag $C$DW$T$58
    4361                    
    4362                    $C$DW$T$1026    .dwtag  DW_TAG_typedef
    4363                            .dwattr $C$DW$T$1026, DW_AT_name("icallLiteMsg_t")
    4364                            .dwattr $C$DW$T$1026, DW_AT_type(*$C$DW$T$58)
    4365                            .dwattr $C$DW$T$1026, DW_AT_language(DW_LANG_C)
    4366                            .dwattr $C$DW$T$1026, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154s
    4367                            .dwattr $C$DW$T$1026, DW_AT_decl_line(0x3fd)
    4368                            .dwattr $C$DW$T$1026, DW_AT_decl_column(0x03)
    4369                    
    4370                    
    4371                    $C$DW$T$59      .dwtag  DW_TAG_structure_type
    4372                            .dwattr $C$DW$T$59, DW_AT_byte_size(0x0a)
    4373                    $C$DW$429       .dwtag  DW_TAG_member
    4374                            .dwattr $C$DW$429, DW_AT_type(*$C$DW$T$450)
    4375                            .dwattr $C$DW$429, DW_AT_name("addr")
    4376                            .dwattr $C$DW$429, DW_AT_TI_symbol_name("addr")
    4377                            .dwattr $C$DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4378                            .dwattr $C$DW$429, DW_AT_accessibility(DW_ACCESS_public)
    4379                            .dwattr $C$DW$429, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/Se
    4380                            .dwattr $C$DW$429, DW_AT_decl_line(0x52)
    4381                            .dwattr $C$DW$429, DW_AT_decl_column(0x05)
    4382                    
    4383                    $C$DW$430       .dwtag  DW_TAG_member
    4384                            .dwattr $C$DW$430, DW_AT_type(*$C$DW$T$29)
    4385                            .dwattr $C$DW$430, DW_AT_name("addrMode")
    4386                            .dwattr $C$DW$430, DW_AT_TI_symbol_name("addrMode")
    4387                            .dwattr $C$DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4388                            .dwattr $C$DW$430, DW_AT_accessibility(DW_ACCESS_public)
    4389                            .dwattr $C$DW$430, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/Se
    4390                            .dwattr $C$DW$430, DW_AT_decl_line(0x53)
    4391                            .dwattr $C$DW$430, DW_AT_decl_column(0x11)
    4392                    
    4393                            .dwattr $C$DW$T$59, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/S
    4394                            .dwattr $C$DW$T$59, DW_AT_decl_line(0x4d)
    4395                            .dwattr $C$DW$T$59, DW_AT_decl_column(0x01)
    4396                            .dwendtag $C$DW$T$59
    4397                    
    4398                    $C$DW$T$346     .dwtag  DW_TAG_typedef
    4399                            .dwattr $C$DW$T$346, DW_AT_name("sAddr_t")
    4400                            .dwattr $C$DW$T$346, DW_AT_type(*$C$DW$T$59)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:30 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{24102AC7-264E-4E23-8F1F-41525EB8EC61} PAGE   81

    4401                            .dwattr $C$DW$T$346, DW_AT_language(DW_LANG_C)
    4402                            .dwattr $C$DW$T$346, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/
    4403                            .dwattr $C$DW$T$346, DW_AT_decl_line(0x54)
    4404                            .dwattr $C$DW$T$346, DW_AT_decl_column(0x03)
    4405                    
    4406                    $C$DW$T$399     .dwtag  DW_TAG_pointer_type
    4407                            .dwattr $C$DW$T$399, DW_AT_type(*$C$DW$T$346)
    4408                            .dwattr $C$DW$T$399, DW_AT_address_class(0x20)
    4409                    
    4410                    
    4411                    $C$DW$T$61      .dwtag  DW_TAG_structure_type
    4412                            .dwattr $C$DW$T$61, DW_AT_byte_size(0x0a)
    4413                    $C$DW$431       .dwtag  DW_TAG_member
    4414                            .dwattr $C$DW$431, DW_AT_type(*$C$DW$T$453)
    4415                            .dwattr $C$DW$431, DW_AT_name("addr")
    4416                            .dwattr $C$DW$431, DW_AT_TI_symbol_name("addr")
    4417                            .dwattr $C$DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4418                            .dwattr $C$DW$431, DW_AT_accessibility(DW_ACCESS_public)
    4419                            .dwattr $C$DW$431, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    4420                            .dwattr $C$DW$431, DW_AT_decl_line(0x139)
    4421                            .dwattr $C$DW$431, DW_AT_decl_column(0x05)
    4422                    
    4423                    $C$DW$432       .dwtag  DW_TAG_member
    4424                            .dwattr $C$DW$432, DW_AT_type(*$C$DW$T$60)
    4425                            .dwattr $C$DW$432, DW_AT_name("addrMode")
    4426                            .dwattr $C$DW$432, DW_AT_TI_symbol_name("addrMode")
    4427                            .dwattr $C$DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4428                            .dwattr $C$DW$432, DW_AT_accessibility(DW_ACCESS_public)
    4429                            .dwattr $C$DW$432, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    4430                            .dwattr $C$DW$432, DW_AT_decl_line(0x13a)
    4431                            .dwattr $C$DW$432, DW_AT_decl_column(0x08)
    4432                    
    4433                            .dwattr $C$DW$T$61, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154sta
    4434                            .dwattr $C$DW$T$61, DW_AT_decl_line(0x134)
    4435                            .dwattr $C$DW$T$61, DW_AT_decl_column(0x01)
    4436                            .dwendtag $C$DW$T$61
    4437                    
    4438                    $C$DW$T$1027    .dwtag  DW_TAG_typedef
    4439                            .dwattr $C$DW$T$1027, DW_AT_name("zAddrType_t")
    4440                            .dwattr $C$DW$T$1027, DW_AT_type(*$C$DW$T$61)
    4441                            .dwattr $C$DW$T$1027, DW_AT_language(DW_LANG_C)
    4442                            .dwattr $C$DW$T$1027, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154s
    4443                            .dwattr $C$DW$T$1027, DW_AT_decl_line(0x13b)
    4444                            .dwattr $C$DW$T$1027, DW_AT_decl_column(0x03)
    4445                    
    4446                    
    4447                    $C$DW$T$63      .dwtag  DW_TAG_structure_type
    4448                            .dwattr $C$DW$T$63, DW_AT_byte_size(0x0c)
    4449                    $C$DW$433       .dwtag  DW_TAG_member
    4450                            .dwattr $C$DW$433, DW_AT_type(*$C$DW$T$29)
    4451                            .dwattr $C$DW$433, DW_AT_name("txCounter")
    4452                            .dwattr $C$DW$433, DW_AT_TI_symbol_name("txCounter")
    4453                            .dwattr $C$DW$433, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4454                            .dwattr $C$DW$433, DW_AT_accessibility(DW_ACCESS_public)
    4455                            .dwattr $C$DW$433, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:30 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{24102AC7-264E-4E23-8F1F-41525EB8EC61} PAGE   82

    4456                            .dwattr $C$DW$433, DW_AT_decl_line(0x198)
    4457                            .dwattr $C$DW$433, DW_AT_decl_column(0x0a)
    4458                    
    4459                    $C$DW$434       .dwtag  DW_TAG_member
    4460                            .dwattr $C$DW$434, DW_AT_type(*$C$DW$T$29)
    4461                            .dwattr $C$DW$434, DW_AT_name("txCost")
    4462                            .dwattr $C$DW$434, DW_AT_TI_symbol_name("txCost")
    4463                            .dwattr $C$DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4464                            .dwattr $C$DW$434, DW_AT_accessibility(DW_ACCESS_public)
    4465                            .dwattr $C$DW$434, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    4466                            .dwattr $C$DW$434, DW_AT_decl_line(0x199)
    4467                            .dwattr $C$DW$434, DW_AT_decl_column(0x0a)
    4468                    
    4469                    $C$DW$435       .dwtag  DW_TAG_member
    4470                            .dwattr $C$DW$435, DW_AT_type(*$C$DW$T$29)
    4471                            .dwattr $C$DW$435, DW_AT_name("rxLqi")
    4472                            .dwattr $C$DW$435, DW_AT_TI_symbol_name("rxLqi")
    4473                            .dwattr $C$DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4474                            .dwattr $C$DW$435, DW_AT_accessibility(DW_ACCESS_public)
    4475                            .dwattr $C$DW$435, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    4476                            .dwattr $C$DW$435, DW_AT_decl_line(0x19b)
    4477                            .dwattr $C$DW$435, DW_AT_decl_column(0x0a)
    4478                    
    4479                    $C$DW$436       .dwtag  DW_TAG_member
    4480                            .dwattr $C$DW$436, DW_AT_type(*$C$DW$T$29)
    4481                            .dwattr $C$DW$436, DW_AT_name("inKeySeqNum")
    4482                            .dwattr $C$DW$436, DW_AT_TI_symbol_name("inKeySeqNum")
    4483                            .dwattr $C$DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4484                            .dwattr $C$DW$436, DW_AT_accessibility(DW_ACCESS_public)
    4485                            .dwattr $C$DW$436, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    4486                            .dwattr $C$DW$436, DW_AT_decl_line(0x19d)
    4487                            .dwattr $C$DW$436, DW_AT_decl_column(0x0a)
    4488                    
    4489                    $C$DW$437       .dwtag  DW_TAG_member
    4490                            .dwattr $C$DW$437, DW_AT_type(*$C$DW$T$62)
    4491                            .dwattr $C$DW$437, DW_AT_name("inFrmCntr")
    4492                            .dwattr $C$DW$437, DW_AT_TI_symbol_name("inFrmCntr")
    4493                            .dwattr $C$DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4494                            .dwattr $C$DW$437, DW_AT_accessibility(DW_ACCESS_public)
    4495                            .dwattr $C$DW$437, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    4496                            .dwattr $C$DW$437, DW_AT_decl_line(0x19e)
    4497                            .dwattr $C$DW$437, DW_AT_decl_column(0x0a)
    4498                    
    4499                    $C$DW$438       .dwtag  DW_TAG_member
    4500                            .dwattr $C$DW$438, DW_AT_type(*$C$DW$T$24)
    4501                            .dwattr $C$DW$438, DW_AT_name("txFailure")
    4502                            .dwattr $C$DW$438, DW_AT_TI_symbol_name("txFailure")
    4503                            .dwattr $C$DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4504                            .dwattr $C$DW$438, DW_AT_accessibility(DW_ACCESS_public)
    4505                            .dwattr $C$DW$438, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    4506                            .dwattr $C$DW$438, DW_AT_decl_line(0x19f)
    4507                            .dwattr $C$DW$438, DW_AT_decl_column(0x0a)
    4508                    
    4509                            .dwattr $C$DW$T$63, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154sta
    4510                            .dwattr $C$DW$T$63, DW_AT_decl_line(0x197)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:30 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{24102AC7-264E-4E23-8F1F-41525EB8EC61} PAGE   83

    4511                            .dwattr $C$DW$T$63, DW_AT_decl_column(0x01)
    4512                            .dwendtag $C$DW$T$63
    4513                    
    4514                    $C$DW$T$1028    .dwtag  DW_TAG_typedef
    4515                            .dwattr $C$DW$T$1028, DW_AT_name("linkInfo_t")
    4516                            .dwattr $C$DW$T$1028, DW_AT_type(*$C$DW$T$63)
    4517                            .dwattr $C$DW$T$1028, DW_AT_language(DW_LANG_C)
    4518                            .dwattr $C$DW$T$1028, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154s
    4519                            .dwattr $C$DW$T$1028, DW_AT_decl_line(0x1a0)
    4520                            .dwattr $C$DW$T$1028, DW_AT_decl_column(0x03)
    4521                    
    4522                    
    4523                    $C$DW$T$64      .dwtag  DW_TAG_structure_type
    4524                            .dwattr $C$DW$T$64, DW_AT_byte_size(0x02)
    4525                    $C$DW$439       .dwtag  DW_TAG_member
    4526                            .dwattr $C$DW$439, DW_AT_type(*$C$DW$T$29)
    4527                            .dwattr $C$DW$439, DW_AT_name("event")
    4528                            .dwattr $C$DW$439, DW_AT_TI_symbol_name("event")
    4529                            .dwattr $C$DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4530                            .dwattr $C$DW$439, DW_AT_accessibility(DW_ACCESS_public)
    4531                            .dwattr $C$DW$439, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    4532                            .dwattr $C$DW$439, DW_AT_decl_line(0x79)
    4533                            .dwattr $C$DW$439, DW_AT_decl_column(0x0a)
    4534                    
    4535                    $C$DW$440       .dwtag  DW_TAG_member
    4536                            .dwattr $C$DW$440, DW_AT_type(*$C$DW$T$29)
    4537                            .dwattr $C$DW$440, DW_AT_name("status")
    4538                            .dwattr $C$DW$440, DW_AT_TI_symbol_name("status")
    4539                            .dwattr $C$DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4540                            .dwattr $C$DW$440, DW_AT_accessibility(DW_ACCESS_public)
    4541                            .dwattr $C$DW$440, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    4542                            .dwattr $C$DW$440, DW_AT_decl_line(0x7a)
    4543                            .dwattr $C$DW$440, DW_AT_decl_column(0x0a)
    4544                    
    4545                            .dwattr $C$DW$T$64, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/M
    4546                            .dwattr $C$DW$T$64, DW_AT_decl_line(0x78)
    4547                            .dwattr $C$DW$T$64, DW_AT_decl_column(0x01)
    4548                            .dwendtag $C$DW$T$64
    4549                    
    4550                    $C$DW$T$1029    .dwtag  DW_TAG_typedef
    4551                            .dwattr $C$DW$T$1029, DW_AT_name("osal_event_hdr_t")
    4552                            .dwattr $C$DW$T$1029, DW_AT_type(*$C$DW$T$64)
    4553                            .dwattr $C$DW$T$1029, DW_AT_language(DW_LANG_C)
    4554                            .dwattr $C$DW$T$1029, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application
    4555                            .dwattr $C$DW$T$1029, DW_AT_decl_line(0x7b)
    4556                            .dwattr $C$DW$T$1029, DW_AT_decl_column(0x03)
    4557                    
    4558                    
    4559                    $C$DW$T$96      .dwtag  DW_TAG_structure_type
    4560                            .dwattr $C$DW$T$96, DW_AT_byte_size(0x4c)
    4561                    $C$DW$441       .dwtag  DW_TAG_member
    4562                            .dwattr $C$DW$441, DW_AT_type(*$C$DW$T$67)
    4563                            .dwattr $C$DW$441, DW_AT_name("Crc32")
    4564                            .dwattr $C$DW$441, DW_AT_TI_symbol_name("Crc32")
    4565                            .dwattr $C$DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:30 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{24102AC7-264E-4E23-8F1F-41525EB8EC61} PAGE   84

    4566                            .dwattr $C$DW$441, DW_AT_accessibility(DW_ACCESS_public)
    4567                            .dwattr $C$DW$441, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    4568                            .dwattr $C$DW$441, DW_AT_decl_line(0x76)
    4569                            .dwattr $C$DW$441, DW_AT_decl_column(0x25)
    4570                    
    4571                    $C$DW$442       .dwtag  DW_TAG_member
    4572                            .dwattr $C$DW$442, DW_AT_type(*$C$DW$T$70)
    4573                            .dwattr $C$DW$442, DW_AT_name("FlashGetSize")
    4574                            .dwattr $C$DW$442, DW_AT_TI_symbol_name("FlashGetSize")
    4575                            .dwattr $C$DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4576                            .dwattr $C$DW$442, DW_AT_accessibility(DW_ACCESS_public)
    4577                            .dwattr $C$DW$442, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    4578                            .dwattr $C$DW$442, DW_AT_decl_line(0x77)
    4579                            .dwattr $C$DW$442, DW_AT_decl_column(0x25)
    4580                    
    4581                    $C$DW$443       .dwtag  DW_TAG_member
    4582                            .dwattr $C$DW$443, DW_AT_type(*$C$DW$T$71)
    4583                            .dwattr $C$DW$443, DW_AT_name("GetChipId")
    4584                            .dwattr $C$DW$443, DW_AT_TI_symbol_name("GetChipId")
    4585                            .dwattr $C$DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4586                            .dwattr $C$DW$443, DW_AT_accessibility(DW_ACCESS_public)
    4587                            .dwattr $C$DW$443, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    4588                            .dwattr $C$DW$443, DW_AT_decl_line(0x78)
    4589                            .dwattr $C$DW$443, DW_AT_decl_column(0x25)
    4590                    
    4591                    $C$DW$444       .dwtag  DW_TAG_member
    4592                            .dwattr $C$DW$444, DW_AT_type(*$C$DW$T$74)
    4593                            .dwattr $C$DW$444, DW_AT_name("ReservedLocation1")
    4594                            .dwattr $C$DW$444, DW_AT_TI_symbol_name("ReservedLocation1")
    4595                            .dwattr $C$DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4596                            .dwattr $C$DW$444, DW_AT_accessibility(DW_ACCESS_public)
    4597                            .dwattr $C$DW$444, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    4598                            .dwattr $C$DW$444, DW_AT_decl_line(0x79)
    4599                            .dwattr $C$DW$444, DW_AT_decl_column(0x25)
    4600                    
    4601                    $C$DW$445       .dwtag  DW_TAG_member
    4602                            .dwattr $C$DW$445, DW_AT_type(*$C$DW$T$75)
    4603                            .dwattr $C$DW$445, DW_AT_name("ReservedLocation2")
    4604                            .dwattr $C$DW$445, DW_AT_TI_symbol_name("ReservedLocation2")
    4605                            .dwattr $C$DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4606                            .dwattr $C$DW$445, DW_AT_accessibility(DW_ACCESS_public)
    4607                            .dwattr $C$DW$445, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    4608                            .dwattr $C$DW$445, DW_AT_decl_line(0x7a)
    4609                            .dwattr $C$DW$445, DW_AT_decl_column(0x25)
    4610                    
    4611                    $C$DW$446       .dwtag  DW_TAG_member
    4612                            .dwattr $C$DW$446, DW_AT_type(*$C$DW$T$76)
    4613                            .dwattr $C$DW$446, DW_AT_name("ReservedLocation3")
    4614                            .dwattr $C$DW$446, DW_AT_TI_symbol_name("ReservedLocation3")
    4615                            .dwattr $C$DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4616                            .dwattr $C$DW$446, DW_AT_accessibility(DW_ACCESS_public)
    4617                            .dwattr $C$DW$446, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    4618                            .dwattr $C$DW$446, DW_AT_decl_line(0x7b)
    4619                            .dwattr $C$DW$446, DW_AT_decl_column(0x25)
    4620                    
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:30 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{24102AC7-264E-4E23-8F1F-41525EB8EC61} PAGE   85

    4621                    $C$DW$447       .dwtag  DW_TAG_member
    4622                            .dwattr $C$DW$447, DW_AT_type(*$C$DW$T$77)
    4623                            .dwattr $C$DW$447, DW_AT_name("ResetDevice")
    4624                            .dwattr $C$DW$447, DW_AT_TI_symbol_name("ResetDevice")
    4625                            .dwattr $C$DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    4626                            .dwattr $C$DW$447, DW_AT_accessibility(DW_ACCESS_public)
    4627                            .dwattr $C$DW$447, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    4628                            .dwattr $C$DW$447, DW_AT_decl_line(0x7c)
    4629                            .dwattr $C$DW$447, DW_AT_decl_column(0x25)
    4630                    
    4631                    $C$DW$448       .dwtag  DW_TAG_member
    4632                            .dwattr $C$DW$448, DW_AT_type(*$C$DW$T$82)
    4633                            .dwattr $C$DW$448, DW_AT_name("Fletcher32")
    4634                            .dwattr $C$DW$448, DW_AT_TI_symbol_name("Fletcher32")
    4635                            .dwattr $C$DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    4636                            .dwattr $C$DW$448, DW_AT_accessibility(DW_ACCESS_public)
    4637                            .dwattr $C$DW$448, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    4638                            .dwattr $C$DW$448, DW_AT_decl_line(0x7d)
    4639                            .dwattr $C$DW$448, DW_AT_decl_column(0x25)
    4640                    
    4641                    $C$DW$449       .dwtag  DW_TAG_member
    4642                            .dwattr $C$DW$449, DW_AT_type(*$C$DW$T$85)
    4643                            .dwattr $C$DW$449, DW_AT_name("MinValue")
    4644                            .dwattr $C$DW$449, DW_AT_TI_symbol_name("MinValue")
    4645                            .dwattr $C$DW$449, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    4646                            .dwattr $C$DW$449, DW_AT_accessibility(DW_ACCESS_public)
    4647                            .dwattr $C$DW$449, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    4648                            .dwattr $C$DW$449, DW_AT_decl_line(0x7e)
    4649                            .dwattr $C$DW$449, DW_AT_decl_column(0x25)
    4650                    
    4651                    $C$DW$450       .dwtag  DW_TAG_member
    4652                            .dwattr $C$DW$450, DW_AT_type(*$C$DW$T$86)
    4653                            .dwattr $C$DW$450, DW_AT_name("MaxValue")
    4654                            .dwattr $C$DW$450, DW_AT_TI_symbol_name("MaxValue")
    4655                            .dwattr $C$DW$450, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    4656                            .dwattr $C$DW$450, DW_AT_accessibility(DW_ACCESS_public)
    4657                            .dwattr $C$DW$450, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    4658                            .dwattr $C$DW$450, DW_AT_decl_line(0x7f)
    4659                            .dwattr $C$DW$450, DW_AT_decl_column(0x25)
    4660                    
    4661                    $C$DW$451       .dwtag  DW_TAG_member
    4662                            .dwattr $C$DW$451, DW_AT_type(*$C$DW$T$87)
    4663                            .dwattr $C$DW$451, DW_AT_name("MeanValue")
    4664                            .dwattr $C$DW$451, DW_AT_TI_symbol_name("MeanValue")
    4665                            .dwattr $C$DW$451, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    4666                            .dwattr $C$DW$451, DW_AT_accessibility(DW_ACCESS_public)
    4667                            .dwattr $C$DW$451, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    4668                            .dwattr $C$DW$451, DW_AT_decl_line(0x80)
    4669                            .dwattr $C$DW$451, DW_AT_decl_column(0x25)
    4670                    
    4671                    $C$DW$452       .dwtag  DW_TAG_member
    4672                            .dwattr $C$DW$452, DW_AT_type(*$C$DW$T$88)
    4673                            .dwattr $C$DW$452, DW_AT_name("StandDeviationValue")
    4674                            .dwattr $C$DW$452, DW_AT_TI_symbol_name("StandDeviationValue")
    4675                            .dwattr $C$DW$452, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:30 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{24102AC7-264E-4E23-8F1F-41525EB8EC61} PAGE   86

    4676                            .dwattr $C$DW$452, DW_AT_accessibility(DW_ACCESS_public)
    4677                            .dwattr $C$DW$452, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    4678                            .dwattr $C$DW$452, DW_AT_decl_line(0x81)
    4679                            .dwattr $C$DW$452, DW_AT_decl_column(0x25)
    4680                    
    4681                    $C$DW$453       .dwtag  DW_TAG_member
    4682                            .dwattr $C$DW$453, DW_AT_type(*$C$DW$T$89)
    4683                            .dwattr $C$DW$453, DW_AT_name("ReservedLocation4")
    4684                            .dwattr $C$DW$453, DW_AT_TI_symbol_name("ReservedLocation4")
    4685                            .dwattr $C$DW$453, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    4686                            .dwattr $C$DW$453, DW_AT_accessibility(DW_ACCESS_public)
    4687                            .dwattr $C$DW$453, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    4688                            .dwattr $C$DW$453, DW_AT_decl_line(0x82)
    4689                            .dwattr $C$DW$453, DW_AT_decl_column(0x25)
    4690                    
    4691                    $C$DW$454       .dwtag  DW_TAG_member
    4692                            .dwattr $C$DW$454, DW_AT_type(*$C$DW$T$90)
    4693                            .dwattr $C$DW$454, DW_AT_name("ReservedLocation5")
    4694                            .dwattr $C$DW$454, DW_AT_TI_symbol_name("ReservedLocation5")
    4695                            .dwattr $C$DW$454, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    4696                            .dwattr $C$DW$454, DW_AT_accessibility(DW_ACCESS_public)
    4697                            .dwattr $C$DW$454, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    4698                            .dwattr $C$DW$454, DW_AT_decl_line(0x83)
    4699                            .dwattr $C$DW$454, DW_AT_decl_column(0x25)
    4700                    
    4701                    $C$DW$455       .dwtag  DW_TAG_member
    4702                            .dwattr $C$DW$455, DW_AT_type(*$C$DW$T$91)
    4703                            .dwattr $C$DW$455, DW_AT_name("HFSourceSafeSwitch")
    4704                            .dwattr $C$DW$455, DW_AT_TI_symbol_name("HFSourceSafeSwitch")
    4705                            .dwattr $C$DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    4706                            .dwattr $C$DW$455, DW_AT_accessibility(DW_ACCESS_public)
    4707                            .dwattr $C$DW$455, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    4708                            .dwattr $C$DW$455, DW_AT_decl_line(0x84)
    4709                            .dwattr $C$DW$455, DW_AT_decl_column(0x25)
    4710                    
    4711                    $C$DW$456       .dwtag  DW_TAG_member
    4712                            .dwattr $C$DW$456, DW_AT_type(*$C$DW$T$92)
    4713                            .dwattr $C$DW$456, DW_AT_name("SelectCompAInput")
    4714                            .dwattr $C$DW$456, DW_AT_TI_symbol_name("SelectCompAInput")
    4715                            .dwattr $C$DW$456, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    4716                            .dwattr $C$DW$456, DW_AT_accessibility(DW_ACCESS_public)
    4717                            .dwattr $C$DW$456, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    4718                            .dwattr $C$DW$456, DW_AT_decl_line(0x85)
    4719                            .dwattr $C$DW$456, DW_AT_decl_column(0x25)
    4720                    
    4721                    $C$DW$457       .dwtag  DW_TAG_member
    4722                            .dwattr $C$DW$457, DW_AT_type(*$C$DW$T$93)
    4723                            .dwattr $C$DW$457, DW_AT_name("SelectCompARef")
    4724                            .dwattr $C$DW$457, DW_AT_TI_symbol_name("SelectCompARef")
    4725                            .dwattr $C$DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    4726                            .dwattr $C$DW$457, DW_AT_accessibility(DW_ACCESS_public)
    4727                            .dwattr $C$DW$457, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    4728                            .dwattr $C$DW$457, DW_AT_decl_line(0x86)
    4729                            .dwattr $C$DW$457, DW_AT_decl_column(0x25)
    4730                    
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:30 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{24102AC7-264E-4E23-8F1F-41525EB8EC61} PAGE   87

    4731                    $C$DW$458       .dwtag  DW_TAG_member
    4732                            .dwattr $C$DW$458, DW_AT_type(*$C$DW$T$94)
    4733                            .dwattr $C$DW$458, DW_AT_name("SelectADCCompBInput")
    4734                            .dwattr $C$DW$458, DW_AT_TI_symbol_name("SelectADCCompBInput")
    4735                            .dwattr $C$DW$458, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    4736                            .dwattr $C$DW$458, DW_AT_accessibility(DW_ACCESS_public)
    4737                            .dwattr $C$DW$458, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    4738                            .dwattr $C$DW$458, DW_AT_decl_line(0x87)
    4739                            .dwattr $C$DW$458, DW_AT_decl_column(0x25)
    4740                    
    4741                    $C$DW$459       .dwtag  DW_TAG_member
    4742                            .dwattr $C$DW$459, DW_AT_type(*$C$DW$T$95)
    4743                            .dwattr $C$DW$459, DW_AT_name("SelectCompBRef")
    4744                            .dwattr $C$DW$459, DW_AT_TI_symbol_name("SelectCompBRef")
    4745                            .dwattr $C$DW$459, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    4746                            .dwattr $C$DW$459, DW_AT_accessibility(DW_ACCESS_public)
    4747                            .dwattr $C$DW$459, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    4748                            .dwattr $C$DW$459, DW_AT_decl_line(0x88)
    4749                            .dwattr $C$DW$459, DW_AT_decl_column(0x25)
    4750                    
    4751                            .dwattr $C$DW$T$96, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\
    4752                            .dwattr $C$DW$T$96, DW_AT_decl_line(0x75)
    4753                            .dwattr $C$DW$T$96, DW_AT_decl_column(0x01)
    4754                            .dwendtag $C$DW$T$96
    4755                    
    4756                    $C$DW$T$1030    .dwtag  DW_TAG_typedef
    4757                            .dwattr $C$DW$T$1030, DW_AT_name("HARD_API_T")
    4758                            .dwattr $C$DW$T$1030, DW_AT_type(*$C$DW$T$96)
    4759                            .dwattr $C$DW$T$1030, DW_AT_language(DW_LANG_C)
    4760                            .dwattr $C$DW$T$1030, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\device
    4761                            .dwattr $C$DW$T$1030, DW_AT_decl_line(0x89)
    4762                            .dwattr $C$DW$T$1030, DW_AT_decl_column(0x03)
    4763                    
    4764                    
    4765                    $C$DW$T$99      .dwtag  DW_TAG_structure_type
    4766                            .dwattr $C$DW$T$99, DW_AT_byte_size(0x0a)
    4767                    $C$DW$460       .dwtag  DW_TAG_member
    4768                            .dwattr $C$DW$460, DW_AT_type(*$C$DW$T$454)
    4769                            .dwattr $C$DW$460, DW_AT_name("addr")
    4770                            .dwattr $C$DW$460, DW_AT_TI_symbol_name("addr")
    4771                            .dwattr $C$DW$460, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4772                            .dwattr $C$DW$460, DW_AT_accessibility(DW_ACCESS_public)
    4773                            .dwattr $C$DW$460, DW_AT_decl_file("C:\Users\Kevin\workspace_v7\sensor_cc1310lp\Application\ap
    4774                            .dwattr $C$DW$460, DW_AT_decl_line(0x4a7)
    4775                            .dwattr $C$DW$460, DW_AT_decl_column(0x07)
    4776                    
    4777                    $C$DW$461       .dwtag  DW_TAG_member
    4778                            .dwattr $C$DW$461, DW_AT_type(*$C$DW$T$98)
    4779                            .dwattr $C$DW$461, DW_AT_name("addrMode")
    4780                            .dwattr $C$DW$461, DW_AT_TI_symbol_name("addrMode")
    4781                            .dwattr $C$DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4782                            .dwattr $C$DW$461, DW_AT_accessibility(DW_ACCESS_public)
    4783                            .dwattr $C$DW$461, DW_AT_decl_file("C:\Users\Kevin\workspace_v7\sensor_cc1310lp\Application\ap
    4784                            .dwattr $C$DW$461, DW_AT_decl_line(0x4aa)
    4785                            .dwattr $C$DW$461, DW_AT_decl_column(0x17)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:30 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{24102AC7-264E-4E23-8F1F-41525EB8EC61} PAGE   88

    4786                    
    4787                            .dwattr $C$DW$T$99, DW_AT_decl_file("C:\Users\Kevin\workspace_v7\sensor_cc1310lp\Application\a
    4788                            .dwattr $C$DW$T$99, DW_AT_decl_line(0x49c)
    4789                            .dwattr $C$DW$T$99, DW_AT_decl_column(0x01)
    4790                            .dwendtag $C$DW$T$99
    4791                    
    4792                    $C$DW$T$687     .dwtag  DW_TAG_typedef
    4793                            .dwattr $C$DW$T$687, DW_AT_name("ApiMac_sAddr_t")
    4794                            .dwattr $C$DW$T$687, DW_AT_type(*$C$DW$T$99)
    4795                            .dwattr $C$DW$T$687, DW_AT_language(DW_LANG_C)
    4796                            .dwattr $C$DW$T$687, DW_AT_decl_file("C:\Users\Kevin\workspace_v7\sensor_cc1310lp\Application\
    4797                            .dwattr $C$DW$T$687, DW_AT_decl_line(0x4ab)
    4798                            .dwattr $C$DW$T$687, DW_AT_decl_column(0x03)
    4799                    
    4800                    
    4801                    $C$DW$T$103     .dwtag  DW_TAG_structure_type
    4802                            .dwattr $C$DW$T$103, DW_AT_byte_size(0x40)
    4803                    $C$DW$462       .dwtag  DW_TAG_member
    4804                            .dwattr $C$DW$462, DW_AT_type(*$C$DW$T$101)
    4805                            .dwattr $C$DW$462, DW_AT_name("beaconType")
    4806                            .dwattr $C$DW$462, DW_AT_TI_symbol_name("beaconType")
    4807                            .dwattr $C$DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4808                            .dwattr $C$DW$462, DW_AT_accessibility(DW_ACCESS_public)
    4809                            .dwattr $C$DW$462, DW_AT_decl_file("C:\Users\Kevin\workspace_v7\sensor_cc1310lp\Application\ap
    4810                            .dwattr $C$DW$462, DW_AT_decl_line(0x848)
    4811                            .dwattr $C$DW$462, DW_AT_decl_column(0x19)
    4812                    
    4813                    $C$DW$463       .dwtag  DW_TAG_member
    4814                            .dwattr $C$DW$463, DW_AT_type(*$C$DW$T$19)
    4815                            .dwattr $C$DW$463, DW_AT_name("bsn")
    4816                            .dwattr $C$DW$463, DW_AT_TI_symbol_name("bsn")
    4817                            .dwattr $C$DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4818                            .dwattr $C$DW$463, DW_AT_accessibility(DW_ACCESS_public)
    4819                            .dwattr $C$DW$463, DW_AT_decl_file("C:\Users\Kevin\workspace_v7\sensor_cc1310lp\Application\ap
    4820                            .dwattr $C$DW$463, DW_AT_decl_line(0x84a)
    4821                            .dwattr $C$DW$463, DW_AT_decl_column(0x0d)
    4822                    
    4823                    $C$DW$464       .dwtag  DW_TAG_member
    4824                            .dwattr $C$DW$464, DW_AT_type(*$C$DW$T$102)
    4825                            .dwattr $C$DW$464, DW_AT_name("panDesc")
    4826                            .dwattr $C$DW$464, DW_AT_TI_symbol_name("panDesc")
    4827                            .dwattr $C$DW$464, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4828                            .dwattr $C$DW$464, DW_AT_accessibility(DW_ACCESS_public)
    4829                            .dwattr $C$DW$464, DW_AT_decl_file("C:\Users\Kevin\workspace_v7\sensor_cc1310lp\Application\ap
    4830                            .dwattr $C$DW$464, DW_AT_decl_line(0x84c)
    4831                            .dwattr $C$DW$464, DW_AT_decl_column(0x16)
    4832                    
    4833                    $C$DW$465       .dwtag  DW_TAG_member
    4834                            .dwattr $C$DW$465, DW_AT_type(*$C$DW$T$457)
    4835                            .dwattr $C$DW$465, DW_AT_name("beaconData")
    4836                            .dwattr $C$DW$465, DW_AT_TI_symbol_name("beaconData")
    4837                            .dwattr $C$DW$465, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    4838                            .dwattr $C$DW$465, DW_AT_accessibility(DW_ACCESS_public)
    4839                            .dwattr $C$DW$465, DW_AT_decl_file("C:\Users\Kevin\workspace_v7\sensor_cc1310lp\Application\ap
    4840                            .dwattr $C$DW$465, DW_AT_decl_line(0x857)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:30 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{24102AC7-264E-4E23-8F1F-41525EB8EC61} PAGE   89

    4841                            .dwattr $C$DW$465, DW_AT_decl_column(0x07)
    4842                    
    4843                            .dwattr $C$DW$T$103, DW_AT_decl_file("C:\Users\Kevin\workspace_v7\sensor_cc1310lp\Application\
    4844                            .dwattr $C$DW$T$103, DW_AT_decl_line(0x846)
    4845                            .dwattr $C$DW$T$103, DW_AT_decl_column(0x01)
    4846                            .dwendtag $C$DW$T$103
    4847                    
    4848                    $C$DW$T$601     .dwtag  DW_TAG_typedef
    4849                            .dwattr $C$DW$T$601, DW_AT_name("ApiMac_mlmeBeaconNotifyInd_t")
    4850                            .dwattr $C$DW$T$601, DW_AT_type(*$C$DW$T$103)
    4851                            .dwattr $C$DW$T$601, DW_AT_language(DW_LANG_C)
    4852                            .dwattr $C$DW$T$601, DW_AT_decl_file("C:\Users\Kevin\workspace_v7\sensor_cc1310lp\Application\
    4853                            .dwattr $C$DW$T$601, DW_AT_decl_line(0x858)
    4854                            .dwattr $C$DW$T$601, DW_AT_decl_column(0x03)
    4855                    
    4856                    $C$DW$T$602     .dwtag  DW_TAG_pointer_type
    4857                            .dwattr $C$DW$T$602, DW_AT_type(*$C$DW$T$601)
    4858                            .dwattr $C$DW$T$602, DW_AT_address_class(0x20)
    4859                    
    4860                    
    4861                    $C$DW$T$104     .dwtag  DW_TAG_structure_type
    4862                            .dwattr $C$DW$T$104, DW_AT_byte_size(0x08)
    4863                    $C$DW$466       .dwtag  DW_TAG_member
    4864                            .dwattr $C$DW$466, DW_AT_type(*$C$DW$T$39)
    4865                            .dwattr $C$DW$466, DW_AT_name("pCurrEntry")
    4866                            .dwattr $C$DW$466, DW_AT_TI_symbol_name("pCurrEntry")
    4867                            .dwattr $C$DW$466, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4868                            .dwattr $C$DW$466, DW_AT_accessibility(DW_ACCESS_public)
    4869                            .dwattr $C$DW$466, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    4870                            .dwattr $C$DW$466, DW_AT_decl_line(0x41)
    4871                            .dwattr $C$DW$466, DW_AT_decl_column(0x0d)
    4872                    
    4873                    $C$DW$467       .dwtag  DW_TAG_member
    4874                            .dwattr $C$DW$467, DW_AT_type(*$C$DW$T$39)
    4875                            .dwattr $C$DW$467, DW_AT_name("pLastEntry")
    4876                            .dwattr $C$DW$467, DW_AT_TI_symbol_name("pLastEntry")
    4877                            .dwattr $C$DW$467, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4878                            .dwattr $C$DW$467, DW_AT_accessibility(DW_ACCESS_public)
    4879                            .dwattr $C$DW$467, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    4880                            .dwattr $C$DW$467, DW_AT_decl_line(0x42)
    4881                            .dwattr $C$DW$467, DW_AT_decl_column(0x0d)
    4882                    
    4883                            .dwattr $C$DW$T$104, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices
    4884                            .dwattr $C$DW$T$104, DW_AT_decl_line(0x40)
    4885                            .dwattr $C$DW$T$104, DW_AT_decl_column(0x10)
    4886                            .dwendtag $C$DW$T$104
    4887                    
    4888                    $C$DW$T$843     .dwtag  DW_TAG_typedef
    4889                            .dwattr $C$DW$T$843, DW_AT_name("dataQueue_t")
    4890                            .dwattr $C$DW$T$843, DW_AT_type(*$C$DW$T$104)
    4891                            .dwattr $C$DW$T$843, DW_AT_language(DW_LANG_C)
    4892                            .dwattr $C$DW$T$843, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices
    4893                            .dwattr $C$DW$T$843, DW_AT_decl_line(0x43)
    4894                            .dwattr $C$DW$T$843, DW_AT_decl_column(0x03)
    4895                    
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:30 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{24102AC7-264E-4E23-8F1F-41525EB8EC61} PAGE   90

    4896                    $C$DW$T$844     .dwtag  DW_TAG_pointer_type
    4897                            .dwattr $C$DW$T$844, DW_AT_type(*$C$DW$T$843)
    4898                            .dwattr $C$DW$T$844, DW_AT_address_class(0x20)
    4899                    
    4900                    
    4901                    $C$DW$T$105     .dwtag  DW_TAG_structure_type
    4902                            .dwattr $C$DW$T$105, DW_AT_byte_size(0x01)
    4903                    $C$DW$468       .dwtag  DW_TAG_member
    4904                            .dwattr $C$DW$468, DW_AT_type(*$C$DW$T$19)
    4905                            .dwattr $C$DW$468, DW_AT_name("triggerType")
    4906                            .dwattr $C$DW$468, DW_AT_TI_symbol_name("triggerType")
    4907                            .dwattr $C$DW$468, DW_AT_bit_offset(0x04)
    4908                            .dwattr $C$DW$468, DW_AT_bit_size(0x04)
    4909                            .dwattr $C$DW$468, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4910                            .dwattr $C$DW$468, DW_AT_accessibility(DW_ACCESS_public)
    4911                            .dwattr $C$DW$468, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    4912                            .dwattr $C$DW$468, DW_AT_decl_line(0x77)
    4913                            .dwattr $C$DW$468, DW_AT_decl_column(0x0f)
    4914                    
    4915                    $C$DW$469       .dwtag  DW_TAG_member
    4916                            .dwattr $C$DW$469, DW_AT_type(*$C$DW$T$19)
    4917                            .dwattr $C$DW$469, DW_AT_name("bEnaCmd")
    4918                            .dwattr $C$DW$469, DW_AT_TI_symbol_name("bEnaCmd")
    4919                            .dwattr $C$DW$469, DW_AT_bit_offset(0x03)
    4920                            .dwattr $C$DW$469, DW_AT_bit_size(0x01)
    4921                            .dwattr $C$DW$469, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4922                            .dwattr $C$DW$469, DW_AT_accessibility(DW_ACCESS_public)
    4923                            .dwattr $C$DW$469, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    4924                            .dwattr $C$DW$469, DW_AT_decl_line(0x78)
    4925                            .dwattr $C$DW$469, DW_AT_decl_column(0x0f)
    4926                    
    4927                    $C$DW$470       .dwtag  DW_TAG_member
    4928                            .dwattr $C$DW$470, DW_AT_type(*$C$DW$T$19)
    4929                            .dwattr $C$DW$470, DW_AT_name("triggerNo")
    4930                            .dwattr $C$DW$470, DW_AT_TI_symbol_name("triggerNo")
    4931                            .dwattr $C$DW$470, DW_AT_bit_offset(0x01)
    4932                            .dwattr $C$DW$470, DW_AT_bit_size(0x02)
    4933                            .dwattr $C$DW$470, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4934                            .dwattr $C$DW$470, DW_AT_accessibility(DW_ACCESS_public)
    4935                            .dwattr $C$DW$470, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    4936                            .dwattr $C$DW$470, DW_AT_decl_line(0x7a)
    4937                            .dwattr $C$DW$470, DW_AT_decl_column(0x0f)
    4938                    
    4939                    $C$DW$471       .dwtag  DW_TAG_member
    4940                            .dwattr $C$DW$471, DW_AT_type(*$C$DW$T$19)
    4941                            .dwattr $C$DW$471, DW_AT_name("pastTrig")
    4942                            .dwattr $C$DW$471, DW_AT_TI_symbol_name("pastTrig")
    4943                            .dwattr $C$DW$471, DW_AT_bit_offset(0x00)
    4944                            .dwattr $C$DW$471, DW_AT_bit_size(0x01)
    4945                            .dwattr $C$DW$471, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4946                            .dwattr $C$DW$471, DW_AT_accessibility(DW_ACCESS_public)
    4947                            .dwattr $C$DW$471, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    4948                            .dwattr $C$DW$471, DW_AT_decl_line(0x7b)
    4949                            .dwattr $C$DW$471, DW_AT_decl_column(0x0f)
    4950                    
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:30 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{24102AC7-264E-4E23-8F1F-41525EB8EC61} PAGE   91

    4951                            .dwattr $C$DW$T$105, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices
    4952                            .dwattr $C$DW$T$105, DW_AT_decl_line(0x76)
    4953                            .dwattr $C$DW$T$105, DW_AT_decl_column(0x0b)
    4954                            .dwendtag $C$DW$T$105
    4955                    
    4956                    
    4957                    $C$DW$T$106     .dwtag  DW_TAG_structure_type
    4958                            .dwattr $C$DW$T$106, DW_AT_byte_size(0x01)
    4959                    $C$DW$472       .dwtag  DW_TAG_member
    4960                            .dwattr $C$DW$472, DW_AT_type(*$C$DW$T$19)
    4961                            .dwattr $C$DW$472, DW_AT_name("rule")
    4962                            .dwattr $C$DW$472, DW_AT_TI_symbol_name("rule")
    4963                            .dwattr $C$DW$472, DW_AT_bit_offset(0x04)
    4964                            .dwattr $C$DW$472, DW_AT_bit_size(0x04)
    4965                            .dwattr $C$DW$472, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4966                            .dwattr $C$DW$472, DW_AT_accessibility(DW_ACCESS_public)
    4967                            .dwattr $C$DW$472, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    4968                            .dwattr $C$DW$472, DW_AT_decl_line(0x7f)
    4969                            .dwattr $C$DW$472, DW_AT_decl_column(0x0f)
    4970                    
    4971                    $C$DW$473       .dwtag  DW_TAG_member
    4972                            .dwattr $C$DW$473, DW_AT_type(*$C$DW$T$19)
    4973                            .dwattr $C$DW$473, DW_AT_name("nSkip")
    4974                            .dwattr $C$DW$473, DW_AT_TI_symbol_name("nSkip")
    4975                            .dwattr $C$DW$473, DW_AT_bit_offset(0x00)
