TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:28 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{041DAC52-8C43-4717-A6A0-6073B5E74BD6} PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                        PC v16.9.4.LTS *
       3                    ;* Date/Time created: Sat Nov 18 18:46:27 2017                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../Application/MAC/OSAL/osal.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v16.9.4.LTS Copyright (c) 1996-20
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Kevin\workspace_v7\sensor_cc1310lp\sensor_cc1310lp"
      13                    
      14                    ;*****************************************************************************

    7065                    
    7066                    $C$DW$T$176     .dwtag  DW_TAG_typedef
    7067                            .dwattr $C$DW$T$176, DW_AT_name("tFlashStateCommandsType")
    7068                            .dwattr $C$DW$T$176, DW_AT_type(*$C$DW$T$175)
    7069                            .dwattr $C$DW$T$176, DW_AT_language(DW_LANG_C)
    7070                            .dwattr $C$DW$T$176, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices
    7071                            .dwattr $C$DW$T$176, DW_AT_decl_line(0xb0)
    7072                            .dwattr $C$DW$T$176, DW_AT_decl_column(0x03)
    7073                    
    7074                    
    7075                    $C$DW$T$177     .dwtag  DW_TAG_enumeration_type
    7076                            .dwattr $C$DW$T$177, DW_AT_byte_size(0x01)
    7077                    $C$DW$456       .dwtag  DW_TAG_enumerator
    7078                            .dwattr $C$DW$456, DW_AT_name("ICALL_RTI_APP_CMD_EVENT")
    7079                            .dwattr $C$DW$456, DW_AT_const_value(0xe0)
    7080                            .dwattr $C$DW$456, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    7081                            .dwattr $C$DW$456, DW_AT_decl_line(0x3de)
    7082                            .dwattr $C$DW$456, DW_AT_decl_column(0x04)
    7083                    
    7084                    $C$DW$457       .dwtag  DW_TAG_enumerator
    7085                            .dwattr $C$DW$457, DW_AT_name("ICALL_RTI_STACK_CMD_EVENT")
    7086                            .dwattr $C$DW$457, DW_AT_const_value(0xe1)
    7087                            .dwattr $C$DW$457, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    7088                            .dwattr $C$DW$457, DW_AT_decl_line(0x3e0)
    7089                            .dwattr $C$DW$457, DW_AT_decl_column(0x04)
    7090                    
    7091                    $C$DW$458       .dwtag  DW_TAG_enumerator
    7092                            .dwattr $C$DW$458, DW_AT_name("ICALL_RTI_APP_ASYNC_CMD_EVENT")
    7093                            .dwattr $C$DW$458, DW_AT_const_value(0xe2)
    7094                            .dwattr $C$DW$458, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    7095                            .dwattr $C$DW$458, DW_AT_decl_line(0x3e2)
    7096                            .dwattr $C$DW$458, DW_AT_decl_column(0x04)
    7097                    
    7098                    $C$DW$459       .dwtag  DW_TAG_enumerator
    7099                            .dwattr $C$DW$459, DW_AT_name("ICALL_RTI_APP_SYNC_CMD_EVENT")
    7100                            .dwattr $C$DW$459, DW_AT_const_value(0xe3)
    7101                            .dwattr $C$DW$459, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    7102                            .dwattr $C$DW$459, DW_AT_decl_line(0x3e4)
    7103                            .dwattr $C$DW$459, DW_AT_decl_column(0x04)
    7104                    
    7105                    $C$DW$460       .dwtag  DW_TAG_enumerator
    7106                            .dwattr $C$DW$460, DW_AT_name("ICALL_RCN_APP_ASYNC_CMD_EVENT")
    7107                            .dwattr $C$DW$460, DW_AT_const_value(0xe4)
    7108                            .dwattr $C$DW$460, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    7109                            .dwattr $C$DW$460, DW_AT_decl_line(0x3e6)
    7110                            .dwattr $C$DW$460, DW_AT_decl_column(0x04)
    7111                    
    7112                    $C$DW$461       .dwtag  DW_TAG_enumerator
    7113                            .dwattr $C$DW$461, DW_AT_name("ICALL_RCN_APP_SYNC_CMD_EVENT")
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:28 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{041DAC52-8C43-4717-A6A0-6073B5E74BD6} PAGE  131

    7114                            .dwattr $C$DW$461, DW_AT_const_value(0xe5)
    7115                            .dwattr $C$DW$461, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    7116                            .dwattr $C$DW$461, DW_AT_decl_line(0x3e8)
    7117                            .dwattr $C$DW$461, DW_AT_decl_column(0x04)
    7118                    
    7119                            .dwattr $C$DW$T$177, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154st
    7120                            .dwattr $C$DW$T$177, DW_AT_decl_line(0x3dc)
    7121                            .dwattr $C$DW$T$177, DW_AT_decl_column(0x01)
    7122                            .dwendtag $C$DW$T$177
    7123                    
    7124                    $C$DW$T$178     .dwtag  DW_TAG_typedef
    7125                            .dwattr $C$DW$T$178, DW_AT_name("ICall_RemotiCmdEvent_t")
    7126                            .dwattr $C$DW$T$178, DW_AT_type(*$C$DW$T$177)
    7127                            .dwattr $C$DW$T$178, DW_AT_language(DW_LANG_C)
    7128                            .dwattr $C$DW$T$178, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154st
    7129                            .dwattr $C$DW$T$178, DW_AT_decl_line(0x3e9)
    7130                            .dwattr $C$DW$T$178, DW_AT_decl_column(0x02)
    7131                    
    7132                    
    7133                    $C$DW$T$20      .dwtag  DW_TAG_structure_type
    7134                            .dwattr $C$DW$T$20, DW_AT_byte_size(0x02)
    7135                    $C$DW$462       .dwtag  DW_TAG_member
    7136                            .dwattr $C$DW$462, DW_AT_type(*$C$DW$T$19)
    7137                            .dwattr $C$DW$462, DW_AT_name("event")
    7138                            .dwattr $C$DW$462, DW_AT_TI_symbol_name("event")
    7139                            .dwattr $C$DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7140                            .dwattr $C$DW$462, DW_AT_accessibility(DW_ACCESS_public)
    7141                            .dwattr $C$DW$462, DW_AT_decl_file("..\Application\MAC\OSAL\osal.h")
    7142                            .dwattr $C$DW$462, DW_AT_decl_line(0x79)
    7143                            .dwattr $C$DW$462, DW_AT_decl_column(0x0a)
    7144                    
    7145                    $C$DW$463       .dwtag  DW_TAG_member
    7146                            .dwattr $C$DW$463, DW_AT_type(*$C$DW$T$19)
    7147                            .dwattr $C$DW$463, DW_AT_name("status")
    7148                            .dwattr $C$DW$463, DW_AT_TI_symbol_name("status")
    7149                            .dwattr $C$DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7150                            .dwattr $C$DW$463, DW_AT_accessibility(DW_ACCESS_public)
    7151                            .dwattr $C$DW$463, DW_AT_decl_file("..\Application\MAC\OSAL\osal.h")
    7152                            .dwattr $C$DW$463, DW_AT_decl_line(0x7a)
    7153                            .dwattr $C$DW$463, DW_AT_decl_column(0x0a)
    7154                    
    7155                            .dwattr $C$DW$T$20, DW_AT_decl_file("..\Application\MAC\OSAL\osal.h")
    7156                            .dwattr $C$DW$T$20, DW_AT_decl_line(0x78)
    7157                            .dwattr $C$DW$T$20, DW_AT_decl_column(0x01)
    7158                            .dwendtag $C$DW$T$20
    7159                    
    7160                    $C$DW$T$86      .dwtag  DW_TAG_typedef
    7161                            .dwattr $C$DW$T$86, DW_AT_name("osal_event_hdr_t")
    7162                            .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$20)
    7163                            .dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)
    7164                            .dwattr $C$DW$T$86, DW_AT_decl_file("..\Application\MAC\OSAL\osal.h")
    7165                            .dwattr $C$DW$T$86, DW_AT_decl_line(0x7b)
    7166                            .dwattr $C$DW$T$86, DW_AT_decl_column(0x03)
    7167                    
    7168                    $C$DW$T$181     .dwtag  DW_TAG_pointer_type
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:28 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{041DAC52-8C43-4717-A6A0-6073B5E74BD6} PAGE  132

    7169                            .dwattr $C$DW$T$181, DW_AT_type(*$C$DW$T$86)
    7170                            .dwattr $C$DW$T$181, DW_AT_address_class(0x20)
    7171                    
    7172                    
    7173                    $C$DW$T$62      .dwtag  DW_TAG_structure_type
    7174                            .dwattr $C$DW$T$62, DW_AT_byte_size(0x4c)
    7175                    $C$DW$464       .dwtag  DW_TAG_member
    7176                            .dwattr $C$DW$464, DW_AT_type(*$C$DW$T$26)
    7177                            .dwattr $C$DW$464, DW_AT_name("Crc32")
    7178                            .dwattr $C$DW$464, DW_AT_TI_symbol_name("Crc32")
    7179                            .dwattr $C$DW$464, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7180                            .dwattr $C$DW$464, DW_AT_accessibility(DW_ACCESS_public)
    7181                            .dwattr $C$DW$464, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    7182                            .dwattr $C$DW$464, DW_AT_decl_line(0x76)
    7183                            .dwattr $C$DW$464, DW_AT_decl_column(0x25)
    7184                    
    7185                    $C$DW$465       .dwtag  DW_TAG_member
    7186                            .dwattr $C$DW$465, DW_AT_type(*$C$DW$T$29)
    7187                            .dwattr $C$DW$465, DW_AT_name("FlashGetSize")
    7188                            .dwattr $C$DW$465, DW_AT_TI_symbol_name("FlashGetSize")
    7189                            .dwattr $C$DW$465, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7190                            .dwattr $C$DW$465, DW_AT_accessibility(DW_ACCESS_public)
    7191                            .dwattr $C$DW$465, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    7192                            .dwattr $C$DW$465, DW_AT_decl_line(0x77)
    7193                            .dwattr $C$DW$465, DW_AT_decl_column(0x25)
    7194                    
    7195                    $C$DW$466       .dwtag  DW_TAG_member
    7196                            .dwattr $C$DW$466, DW_AT_type(*$C$DW$T$30)
    7197                            .dwattr $C$DW$466, DW_AT_name("GetChipId")
    7198                            .dwattr $C$DW$466, DW_AT_TI_symbol_name("GetChipId")
    7199                            .dwattr $C$DW$466, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7200                            .dwattr $C$DW$466, DW_AT_accessibility(DW_ACCESS_public)
    7201                            .dwattr $C$DW$466, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    7202                            .dwattr $C$DW$466, DW_AT_decl_line(0x78)
    7203                            .dwattr $C$DW$466, DW_AT_decl_column(0x25)
    7204                    
    7205                    $C$DW$467       .dwtag  DW_TAG_member
    7206                            .dwattr $C$DW$467, DW_AT_type(*$C$DW$T$33)
    7207                            .dwattr $C$DW$467, DW_AT_name("ReservedLocation1")
    7208                            .dwattr $C$DW$467, DW_AT_TI_symbol_name("ReservedLocation1")
    7209                            .dwattr $C$DW$467, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7210                            .dwattr $C$DW$467, DW_AT_accessibility(DW_ACCESS_public)
    7211                            .dwattr $C$DW$467, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    7212                            .dwattr $C$DW$467, DW_AT_decl_line(0x79)
    7213                            .dwattr $C$DW$467, DW_AT_decl_column(0x25)
    7214                    
    7215                    $C$DW$468       .dwtag  DW_TAG_member
    7216                            .dwattr $C$DW$468, DW_AT_type(*$C$DW$T$34)
    7217                            .dwattr $C$DW$468, DW_AT_name("ReservedLocation2")
    7218                            .dwattr $C$DW$468, DW_AT_TI_symbol_name("ReservedLocation2")
    7219                            .dwattr $C$DW$468, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7220                            .dwattr $C$DW$468, DW_AT_accessibility(DW_ACCESS_public)
    7221                            .dwattr $C$DW$468, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    7222                            .dwattr $C$DW$468, DW_AT_decl_line(0x7a)
    7223                            .dwattr $C$DW$468, DW_AT_decl_column(0x25)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:28 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{041DAC52-8C43-4717-A6A0-6073B5E74BD6} PAGE  133

    7224                    
    7225                    $C$DW$469       .dwtag  DW_TAG_member
    7226                            .dwattr $C$DW$469, DW_AT_type(*$C$DW$T$35)
    7227                            .dwattr $C$DW$469, DW_AT_name("ReservedLocation3")
    7228                            .dwattr $C$DW$469, DW_AT_TI_symbol_name("ReservedLocation3")
    7229                            .dwattr $C$DW$469, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    7230                            .dwattr $C$DW$469, DW_AT_accessibility(DW_ACCESS_public)
    7231                            .dwattr $C$DW$469, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    7232                            .dwattr $C$DW$469, DW_AT_decl_line(0x7b)
    7233                            .dwattr $C$DW$469, DW_AT_decl_column(0x25)
    7234                    
    7235                    $C$DW$470       .dwtag  DW_TAG_member
    7236                            .dwattr $C$DW$470, DW_AT_type(*$C$DW$T$38)
    7237                            .dwattr $C$DW$470, DW_AT_name("ResetDevice")
    7238                            .dwattr $C$DW$470, DW_AT_TI_symbol_name("ResetDevice")
    7239                            .dwattr $C$DW$470, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    7240                            .dwattr $C$DW$470, DW_AT_accessibility(DW_ACCESS_public)
    7241                            .dwattr $C$DW$470, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    7242                            .dwattr $C$DW$470, DW_AT_decl_line(0x7c)
    7243                            .dwattr $C$DW$470, DW_AT_decl_column(0x25)
    7244                    
    7245                    $C$DW$471       .dwtag  DW_TAG_member
    7246                            .dwattr $C$DW$471, DW_AT_type(*$C$DW$T$43)
    7247                            .dwattr $C$DW$471, DW_AT_name("Fletcher32")
    7248                            .dwattr $C$DW$471, DW_AT_TI_symbol_name("Fletcher32")
    7249                            .dwattr $C$DW$471, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    7250                            .dwattr $C$DW$471, DW_AT_accessibility(DW_ACCESS_public)
    7251                            .dwattr $C$DW$471, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    7252                            .dwattr $C$DW$471, DW_AT_decl_line(0x7d)
    7253                            .dwattr $C$DW$471, DW_AT_decl_column(0x25)
    7254                    
    7255                    $C$DW$472       .dwtag  DW_TAG_member
    7256                            .dwattr $C$DW$472, DW_AT_type(*$C$DW$T$47)
    7257                            .dwattr $C$DW$472, DW_AT_name("MinValue")
    7258                            .dwattr $C$DW$472, DW_AT_TI_symbol_name("MinValue")
    7259                            .dwattr $C$DW$472, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    7260                            .dwattr $C$DW$472, DW_AT_accessibility(DW_ACCESS_public)
    7261                            .dwattr $C$DW$472, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    7262                            .dwattr $C$DW$472, DW_AT_decl_line(0x7e)
    7263                            .dwattr $C$DW$472, DW_AT_decl_column(0x25)
    7264                    
    7265                    $C$DW$473       .dwtag  DW_TAG_member
    7266                            .dwattr $C$DW$473, DW_AT_type(*$C$DW$T$48)
    7267                            .dwattr $C$DW$473, DW_AT_name("MaxValue")
    7268                            .dwattr $C$DW$473, DW_AT_TI_symbol_name("MaxValue")
    7269                            .dwattr $C$DW$473, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    7270                            .dwattr $C$DW$473, DW_AT_accessibility(DW_ACCESS_public)
    7271                            .dwattr $C$DW$473, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    7272                            .dwattr $C$DW$473, DW_AT_decl_line(0x7f)
    7273                            .dwattr $C$DW$473, DW_AT_decl_column(0x25)
    7274                    
    7275                    $C$DW$474       .dwtag  DW_TAG_member
    7276                            .dwattr $C$DW$474, DW_AT_type(*$C$DW$T$49)
    7277                            .dwattr $C$DW$474, DW_AT_name("MeanValue")
    7278                            .dwattr $C$DW$474, DW_AT_TI_symbol_name("MeanValue")
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:28 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{041DAC52-8C43-4717-A6A0-6073B5E74BD6} PAGE  134

    7279                            .dwattr $C$DW$474, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    7280                            .dwattr $C$DW$474, DW_AT_accessibility(DW_ACCESS_public)
    7281                            .dwattr $C$DW$474, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    7282                            .dwattr $C$DW$474, DW_AT_decl_line(0x80)
    7283                            .dwattr $C$DW$474, DW_AT_decl_column(0x25)
    7284                    
    7285                    $C$DW$475       .dwtag  DW_TAG_member
    7286                            .dwattr $C$DW$475, DW_AT_type(*$C$DW$T$50)
    7287                            .dwattr $C$DW$475, DW_AT_name("StandDeviationValue")
    7288                            .dwattr $C$DW$475, DW_AT_TI_symbol_name("StandDeviationValue")
    7289                            .dwattr $C$DW$475, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    7290                            .dwattr $C$DW$475, DW_AT_accessibility(DW_ACCESS_public)
    7291                            .dwattr $C$DW$475, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    7292                            .dwattr $C$DW$475, DW_AT_decl_line(0x81)
    7293                            .dwattr $C$DW$475, DW_AT_decl_column(0x25)
    7294                    
    7295                    $C$DW$476       .dwtag  DW_TAG_member
    7296                            .dwattr $C$DW$476, DW_AT_type(*$C$DW$T$53)
    7297                            .dwattr $C$DW$476, DW_AT_name("ReservedLocation4")
    7298                            .dwattr $C$DW$476, DW_AT_TI_symbol_name("ReservedLocation4")
    7299                            .dwattr $C$DW$476, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    7300                            .dwattr $C$DW$476, DW_AT_accessibility(DW_ACCESS_public)
    7301                            .dwattr $C$DW$476, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    7302                            .dwattr $C$DW$476, DW_AT_decl_line(0x82)
    7303                            .dwattr $C$DW$476, DW_AT_decl_column(0x25)
    7304                    
    7305                    $C$DW$477       .dwtag  DW_TAG_member
    7306                            .dwattr $C$DW$477, DW_AT_type(*$C$DW$T$54)
    7307                            .dwattr $C$DW$477, DW_AT_name("ReservedLocation5")
    7308                            .dwattr $C$DW$477, DW_AT_TI_symbol_name("ReservedLocation5")
    7309                            .dwattr $C$DW$477, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    7310                            .dwattr $C$DW$477, DW_AT_accessibility(DW_ACCESS_public)
    7311                            .dwattr $C$DW$477, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    7312                            .dwattr $C$DW$477, DW_AT_decl_line(0x83)
    7313                            .dwattr $C$DW$477, DW_AT_decl_column(0x25)
    7314                    
    7315                    $C$DW$478       .dwtag  DW_TAG_member
    7316                            .dwattr $C$DW$478, DW_AT_type(*$C$DW$T$55)
    7317                            .dwattr $C$DW$478, DW_AT_name("HFSourceSafeSwitch")
    7318                            .dwattr $C$DW$478, DW_AT_TI_symbol_name("HFSourceSafeSwitch")
    7319                            .dwattr $C$DW$478, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    7320                            .dwattr $C$DW$478, DW_AT_accessibility(DW_ACCESS_public)
    7321                            .dwattr $C$DW$478, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    7322                            .dwattr $C$DW$478, DW_AT_decl_line(0x84)
    7323                            .dwattr $C$DW$478, DW_AT_decl_column(0x25)
    7324                    
    7325                    $C$DW$479       .dwtag  DW_TAG_member
    7326                            .dwattr $C$DW$479, DW_AT_type(*$C$DW$T$58)
    7327                            .dwattr $C$DW$479, DW_AT_name("SelectCompAInput")
    7328                            .dwattr $C$DW$479, DW_AT_TI_symbol_name("SelectCompAInput")
    7329                            .dwattr $C$DW$479, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    7330                            .dwattr $C$DW$479, DW_AT_accessibility(DW_ACCESS_public)
    7331                            .dwattr $C$DW$479, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    7332                            .dwattr $C$DW$479, DW_AT_decl_line(0x85)
    7333                            .dwattr $C$DW$479, DW_AT_decl_column(0x25)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:28 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{041DAC52-8C43-4717-A6A0-6073B5E74BD6} PAGE  135

    7334                    
    7335                    $C$DW$480       .dwtag  DW_TAG_member
    7336                            .dwattr $C$DW$480, DW_AT_type(*$C$DW$T$59)
    7337                            .dwattr $C$DW$480, DW_AT_name("SelectCompARef")
    7338                            .dwattr $C$DW$480, DW_AT_TI_symbol_name("SelectCompARef")
    7339                            .dwattr $C$DW$480, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    7340                            .dwattr $C$DW$480, DW_AT_accessibility(DW_ACCESS_public)
    7341                            .dwattr $C$DW$480, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    7342                            .dwattr $C$DW$480, DW_AT_decl_line(0x86)
    7343                            .dwattr $C$DW$480, DW_AT_decl_column(0x25)
    7344                    
    7345                    $C$DW$481       .dwtag  DW_TAG_member
    7346                            .dwattr $C$DW$481, DW_AT_type(*$C$DW$T$60)
    7347                            .dwattr $C$DW$481, DW_AT_name("SelectADCCompBInput")
    7348                            .dwattr $C$DW$481, DW_AT_TI_symbol_name("SelectADCCompBInput")
    7349                            .dwattr $C$DW$481, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    7350                            .dwattr $C$DW$481, DW_AT_accessibility(DW_ACCESS_public)
    7351                            .dwattr $C$DW$481, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    7352                            .dwattr $C$DW$481, DW_AT_decl_line(0x87)
    7353                            .dwattr $C$DW$481, DW_AT_decl_column(0x25)
    7354                    
    7355                    $C$DW$482       .dwtag  DW_TAG_member
    7356                            .dwattr $C$DW$482, DW_AT_type(*$C$DW$T$61)
    7357                            .dwattr $C$DW$482, DW_AT_name("SelectCompBRef")
    7358                            .dwattr $C$DW$482, DW_AT_TI_symbol_name("SelectCompBRef")
    7359                            .dwattr $C$DW$482, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    7360                            .dwattr $C$DW$482, DW_AT_accessibility(DW_ACCESS_public)
    7361                            .dwattr $C$DW$482, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    7362                            .dwattr $C$DW$482, DW_AT_decl_line(0x88)
    7363                            .dwattr $C$DW$482, DW_AT_decl_column(0x25)
    7364                    
    7365                            .dwattr $C$DW$T$62, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\
    7366                            .dwattr $C$DW$T$62, DW_AT_decl_line(0x75)
    7367                            .dwattr $C$DW$T$62, DW_AT_decl_column(0x01)
    7368                            .dwendtag $C$DW$T$62
    7369                    
    7370                    $C$DW$T$183     .dwtag  DW_TAG_typedef
    7371                            .dwattr $C$DW$T$183, DW_AT_name("HARD_API_T")
    7372                            .dwattr $C$DW$T$183, DW_AT_type(*$C$DW$T$62)
    7373                            .dwattr $C$DW$T$183, DW_AT_language(DW_LANG_C)
    7374                            .dwattr $C$DW$T$183, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices
    7375                            .dwattr $C$DW$T$183, DW_AT_decl_line(0x89)
    7376                            .dwattr $C$DW$T$183, DW_AT_decl_column(0x03)
    7377                    
    7378                    
    7379                    $C$DW$T$63      .dwtag  DW_TAG_structure_type
    7380                            .dwattr $C$DW$T$63, DW_AT_byte_size(0x08)
    7381                    $C$DW$483       .dwtag  DW_TAG_member
    7382                            .dwattr $C$DW$483, DW_AT_type(*$C$DW$T$10)
    7383                            .dwattr $C$DW$483, DW_AT_name("quot")
    7384                            .dwattr $C$DW$483, DW_AT_TI_symbol_name("quot")
    7385                            .dwattr $C$DW$483, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7386                            .dwattr $C$DW$483, DW_AT_accessibility(DW_ACCESS_public)
    7387                            .dwattr $C$DW$483, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/s
    7388                            .dwattr $C$DW$483, DW_AT_decl_line(0x5c)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:28 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{041DAC52-8C43-4717-A6A0-6073B5E74BD6} PAGE  136

    7389                            .dwattr $C$DW$483, DW_AT_decl_column(0x16)
    7390                    
    7391                    $C$DW$484       .dwtag  DW_TAG_member
    7392                            .dwattr $C$DW$484, DW_AT_type(*$C$DW$T$10)
    7393                            .dwattr $C$DW$484, DW_AT_name("rem")
    7394                            .dwattr $C$DW$484, DW_AT_TI_symbol_name("rem")
    7395                            .dwattr $C$DW$484, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7396                            .dwattr $C$DW$484, DW_AT_accessibility(DW_ACCESS_public)
    7397                            .dwattr $C$DW$484, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/s
    7398                            .dwattr $C$DW$484, DW_AT_decl_line(0x5c)
    7399                            .dwattr $C$DW$484, DW_AT_decl_column(0x1c)
    7400                    
    7401                            .dwattr $C$DW$T$63, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/
    7402                            .dwattr $C$DW$T$63, DW_AT_decl_line(0x5c)
    7403                            .dwattr $C$DW$T$63, DW_AT_decl_column(0x10)
    7404                            .dwendtag $C$DW$T$63
    7405                    
    7406                    $C$DW$T$184     .dwtag  DW_TAG_typedef
    7407                            .dwattr $C$DW$T$184, DW_AT_name("div_t")
    7408                            .dwattr $C$DW$T$184, DW_AT_type(*$C$DW$T$63)
    7409                            .dwattr $C$DW$T$184, DW_AT_language(DW_LANG_C)
    7410                            .dwattr $C$DW$T$184, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include
    7411                            .dwattr $C$DW$T$184, DW_AT_decl_line(0x5c)
    7412                            .dwattr $C$DW$T$184, DW_AT_decl_column(0x23)
    7413                    
    7414                    
    7415                    $C$DW$T$64      .dwtag  DW_TAG_structure_type
    7416                            .dwattr $C$DW$T$64, DW_AT_byte_size(0x08)
    7417                    $C$DW$485       .dwtag  DW_TAG_member
    7418                            .dwattr $C$DW$485, DW_AT_type(*$C$DW$T$10)
    7419                            .dwattr $C$DW$485, DW_AT_name("quot")
    7420                            .dwattr $C$DW$485, DW_AT_TI_symbol_name("quot")
    7421                            .dwattr $C$DW$485, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7422                            .dwattr $C$DW$485, DW_AT_accessibility(DW_ACCESS_public)
    7423                            .dwattr $C$DW$485, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/s
    7424                            .dwattr $C$DW$485, DW_AT_decl_line(0x5e)
    7425                            .dwattr $C$DW$485, DW_AT_decl_column(0x16)
    7426                    
    7427                    $C$DW$486       .dwtag  DW_TAG_member
    7428                            .dwattr $C$DW$486, DW_AT_type(*$C$DW$T$10)
    7429                            .dwattr $C$DW$486, DW_AT_name("rem")
    7430                            .dwattr $C$DW$486, DW_AT_TI_symbol_name("rem")
    7431                            .dwattr $C$DW$486, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7432                            .dwattr $C$DW$486, DW_AT_accessibility(DW_ACCESS_public)
    7433                            .dwattr $C$DW$486, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/s
    7434                            .dwattr $C$DW$486, DW_AT_decl_line(0x5e)
    7435                            .dwattr $C$DW$486, DW_AT_decl_column(0x1c)
    7436                    
    7437                            .dwattr $C$DW$T$64, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/
    7438                            .dwattr $C$DW$T$64, DW_AT_decl_line(0x5e)
    7439                            .dwattr $C$DW$T$64, DW_AT_decl_column(0x10)
    7440                            .dwendtag $C$DW$T$64
    7441                    
    7442                    $C$DW$T$185     .dwtag  DW_TAG_typedef
    7443                            .dwattr $C$DW$T$185, DW_AT_name("ldiv_t")
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:28 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{041DAC52-8C43-4717-A6A0-6073B5E74BD6} PAGE  137

    7444                            .dwattr $C$DW$T$185, DW_AT_type(*$C$DW$T$64)
    7445                            .dwattr $C$DW$T$185, DW_AT_language(DW_LANG_C)
    7446                            .dwattr $C$DW$T$185, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include
    7447                            .dwattr $C$DW$T$185, DW_AT_decl_line(0x5e)
    7448                            .dwattr $C$DW$T$185, DW_AT_decl_column(0x23)
    7449                    
    7450                    
    7451                    $C$DW$T$65      .dwtag  DW_TAG_structure_type
    7452                            .dwattr $C$DW$T$65, DW_AT_byte_size(0x10)
    7453                    $C$DW$487       .dwtag  DW_TAG_member
    7454                            .dwattr $C$DW$487, DW_AT_type(*$C$DW$T$14)
    7455                            .dwattr $C$DW$487, DW_AT_name("quot")
    7456                            .dwattr $C$DW$487, DW_AT_TI_symbol_name("quot")
    7457                            .dwattr $C$DW$487, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7458                            .dwattr $C$DW$487, DW_AT_accessibility(DW_ACCESS_public)
    7459                            .dwattr $C$DW$487, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/s
    7460                            .dwattr $C$DW$487, DW_AT_decl_line(0x61)
    7461                            .dwattr $C$DW$487, DW_AT_decl_column(0x1c)
    7462                    
    7463                    $C$DW$488       .dwtag  DW_TAG_member
    7464                            .dwattr $C$DW$488, DW_AT_type(*$C$DW$T$14)
    7465                            .dwattr $C$DW$488, DW_AT_name("rem")
    7466                            .dwattr $C$DW$488, DW_AT_TI_symbol_name("rem")
    7467                            .dwattr $C$DW$488, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7468                            .dwattr $C$DW$488, DW_AT_accessibility(DW_ACCESS_public)
    7469                            .dwattr $C$DW$488, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/s
    7470                            .dwattr $C$DW$488, DW_AT_decl_line(0x61)
    7471                            .dwattr $C$DW$488, DW_AT_decl_column(0x22)
    7472                    
    7473                            .dwattr $C$DW$T$65, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/
    7474                            .dwattr $C$DW$T$65, DW_AT_decl_line(0x61)
    7475                            .dwattr $C$DW$T$65, DW_AT_decl_column(0x10)
    7476                            .dwendtag $C$DW$T$65
    7477                    
    7478                    $C$DW$T$186     .dwtag  DW_TAG_typedef
    7479                            .dwattr $C$DW$T$186, DW_AT_name("lldiv_t")
    7480                            .dwattr $C$DW$T$186, DW_AT_type(*$C$DW$T$65)
    7481                            .dwattr $C$DW$T$186, DW_AT_language(DW_LANG_C)
    7482                            .dwattr $C$DW$T$186, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include
    7483                            .dwattr $C$DW$T$186, DW_AT_decl_line(0x61)
    7484                            .dwattr $C$DW$T$186, DW_AT_decl_column(0x29)
    7485                    
    7486                    
    7487                    $C$DW$T$69      .dwtag  DW_TAG_structure_type
    7488                            .dwattr $C$DW$T$69, DW_AT_byte_size(0x08)
    7489                    $C$DW$489       .dwtag  DW_TAG_member
    7490                            .dwattr $C$DW$489, DW_AT_type(*$C$DW$T$67)
    7491                            .dwattr $C$DW$489, DW_AT_name("pointerStack")
    7492                            .dwattr $C$DW$489, DW_AT_TI_symbol_name("pointerStack")
    7493                            .dwattr $C$DW$489, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7494                            .dwattr $C$DW$489, DW_AT_accessibility(DW_ACCESS_public)
    7495                            .dwattr $C$DW$489, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    7496                            .dwattr $C$DW$489, DW_AT_decl_line(0x3f5)
    7497                            .dwattr $C$DW$489, DW_AT_decl_column(0x16)
    7498                    
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:28 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{041DAC52-8C43-4717-A6A0-6073B5E74BD6} PAGE  138

    7499                    $C$DW$490       .dwtag  DW_TAG_member
    7500                            .dwattr $C$DW$490, DW_AT_type(*$C$DW$T$68)
    7501                            .dwattr $C$DW$490, DW_AT_name("directAPI")
    7502                            .dwattr $C$DW$490, DW_AT_TI_symbol_name("directAPI")
    7503                            .dwattr $C$DW$490, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7504                            .dwattr $C$DW$490, DW_AT_accessibility(DW_ACCESS_public)
    7505                            .dwattr $C$DW$490, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    7506                            .dwattr $C$DW$490, DW_AT_decl_line(0x3f6)
    7507                            .dwattr $C$DW$490, DW_AT_decl_column(0x15)
    7508                    
    7509                            .dwattr $C$DW$T$69, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154sta
    7510                            .dwattr $C$DW$T$69, DW_AT_decl_line(0x3f4)
    7511                            .dwattr $C$DW$T$69, DW_AT_decl_column(0x01)
    7512                            .dwendtag $C$DW$T$69
    7513                    
    7514                    $C$DW$T$71      .dwtag  DW_TAG_typedef
    7515                            .dwattr $C$DW$T$71, DW_AT_name("icall_directAPIMsg_t")
    7516                            .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$69)
    7517                            .dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
    7518                            .dwattr $C$DW$T$71, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154sta
    7519                            .dwattr $C$DW$T$71, DW_AT_decl_line(0x3f7)
    7520                            .dwattr $C$DW$T$71, DW_AT_decl_column(0x03)
    7521                    
    7522                    
    7523                    $C$DW$T$72      .dwtag  DW_TAG_structure_type
    7524                            .dwattr $C$DW$T$72, DW_AT_byte_size(0x14)
    7525                    $C$DW$491       .dwtag  DW_TAG_member
    7526                            .dwattr $C$DW$491, DW_AT_type(*$C$DW$T$70)
    7527                            .dwattr $C$DW$491, DW_AT_name("hdr")
    7528                            .dwattr $C$DW$491, DW_AT_TI_symbol_name("hdr")
    7529                            .dwattr $C$DW$491, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7530                            .dwattr $C$DW$491, DW_AT_accessibility(DW_ACCESS_public)
    7531                            .dwattr $C$DW$491, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    7532                            .dwattr $C$DW$491, DW_AT_decl_line(0x3fb)
    7533                            .dwattr $C$DW$491, DW_AT_decl_column(0x10)
    7534                    
    7535                    $C$DW$492       .dwtag  DW_TAG_member
    7536                            .dwattr $C$DW$492, DW_AT_type(*$C$DW$T$71)
    7537                            .dwattr $C$DW$492, DW_AT_name("msg")
    7538                            .dwattr $C$DW$492, DW_AT_TI_symbol_name("msg")
    7539                            .dwattr $C$DW$492, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7540                            .dwattr $C$DW$492, DW_AT_accessibility(DW_ACCESS_public)
    7541                            .dwattr $C$DW$492, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    7542                            .dwattr $C$DW$492, DW_AT_decl_line(0x3fc)
    7543                            .dwattr $C$DW$492, DW_AT_decl_column(0x1a)
    7544                    
    7545                            .dwattr $C$DW$T$72, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154sta
    7546                            .dwattr $C$DW$T$72, DW_AT_decl_line(0x3fa)
    7547                            .dwattr $C$DW$T$72, DW_AT_decl_column(0x01)
    7548                            .dwendtag $C$DW$T$72
    7549                    
    7550                    $C$DW$T$187     .dwtag  DW_TAG_typedef
    7551                            .dwattr $C$DW$T$187, DW_AT_name("icallLiteMsg_t")
    7552                            .dwattr $C$DW$T$187, DW_AT_type(*$C$DW$T$72)
    7553                            .dwattr $C$DW$T$187, DW_AT_language(DW_LANG_C)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:28 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{041DAC52-8C43-4717-A6A0-6073B5E74BD6} PAGE  139

    7554                            .dwattr $C$DW$T$187, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154st
    7555                            .dwattr $C$DW$T$187, DW_AT_decl_line(0x3fd)
    7556                            .dwattr $C$DW$T$187, DW_AT_decl_column(0x03)
    7557                    
    7558                    
    7559                    $C$DW$T$74      .dwtag  DW_TAG_structure_type
    7560                            .dwattr $C$DW$T$74, DW_AT_byte_size(0x02)
    7561                    $C$DW$493       .dwtag  DW_TAG_member
    7562                            .dwattr $C$DW$493, DW_AT_type(*$C$DW$T$73)
    7563                            .dwattr $C$DW$493, DW_AT_name("pwrmgr_task_state")
    7564                            .dwattr $C$DW$493, DW_AT_TI_symbol_name("pwrmgr_task_state")
    7565                            .dwattr $C$DW$493, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7566                            .dwattr $C$DW$493, DW_AT_accessibility(DW_ACCESS_public)
    7567                            .dwattr $C$DW$493, DW_AT_decl_file("..\Application\MAC\OSAL\osal_pwrmgr.h")
    7568                            .dwattr $C$DW$493, DW_AT_decl_line(0x48)
    7569                            .dwattr $C$DW$493, DW_AT_decl_column(0x0a)
    7570                    
    7571                            .dwattr $C$DW$T$74, DW_AT_decl_file("..\Application\MAC\OSAL\osal_pwrmgr.h")
    7572                            .dwattr $C$DW$T$74, DW_AT_decl_line(0x47)
    7573                            .dwattr $C$DW$T$74, DW_AT_decl_column(0x01)
    7574                            .dwendtag $C$DW$T$74
    7575                    
    7576                    $C$DW$T$188     .dwtag  DW_TAG_typedef
    7577                            .dwattr $C$DW$T$188, DW_AT_name("pwrmgr_attribute_t")
    7578                            .dwattr $C$DW$T$188, DW_AT_type(*$C$DW$T$74)
    7579                            .dwattr $C$DW$T$188, DW_AT_language(DW_LANG_C)
    7580                            .dwattr $C$DW$T$188, DW_AT_decl_file("..\Application\MAC\OSAL\osal_pwrmgr.h")
    7581                            .dwattr $C$DW$T$188, DW_AT_decl_line(0x4e)
    7582                            .dwattr $C$DW$T$188, DW_AT_decl_column(0x03)
    7583                    
    7584                    
    7585                    $C$DW$T$75      .dwtag  DW_TAG_structure_type
    7586                            .dwattr $C$DW$T$75, DW_AT_byte_size(0x08)
    7587                    $C$DW$494       .dwtag  DW_TAG_member
    7588                            .dwattr $C$DW$494, DW_AT_type(*$C$DW$T$19)
    7589                            .dwattr $C$DW$494, DW_AT_name("seconds")
    7590                            .dwattr $C$DW$494, DW_AT_TI_symbol_name("seconds")
    7591                            .dwattr $C$DW$494, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7592                            .dwattr $C$DW$494, DW_AT_accessibility(DW_ACCESS_public)
    7593                            .dwattr $C$DW$494, DW_AT_decl_file("..\Application\MAC\OSAL\osal_clock.h")
    7594                            .dwattr $C$DW$494, DW_AT_decl_line(0x50)
    7595                            .dwattr $C$DW$494, DW_AT_decl_column(0x09)
    7596                    
    7597                    $C$DW$495       .dwtag  DW_TAG_member
    7598                            .dwattr $C$DW$495, DW_AT_type(*$C$DW$T$19)
    7599                            .dwattr $C$DW$495, DW_AT_name("minutes")
    7600                            .dwattr $C$DW$495, DW_AT_TI_symbol_name("minutes")
    7601                            .dwattr $C$DW$495, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7602                            .dwattr $C$DW$495, DW_AT_accessibility(DW_ACCESS_public)
    7603                            .dwattr $C$DW$495, DW_AT_decl_file("..\Application\MAC\OSAL\osal_clock.h")
    7604                            .dwattr $C$DW$495, DW_AT_decl_line(0x51)
    7605                            .dwattr $C$DW$495, DW_AT_decl_column(0x09)
    7606                    
    7607                    $C$DW$496       .dwtag  DW_TAG_member
    7608                            .dwattr $C$DW$496, DW_AT_type(*$C$DW$T$19)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:28 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{041DAC52-8C43-4717-A6A0-6073B5E74BD6} PAGE  140

    7609                            .dwattr $C$DW$496, DW_AT_name("hour")
    7610                            .dwattr $C$DW$496, DW_AT_TI_symbol_name("hour")
    7611                            .dwattr $C$DW$496, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7612                            .dwattr $C$DW$496, DW_AT_accessibility(DW_ACCESS_public)
    7613                            .dwattr $C$DW$496, DW_AT_decl_file("..\Application\MAC\OSAL\osal_clock.h")
    7614                            .dwattr $C$DW$496, DW_AT_decl_line(0x52)
    7615                            .dwattr $C$DW$496, DW_AT_decl_column(0x09)
    7616                    
    7617                    $C$DW$497       .dwtag  DW_TAG_member
    7618                            .dwattr $C$DW$497, DW_AT_type(*$C$DW$T$19)
    7619                            .dwattr $C$DW$497, DW_AT_name("day")
    7620                            .dwattr $C$DW$497, DW_AT_TI_symbol_name("day")
    7621                            .dwattr $C$DW$497, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    7622                            .dwattr $C$DW$497, DW_AT_accessibility(DW_ACCESS_public)
    7623                            .dwattr $C$DW$497, DW_AT_decl_file("..\Application\MAC\OSAL\osal_clock.h")
    7624                            .dwattr $C$DW$497, DW_AT_decl_line(0x53)
    7625                            .dwattr $C$DW$497, DW_AT_decl_column(0x09)
    7626                    
    7627                    $C$DW$498       .dwtag  DW_TAG_member
    7628                            .dwattr $C$DW$498, DW_AT_type(*$C$DW$T$19)
    7629                            .dwattr $C$DW$498, DW_AT_name("month")
    7630                            .dwattr $C$DW$498, DW_AT_TI_symbol_name("month")
    7631                            .dwattr $C$DW$498, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7632                            .dwattr $C$DW$498, DW_AT_accessibility(DW_ACCESS_public)
    7633                            .dwattr $C$DW$498, DW_AT_decl_file("..\Application\MAC\OSAL\osal_clock.h")
    7634                            .dwattr $C$DW$498, DW_AT_decl_line(0x54)
    7635                            .dwattr $C$DW$498, DW_AT_decl_column(0x09)
    7636                    
    7637                    $C$DW$499       .dwtag  DW_TAG_member
    7638                            .dwattr $C$DW$499, DW_AT_type(*$C$DW$T$73)
    7639                            .dwattr $C$DW$499, DW_AT_name("year")
    7640                            .dwattr $C$DW$499, DW_AT_TI_symbol_name("year")
    7641                            .dwattr $C$DW$499, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7642                            .dwattr $C$DW$499, DW_AT_accessibility(DW_ACCESS_public)
    7643                            .dwattr $C$DW$499, DW_AT_decl_file("..\Application\MAC\OSAL\osal_clock.h")
    7644                            .dwattr $C$DW$499, DW_AT_decl_line(0x55)
    7645                            .dwattr $C$DW$499, DW_AT_decl_column(0x0a)
    7646                    
    7647                            .dwattr $C$DW$T$75, DW_AT_decl_file("..\Application\MAC\OSAL\osal_clock.h")
    7648                            .dwattr $C$DW$T$75, DW_AT_decl_line(0x4f)
    7649                            .dwattr $C$DW$T$75, DW_AT_decl_column(0x01)
    7650                            .dwendtag $C$DW$T$75
    7651                    
    7652                    $C$DW$T$189     .dwtag  DW_TAG_typedef
    7653                            .dwattr $C$DW$T$189, DW_AT_name("UTCTimeStruct")
    7654                            .dwattr $C$DW$T$189, DW_AT_type(*$C$DW$T$75)
    7655                            .dwattr $C$DW$T$189, DW_AT_language(DW_LANG_C)
    7656                            .dwattr $C$DW$T$189, DW_AT_decl_file("..\Application\MAC\OSAL\osal_clock.h")
    7657                            .dwattr $C$DW$T$189, DW_AT_decl_line(0x56)
    7658                            .dwattr $C$DW$T$189, DW_AT_decl_column(0x03)
    7659                    
    7660                    
    7661                    $C$DW$T$78      .dwtag  DW_TAG_structure_type
    7662                            .dwattr $C$DW$T$78, DW_AT_byte_size(0x0c)
    7663                    $C$DW$500       .dwtag  DW_TAG_member
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:28 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{041DAC52-8C43-4717-A6A0-6073B5E74BD6} PAGE  141

    7664                            .dwattr $C$DW$500, DW_AT_type(*$C$DW$T$76)
    7665                            .dwattr $C$DW$500, DW_AT_name("bufferHead")
    7666                            .dwattr $C$DW$500, DW_AT_TI_symbol_name("bufferHead")
    7667                            .dwattr $C$DW$500, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7668                            .dwattr $C$DW$500, DW_AT_accessibility(DW_ACCESS_public)
    7669                            .dwattr $C$DW$500, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    7670                            .dwattr $C$DW$500, DW_AT_decl_line(0x80)
    7671                            .dwattr $C$DW$500, DW_AT_decl_column(0x13)
    7672                    
    7673                    $C$DW$501       .dwtag  DW_TAG_member
    7674                            .dwattr $C$DW$501, DW_AT_type(*$C$DW$T$76)
    7675                            .dwattr $C$DW$501, DW_AT_name("bufferTail")
    7676                            .dwattr $C$DW$501, DW_AT_TI_symbol_name("bufferTail")
    7677                            .dwattr $C$DW$501, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7678                            .dwattr $C$DW$501, DW_AT_accessibility(DW_ACCESS_public)
    7679                            .dwattr $C$DW$501, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    7680                            .dwattr $C$DW$501, DW_AT_decl_line(0x81)
    7681                            .dwattr $C$DW$501, DW_AT_decl_column(0x13)
    7682                    
    7683                    $C$DW$502       .dwtag  DW_TAG_member
    7684                            .dwattr $C$DW$502, DW_AT_type(*$C$DW$T$73)
    7685                            .dwattr $C$DW$502, DW_AT_name("maxBufSize")
    7686                            .dwattr $C$DW$502, DW_AT_TI_symbol_name("maxBufSize")
    7687                            .dwattr $C$DW$502, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7688                            .dwattr $C$DW$502, DW_AT_accessibility(DW_ACCESS_public)
    7689                            .dwattr $C$DW$502, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    7690                            .dwattr $C$DW$502, DW_AT_decl_line(0x82)
    7691                            .dwattr $C$DW$502, DW_AT_decl_column(0x0a)
    7692                    
    7693                    $C$DW$503       .dwtag  DW_TAG_member
    7694                            .dwattr $C$DW$503, DW_AT_type(*$C$DW$T$77)
    7695                            .dwattr $C$DW$503, DW_AT_name("pBuffer")
    7696                            .dwattr $C$DW$503, DW_AT_TI_symbol_name("pBuffer")
    7697                            .dwattr $C$DW$503, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7698                            .dwattr $C$DW$503, DW_AT_accessibility(DW_ACCESS_public)
    7699                            .dwattr $C$DW$503, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    7700                            .dwattr $C$DW$503, DW_AT_decl_line(0x83)
    7701                            .dwattr $C$DW$503, DW_AT_decl_column(0x0a)
    7702                    
    7703                            .dwattr $C$DW$T$78, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154sta
    7704                            .dwattr $C$DW$T$78, DW_AT_decl_line(0x7e)
    7705                            .dwattr $C$DW$T$78, DW_AT_decl_column(0x01)
    7706                            .dwendtag $C$DW$T$78
    7707                    
    7708                    $C$DW$T$80      .dwtag  DW_TAG_typedef
    7709                            .dwattr $C$DW$T$80, DW_AT_name("halUARTBufControl_t")
    7710                            .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$78)
    7711                            .dwattr $C$DW$T$80, DW_AT_language(DW_LANG_C)
    7712                            .dwattr $C$DW$T$80, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154sta
    7713                            .dwattr $C$DW$T$80, DW_AT_decl_line(0x84)
    7714                            .dwattr $C$DW$T$80, DW_AT_decl_column(0x03)
    7715                    
    7716                    
    7717                    $C$DW$T$85      .dwtag  DW_TAG_structure_type
    7718                            .dwattr $C$DW$T$85, DW_AT_byte_size(0x2c)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:28 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{041DAC52-8C43-4717-A6A0-6073B5E74BD6} PAGE  142

    7719                    $C$DW$504       .dwtag  DW_TAG_member
    7720                            .dwattr $C$DW$504, DW_AT_type(*$C$DW$T$79)
    7721                            .dwattr $C$DW$504, DW_AT_name("configured")
    7722                            .dwattr $C$DW$504, DW_AT_TI_symbol_name("configured")
    7723                            .dwattr $C$DW$504, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7724                            .dwattr $C$DW$504, DW_AT_accessibility(DW_ACCESS_public)
    7725                            .dwattr $C$DW$504, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    7726                            .dwattr $C$DW$504, DW_AT_decl_line(0x88)
    7727                            .dwattr $C$DW$504, DW_AT_decl_column(0x17)
    7728                    
    7729                    $C$DW$505       .dwtag  DW_TAG_member
    7730                            .dwattr $C$DW$505, DW_AT_type(*$C$DW$T$19)
    7731                            .dwattr $C$DW$505, DW_AT_name("baudRate")
    7732                            .dwattr $C$DW$505, DW_AT_TI_symbol_name("baudRate")
    7733                            .dwattr $C$DW$505, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7734                            .dwattr $C$DW$505, DW_AT_accessibility(DW_ACCESS_public)
    7735                            .dwattr $C$DW$505, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    7736                            .dwattr $C$DW$505, DW_AT_decl_line(0x89)
    7737                            .dwattr $C$DW$505, DW_AT_decl_column(0x17)
    7738                    
    7739                    $C$DW$506       .dwtag  DW_TAG_member
    7740                            .dwattr $C$DW$506, DW_AT_type(*$C$DW$T$79)
    7741                            .dwattr $C$DW$506, DW_AT_name("flowControl")
    7742                            .dwattr $C$DW$506, DW_AT_TI_symbol_name("flowControl")
    7743                            .dwattr $C$DW$506, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7744                            .dwattr $C$DW$506, DW_AT_accessibility(DW_ACCESS_public)
    7745                            .dwattr $C$DW$506, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    7746                            .dwattr $C$DW$506, DW_AT_decl_line(0x8a)
    7747                            .dwattr $C$DW$506, DW_AT_decl_column(0x17)
    7748                    
    7749                    $C$DW$507       .dwtag  DW_TAG_member
    7750                            .dwattr $C$DW$507, DW_AT_type(*$C$DW$T$73)
    7751                            .dwattr $C$DW$507, DW_AT_name("flowControlThreshold")
    7752                            .dwattr $C$DW$507, DW_AT_TI_symbol_name("flowControlThreshold")
    7753                            .dwattr $C$DW$507, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7754                            .dwattr $C$DW$507, DW_AT_accessibility(DW_ACCESS_public)
    7755                            .dwattr $C$DW$507, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    7756                            .dwattr $C$DW$507, DW_AT_decl_line(0x8b)
    7757                            .dwattr $C$DW$507, DW_AT_decl_column(0x17)
    7758                    
    7759                    $C$DW$508       .dwtag  DW_TAG_member
    7760                            .dwattr $C$DW$508, DW_AT_type(*$C$DW$T$19)
    7761                            .dwattr $C$DW$508, DW_AT_name("idleTimeout")
    7762                            .dwattr $C$DW$508, DW_AT_TI_symbol_name("idleTimeout")
    7763                            .dwattr $C$DW$508, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7764                            .dwattr $C$DW$508, DW_AT_accessibility(DW_ACCESS_public)
    7765                            .dwattr $C$DW$508, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    7766                            .dwattr $C$DW$508, DW_AT_decl_line(0x8c)
    7767                            .dwattr $C$DW$508, DW_AT_decl_column(0x17)
    7768                    
    7769                    $C$DW$509       .dwtag  DW_TAG_member
    7770                            .dwattr $C$DW$509, DW_AT_type(*$C$DW$T$80)
    7771                            .dwattr $C$DW$509, DW_AT_name("rx")
    7772                            .dwattr $C$DW$509, DW_AT_TI_symbol_name("rx")
    7773                            .dwattr $C$DW$509, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:28 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{041DAC52-8C43-4717-A6A0-6073B5E74BD6} PAGE  143

    7774                            .dwattr $C$DW$509, DW_AT_accessibility(DW_ACCESS_public)
    7775                            .dwattr $C$DW$509, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    7776                            .dwattr $C$DW$509, DW_AT_decl_line(0x8d)
    7777                            .dwattr $C$DW$509, DW_AT_decl_column(0x17)
    7778                    
    7779                    $C$DW$510       .dwtag  DW_TAG_member
    7780                            .dwattr $C$DW$510, DW_AT_type(*$C$DW$T$80)
    7781                            .dwattr $C$DW$510, DW_AT_name("tx")
    7782                            .dwattr $C$DW$510, DW_AT_TI_symbol_name("tx")
    7783                            .dwattr $C$DW$510, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    7784                            .dwattr $C$DW$510, DW_AT_accessibility(DW_ACCESS_public)
    7785                            .dwattr $C$DW$510, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    7786                            .dwattr $C$DW$510, DW_AT_decl_line(0x8e)
    7787                            .dwattr $C$DW$510, DW_AT_decl_column(0x17)
    7788                    
    7789                    $C$DW$511       .dwtag  DW_TAG_member
    7790                            .dwattr $C$DW$511, DW_AT_type(*$C$DW$T$79)
    7791                            .dwattr $C$DW$511, DW_AT_name("intEnable")
    7792                            .dwattr $C$DW$511, DW_AT_TI_symbol_name("intEnable")
    7793                            .dwattr $C$DW$511, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    7794                            .dwattr $C$DW$511, DW_AT_accessibility(DW_ACCESS_public)
    7795                            .dwattr $C$DW$511, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    7796                            .dwattr $C$DW$511, DW_AT_decl_line(0x8f)
    7797                            .dwattr $C$DW$511, DW_AT_decl_column(0x17)
    7798                    
    7799                    $C$DW$512       .dwtag  DW_TAG_member
    7800                            .dwattr $C$DW$512, DW_AT_type(*$C$DW$T$81)
    7801                            .dwattr $C$DW$512, DW_AT_name("rxChRvdTime")
    7802                            .dwattr $C$DW$512, DW_AT_TI_symbol_name("rxChRvdTime")
    7803                            .dwattr $C$DW$512, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    7804                            .dwattr $C$DW$512, DW_AT_accessibility(DW_ACCESS_public)
    7805                            .dwattr $C$DW$512, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    7806                            .dwattr $C$DW$512, DW_AT_decl_line(0x90)
    7807                            .dwattr $C$DW$512, DW_AT_decl_column(0x17)
    7808                    
    7809                    $C$DW$513       .dwtag  DW_TAG_member
    7810                            .dwattr $C$DW$513, DW_AT_type(*$C$DW$T$84)
    7811                            .dwattr $C$DW$513, DW_AT_name("callBackFunc")
    7812                            .dwattr $C$DW$513, DW_AT_TI_symbol_name("callBackFunc")
    7813                            .dwattr $C$DW$513, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    7814                            .dwattr $C$DW$513, DW_AT_accessibility(DW_ACCESS_public)
    7815                            .dwattr $C$DW$513, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    7816                            .dwattr $C$DW$513, DW_AT_decl_line(0x91)
    7817                            .dwattr $C$DW$513, DW_AT_decl_column(0x17)
    7818                    
    7819                            .dwattr $C$DW$T$85, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154sta
    7820                            .dwattr $C$DW$T$85, DW_AT_decl_line(0x87)
    7821                            .dwattr $C$DW$T$85, DW_AT_decl_column(0x01)
    7822                            .dwendtag $C$DW$T$85
    7823                    
    7824                    $C$DW$T$190     .dwtag  DW_TAG_typedef
    7825                            .dwattr $C$DW$T$190, DW_AT_name("halUARTCfg_t")
    7826                            .dwattr $C$DW$T$190, DW_AT_type(*$C$DW$T$85)
    7827                            .dwattr $C$DW$T$190, DW_AT_language(DW_LANG_C)
    7828                            .dwattr $C$DW$T$190, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154st
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:28 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{041DAC52-8C43-4717-A6A0-6073B5E74BD6} PAGE  144

    7829                            .dwattr $C$DW$T$190, DW_AT_decl_line(0x92)
    7830                            .dwattr $C$DW$T$190, DW_AT_decl_column(0x02)
    7831                    
    7832                    
    7833                    $C$DW$T$87      .dwtag  DW_TAG_structure_type
    7834                            .dwattr $C$DW$T$87, DW_AT_byte_size(0x04)
    7835                    $C$DW$514       .dwtag  DW_TAG_member
    7836                            .dwattr $C$DW$514, DW_AT_type(*$C$DW$T$86)
    7837                            .dwattr $C$DW$514, DW_AT_name("hdr")
    7838                            .dwattr $C$DW$514, DW_AT_TI_symbol_name("hdr")
    7839                            .dwattr $C$DW$514, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7840                            .dwattr $C$DW$514, DW_AT_accessibility(DW_ACCESS_public)
    7841                            .dwattr $C$DW$514, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/examples/rtos/CC131
    7842                            .dwattr $C$DW$514, DW_AT_decl_line(0xbc)
    7843                            .dwattr $C$DW$514, DW_AT_decl_column(0x14)
    7844                    
    7845                    $C$DW$515       .dwtag  DW_TAG_member
    7846                            .dwattr $C$DW$515, DW_AT_type(*$C$DW$T$19)
    7847                            .dwattr $C$DW$515, DW_AT_name("state")
    7848                            .dwattr $C$DW$515, DW_AT_TI_symbol_name("state")
    7849                            .dwattr $C$DW$515, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7850                            .dwattr $C$DW$515, DW_AT_accessibility(DW_ACCESS_public)
    7851                            .dwattr $C$DW$515, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/examples/rtos/CC131
    7852                            .dwattr $C$DW$515, DW_AT_decl_line(0xbd)
    7853                            .dwattr $C$DW$515, DW_AT_decl_column(0x09)
    7854                    
    7855                    $C$DW$516       .dwtag  DW_TAG_member
    7856                            .dwattr $C$DW$516, DW_AT_type(*$C$DW$T$19)
    7857                            .dwattr $C$DW$516, DW_AT_name("keys")
    7858                            .dwattr $C$DW$516, DW_AT_TI_symbol_name("keys")
    7859                            .dwattr $C$DW$516, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    7860                            .dwattr $C$DW$516, DW_AT_accessibility(DW_ACCESS_public)
    7861                            .dwattr $C$DW$516, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/examples/rtos/CC131
    7862                            .dwattr $C$DW$516, DW_AT_decl_line(0xbe)
    7863                            .dwattr $C$DW$516, DW_AT_decl_column(0x09)
    7864                    
    7865                            .dwattr $C$DW$T$87, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/examples/rtos/CC13
    7866                            .dwattr $C$DW$T$87, DW_AT_decl_line(0xbb)
    7867                            .dwattr $C$DW$T$87, DW_AT_decl_column(0x01)
    7868                            .dwendtag $C$DW$T$87
    7869                    
    7870                    $C$DW$T$191     .dwtag  DW_TAG_typedef
    7871                            .dwattr $C$DW$T$191, DW_AT_name("keyChange_t")
    7872                            .dwattr $C$DW$T$191, DW_AT_type(*$C$DW$T$87)
    7873                            .dwattr $C$DW$T$191, DW_AT_language(DW_LANG_C)
    7874                            .dwattr $C$DW$T$191, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/examples/rtos/CC1
    7875                            .dwattr $C$DW$T$191, DW_AT_decl_line(0xbf)
    7876                            .dwattr $C$DW$T$191, DW_AT_decl_column(0x03)
    7877                    
    7878                    
    7879                    $C$DW$T$92      .dwtag  DW_TAG_union_type
    7880                            .dwattr $C$DW$T$92, DW_AT_byte_size(0x02)
    7881                    $C$DW$517       .dwtag  DW_TAG_member
    7882                            .dwattr $C$DW$517, DW_AT_type(*$C$DW$T$89)
    7883                            .dwattr $C$DW$517, DW_AT_name("entityId")
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:28 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{041DAC52-8C43-4717-A6A0-6073B5E74BD6} PAGE  145

    7884                            .dwattr $C$DW$517, DW_AT_TI_symbol_name("entityId")
    7885                            .dwattr $C$DW$517, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7886                            .dwattr $C$DW$517, DW_AT_accessibility(DW_ACCESS_public)
    7887                            .dwattr $C$DW$517, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    7888                            .dwattr $C$DW$517, DW_AT_decl_line(0x1fe)
    7889                            .dwattr $C$DW$517, DW_AT_decl_column(0x14)
    7890                    
    7891                    $C$DW$518       .dwtag  DW_TAG_member
    7892                            .dwattr $C$DW$518, DW_AT_type(*$C$DW$T$91)
    7893                            .dwattr $C$DW$518, DW_AT_name("servId")
    7894                            .dwattr $C$DW$518, DW_AT_TI_symbol_name("servId")
    7895                            .dwattr $C$DW$518, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7896                            .dwattr $C$DW$518, DW_AT_accessibility(DW_ACCESS_public)
    7897                            .dwattr $C$DW$518, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    7898                            .dwattr $C$DW$518, DW_AT_decl_line(0x200)
    7899                            .dwattr $C$DW$518, DW_AT_decl_column(0x17)
    7900                    
    7901                            .dwattr $C$DW$T$92, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154sta
    7902                            .dwattr $C$DW$T$92, DW_AT_decl_line(0x1fc)
    7903                            .dwattr $C$DW$T$92, DW_AT_decl_column(0x03)
    7904                            .dwendtag $C$DW$T$92
    7905                    
    7906                    
    7907                    $C$DW$T$93      .dwtag  DW_TAG_union_type
    7908                            .dwattr $C$DW$T$93, DW_AT_byte_size(0x02)
    7909                    $C$DW$519       .dwtag  DW_TAG_member
    7910                            .dwattr $C$DW$519, DW_AT_type(*$C$DW$T$91)
    7911                            .dwattr $C$DW$519, DW_AT_name("servId")
    7912                            .dwattr $C$DW$519, DW_AT_TI_symbol_name("servId")
    7913                            .dwattr $C$DW$519, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7914                            .dwattr $C$DW$519, DW_AT_accessibility(DW_ACCESS_public)
    7915                            .dwattr $C$DW$519, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    7916                            .dwattr $C$DW$519, DW_AT_decl_line(0x211)
    7917                            .dwattr $C$DW$519, DW_AT_decl_column(0x17)
    7918                    
    7919                    $C$DW$520       .dwtag  DW_TAG_member
    7920                            .dwattr $C$DW$520, DW_AT_type(*$C$DW$T$89)
    7921                            .dwattr $C$DW$520, DW_AT_name("entityId")
    7922                            .dwattr $C$DW$520, DW_AT_TI_symbol_name("entityId")
    7923                            .dwattr $C$DW$520, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7924                            .dwattr $C$DW$520, DW_AT_accessibility(DW_ACCESS_public)
    7925                            .dwattr $C$DW$520, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    7926                            .dwattr $C$DW$520, DW_AT_decl_line(0x213)
    7927                            .dwattr $C$DW$520, DW_AT_decl_column(0x14)
    7928                    
    7929                            .dwattr $C$DW$T$93, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154sta
    7930                            .dwattr $C$DW$T$93, DW_AT_decl_line(0x20f)
    7931                            .dwattr $C$DW$T$93, DW_AT_decl_column(0x03)
    7932                            .dwendtag $C$DW$T$93
    7933                    
    7934                    
    7935                    $C$DW$T$94      .dwtag  DW_TAG_union_type
    7936                            .dwattr $C$DW$T$94, DW_AT_byte_size(0x02)
    7937                    $C$DW$521       .dwtag  DW_TAG_member
    7938                            .dwattr $C$DW$521, DW_AT_type(*$C$DW$T$79)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:28 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{041DAC52-8C43-4717-A6A0-6073B5E74BD6} PAGE  146

    7939                            .dwattr $C$DW$521, DW_AT_name("paramCTS")
    7940                            .dwattr $C$DW$521, DW_AT_TI_symbol_name("paramCTS")
    7941                            .dwattr $C$DW$521, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7942                            .dwattr $C$DW$521, DW_AT_accessibility(DW_ACCESS_public)
    7943                            .dwattr $C$DW$521, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    7944                            .dwattr $C$DW$521, DW_AT_decl_line(0x96)
    7945                            .dwattr $C$DW$521, DW_AT_decl_column(0x08)
    7946                    
    7947                    $C$DW$522       .dwtag  DW_TAG_member
    7948                            .dwattr $C$DW$522, DW_AT_type(*$C$DW$T$79)
    7949                            .dwattr $C$DW$522, DW_AT_name("paramRTS")
    7950                            .dwattr $C$DW$522, DW_AT_TI_symbol_name("paramRTS")
    7951                            .dwattr $C$DW$522, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7952                            .dwattr $C$DW$522, DW_AT_accessibility(DW_ACCESS_public)
    7953                            .dwattr $C$DW$522, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    7954                            .dwattr $C$DW$522, DW_AT_decl_line(0x97)
    7955                            .dwattr $C$DW$522, DW_AT_decl_column(0x08)
    7956                    
    7957                    $C$DW$523       .dwtag  DW_TAG_member
    7958                            .dwattr $C$DW$523, DW_AT_type(*$C$DW$T$79)
    7959                            .dwattr $C$DW$523, DW_AT_name("paramDSR")
    7960                            .dwattr $C$DW$523, DW_AT_TI_symbol_name("paramDSR")
    7961                            .dwattr $C$DW$523, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7962                            .dwattr $C$DW$523, DW_AT_accessibility(DW_ACCESS_public)
    7963                            .dwattr $C$DW$523, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    7964                            .dwattr $C$DW$523, DW_AT_decl_line(0x98)
    7965                            .dwattr $C$DW$523, DW_AT_decl_column(0x08)
    7966                    
    7967                    $C$DW$524       .dwtag  DW_TAG_member
    7968                            .dwattr $C$DW$524, DW_AT_type(*$C$DW$T$79)
    7969                            .dwattr $C$DW$524, DW_AT_name("paramDTR")
    7970                            .dwattr $C$DW$524, DW_AT_TI_symbol_name("paramDTR")
    7971                            .dwattr $C$DW$524, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7972                            .dwattr $C$DW$524, DW_AT_accessibility(DW_ACCESS_public)
    7973                            .dwattr $C$DW$524, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    7974                            .dwattr $C$DW$524, DW_AT_decl_line(0x99)
    7975                            .dwattr $C$DW$524, DW_AT_decl_column(0x08)
    7976                    
    7977                    $C$DW$525       .dwtag  DW_TAG_member
    7978                            .dwattr $C$DW$525, DW_AT_type(*$C$DW$T$79)
    7979                            .dwattr $C$DW$525, DW_AT_name("paramCD")
    7980                            .dwattr $C$DW$525, DW_AT_TI_symbol_name("paramCD")
    7981                            .dwattr $C$DW$525, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7982                            .dwattr $C$DW$525, DW_AT_accessibility(DW_ACCESS_public)
    7983                            .dwattr $C$DW$525, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    7984                            .dwattr $C$DW$525, DW_AT_decl_line(0x9a)
    7985                            .dwattr $C$DW$525, DW_AT_decl_column(0x08)
    7986                    
    7987                    $C$DW$526       .dwtag  DW_TAG_member
    7988                            .dwattr $C$DW$526, DW_AT_type(*$C$DW$T$79)
    7989                            .dwattr $C$DW$526, DW_AT_name("paramRI")
    7990                            .dwattr $C$DW$526, DW_AT_TI_symbol_name("paramRI")
    7991                            .dwattr $C$DW$526, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7992                            .dwattr $C$DW$526, DW_AT_accessibility(DW_ACCESS_public)
    7993                            .dwattr $C$DW$526, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:28 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{041DAC52-8C43-4717-A6A0-6073B5E74BD6} PAGE  147

    7994                            .dwattr $C$DW$526, DW_AT_decl_line(0x9b)
    7995                            .dwattr $C$DW$526, DW_AT_decl_column(0x08)
    7996                    
    7997                    $C$DW$527       .dwtag  DW_TAG_member
    7998                            .dwattr $C$DW$527, DW_AT_type(*$C$DW$T$73)
    7999                            .dwattr $C$DW$527, DW_AT_name("baudRate")
    8000                            .dwattr $C$DW$527, DW_AT_TI_symbol_name("baudRate")
    8001                            .dwattr $C$DW$527, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8002                            .dwattr $C$DW$527, DW_AT_accessibility(DW_ACCESS_public)
    8003                            .dwattr $C$DW$527, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    8004                            .dwattr $C$DW$527, DW_AT_decl_line(0x9c)
    8005                            .dwattr $C$DW$527, DW_AT_decl_column(0x0a)
    8006                    
    8007                    $C$DW$528       .dwtag  DW_TAG_member
    8008                            .dwattr $C$DW$528, DW_AT_type(*$C$DW$T$79)
    8009                            .dwattr $C$DW$528, DW_AT_name("flowControl")
    8010                            .dwattr $C$DW$528, DW_AT_TI_symbol_name("flowControl")
    8011                            .dwattr $C$DW$528, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8012                            .dwattr $C$DW$528, DW_AT_accessibility(DW_ACCESS_public)
    8013                            .dwattr $C$DW$528, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    8014                            .dwattr $C$DW$528, DW_AT_decl_line(0x9d)
    8015                            .dwattr $C$DW$528, DW_AT_decl_column(0x08)
    8016                    
    8017                    $C$DW$529       .dwtag  DW_TAG_member
    8018                            .dwattr $C$DW$529, DW_AT_type(*$C$DW$T$79)
    8019                            .dwattr $C$DW$529, DW_AT_name("flushControl")
    8020                            .dwattr $C$DW$529, DW_AT_TI_symbol_name("flushControl")
    8021                            .dwattr $C$DW$529, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8022                            .dwattr $C$DW$529, DW_AT_accessibility(DW_ACCESS_public)
    8023                            .dwattr $C$DW$529, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    8024                            .dwattr $C$DW$529, DW_AT_decl_line(0x9e)
    8025                            .dwattr $C$DW$529, DW_AT_decl_column(0x08)
    8026                    
    8027                            .dwattr $C$DW$T$94, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154sta
    8028                            .dwattr $C$DW$T$94, DW_AT_decl_line(0x95)
    8029                            .dwattr $C$DW$T$94, DW_AT_decl_column(0x01)
    8030                            .dwendtag $C$DW$T$94
    8031                    
    8032                    $C$DW$T$192     .dwtag  DW_TAG_typedef
    8033                            .dwattr $C$DW$T$192, DW_AT_name("halUARTIoctl_t")
    8034                            .dwattr $C$DW$T$192, DW_AT_type(*$C$DW$T$94)
    8035                            .dwattr $C$DW$T$192, DW_AT_language(DW_LANG_C)
    8036                            .dwattr $C$DW$T$192, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154st
    8037                            .dwattr $C$DW$T$192, DW_AT_decl_line(0x9f)
    8038                            .dwattr $C$DW$T$192, DW_AT_decl_column(0x02)
    8039                    
    8040                    
    8041                    $C$DW$T$99      .dwtag  DW_TAG_structure_type
    8042                            .dwattr $C$DW$T$99, DW_AT_name(".ggroup1")
    8043                            .dwattr $C$DW$T$99, DW_AT_byte_size(0x2c)
    8044                    $C$DW$530       .dwtag  DW_TAG_member
    8045                            .dwattr $C$DW$530, DW_AT_type(*$C$DW$T$6)
    8046                            .dwattr $C$DW$530, DW_AT_name("activeTaskID")
    8047                            .dwattr $C$DW$530, DW_AT_TI_symbol_name("activeTaskID")
    8048                            .dwattr $C$DW$530, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:28 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{041DAC52-8C43-4717-A6A0-6073B5E74BD6} PAGE  148

    8049                            .dwattr $C$DW$530, DW_AT_accessibility(DW_ACCESS_public)
    8050                    
    8051                    $C$DW$531       .dwtag  DW_TAG_member
    8052                            .dwattr $C$DW$531, DW_AT_type(*$C$DW$T$6)
    8053                            .dwattr $C$DW$531, DW_AT_name("osal_notask_entity")
    8054                            .dwattr $C$DW$531, DW_AT_TI_symbol_name("osal_notask_entity")
    8055                            .dwattr $C$DW$531, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    8056                            .dwattr $C$DW$531, DW_AT_accessibility(DW_ACCESS_public)
    8057                    
    8058                    $C$DW$532       .dwtag  DW_TAG_member
    8059                            .dwattr $C$DW$532, DW_AT_type(*$C$DW$T$95)
    8060                            .dwattr $C$DW$532, DW_AT_name("osal_proxy_tasks")
    8061                            .dwattr $C$DW$532, DW_AT_TI_symbol_name("osal_proxy_tasks")
    8062                            .dwattr $C$DW$532, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8063                            .dwattr $C$DW$532, DW_AT_accessibility(DW_ACCESS_public)
    8064                    
    8065                    $C$DW$533       .dwtag  DW_TAG_member
    8066                            .dwattr $C$DW$533, DW_AT_type(*$C$DW$T$3)
    8067                            .dwattr $C$DW$533, DW_AT_name("osal_qHead")
    8068                            .dwattr $C$DW$533, DW_AT_TI_symbol_name("osal_qHead")
    8069                            .dwattr $C$DW$533, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8070                            .dwattr $C$DW$533, DW_AT_accessibility(DW_ACCESS_public)
    8071                    
    8072                    $C$DW$534       .dwtag  DW_TAG_member
    8073                            .dwattr $C$DW$534, DW_AT_type(*$C$DW$T$37)
    8074                            .dwattr $C$DW$534, DW_AT_name("osal_eventloop_hook")
    8075                            .dwattr $C$DW$534, DW_AT_TI_symbol_name("osal_eventloop_hook")
    8076                            .dwattr $C$DW$534, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8077                            .dwattr $C$DW$534, DW_AT_accessibility(DW_ACCESS_public)
    8078                    
    8079                    $C$DW$535       .dwtag  DW_TAG_member
    8080                            .dwattr $C$DW$535, DW_AT_type(*$C$DW$T$97)
    8081                            .dwattr $C$DW$535, DW_AT_name("osal_icallMsg_hook")
    8082                            .dwattr $C$DW$535, DW_AT_TI_symbol_name("osal_icallMsg_hook")
    8083                            .dwattr $C$DW$535, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    8084                            .dwattr $C$DW$535, DW_AT_accessibility(DW_ACCESS_public)
    8085                    
    8086                    $C$DW$536       .dwtag  DW_TAG_member
    8087                            .dwattr $C$DW$536, DW_AT_type(*$C$DW$T$3)
    8088                            .dwattr $C$DW$536, DW_AT_name("osal_semaphore")
    8089                            .dwattr $C$DW$536, DW_AT_TI_symbol_name("osal_semaphore")
    8090                            .dwattr $C$DW$536, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    8091                            .dwattr $C$DW$536, DW_AT_accessibility(DW_ACCESS_public)
    8092                    
    8093                    $C$DW$537       .dwtag  DW_TAG_member
    8094                            .dwattr $C$DW$537, DW_AT_type(*$C$DW$T$11)
    8095                            .dwattr $C$DW$537, DW_AT_name("osal_last_timestamp")
    8096                            .dwattr $C$DW$537, DW_AT_TI_symbol_name("osal_last_timestamp")
    8097                            .dwattr $C$DW$537, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    8098                            .dwattr $C$DW$537, DW_AT_accessibility(DW_ACCESS_public)
    8099                    
    8100                    $C$DW$538       .dwtag  DW_TAG_member
    8101                            .dwattr $C$DW$538, DW_AT_type(*$C$DW$T$11)
    8102                            .dwattr $C$DW$538, DW_AT_name("osal_tickperiod")
    8103                            .dwattr $C$DW$538, DW_AT_TI_symbol_name("osal_tickperiod")
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:28 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{041DAC52-8C43-4717-A6A0-6073B5E74BD6} PAGE  149

    8104                            .dwattr $C$DW$538, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    8105                            .dwattr $C$DW$538, DW_AT_accessibility(DW_ACCESS_public)
    8106                    
    8107                    $C$DW$539       .dwtag  DW_TAG_member
    8108                            .dwattr $C$DW$539, DW_AT_type(*$C$DW$T$11)
    8109                            .dwattr $C$DW$539, DW_AT_name("osal_max_msecs")
    8110                            .dwattr $C$DW$539, DW_AT_TI_symbol_name("osal_max_msecs")
    8111                            .dwattr $C$DW$539, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    8112                            .dwattr $C$DW$539, DW_AT_accessibility(DW_ACCESS_public)
    8113                    
    8114                    $C$DW$540       .dwtag  DW_TAG_member
    8115                            .dwattr $C$DW$540, DW_AT_type(*$C$DW$T$3)
    8116                            .dwattr $C$DW$540, DW_AT_name("osal_timerid_msec_timer")
    8117                            .dwattr $C$DW$540, DW_AT_TI_symbol_name("osal_timerid_msec_timer")
    8118                            .dwattr $C$DW$540, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    8119                            .dwattr $C$DW$540, DW_AT_accessibility(DW_ACCESS_public)
    8120                    
    8121                    $C$DW$541       .dwtag  DW_TAG_member
    8122                            .dwattr $C$DW$541, DW_AT_type(*$C$DW$T$11)
    8123                            .dwattr $C$DW$541, DW_AT_name("osal_msec_timer_seq")
    8124                            .dwattr $C$DW$541, DW_AT_TI_symbol_name("osal_msec_timer_seq")
    8125                            .dwattr $C$DW$541, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    8126                            .dwattr $C$DW$541, DW_AT_accessibility(DW_ACCESS_public)
    8127                    
    8128                    $C$DW$542       .dwtag  DW_TAG_member
    8129                            .dwattr $C$DW$542, DW_AT_type(*$C$DW$T$98)
    8130                            .dwattr $C$DW$542, DW_AT_name("osal_dispatch_entities")
    8131                            .dwattr $C$DW$542, DW_AT_TI_symbol_name("osal_dispatch_entities")
    8132                            .dwattr $C$DW$542, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    8133                            .dwattr $C$DW$542, DW_AT_accessibility(DW_ACCESS_public)
    8134                    
    8135                            .dwendtag $C$DW$T$99
    8136                    
    8137                    
    8138                    $C$DW$T$100     .dwtag  DW_TAG_structure_type
    8139                            .dwattr $C$DW$T$100, DW_AT_name("_ICall_LiteCmdStatus_")
    8140                            .dwattr $C$DW$T$100, DW_AT_byte_size(0x01)
    8141                    $C$DW$543       .dwtag  DW_TAG_member
    8142                            .dwattr $C$DW$543, DW_AT_type(*$C$DW$T$88)
    8143                            .dwattr $C$DW$543, DW_AT_name("cmdId")
    8144                            .dwattr $C$DW$543, DW_AT_TI_symbol_name("cmdId")
    8145                            .dwattr $C$DW$543, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8146                            .dwattr $C$DW$543, DW_AT_accessibility(DW_ACCESS_public)
    8147                            .dwattr $C$DW$543, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    8148                            .dwattr $C$DW$543, DW_AT_decl_line(0x3f0)
    8149                            .dwattr $C$DW$543, DW_AT_decl_column(0x11)
    8150                    
    8151                            .dwattr $C$DW$T$100, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154st
    8152                            .dwattr $C$DW$T$100, DW_AT_decl_line(0x3ee)
    8153                            .dwattr $C$DW$T$100, DW_AT_decl_column(0x10)
    8154                            .dwendtag $C$DW$T$100
    8155                    
    8156                    $C$DW$T$194     .dwtag  DW_TAG_typedef
    8157                            .dwattr $C$DW$T$194, DW_AT_name("ICall_LiteCmdStatus")
    8158                            .dwattr $C$DW$T$194, DW_AT_type(*$C$DW$T$100)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:28 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{041DAC52-8C43-4717-A6A0-6073B5E74BD6} PAGE  150

    8159                            .dwattr $C$DW$T$194, DW_AT_language(DW_LANG_C)
    8160                            .dwattr $C$DW$T$194, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154st
    8161                            .dwattr $C$DW$T$194, DW_AT_decl_line(0x3f1)
    8162                            .dwattr $C$DW$T$194, DW_AT_decl_column(0x03)
    8163                    
    8164                    $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    8165                            .dwattr $C$DW$T$2, DW_AT_name("void")
    8166                    
    8167                    $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    8168                            .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
    8169                            .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
    8170                    
    8171                    $C$DW$T$195     .dwtag  DW_TAG_typedef
    8172                            .dwattr $C$DW$T$195, DW_AT_name("ICall_Semaphore")
    8173                            .dwattr $C$DW$T$195, DW_AT_type(*$C$DW$T$3)
    8174                            .dwattr $C$DW$T$195, DW_AT_language(DW_LANG_C)
    8175                            .dwattr $C$DW$T$195, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154st
    8176                            .dwattr $C$DW$T$195, DW_AT_decl_line(0x1ac)
    8177                            .dwattr $C$DW$T$195, DW_AT_decl_column(0x0f)
    8178                    
    8179                    $C$DW$T$114     .dwtag  DW_TAG_typedef
    8180                            .dwattr $C$DW$T$114, DW_AT_name("ICall_SyncHandle")
    8181                            .dwattr $C$DW$T$114, DW_AT_type(*$C$DW$T$3)
    8182                            .dwattr $C$DW$T$114, DW_AT_language(DW_LANG_C)
    8183                            .dwattr $C$DW$T$114, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154st
    8184                            .dwattr $C$DW$T$114, DW_AT_decl_line(0x1aa)
    8185                            .dwattr $C$DW$T$114, DW_AT_decl_column(0x0f)
    8186                    
    8187                    $C$DW$T$196     .dwtag  DW_TAG_const_type
    8188                            .dwattr $C$DW$T$196, DW_AT_type(*$C$DW$T$114)
    8189                    
    8190                    $C$DW$T$158     .dwtag  DW_TAG_typedef
    8191                            .dwattr $C$DW$T$158, DW_AT_name("ICall_TimerID")
    8192                            .dwattr $C$DW$T$158, DW_AT_type(*$C$DW$T$3)
    8193                            .dwattr $C$DW$T$158, DW_AT_language(DW_LANG_C)
    8194                            .dwattr $C$DW$T$158, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154st
    8195                            .dwattr $C$DW$T$158, DW_AT_decl_line(0x1b7)
    8196                            .dwattr $C$DW$T$158, DW_AT_decl_column(0x0f)
    8197                    
    8198                    $C$DW$T$212     .dwtag  DW_TAG_const_type
    8199                            .dwattr $C$DW$T$212, DW_AT_type(*$C$DW$T$3)
    8200                    
    8201                    $C$DW$T$209     .dwtag  DW_TAG_typedef
    8202                            .dwattr $C$DW$T$209, DW_AT_name("osal_msg_q_t")
    8203                            .dwattr $C$DW$T$209, DW_AT_type(*$C$DW$T$3)
    8204                            .dwattr $C$DW$T$209, DW_AT_language(DW_LANG_C)
    8205                            .dwattr $C$DW$T$209, DW_AT_decl_file("..\Application\MAC\OSAL\osal.h")
    8206                            .dwattr $C$DW$T$209, DW_AT_decl_line(0x7d)
    8207                            .dwattr $C$DW$T$209, DW_AT_decl_column(0x10)
    8208                    
    8209                    $C$DW$T$210     .dwtag  DW_TAG_pointer_type
    8210                            .dwattr $C$DW$T$210, DW_AT_type(*$C$DW$T$209)
    8211                            .dwattr $C$DW$T$210, DW_AT_address_class(0x20)
    8212                    
    8213                    $C$DW$T$213     .dwtag  DW_TAG_const_type
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:28 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{041DAC52-8C43-4717-A6A0-6073B5E74BD6} PAGE  151

    8214                            .dwattr $C$DW$T$213, DW_AT_type(*$C$DW$T$210)
    8215                    
    8216                    
    8217                    $C$DW$T$36      .dwtag  DW_TAG_subroutine_type
    8218                            .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
    8219                            .dwendtag $C$DW$T$36
    8220                    
    8221                    $C$DW$T$37      .dwtag  DW_TAG_pointer_type
    8222                            .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$36)
    8223                            .dwattr $C$DW$T$37, DW_AT_address_class(0x20)
    8224                    
    8225                    $C$DW$T$173     .dwtag  DW_TAG_typedef
    8226                            .dwattr $C$DW$T$173, DW_AT_name("APPASRTINTF_callAssrtHndler")
    8227                            .dwattr $C$DW$T$173, DW_AT_type(*$C$DW$T$37)
    8228                            .dwattr $C$DW$T$173, DW_AT_language(DW_LANG_C)
    8229                            .dwattr $C$DW$T$173, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154st
    8230                            .dwattr $C$DW$T$173, DW_AT_decl_line(0x43)
    8231                            .dwattr $C$DW$T$173, DW_AT_decl_column(0x10)
    8232                    
    8233                    $C$DW$T$55      .dwtag  DW_TAG_typedef
    8234                            .dwattr $C$DW$T$55, DW_AT_name("FPTR_HFSOURCESAFESWITCH_T")
    8235                            .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$37)
    8236                            .dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C)
    8237                            .dwattr $C$DW$T$55, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\
    8238                            .dwattr $C$DW$T$55, DW_AT_decl_line(0x5f)
    8239                            .dwattr $C$DW$T$55, DW_AT_decl_column(0x19)
    8240                    
    8241                    $C$DW$T$38      .dwtag  DW_TAG_typedef
    8242                            .dwattr $C$DW$T$38, DW_AT_name("FPTR_RESETDEV_T")
    8243                            .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$37)
    8244                            .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    8245                            .dwattr $C$DW$T$38, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\
    8246                            .dwattr $C$DW$T$38, DW_AT_decl_line(0x4d)
    8247                            .dwattr $C$DW$T$38, DW_AT_decl_column(0x19)
    8248                    
    8249                    $C$DW$T$214     .dwtag  DW_TAG_typedef
    8250                            .dwattr $C$DW$T$214, DW_AT_name("FPTR_VOID_VOID_T")
    8251                            .dwattr $C$DW$T$214, DW_AT_type(*$C$DW$T$37)
    8252                            .dwattr $C$DW$T$214, DW_AT_language(DW_LANG_C)
