TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:29 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{50BC86E2-734C-4CC5-8A3A-CC35CB40926B} PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                        PC v16.9.4.LTS *
       3                    ;* Date/Time created: Sat Nov 18 18:46:28 2017                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../Application/MAC/OSAL/osal_timers.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v16.9.4.LTS Copyright (c) 1996-20
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Kevin\workspace_v7\sensor_cc1310lp\sensor_cc1310lp"
      13                    
      14                    $C$DW$1 .dwtag  DW_TAG_subprogram

    1912                            .dwattr $C$DW$T$177, DW_AT_type(*$C$DW$T$176)
    1913                            .dwattr $C$DW$T$177, DW_AT_language(DW_LANG_C)
    1914                            .dwattr $C$DW$T$177, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices
    1915                            .dwattr $C$DW$T$177, DW_AT_decl_line(0xb0)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:29 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{50BC86E2-734C-4CC5-8A3A-CC35CB40926B} PAGE   36

    1916                            .dwattr $C$DW$T$177, DW_AT_decl_column(0x03)
    1917                    
    1918                    
    1919                    $C$DW$T$178     .dwtag  DW_TAG_enumeration_type
    1920                            .dwattr $C$DW$T$178, DW_AT_byte_size(0x01)
    1921                    $C$DW$119       .dwtag  DW_TAG_enumerator
    1922                            .dwattr $C$DW$119, DW_AT_name("ICALL_RTI_APP_CMD_EVENT")
    1923                            .dwattr $C$DW$119, DW_AT_const_value(0xe0)
    1924                            .dwattr $C$DW$119, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    1925                            .dwattr $C$DW$119, DW_AT_decl_line(0x3de)
    1926                            .dwattr $C$DW$119, DW_AT_decl_column(0x04)
    1927                    
    1928                    $C$DW$120       .dwtag  DW_TAG_enumerator
    1929                            .dwattr $C$DW$120, DW_AT_name("ICALL_RTI_STACK_CMD_EVENT")
    1930                            .dwattr $C$DW$120, DW_AT_const_value(0xe1)
    1931                            .dwattr $C$DW$120, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    1932                            .dwattr $C$DW$120, DW_AT_decl_line(0x3e0)
    1933                            .dwattr $C$DW$120, DW_AT_decl_column(0x04)
    1934                    
    1935                    $C$DW$121       .dwtag  DW_TAG_enumerator
    1936                            .dwattr $C$DW$121, DW_AT_name("ICALL_RTI_APP_ASYNC_CMD_EVENT")
    1937                            .dwattr $C$DW$121, DW_AT_const_value(0xe2)
    1938                            .dwattr $C$DW$121, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    1939                            .dwattr $C$DW$121, DW_AT_decl_line(0x3e2)
    1940                            .dwattr $C$DW$121, DW_AT_decl_column(0x04)
    1941                    
    1942                    $C$DW$122       .dwtag  DW_TAG_enumerator
    1943                            .dwattr $C$DW$122, DW_AT_name("ICALL_RTI_APP_SYNC_CMD_EVENT")
    1944                            .dwattr $C$DW$122, DW_AT_const_value(0xe3)
    1945                            .dwattr $C$DW$122, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    1946                            .dwattr $C$DW$122, DW_AT_decl_line(0x3e4)
    1947                            .dwattr $C$DW$122, DW_AT_decl_column(0x04)
    1948                    
    1949                    $C$DW$123       .dwtag  DW_TAG_enumerator
    1950                            .dwattr $C$DW$123, DW_AT_name("ICALL_RCN_APP_ASYNC_CMD_EVENT")
    1951                            .dwattr $C$DW$123, DW_AT_const_value(0xe4)
    1952                            .dwattr $C$DW$123, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    1953                            .dwattr $C$DW$123, DW_AT_decl_line(0x3e6)
    1954                            .dwattr $C$DW$123, DW_AT_decl_column(0x04)
    1955                    
    1956                    $C$DW$124       .dwtag  DW_TAG_enumerator
    1957                            .dwattr $C$DW$124, DW_AT_name("ICALL_RCN_APP_SYNC_CMD_EVENT")
    1958                            .dwattr $C$DW$124, DW_AT_const_value(0xe5)
    1959                            .dwattr $C$DW$124, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    1960                            .dwattr $C$DW$124, DW_AT_decl_line(0x3e8)
    1961                            .dwattr $C$DW$124, DW_AT_decl_column(0x04)
    1962                    
    1963                            .dwattr $C$DW$T$178, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154st
    1964                            .dwattr $C$DW$T$178, DW_AT_decl_line(0x3dc)
    1965                            .dwattr $C$DW$T$178, DW_AT_decl_column(0x01)
    1966                            .dwendtag $C$DW$T$178
    1967                    
    1968                    $C$DW$T$179     .dwtag  DW_TAG_typedef
    1969                            .dwattr $C$DW$T$179, DW_AT_name("ICall_RemotiCmdEvent_t")
    1970                            .dwattr $C$DW$T$179, DW_AT_type(*$C$DW$T$178)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:29 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{50BC86E2-734C-4CC5-8A3A-CC35CB40926B} PAGE   37

    1971                            .dwattr $C$DW$T$179, DW_AT_language(DW_LANG_C)
    1972                            .dwattr $C$DW$T$179, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154st
    1973                            .dwattr $C$DW$T$179, DW_AT_decl_line(0x3e9)
    1974                            .dwattr $C$DW$T$179, DW_AT_decl_column(0x02)
    1975                    
    1976                    
    1977                    $C$DW$T$23      .dwtag  DW_TAG_structure_type
    1978                            .dwattr $C$DW$T$23, DW_AT_byte_size(0x10)
    1979                    $C$DW$125       .dwtag  DW_TAG_member
    1980                            .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$3)
    1981                            .dwattr $C$DW$125, DW_AT_name("next")
    1982                            .dwattr $C$DW$125, DW_AT_TI_symbol_name("next")
    1983                            .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1984                            .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1985                            .dwattr $C$DW$125, DW_AT_decl_file("../Application/MAC/OSAL/osal_timers.c")
    1986                            .dwattr $C$DW$125, DW_AT_decl_line(0x4d)
    1987                            .dwattr $C$DW$125, DW_AT_decl_column(0x0b)
    1988                    
    1989                    $C$DW$126       .dwtag  DW_TAG_member
    1990                            .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$19)
    1991                            .dwattr $C$DW$126, DW_AT_name("timeout")
    1992                            .dwattr $C$DW$126, DW_AT_TI_symbol_name("timeout")
    1993                            .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1994                            .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1995                            .dwattr $C$DW$126, DW_AT_decl_file("../Application/MAC/OSAL/osal_timers.c")
    1996                            .dwattr $C$DW$126, DW_AT_decl_line(0x4e)
    1997                            .dwattr $C$DW$126, DW_AT_decl_column(0x0e)
    1998                    
    1999                    $C$DW$127       .dwtag  DW_TAG_member
    2000                            .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$20)
    2001                            .dwattr $C$DW$127, DW_AT_name("event_flag")
    2002                            .dwattr $C$DW$127, DW_AT_TI_symbol_name("event_flag")
    2003                            .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2004                            .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    2005                            .dwattr $C$DW$127, DW_AT_decl_file("../Application/MAC/OSAL/osal_timers.c")
    2006                            .dwattr $C$DW$127, DW_AT_decl_line(0x4f)
    2007                            .dwattr $C$DW$127, DW_AT_decl_column(0x0a)
    2008                    
    2009                    $C$DW$128       .dwtag  DW_TAG_member
    2010                            .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$21)
    2011                            .dwattr $C$DW$128, DW_AT_name("task_id")
    2012                            .dwattr $C$DW$128, DW_AT_TI_symbol_name("task_id")
    2013                            .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2014                            .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    2015                            .dwattr $C$DW$128, DW_AT_decl_file("../Application/MAC/OSAL/osal_timers.c")
    2016                            .dwattr $C$DW$128, DW_AT_decl_line(0x50)
    2017                            .dwattr $C$DW$128, DW_AT_decl_column(0x0a)
    2018                    
    2019                    $C$DW$129       .dwtag  DW_TAG_member
    2020                            .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$22)
    2021                            .dwattr $C$DW$129, DW_AT_name("reloadTimeout")
    2022                            .dwattr $C$DW$129, DW_AT_TI_symbol_name("reloadTimeout")
    2023                            .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2024                            .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    2025                            .dwattr $C$DW$129, DW_AT_decl_file("../Application/MAC/OSAL/osal_timers.c")
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:29 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{50BC86E2-734C-4CC5-8A3A-CC35CB40926B} PAGE   38

    2026                            .dwattr $C$DW$129, DW_AT_decl_line(0x51)
    2027                            .dwattr $C$DW$129, DW_AT_decl_column(0x0a)
    2028                    
    2029                            .dwattr $C$DW$T$23, DW_AT_decl_file("../Application/MAC/OSAL/osal_timers.c")
    2030                            .dwattr $C$DW$T$23, DW_AT_decl_line(0x4c)
    2031                            .dwattr $C$DW$T$23, DW_AT_decl_column(0x01)
    2032                            .dwendtag $C$DW$T$23
    2033                    
    2034                    $C$DW$T$98      .dwtag  DW_TAG_pointer_type
    2035                            .dwattr $C$DW$T$98, DW_AT_type(*$C$DW$T$23)
    2036                            .dwattr $C$DW$T$98, DW_AT_address_class(0x20)
    2037                    
    2038                    $C$DW$T$186     .dwtag  DW_TAG_typedef
    2039                            .dwattr $C$DW$T$186, DW_AT_name("osalTimerRec_t")
    2040                            .dwattr $C$DW$T$186, DW_AT_type(*$C$DW$T$23)
    2041                            .dwattr $C$DW$T$186, DW_AT_language(DW_LANG_C)
    2042                            .dwattr $C$DW$T$186, DW_AT_decl_file("../Application/MAC/OSAL/osal_timers.c")
    2043                            .dwattr $C$DW$T$186, DW_AT_decl_line(0x52)
    2044                            .dwattr $C$DW$T$186, DW_AT_decl_column(0x03)
    2045                    
    2046                    $C$DW$T$187     .dwtag  DW_TAG_pointer_type
    2047                            .dwattr $C$DW$T$187, DW_AT_type(*$C$DW$T$186)
    2048                            .dwattr $C$DW$T$187, DW_AT_address_class(0x20)
    2049                    
    2050                    $C$DW$T$190     .dwtag  DW_TAG_const_type
    2051                            .dwattr $C$DW$T$190, DW_AT_type(*$C$DW$T$187)
    2052                    
    2053                    
    2054                    $C$DW$T$65      .dwtag  DW_TAG_structure_type
    2055                            .dwattr $C$DW$T$65, DW_AT_byte_size(0x4c)
    2056                    $C$DW$130       .dwtag  DW_TAG_member
    2057                            .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$29)
    2058                            .dwattr $C$DW$130, DW_AT_name("Crc32")
    2059                            .dwattr $C$DW$130, DW_AT_TI_symbol_name("Crc32")
    2060                            .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2061                            .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    2062                            .dwattr $C$DW$130, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    2063                            .dwattr $C$DW$130, DW_AT_decl_line(0x76)
    2064                            .dwattr $C$DW$130, DW_AT_decl_column(0x25)
    2065                    
    2066                    $C$DW$131       .dwtag  DW_TAG_member
    2067                            .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$32)
    2068                            .dwattr $C$DW$131, DW_AT_name("FlashGetSize")
    2069                            .dwattr $C$DW$131, DW_AT_TI_symbol_name("FlashGetSize")
    2070                            .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2071                            .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    2072                            .dwattr $C$DW$131, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    2073                            .dwattr $C$DW$131, DW_AT_decl_line(0x77)
    2074                            .dwattr $C$DW$131, DW_AT_decl_column(0x25)
    2075                    
    2076                    $C$DW$132       .dwtag  DW_TAG_member
    2077                            .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$33)
    2078                            .dwattr $C$DW$132, DW_AT_name("GetChipId")
    2079                            .dwattr $C$DW$132, DW_AT_TI_symbol_name("GetChipId")
    2080                            .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:29 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{50BC86E2-734C-4CC5-8A3A-CC35CB40926B} PAGE   39

    2081                            .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    2082                            .dwattr $C$DW$132, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    2083                            .dwattr $C$DW$132, DW_AT_decl_line(0x78)
    2084                            .dwattr $C$DW$132, DW_AT_decl_column(0x25)
    2085                    
    2086                    $C$DW$133       .dwtag  DW_TAG_member
    2087                            .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$36)
    2088                            .dwattr $C$DW$133, DW_AT_name("ReservedLocation1")
    2089                            .dwattr $C$DW$133, DW_AT_TI_symbol_name("ReservedLocation1")
    2090                            .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2091                            .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    2092                            .dwattr $C$DW$133, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    2093                            .dwattr $C$DW$133, DW_AT_decl_line(0x79)
    2094                            .dwattr $C$DW$133, DW_AT_decl_column(0x25)
    2095                    
    2096                    $C$DW$134       .dwtag  DW_TAG_member
    2097                            .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$37)
    2098                            .dwattr $C$DW$134, DW_AT_name("ReservedLocation2")
    2099                            .dwattr $C$DW$134, DW_AT_TI_symbol_name("ReservedLocation2")
    2100                            .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2101                            .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    2102                            .dwattr $C$DW$134, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    2103                            .dwattr $C$DW$134, DW_AT_decl_line(0x7a)
    2104                            .dwattr $C$DW$134, DW_AT_decl_column(0x25)
    2105                    
    2106                    $C$DW$135       .dwtag  DW_TAG_member
    2107                            .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$38)
    2108                            .dwattr $C$DW$135, DW_AT_name("ReservedLocation3")
    2109                            .dwattr $C$DW$135, DW_AT_TI_symbol_name("ReservedLocation3")
    2110                            .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2111                            .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    2112                            .dwattr $C$DW$135, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    2113                            .dwattr $C$DW$135, DW_AT_decl_line(0x7b)
    2114                            .dwattr $C$DW$135, DW_AT_decl_column(0x25)
    2115                    
    2116                    $C$DW$136       .dwtag  DW_TAG_member
    2117                            .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$41)
    2118                            .dwattr $C$DW$136, DW_AT_name("ResetDevice")
    2119                            .dwattr $C$DW$136, DW_AT_TI_symbol_name("ResetDevice")
    2120                            .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2121                            .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    2122                            .dwattr $C$DW$136, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    2123                            .dwattr $C$DW$136, DW_AT_decl_line(0x7c)
    2124                            .dwattr $C$DW$136, DW_AT_decl_column(0x25)
    2125                    
    2126                    $C$DW$137       .dwtag  DW_TAG_member
    2127                            .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$46)
    2128                            .dwattr $C$DW$137, DW_AT_name("Fletcher32")
    2129                            .dwattr $C$DW$137, DW_AT_TI_symbol_name("Fletcher32")
    2130                            .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2131                            .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    2132                            .dwattr $C$DW$137, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    2133                            .dwattr $C$DW$137, DW_AT_decl_line(0x7d)
    2134                            .dwattr $C$DW$137, DW_AT_decl_column(0x25)
    2135                    
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:29 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{50BC86E2-734C-4CC5-8A3A-CC35CB40926B} PAGE   40

    2136                    $C$DW$138       .dwtag  DW_TAG_member
    2137                            .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$50)
    2138                            .dwattr $C$DW$138, DW_AT_name("MinValue")
    2139                            .dwattr $C$DW$138, DW_AT_TI_symbol_name("MinValue")
    2140                            .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2141                            .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    2142                            .dwattr $C$DW$138, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    2143                            .dwattr $C$DW$138, DW_AT_decl_line(0x7e)
    2144                            .dwattr $C$DW$138, DW_AT_decl_column(0x25)
    2145                    
    2146                    $C$DW$139       .dwtag  DW_TAG_member
    2147                            .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$51)
    2148                            .dwattr $C$DW$139, DW_AT_name("MaxValue")
    2149                            .dwattr $C$DW$139, DW_AT_TI_symbol_name("MaxValue")
    2150                            .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2151                            .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    2152                            .dwattr $C$DW$139, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    2153                            .dwattr $C$DW$139, DW_AT_decl_line(0x7f)
    2154                            .dwattr $C$DW$139, DW_AT_decl_column(0x25)
    2155                    
    2156                    $C$DW$140       .dwtag  DW_TAG_member
    2157                            .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$52)
    2158                            .dwattr $C$DW$140, DW_AT_name("MeanValue")
    2159                            .dwattr $C$DW$140, DW_AT_TI_symbol_name("MeanValue")
    2160                            .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2161                            .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    2162                            .dwattr $C$DW$140, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    2163                            .dwattr $C$DW$140, DW_AT_decl_line(0x80)
    2164                            .dwattr $C$DW$140, DW_AT_decl_column(0x25)
    2165                    
    2166                    $C$DW$141       .dwtag  DW_TAG_member
    2167                            .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$53)
    2168                            .dwattr $C$DW$141, DW_AT_name("StandDeviationValue")
    2169                            .dwattr $C$DW$141, DW_AT_TI_symbol_name("StandDeviationValue")
    2170                            .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    2171                            .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    2172                            .dwattr $C$DW$141, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    2173                            .dwattr $C$DW$141, DW_AT_decl_line(0x81)
    2174                            .dwattr $C$DW$141, DW_AT_decl_column(0x25)
    2175                    
    2176                    $C$DW$142       .dwtag  DW_TAG_member
    2177                            .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$56)
    2178                            .dwattr $C$DW$142, DW_AT_name("ReservedLocation4")
    2179                            .dwattr $C$DW$142, DW_AT_TI_symbol_name("ReservedLocation4")
    2180                            .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2181                            .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    2182                            .dwattr $C$DW$142, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    2183                            .dwattr $C$DW$142, DW_AT_decl_line(0x82)
    2184                            .dwattr $C$DW$142, DW_AT_decl_column(0x25)
    2185                    
    2186                    $C$DW$143       .dwtag  DW_TAG_member
    2187                            .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$57)
    2188                            .dwattr $C$DW$143, DW_AT_name("ReservedLocation5")
    2189                            .dwattr $C$DW$143, DW_AT_TI_symbol_name("ReservedLocation5")
    2190                            .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:29 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{50BC86E2-734C-4CC5-8A3A-CC35CB40926B} PAGE   41

    2191                            .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    2192                            .dwattr $C$DW$143, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    2193                            .dwattr $C$DW$143, DW_AT_decl_line(0x83)
    2194                            .dwattr $C$DW$143, DW_AT_decl_column(0x25)
    2195                    
    2196                    $C$DW$144       .dwtag  DW_TAG_member
    2197                            .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$58)
    2198                            .dwattr $C$DW$144, DW_AT_name("HFSourceSafeSwitch")
    2199                            .dwattr $C$DW$144, DW_AT_TI_symbol_name("HFSourceSafeSwitch")
    2200                            .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    2201                            .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    2202                            .dwattr $C$DW$144, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    2203                            .dwattr $C$DW$144, DW_AT_decl_line(0x84)
    2204                            .dwattr $C$DW$144, DW_AT_decl_column(0x25)
    2205                    
    2206                    $C$DW$145       .dwtag  DW_TAG_member
    2207                            .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$61)
    2208                            .dwattr $C$DW$145, DW_AT_name("SelectCompAInput")
    2209                            .dwattr $C$DW$145, DW_AT_TI_symbol_name("SelectCompAInput")
    2210                            .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    2211                            .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    2212                            .dwattr $C$DW$145, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    2213                            .dwattr $C$DW$145, DW_AT_decl_line(0x85)
    2214                            .dwattr $C$DW$145, DW_AT_decl_column(0x25)
    2215                    
    2216                    $C$DW$146       .dwtag  DW_TAG_member
    2217                            .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$62)
    2218                            .dwattr $C$DW$146, DW_AT_name("SelectCompARef")
    2219                            .dwattr $C$DW$146, DW_AT_TI_symbol_name("SelectCompARef")
    2220                            .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    2221                            .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    2222                            .dwattr $C$DW$146, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    2223                            .dwattr $C$DW$146, DW_AT_decl_line(0x86)
    2224                            .dwattr $C$DW$146, DW_AT_decl_column(0x25)
    2225                    
    2226                    $C$DW$147       .dwtag  DW_TAG_member
    2227                            .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$63)
    2228                            .dwattr $C$DW$147, DW_AT_name("SelectADCCompBInput")
    2229                            .dwattr $C$DW$147, DW_AT_TI_symbol_name("SelectADCCompBInput")
    2230                            .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    2231                            .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    2232                            .dwattr $C$DW$147, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    2233                            .dwattr $C$DW$147, DW_AT_decl_line(0x87)
    2234                            .dwattr $C$DW$147, DW_AT_decl_column(0x25)
    2235                    
    2236                    $C$DW$148       .dwtag  DW_TAG_member
    2237                            .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$64)
    2238                            .dwattr $C$DW$148, DW_AT_name("SelectCompBRef")
    2239                            .dwattr $C$DW$148, DW_AT_TI_symbol_name("SelectCompBRef")
    2240                            .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    2241                            .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    2242                            .dwattr $C$DW$148, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    2243                            .dwattr $C$DW$148, DW_AT_decl_line(0x88)
    2244                            .dwattr $C$DW$148, DW_AT_decl_column(0x25)
    2245                    
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:29 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{50BC86E2-734C-4CC5-8A3A-CC35CB40926B} PAGE   42

    2246                            .dwattr $C$DW$T$65, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\
    2247                            .dwattr $C$DW$T$65, DW_AT_decl_line(0x75)
    2248                            .dwattr $C$DW$T$65, DW_AT_decl_column(0x01)
    2249                            .dwendtag $C$DW$T$65
    2250                    
    2251                    $C$DW$T$191     .dwtag  DW_TAG_typedef
    2252                            .dwattr $C$DW$T$191, DW_AT_name("HARD_API_T")
    2253                            .dwattr $C$DW$T$191, DW_AT_type(*$C$DW$T$65)
    2254                            .dwattr $C$DW$T$191, DW_AT_language(DW_LANG_C)
    2255                            .dwattr $C$DW$T$191, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices
    2256                            .dwattr $C$DW$T$191, DW_AT_decl_line(0x89)
    2257                            .dwattr $C$DW$T$191, DW_AT_decl_column(0x03)
    2258                    
    2259                    
    2260                    $C$DW$T$66      .dwtag  DW_TAG_structure_type
    2261                            .dwattr $C$DW$T$66, DW_AT_byte_size(0x08)
    2262                    $C$DW$149       .dwtag  DW_TAG_member
    2263                            .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$10)
    2264                            .dwattr $C$DW$149, DW_AT_name("quot")
    2265                            .dwattr $C$DW$149, DW_AT_TI_symbol_name("quot")
    2266                            .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2267                            .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    2268                            .dwattr $C$DW$149, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/s
    2269                            .dwattr $C$DW$149, DW_AT_decl_line(0x5c)
    2270                            .dwattr $C$DW$149, DW_AT_decl_column(0x16)
    2271                    
    2272                    $C$DW$150       .dwtag  DW_TAG_member
    2273                            .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$10)
    2274                            .dwattr $C$DW$150, DW_AT_name("rem")
    2275                            .dwattr $C$DW$150, DW_AT_TI_symbol_name("rem")
    2276                            .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2277                            .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    2278                            .dwattr $C$DW$150, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/s
    2279                            .dwattr $C$DW$150, DW_AT_decl_line(0x5c)
    2280                            .dwattr $C$DW$150, DW_AT_decl_column(0x1c)
    2281                    
    2282                            .dwattr $C$DW$T$66, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/
    2283                            .dwattr $C$DW$T$66, DW_AT_decl_line(0x5c)
    2284                            .dwattr $C$DW$T$66, DW_AT_decl_column(0x10)
    2285                            .dwendtag $C$DW$T$66
    2286                    
    2287                    $C$DW$T$192     .dwtag  DW_TAG_typedef
    2288                            .dwattr $C$DW$T$192, DW_AT_name("div_t")
    2289                            .dwattr $C$DW$T$192, DW_AT_type(*$C$DW$T$66)
    2290                            .dwattr $C$DW$T$192, DW_AT_language(DW_LANG_C)
    2291                            .dwattr $C$DW$T$192, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include
    2292                            .dwattr $C$DW$T$192, DW_AT_decl_line(0x5c)
    2293                            .dwattr $C$DW$T$192, DW_AT_decl_column(0x23)
    2294                    
    2295                    
    2296                    $C$DW$T$67      .dwtag  DW_TAG_structure_type
    2297                            .dwattr $C$DW$T$67, DW_AT_byte_size(0x08)
    2298                    $C$DW$151       .dwtag  DW_TAG_member
    2299                            .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$10)
    2300                            .dwattr $C$DW$151, DW_AT_name("quot")
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:29 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{50BC86E2-734C-4CC5-8A3A-CC35CB40926B} PAGE   43

    2301                            .dwattr $C$DW$151, DW_AT_TI_symbol_name("quot")
    2302                            .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2303                            .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    2304                            .dwattr $C$DW$151, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/s
    2305                            .dwattr $C$DW$151, DW_AT_decl_line(0x5e)
    2306                            .dwattr $C$DW$151, DW_AT_decl_column(0x16)
    2307                    
    2308                    $C$DW$152       .dwtag  DW_TAG_member
    2309                            .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$10)
    2310                            .dwattr $C$DW$152, DW_AT_name("rem")
    2311                            .dwattr $C$DW$152, DW_AT_TI_symbol_name("rem")
    2312                            .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2313                            .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    2314                            .dwattr $C$DW$152, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/s
    2315                            .dwattr $C$DW$152, DW_AT_decl_line(0x5e)
    2316                            .dwattr $C$DW$152, DW_AT_decl_column(0x1c)
    2317                    
    2318                            .dwattr $C$DW$T$67, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/
    2319                            .dwattr $C$DW$T$67, DW_AT_decl_line(0x5e)
    2320                            .dwattr $C$DW$T$67, DW_AT_decl_column(0x10)
    2321                            .dwendtag $C$DW$T$67
    2322                    
    2323                    $C$DW$T$193     .dwtag  DW_TAG_typedef
    2324                            .dwattr $C$DW$T$193, DW_AT_name("ldiv_t")
    2325                            .dwattr $C$DW$T$193, DW_AT_type(*$C$DW$T$67)
    2326                            .dwattr $C$DW$T$193, DW_AT_language(DW_LANG_C)
    2327                            .dwattr $C$DW$T$193, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include
    2328                            .dwattr $C$DW$T$193, DW_AT_decl_line(0x5e)
    2329                            .dwattr $C$DW$T$193, DW_AT_decl_column(0x23)
    2330                    
    2331                    
    2332                    $C$DW$T$68      .dwtag  DW_TAG_structure_type
    2333                            .dwattr $C$DW$T$68, DW_AT_byte_size(0x10)
    2334                    $C$DW$153       .dwtag  DW_TAG_member
    2335                            .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$14)
    2336                            .dwattr $C$DW$153, DW_AT_name("quot")
    2337                            .dwattr $C$DW$153, DW_AT_TI_symbol_name("quot")
    2338                            .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2339                            .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    2340                            .dwattr $C$DW$153, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/s
    2341                            .dwattr $C$DW$153, DW_AT_decl_line(0x61)
    2342                            .dwattr $C$DW$153, DW_AT_decl_column(0x1c)
    2343                    
    2344                    $C$DW$154       .dwtag  DW_TAG_member
    2345                            .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$14)
    2346                            .dwattr $C$DW$154, DW_AT_name("rem")
    2347                            .dwattr $C$DW$154, DW_AT_TI_symbol_name("rem")
    2348                            .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2349                            .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    2350                            .dwattr $C$DW$154, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/s
    2351                            .dwattr $C$DW$154, DW_AT_decl_line(0x61)
    2352                            .dwattr $C$DW$154, DW_AT_decl_column(0x22)
    2353                    
    2354                            .dwattr $C$DW$T$68, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/
    2355                            .dwattr $C$DW$T$68, DW_AT_decl_line(0x61)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:29 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{50BC86E2-734C-4CC5-8A3A-CC35CB40926B} PAGE   44

    2356                            .dwattr $C$DW$T$68, DW_AT_decl_column(0x10)
    2357                            .dwendtag $C$DW$T$68
    2358                    
    2359                    $C$DW$T$194     .dwtag  DW_TAG_typedef
    2360                            .dwattr $C$DW$T$194, DW_AT_name("lldiv_t")
    2361                            .dwattr $C$DW$T$194, DW_AT_type(*$C$DW$T$68)
    2362                            .dwattr $C$DW$T$194, DW_AT_language(DW_LANG_C)
    2363                            .dwattr $C$DW$T$194, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include
    2364                            .dwattr $C$DW$T$194, DW_AT_decl_line(0x61)
    2365                            .dwattr $C$DW$T$194, DW_AT_decl_column(0x29)
    2366                    
    2367                    
    2368                    $C$DW$T$72      .dwtag  DW_TAG_structure_type
    2369                            .dwattr $C$DW$T$72, DW_AT_byte_size(0x08)
    2370                    $C$DW$155       .dwtag  DW_TAG_member
    2371                            .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$70)
    2372                            .dwattr $C$DW$155, DW_AT_name("pointerStack")
    2373                            .dwattr $C$DW$155, DW_AT_TI_symbol_name("pointerStack")
    2374                            .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2375                            .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    2376                            .dwattr $C$DW$155, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    2377                            .dwattr $C$DW$155, DW_AT_decl_line(0x3f5)
    2378                            .dwattr $C$DW$155, DW_AT_decl_column(0x16)
    2379                    
    2380                    $C$DW$156       .dwtag  DW_TAG_member
    2381                            .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$71)
    2382                            .dwattr $C$DW$156, DW_AT_name("directAPI")
    2383                            .dwattr $C$DW$156, DW_AT_TI_symbol_name("directAPI")
    2384                            .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2385                            .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    2386                            .dwattr $C$DW$156, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    2387                            .dwattr $C$DW$156, DW_AT_decl_line(0x3f6)
    2388                            .dwattr $C$DW$156, DW_AT_decl_column(0x15)
    2389                    
    2390                            .dwattr $C$DW$T$72, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154sta
    2391                            .dwattr $C$DW$T$72, DW_AT_decl_line(0x3f4)
    2392                            .dwattr $C$DW$T$72, DW_AT_decl_column(0x01)
    2393                            .dwendtag $C$DW$T$72
    2394                    
    2395                    $C$DW$T$74      .dwtag  DW_TAG_typedef
    2396                            .dwattr $C$DW$T$74, DW_AT_name("icall_directAPIMsg_t")
    2397                            .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$72)
    2398                            .dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
    2399                            .dwattr $C$DW$T$74, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154sta
    2400                            .dwattr $C$DW$T$74, DW_AT_decl_line(0x3f7)
    2401                            .dwattr $C$DW$T$74, DW_AT_decl_column(0x03)
    2402                    
    2403                    
    2404                    $C$DW$T$75      .dwtag  DW_TAG_structure_type
    2405                            .dwattr $C$DW$T$75, DW_AT_byte_size(0x14)
    2406                    $C$DW$157       .dwtag  DW_TAG_member
    2407                            .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$73)
    2408                            .dwattr $C$DW$157, DW_AT_name("hdr")
    2409                            .dwattr $C$DW$157, DW_AT_TI_symbol_name("hdr")
    2410                            .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:29 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{50BC86E2-734C-4CC5-8A3A-CC35CB40926B} PAGE   45

    2411                            .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    2412                            .dwattr $C$DW$157, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    2413                            .dwattr $C$DW$157, DW_AT_decl_line(0x3fb)
    2414                            .dwattr $C$DW$157, DW_AT_decl_column(0x10)
    2415                    
    2416                    $C$DW$158       .dwtag  DW_TAG_member
    2417                            .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$74)
    2418                            .dwattr $C$DW$158, DW_AT_name("msg")
    2419                            .dwattr $C$DW$158, DW_AT_TI_symbol_name("msg")
    2420                            .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2421                            .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    2422                            .dwattr $C$DW$158, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    2423                            .dwattr $C$DW$158, DW_AT_decl_line(0x3fc)
    2424                            .dwattr $C$DW$158, DW_AT_decl_column(0x1a)
    2425                    
    2426                            .dwattr $C$DW$T$75, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154sta
    2427                            .dwattr $C$DW$T$75, DW_AT_decl_line(0x3fa)
    2428                            .dwattr $C$DW$T$75, DW_AT_decl_column(0x01)
    2429                            .dwendtag $C$DW$T$75
    2430                    
    2431                    $C$DW$T$195     .dwtag  DW_TAG_typedef
    2432                            .dwattr $C$DW$T$195, DW_AT_name("icallLiteMsg_t")
    2433                            .dwattr $C$DW$T$195, DW_AT_type(*$C$DW$T$75)
    2434                            .dwattr $C$DW$T$195, DW_AT_language(DW_LANG_C)
    2435                            .dwattr $C$DW$T$195, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154st
    2436                            .dwattr $C$DW$T$195, DW_AT_decl_line(0x3fd)
    2437                            .dwattr $C$DW$T$195, DW_AT_decl_column(0x03)
    2438                    
    2439                    
    2440                    $C$DW$T$78      .dwtag  DW_TAG_structure_type
    2441                            .dwattr $C$DW$T$78, DW_AT_byte_size(0x0c)
    2442                    $C$DW$159       .dwtag  DW_TAG_member
    2443                            .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$76)
    2444                            .dwattr $C$DW$159, DW_AT_name("bufferHead")
    2445                            .dwattr $C$DW$159, DW_AT_TI_symbol_name("bufferHead")
    2446                            .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2447                            .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    2448                            .dwattr $C$DW$159, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    2449                            .dwattr $C$DW$159, DW_AT_decl_line(0x80)
    2450                            .dwattr $C$DW$159, DW_AT_decl_column(0x13)
    2451                    
    2452                    $C$DW$160       .dwtag  DW_TAG_member
    2453                            .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$76)
    2454                            .dwattr $C$DW$160, DW_AT_name("bufferTail")
    2455                            .dwattr $C$DW$160, DW_AT_TI_symbol_name("bufferTail")
    2456                            .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2457                            .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2458                            .dwattr $C$DW$160, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    2459                            .dwattr $C$DW$160, DW_AT_decl_line(0x81)
    2460                            .dwattr $C$DW$160, DW_AT_decl_column(0x13)
    2461                    
    2462                    $C$DW$161       .dwtag  DW_TAG_member
    2463                            .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$20)
    2464                            .dwattr $C$DW$161, DW_AT_name("maxBufSize")
    2465                            .dwattr $C$DW$161, DW_AT_TI_symbol_name("maxBufSize")
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:29 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{50BC86E2-734C-4CC5-8A3A-CC35CB40926B} PAGE   46

    2466                            .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2467                            .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    2468                            .dwattr $C$DW$161, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    2469                            .dwattr $C$DW$161, DW_AT_decl_line(0x82)
    2470                            .dwattr $C$DW$161, DW_AT_decl_column(0x0a)
    2471                    
    2472                    $C$DW$162       .dwtag  DW_TAG_member
    2473                            .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$77)
    2474                            .dwattr $C$DW$162, DW_AT_name("pBuffer")
    2475                            .dwattr $C$DW$162, DW_AT_TI_symbol_name("pBuffer")
    2476                            .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2477                            .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2478                            .dwattr $C$DW$162, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    2479                            .dwattr $C$DW$162, DW_AT_decl_line(0x83)
    2480                            .dwattr $C$DW$162, DW_AT_decl_column(0x0a)
    2481                    
    2482                            .dwattr $C$DW$T$78, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154sta
    2483                            .dwattr $C$DW$T$78, DW_AT_decl_line(0x7e)
    2484                            .dwattr $C$DW$T$78, DW_AT_decl_column(0x01)
    2485                            .dwendtag $C$DW$T$78
    2486                    
    2487                    $C$DW$T$80      .dwtag  DW_TAG_typedef
    2488                            .dwattr $C$DW$T$80, DW_AT_name("halUARTBufControl_t")
    2489                            .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$78)
    2490                            .dwattr $C$DW$T$80, DW_AT_language(DW_LANG_C)
    2491                            .dwattr $C$DW$T$80, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154sta
    2492                            .dwattr $C$DW$T$80, DW_AT_decl_line(0x84)
    2493                            .dwattr $C$DW$T$80, DW_AT_decl_column(0x03)
    2494                    
    2495                    
    2496                    $C$DW$T$84      .dwtag  DW_TAG_structure_type
    2497                            .dwattr $C$DW$T$84, DW_AT_byte_size(0x2c)
    2498                    $C$DW$163       .dwtag  DW_TAG_member
    2499                            .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$79)
    2500                            .dwattr $C$DW$163, DW_AT_name("configured")
    2501                            .dwattr $C$DW$163, DW_AT_TI_symbol_name("configured")
    2502                            .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2503                            .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2504                            .dwattr $C$DW$163, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    2505                            .dwattr $C$DW$163, DW_AT_decl_line(0x88)
    2506                            .dwattr $C$DW$163, DW_AT_decl_column(0x17)
    2507                    
    2508                    $C$DW$164       .dwtag  DW_TAG_member
    2509                            .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$21)
    2510                            .dwattr $C$DW$164, DW_AT_name("baudRate")
    2511                            .dwattr $C$DW$164, DW_AT_TI_symbol_name("baudRate")
    2512                            .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2513                            .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2514                            .dwattr $C$DW$164, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    2515                            .dwattr $C$DW$164, DW_AT_decl_line(0x89)
    2516                            .dwattr $C$DW$164, DW_AT_decl_column(0x17)
    2517                    
    2518                    $C$DW$165       .dwtag  DW_TAG_member
    2519                            .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$79)
    2520                            .dwattr $C$DW$165, DW_AT_name("flowControl")
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:29 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{50BC86E2-734C-4CC5-8A3A-CC35CB40926B} PAGE   47

    2521                            .dwattr $C$DW$165, DW_AT_TI_symbol_name("flowControl")
    2522                            .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2523                            .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2524                            .dwattr $C$DW$165, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    2525                            .dwattr $C$DW$165, DW_AT_decl_line(0x8a)
    2526                            .dwattr $C$DW$165, DW_AT_decl_column(0x17)
    2527                    
    2528                    $C$DW$166       .dwtag  DW_TAG_member
    2529                            .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$20)
    2530                            .dwattr $C$DW$166, DW_AT_name("flowControlThreshold")
    2531                            .dwattr $C$DW$166, DW_AT_TI_symbol_name("flowControlThreshold")
    2532                            .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2533                            .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2534                            .dwattr $C$DW$166, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    2535                            .dwattr $C$DW$166, DW_AT_decl_line(0x8b)
    2536                            .dwattr $C$DW$166, DW_AT_decl_column(0x17)
    2537                    
    2538                    $C$DW$167       .dwtag  DW_TAG_member
    2539                            .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$21)
    2540                            .dwattr $C$DW$167, DW_AT_name("idleTimeout")
    2541                            .dwattr $C$DW$167, DW_AT_TI_symbol_name("idleTimeout")
    2542                            .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2543                            .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2544                            .dwattr $C$DW$167, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    2545                            .dwattr $C$DW$167, DW_AT_decl_line(0x8c)
    2546                            .dwattr $C$DW$167, DW_AT_decl_column(0x17)
    2547                    
    2548                    $C$DW$168       .dwtag  DW_TAG_member
    2549                            .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$80)
    2550                            .dwattr $C$DW$168, DW_AT_name("rx")
    2551                            .dwattr $C$DW$168, DW_AT_TI_symbol_name("rx")
    2552                            .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2553                            .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2554                            .dwattr $C$DW$168, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    2555                            .dwattr $C$DW$168, DW_AT_decl_line(0x8d)
    2556                            .dwattr $C$DW$168, DW_AT_decl_column(0x17)
    2557                    
    2558                    $C$DW$169       .dwtag  DW_TAG_member
    2559                            .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$80)
    2560                            .dwattr $C$DW$169, DW_AT_name("tx")
    2561                            .dwattr $C$DW$169, DW_AT_TI_symbol_name("tx")
    2562                            .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2563                            .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2564                            .dwattr $C$DW$169, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    2565                            .dwattr $C$DW$169, DW_AT_decl_line(0x8e)
    2566                            .dwattr $C$DW$169, DW_AT_decl_column(0x17)
    2567                    
    2568                    $C$DW$170       .dwtag  DW_TAG_member
    2569                            .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$79)
    2570                            .dwattr $C$DW$170, DW_AT_name("intEnable")
    2571                            .dwattr $C$DW$170, DW_AT_TI_symbol_name("intEnable")
    2572                            .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2573                            .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    2574                            .dwattr $C$DW$170, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    2575                            .dwattr $C$DW$170, DW_AT_decl_line(0x8f)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:29 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{50BC86E2-734C-4CC5-8A3A-CC35CB40926B} PAGE   48

    2576                            .dwattr $C$DW$170, DW_AT_decl_column(0x17)
    2577                    
    2578                    $C$DW$171       .dwtag  DW_TAG_member
    2579                            .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$22)
    2580                            .dwattr $C$DW$171, DW_AT_name("rxChRvdTime")
    2581                            .dwattr $C$DW$171, DW_AT_TI_symbol_name("rxChRvdTime")
    2582                            .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2583                            .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    2584                            .dwattr $C$DW$171, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    2585                            .dwattr $C$DW$171, DW_AT_decl_line(0x90)
    2586                            .dwattr $C$DW$171, DW_AT_decl_column(0x17)
    2587                    
    2588                    $C$DW$172       .dwtag  DW_TAG_member
    2589                            .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$83)
    2590                            .dwattr $C$DW$172, DW_AT_name("callBackFunc")
    2591                            .dwattr $C$DW$172, DW_AT_TI_symbol_name("callBackFunc")
    2592                            .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2593                            .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    2594                            .dwattr $C$DW$172, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    2595                            .dwattr $C$DW$172, DW_AT_decl_line(0x91)
    2596                            .dwattr $C$DW$172, DW_AT_decl_column(0x17)
    2597                    
    2598                            .dwattr $C$DW$T$84, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154sta
    2599                            .dwattr $C$DW$T$84, DW_AT_decl_line(0x87)
    2600                            .dwattr $C$DW$T$84, DW_AT_decl_column(0x01)
    2601                            .dwendtag $C$DW$T$84
    2602                    
    2603                    $C$DW$T$196     .dwtag  DW_TAG_typedef
    2604                            .dwattr $C$DW$T$196, DW_AT_name("halUARTCfg_t")
    2605                            .dwattr $C$DW$T$196, DW_AT_type(*$C$DW$T$84)
    2606                            .dwattr $C$DW$T$196, DW_AT_language(DW_LANG_C)
    2607                            .dwattr $C$DW$T$196, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154st
    2608                            .dwattr $C$DW$T$196, DW_AT_decl_line(0x92)
    2609                            .dwattr $C$DW$T$196, DW_AT_decl_column(0x02)
    2610                    
    2611                    
    2612                    $C$DW$T$85      .dwtag  DW_TAG_structure_type
    2613                            .dwattr $C$DW$T$85, DW_AT_byte_size(0x02)
    2614                    $C$DW$173       .dwtag  DW_TAG_member
    2615                            .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$21)
    2616                            .dwattr $C$DW$173, DW_AT_name("event")
    2617                            .dwattr $C$DW$173, DW_AT_TI_symbol_name("event")
    2618                            .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2619                            .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    2620                            .dwattr $C$DW$173, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
    2621                            .dwattr $C$DW$173, DW_AT_decl_line(0x79)
    2622                            .dwattr $C$DW$173, DW_AT_decl_column(0x0a)
    2623                    
    2624                    $C$DW$174       .dwtag  DW_TAG_member
    2625                            .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$21)
    2626                            .dwattr $C$DW$174, DW_AT_name("status")
    2627                            .dwattr $C$DW$174, DW_AT_TI_symbol_name("status")
    2628                            .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2629                            .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    2630                            .dwattr $C$DW$174, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MA
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:29 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{50BC86E2-734C-4CC5-8A3A-CC35CB40926B} PAGE   49

    2631                            .dwattr $C$DW$174, DW_AT_decl_line(0x7a)
    2632                            .dwattr $C$DW$174, DW_AT_decl_column(0x0a)
    2633                    
    2634                            .dwattr $C$DW$T$85, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/M
    2635                            .dwattr $C$DW$T$85, DW_AT_decl_line(0x78)
    2636                            .dwattr $C$DW$T$85, DW_AT_decl_column(0x01)
    2637                            .dwendtag $C$DW$T$85
    2638                    
    2639                    $C$DW$T$86      .dwtag  DW_TAG_typedef
    2640                            .dwattr $C$DW$T$86, DW_AT_name("osal_event_hdr_t")
    2641                            .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$85)
    2642                            .dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)
    2643                            .dwattr $C$DW$T$86, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/M
    2644                            .dwattr $C$DW$T$86, DW_AT_decl_line(0x7b)
    2645                            .dwattr $C$DW$T$86, DW_AT_decl_column(0x03)
    2646                    
    2647                    
    2648                    $C$DW$T$87      .dwtag  DW_TAG_structure_type
    2649                            .dwattr $C$DW$T$87, DW_AT_byte_size(0x04)
    2650                    $C$DW$175       .dwtag  DW_TAG_member
    2651                            .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$86)
    2652                            .dwattr $C$DW$175, DW_AT_name("hdr")
    2653                            .dwattr $C$DW$175, DW_AT_TI_symbol_name("hdr")
    2654                            .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2655                            .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    2656                            .dwattr $C$DW$175, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/examples/rtos/CC131
    2657                            .dwattr $C$DW$175, DW_AT_decl_line(0xbc)
    2658                            .dwattr $C$DW$175, DW_AT_decl_column(0x14)
    2659                    
    2660                    $C$DW$176       .dwtag  DW_TAG_member
    2661                            .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$21)
    2662                            .dwattr $C$DW$176, DW_AT_name("state")
    2663                            .dwattr $C$DW$176, DW_AT_TI_symbol_name("state")
    2664                            .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2665                            .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    2666                            .dwattr $C$DW$176, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/examples/rtos/CC131
    2667                            .dwattr $C$DW$176, DW_AT_decl_line(0xbd)
    2668                            .dwattr $C$DW$176, DW_AT_decl_column(0x09)
    2669                    
    2670                    $C$DW$177       .dwtag  DW_TAG_member
    2671                            .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$21)
    2672                            .dwattr $C$DW$177, DW_AT_name("keys")
    2673                            .dwattr $C$DW$177, DW_AT_TI_symbol_name("keys")
    2674                            .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2675                            .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    2676                            .dwattr $C$DW$177, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/examples/rtos/CC131
    2677                            .dwattr $C$DW$177, DW_AT_decl_line(0xbe)
    2678                            .dwattr $C$DW$177, DW_AT_decl_column(0x09)
    2679                    
    2680                            .dwattr $C$DW$T$87, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/examples/rtos/CC13
    2681                            .dwattr $C$DW$T$87, DW_AT_decl_line(0xbb)
    2682                            .dwattr $C$DW$T$87, DW_AT_decl_column(0x01)
    2683                            .dwendtag $C$DW$T$87
    2684                    
    2685                    $C$DW$T$197     .dwtag  DW_TAG_typedef
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:29 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{50BC86E2-734C-4CC5-8A3A-CC35CB40926B} PAGE   50

    2686                            .dwattr $C$DW$T$197, DW_AT_name("keyChange_t")
    2687                            .dwattr $C$DW$T$197, DW_AT_type(*$C$DW$T$87)
    2688                            .dwattr $C$DW$T$197, DW_AT_language(DW_LANG_C)
    2689                            .dwattr $C$DW$T$197, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/examples/rtos/CC1
    2690                            .dwattr $C$DW$T$197, DW_AT_decl_line(0xbf)
    2691                            .dwattr $C$DW$T$197, DW_AT_decl_column(0x03)
    2692                    
    2693                    
    2694                    $C$DW$T$90      .dwtag  DW_TAG_union_type
    2695                            .dwattr $C$DW$T$90, DW_AT_byte_size(0x04)
    2696                    $C$DW$178       .dwtag  DW_TAG_member
    2697                            .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$22)
    2698                            .dwattr $C$DW$178, DW_AT_name("time32")
    2699                            .dwattr $C$DW$178, DW_AT_TI_symbol_name("time32")
    2700                            .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2701                            .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    2702                            .dwattr $C$DW$178, DW_AT_decl_file("../Application/MAC/OSAL/osal_timers.c")
    2703                            .dwattr $C$DW$178, DW_AT_decl_line(0x46)
    2704                            .dwattr $C$DW$178, DW_AT_decl_column(0x0a)
    2705                    
    2706                    $C$DW$179       .dwtag  DW_TAG_member
    2707                            .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$88)
    2708                            .dwattr $C$DW$179, DW_AT_name("time16")
    2709                            .dwattr $C$DW$179, DW_AT_TI_symbol_name("time16")
    2710                            .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2711                            .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    2712                            .dwattr $C$DW$179, DW_AT_decl_file("../Application/MAC/OSAL/osal_timers.c")
    2713                            .dwattr $C$DW$179, DW_AT_decl_line(0x47)
    2714                            .dwattr $C$DW$179, DW_AT_decl_column(0x0a)
    2715                    
    2716                    $C$DW$180       .dwtag  DW_TAG_member
    2717                            .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$89)
    2718                            .dwattr $C$DW$180, DW_AT_name("time8")
    2719                            .dwattr $C$DW$180, DW_AT_TI_symbol_name("time8")
    2720                            .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2721                            .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    2722                            .dwattr $C$DW$180, DW_AT_decl_file("../Application/MAC/OSAL/osal_timers.c")
    2723                            .dwattr $C$DW$180, DW_AT_decl_line(0x48)
    2724                            .dwattr $C$DW$180, DW_AT_decl_column(0x09)
    2725                    
    2726                            .dwattr $C$DW$T$90, DW_AT_decl_file("../Application/MAC/OSAL/osal_timers.c")
    2727                            .dwattr $C$DW$T$90, DW_AT_decl_line(0x45)
    2728                            .dwattr $C$DW$T$90, DW_AT_decl_column(0x0f)
    2729                            .dwendtag $C$DW$T$90
    2730                    
    2731                    $C$DW$T$19      .dwtag  DW_TAG_typedef
    2732                            .dwattr $C$DW$T$19, DW_AT_name("osalTime_t")
    2733                            .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$90)
    2734                            .dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
    2735                            .dwattr $C$DW$T$19, DW_AT_decl_file("../Application/MAC/OSAL/osal_timers.c")
    2736                            .dwattr $C$DW$T$19, DW_AT_decl_line(0x49)
    2737                            .dwattr $C$DW$T$19, DW_AT_decl_column(0x03)
    2738                    
    2739                    
    2740                    $C$DW$T$95      .dwtag  DW_TAG_union_type
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:29 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{50BC86E2-734C-4CC5-8A3A-CC35CB40926B} PAGE   51

    2741                            .dwattr $C$DW$T$95, DW_AT_byte_size(0x02)
    2742                    $C$DW$181       .dwtag  DW_TAG_member
    2743                            .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$92)
    2744                            .dwattr $C$DW$181, DW_AT_name("entityId")
    2745                            .dwattr $C$DW$181, DW_AT_TI_symbol_name("entityId")
    2746                            .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2747                            .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    2748                            .dwattr $C$DW$181, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    2749                            .dwattr $C$DW$181, DW_AT_decl_line(0x1fe)
    2750                            .dwattr $C$DW$181, DW_AT_decl_column(0x14)
    2751                    
    2752                    $C$DW$182       .dwtag  DW_TAG_member
    2753                            .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$94)
    2754                            .dwattr $C$DW$182, DW_AT_name("servId")
    2755                            .dwattr $C$DW$182, DW_AT_TI_symbol_name("servId")
    2756                            .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2757                            .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    2758                            .dwattr $C$DW$182, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    2759                            .dwattr $C$DW$182, DW_AT_decl_line(0x200)
    2760                            .dwattr $C$DW$182, DW_AT_decl_column(0x17)
    2761                    
    2762                            .dwattr $C$DW$T$95, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154sta
    2763                            .dwattr $C$DW$T$95, DW_AT_decl_line(0x1fc)
    2764                            .dwattr $C$DW$T$95, DW_AT_decl_column(0x03)
    2765                            .dwendtag $C$DW$T$95
    2766                    
    2767                    
    2768                    $C$DW$T$96      .dwtag  DW_TAG_union_type
    2769                            .dwattr $C$DW$T$96, DW_AT_byte_size(0x02)
    2770                    $C$DW$183       .dwtag  DW_TAG_member
    2771                            .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$94)
    2772                            .dwattr $C$DW$183, DW_AT_name("servId")
    2773                            .dwattr $C$DW$183, DW_AT_TI_symbol_name("servId")
    2774                            .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2775                            .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    2776                            .dwattr $C$DW$183, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    2777                            .dwattr $C$DW$183, DW_AT_decl_line(0x211)
    2778                            .dwattr $C$DW$183, DW_AT_decl_column(0x17)
    2779                    
    2780                    $C$DW$184       .dwtag  DW_TAG_member
    2781                            .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$92)
    2782                            .dwattr $C$DW$184, DW_AT_name("entityId")
    2783                            .dwattr $C$DW$184, DW_AT_TI_symbol_name("entityId")
    2784                            .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2785                            .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    2786                            .dwattr $C$DW$184, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    2787                            .dwattr $C$DW$184, DW_AT_decl_line(0x213)
    2788                            .dwattr $C$DW$184, DW_AT_decl_column(0x14)
    2789                    
    2790                            .dwattr $C$DW$T$96, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154sta
    2791                            .dwattr $C$DW$T$96, DW_AT_decl_line(0x20f)
    2792                            .dwattr $C$DW$T$96, DW_AT_decl_column(0x03)
    2793                            .dwendtag $C$DW$T$96
    2794                    
    2795                    
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:29 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{50BC86E2-734C-4CC5-8A3A-CC35CB40926B} PAGE   52

    2796                    $C$DW$T$97      .dwtag  DW_TAG_union_type
    2797                            .dwattr $C$DW$T$97, DW_AT_byte_size(0x02)
    2798                    $C$DW$185       .dwtag  DW_TAG_member
    2799                            .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$79)
    2800                            .dwattr $C$DW$185, DW_AT_name("paramCTS")
    2801                            .dwattr $C$DW$185, DW_AT_TI_symbol_name("paramCTS")
    2802                            .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2803                            .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    2804                            .dwattr $C$DW$185, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    2805                            .dwattr $C$DW$185, DW_AT_decl_line(0x96)
    2806                            .dwattr $C$DW$185, DW_AT_decl_column(0x08)
    2807                    
    2808                    $C$DW$186       .dwtag  DW_TAG_member
    2809                            .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$79)
    2810                            .dwattr $C$DW$186, DW_AT_name("paramRTS")
    2811                            .dwattr $C$DW$186, DW_AT_TI_symbol_name("paramRTS")
    2812                            .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2813                            .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    2814                            .dwattr $C$DW$186, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    2815                            .dwattr $C$DW$186, DW_AT_decl_line(0x97)
    2816                            .dwattr $C$DW$186, DW_AT_decl_column(0x08)
    2817                    
    2818                    $C$DW$187       .dwtag  DW_TAG_member
    2819                            .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$79)
    2820                            .dwattr $C$DW$187, DW_AT_name("paramDSR")
    2821                            .dwattr $C$DW$187, DW_AT_TI_symbol_name("paramDSR")
    2822                            .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2823                            .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    2824                            .dwattr $C$DW$187, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    2825                            .dwattr $C$DW$187, DW_AT_decl_line(0x98)
    2826                            .dwattr $C$DW$187, DW_AT_decl_column(0x08)
    2827                    
    2828                    $C$DW$188       .dwtag  DW_TAG_member
    2829                            .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$79)
    2830                            .dwattr $C$DW$188, DW_AT_name("paramDTR")
    2831                            .dwattr $C$DW$188, DW_AT_TI_symbol_name("paramDTR")
    2832                            .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2833                            .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    2834                            .dwattr $C$DW$188, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    2835                            .dwattr $C$DW$188, DW_AT_decl_line(0x99)
    2836                            .dwattr $C$DW$188, DW_AT_decl_column(0x08)
    2837                    
    2838                    $C$DW$189       .dwtag  DW_TAG_member
    2839                            .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$79)
    2840                            .dwattr $C$DW$189, DW_AT_name("paramCD")
    2841                            .dwattr $C$DW$189, DW_AT_TI_symbol_name("paramCD")
    2842                            .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2843                            .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    2844                            .dwattr $C$DW$189, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    2845                            .dwattr $C$DW$189, DW_AT_decl_line(0x9a)
    2846                            .dwattr $C$DW$189, DW_AT_decl_column(0x08)
    2847                    
    2848                    $C$DW$190       .dwtag  DW_TAG_member
    2849                            .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$79)
    2850                            .dwattr $C$DW$190, DW_AT_name("paramRI")
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:29 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{50BC86E2-734C-4CC5-8A3A-CC35CB40926B} PAGE   53

    2851                            .dwattr $C$DW$190, DW_AT_TI_symbol_name("paramRI")
    2852                            .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2853                            .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    2854                            .dwattr $C$DW$190, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    2855                            .dwattr $C$DW$190, DW_AT_decl_line(0x9b)
    2856                            .dwattr $C$DW$190, DW_AT_decl_column(0x08)
    2857                    
    2858                    $C$DW$191       .dwtag  DW_TAG_member
    2859                            .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$20)
    2860                            .dwattr $C$DW$191, DW_AT_name("baudRate")
    2861                            .dwattr $C$DW$191, DW_AT_TI_symbol_name("baudRate")
    2862                            .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2863                            .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    2864                            .dwattr $C$DW$191, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    2865                            .dwattr $C$DW$191, DW_AT_decl_line(0x9c)
    2866                            .dwattr $C$DW$191, DW_AT_decl_column(0x0a)
    2867                    
    2868                    $C$DW$192       .dwtag  DW_TAG_member
    2869                            .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$79)
    2870                            .dwattr $C$DW$192, DW_AT_name("flowControl")
    2871                            .dwattr $C$DW$192, DW_AT_TI_symbol_name("flowControl")
    2872                            .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2873                            .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    2874                            .dwattr $C$DW$192, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    2875                            .dwattr $C$DW$192, DW_AT_decl_line(0x9d)
    2876                            .dwattr $C$DW$192, DW_AT_decl_column(0x08)
    2877                    
    2878                    $C$DW$193       .dwtag  DW_TAG_member
    2879                            .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$79)
    2880                            .dwattr $C$DW$193, DW_AT_name("flushControl")
    2881                            .dwattr $C$DW$193, DW_AT_TI_symbol_name("flushControl")
    2882                            .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2883                            .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    2884                            .dwattr $C$DW$193, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    2885                            .dwattr $C$DW$193, DW_AT_decl_line(0x9e)
    2886                            .dwattr $C$DW$193, DW_AT_decl_column(0x08)
    2887                    
    2888                            .dwattr $C$DW$T$97, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154sta
    2889                            .dwattr $C$DW$T$97, DW_AT_decl_line(0x95)
    2890                            .dwattr $C$DW$T$97, DW_AT_decl_column(0x01)
    2891                            .dwendtag $C$DW$T$97
    2892                    
    2893                    $C$DW$T$199     .dwtag  DW_TAG_typedef
    2894                            .dwattr $C$DW$T$199, DW_AT_name("halUARTIoctl_t")
    2895                            .dwattr $C$DW$T$199, DW_AT_type(*$C$DW$T$97)
    2896                            .dwattr $C$DW$T$199, DW_AT_language(DW_LANG_C)
    2897                            .dwattr $C$DW$T$199, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154st
    2898                            .dwattr $C$DW$T$199, DW_AT_decl_line(0x9f)
    2899                            .dwattr $C$DW$T$199, DW_AT_decl_column(0x02)
    2900                    
    2901                    
    2902                    $C$DW$T$99      .dwtag  DW_TAG_structure_type
    2903                            .dwattr $C$DW$T$99, DW_AT_name(".ggroup1")
    2904                            .dwattr $C$DW$T$99, DW_AT_byte_size(0x08)
    2905                    $C$DW$194       .dwtag  DW_TAG_member
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:29 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{50BC86E2-734C-4CC5-8A3A-CC35CB40926B} PAGE   54

    2906                            .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$98)
    2907                            .dwattr $C$DW$194, DW_AT_name("timerHead")
    2908                            .dwattr $C$DW$194, DW_AT_TI_symbol_name("timerHead")
    2909                            .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2910                            .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    2911                    
    2912                    $C$DW$195       .dwtag  DW_TAG_member
    2913                            .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$11)
    2914                            .dwattr $C$DW$195, DW_AT_name("osal_systemClock")
    2915                            .dwattr $C$DW$195, DW_AT_TI_symbol_name("osal_systemClock")
    2916                            .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2917                            .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    2918                    
    2919                            .dwendtag $C$DW$T$99
    2920                    
    2921                    
    2922                    $C$DW$T$100     .dwtag  DW_TAG_structure_type
    2923                            .dwattr $C$DW$T$100, DW_AT_name("_ICall_LiteCmdStatus_")
    2924                            .dwattr $C$DW$T$100, DW_AT_byte_size(0x01)
    2925                    $C$DW$196       .dwtag  DW_TAG_member
    2926                            .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$91)
    2927                            .dwattr $C$DW$196, DW_AT_name("cmdId")
    2928                            .dwattr $C$DW$196, DW_AT_TI_symbol_name("cmdId")
    2929                            .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2930                            .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    2931                            .dwattr $C$DW$196, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    2932                            .dwattr $C$DW$196, DW_AT_decl_line(0x3f0)
    2933                            .dwattr $C$DW$196, DW_AT_decl_column(0x11)
    2934                    
    2935                            .dwattr $C$DW$T$100, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154st
    2936                            .dwattr $C$DW$T$100, DW_AT_decl_line(0x3ee)
    2937                            .dwattr $C$DW$T$100, DW_AT_decl_column(0x10)
    2938                            .dwendtag $C$DW$T$100
    2939                    
    2940                    $C$DW$T$201     .dwtag  DW_TAG_typedef
    2941                            .dwattr $C$DW$T$201, DW_AT_name("ICall_LiteCmdStatus")
    2942                            .dwattr $C$DW$T$201, DW_AT_type(*$C$DW$T$100)
    2943                            .dwattr $C$DW$T$201, DW_AT_language(DW_LANG_C)
    2944                            .dwattr $C$DW$T$201, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154st
    2945                            .dwattr $C$DW$T$201, DW_AT_decl_line(0x3f1)
    2946                            .dwattr $C$DW$T$201, DW_AT_decl_column(0x03)
    2947                    
    2948                    $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    2949                            .dwattr $C$DW$T$2, DW_AT_name("void")
    2950                    
    2951                    $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    2952                            .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
    2953                            .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
    2954                    
    2955                    $C$DW$T$202     .dwtag  DW_TAG_typedef
    2956                            .dwattr $C$DW$T$202, DW_AT_name("ICall_Semaphore")
    2957                            .dwattr $C$DW$T$202, DW_AT_type(*$C$DW$T$3)
    2958                            .dwattr $C$DW$T$202, DW_AT_language(DW_LANG_C)
    2959                            .dwattr $C$DW$T$202, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154st
    2960                            .dwattr $C$DW$T$202, DW_AT_decl_line(0x1ac)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:29 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{50BC86E2-734C-4CC5-8A3A-CC35CB40926B} PAGE   55

    2961                            .dwattr $C$DW$T$202, DW_AT_decl_column(0x0f)
    2962                    
    2963                    $C$DW$T$114     .dwtag  DW_TAG_typedef
    2964                            .dwattr $C$DW$T$114, DW_AT_name("ICall_SyncHandle")
    2965                            .dwattr $C$DW$T$114, DW_AT_type(*$C$DW$T$3)
    2966                            .dwattr $C$DW$T$114, DW_AT_language(DW_LANG_C)
    2967                            .dwattr $C$DW$T$114, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154st
    2968                            .dwattr $C$DW$T$114, DW_AT_decl_line(0x1aa)
    2969                            .dwattr $C$DW$T$114, DW_AT_decl_column(0x0f)
    2970                    
    2971                    $C$DW$T$158     .dwtag  DW_TAG_typedef
    2972                            .dwattr $C$DW$T$158, DW_AT_name("ICall_TimerID")
    2973                            .dwattr $C$DW$T$158, DW_AT_type(*$C$DW$T$3)
    2974                            .dwattr $C$DW$T$158, DW_AT_language(DW_LANG_C)
    2975                            .dwattr $C$DW$T$158, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154st
    2976                            .dwattr $C$DW$T$158, DW_AT_decl_line(0x1b7)
    2977                            .dwattr $C$DW$T$158, DW_AT_decl_column(0x0f)
    2978                    
    2979                    $C$DW$T$206     .dwtag  DW_TAG_typedef
    2980                            .dwattr $C$DW$T$206, DW_AT_name("osal_msg_q_t")
    2981                            .dwattr $C$DW$T$206, DW_AT_type(*$C$DW$T$3)
    2982                            .dwattr $C$DW$T$206, DW_AT_language(DW_LANG_C)
    2983                            .dwattr $C$DW$T$206, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/
    2984                            .dwattr $C$DW$T$206, DW_AT_decl_line(0x7d)
    2985                            .dwattr $C$DW$T$206, DW_AT_decl_column(0x10)
    2986                    
    2987                    
    2988                    $C$DW$T$39      .dwtag  DW_TAG_subroutine_type
    2989                            .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    2990                            .dwendtag $C$DW$T$39
    2991                    
    2992                    $C$DW$T$40      .dwtag  DW_TAG_pointer_type
    2993                            .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$39)
    2994                            .dwattr $C$DW$T$40, DW_AT_address_class(0x20)
    2995                    
    2996                    $C$DW$T$174     .dwtag  DW_TAG_typedef
    2997                            .dwattr $C$DW$T$174, DW_AT_name("APPASRTINTF_callAssrtHndler")
    2998                            .dwattr $C$DW$T$174, DW_AT_type(*$C$DW$T$40)
    2999                            .dwattr $C$DW$T$174, DW_AT_language(DW_LANG_C)
    3000                            .dwattr $C$DW$T$174, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154st
    3001                            .dwattr $C$DW$T$174, DW_AT_decl_line(0x43)
    3002                            .dwattr $C$DW$T$174, DW_AT_decl_column(0x10)
    3003                    
    3004                    $C$DW$T$58      .dwtag  DW_TAG_typedef
    3005                            .dwattr $C$DW$T$58, DW_AT_name("FPTR_HFSOURCESAFESWITCH_T")
    3006                            .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$40)
    3007                            .dwattr $C$DW$T$58, DW_AT_language(DW_LANG_C)
    3008                            .dwattr $C$DW$T$58, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\
    3009                            .dwattr $C$DW$T$58, DW_AT_decl_line(0x5f)
    3010                            .dwattr $C$DW$T$58, DW_AT_decl_column(0x19)
    3011                    
    3012                    $C$DW$T$41      .dwtag  DW_TAG_typedef
    3013                            .dwattr $C$DW$T$41, DW_AT_name("FPTR_RESETDEV_T")
    3014                            .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$40)
    3015                            .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:29 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{50BC86E2-734C-4CC5-8A3A-CC35CB40926B} PAGE   56

    3016                            .dwattr $C$DW$T$41, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\
    3017                            .dwattr $C$DW$T$41, DW_AT_decl_line(0x4d)
    3018                            .dwattr $C$DW$T$41, DW_AT_decl_column(0x19)
    3019                    
    3020                    $C$DW$T$207     .dwtag  DW_TAG_typedef
    3021                            .dwattr $C$DW$T$207, DW_AT_name("FPTR_VOID_VOID_T")
    3022                            .dwattr $C$DW$T$207, DW_AT_type(*$C$DW$T$40)
    3023                            .dwattr $C$DW$T$207, DW_AT_language(DW_LANG_C)
    3024                            .dwattr $C$DW$T$207, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices
    3025                            .dwattr $C$DW$T$207, DW_AT_decl_line(0x33)
    3026                            .dwattr $C$DW$T$207, DW_AT_decl_column(0x11)
    3027                    
    3028                    $C$DW$T$208     .dwtag  DW_TAG_typedef
    3029                            .dwattr $C$DW$T$208, DW_AT_name("__TI_atexit_fn")
    3030                            .dwattr $C$DW$T$208, DW_AT_type(*$C$DW$T$40)
    3031                            .dwattr $C$DW$T$208, DW_AT_language(DW_LANG_C)
    3032                            .dwattr $C$DW$T$208, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include
    3033                            .dwattr $C$DW$T$208, DW_AT_decl_line(0xb9)
    3034                            .dwattr $C$DW$T$208, DW_AT_decl_column(0x14)
    3035                    
    3036                    
    3037                    $C$DW$T$54      .dwtag  DW_TAG_subroutine_type
    3038                            .dwattr $C$DW$T$54, DW_AT_language(DW_LANG_C)
    3039                    $C$DW$197       .dwtag  DW_TAG_formal_parameter
    3040                            .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$24)
    3041                    
    3042                            .dwendtag $C$DW$T$54
    3043                    
    3044                    $C$DW$T$55      .dwtag  DW_TAG_pointer_type
    3045                            .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$54)
    3046                            .dwattr $C$DW$T$55, DW_AT_address_class(0x20)
    3047                    
    3048                    $C$DW$T$56      .dwtag  DW_TAG_typedef
    3049                            .dwattr $C$DW$T$56, DW_AT_name("FPTR_RESERVED4_T")
    3050                            .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$55)
    3051                            .dwattr $C$DW$T$56, DW_AT_language(DW_LANG_C)
    3052                            .dwattr $C$DW$T$56, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\
    3053                            .dwattr $C$DW$T$56, DW_AT_decl_line(0x61)
    3054                            .dwattr $C$DW$T$56, DW_AT_decl_column(0x19)
    3055                    
    3056                    $C$DW$T$57      .dwtag  DW_TAG_typedef
    3057                            .dwattr $C$DW$T$57, DW_AT_name("FPTR_RESERVED5_T")
    3058                            .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$55)
    3059                            .dwattr $C$DW$T$57, DW_AT_language(DW_LANG_C)
    3060                            .dwattr $C$DW$T$57, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\
    3061                            .dwattr $C$DW$T$57, DW_AT_decl_line(0x63)
    3062                            .dwattr $C$DW$T$57, DW_AT_decl_column(0x19)
    3063                    
    3064                    
    3065                    $C$DW$T$59      .dwtag  DW_TAG_subroutine_type
    3066                            .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
    3067                    $C$DW$198       .dwtag  DW_TAG_formal_parameter
    3068                            .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$25)
    3069                    
    3070                            .dwendtag $C$DW$T$59
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:29 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{50BC86E2-734C-4CC5-8A3A-CC35CB40926B} PAGE   57

    3071                    
    3072                    $C$DW$T$60      .dwtag  DW_TAG_pointer_type
    3073                            .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$59)
    3074                            .dwattr $C$DW$T$60, DW_AT_address_class(0x20)
    3075                    
    3076                    $C$DW$T$63      .dwtag  DW_TAG_typedef
    3077                            .dwattr $C$DW$T$63, DW_AT_name("FPTR_ADCCOMPBIN_T")
    3078                            .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$60)
    3079                            .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
    3080                            .dwattr $C$DW$T$63, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\
    3081                            .dwattr $C$DW$T$63, DW_AT_decl_line(0x69)
    3082                            .dwattr $C$DW$T$63, DW_AT_decl_column(0x19)
    3083                    
    3084                    $C$DW$T$61      .dwtag  DW_TAG_typedef
    3085                            .dwattr $C$DW$T$61, DW_AT_name("FPTR_COMPAIN_T")
    3086                            .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$60)
    3087                            .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
    3088                            .dwattr $C$DW$T$61, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\
    3089                            .dwattr $C$DW$T$61, DW_AT_decl_line(0x65)
    3090                            .dwattr $C$DW$T$61, DW_AT_decl_column(0x19)
    3091                    
    3092                    $C$DW$T$62      .dwtag  DW_TAG_typedef
    3093                            .dwattr $C$DW$T$62, DW_AT_name("FPTR_COMPAREF_T")
    3094                            .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$60)
    3095                            .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
    3096                            .dwattr $C$DW$T$62, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\
    3097                            .dwattr $C$DW$T$62, DW_AT_decl_line(0x67)
    3098                            .dwattr $C$DW$T$62, DW_AT_decl_column(0x19)
    3099                    
