TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:28 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{AA9CD641-63C2-49DB-BD5C-18956368E504} PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                        PC v16.9.4.LTS *
       3                    ;* Date/Time created: Sat Nov 18 18:46:28 2017                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../Application/MAC/OSAL/osal_pwrmgr.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v16.9.4.LTS Copyright (c) 1996-20
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Kevin\workspace_v7\sensor_cc1310lp\sensor_cc1310lp"
      13                    $C$DW$1 .dwtag  DW_TAG_variable
      14                            .dwattr $C$DW$1, DW_AT_name("ICall_dispatcher")

     594                            .dwattr $C$DW$T$172, DW_AT_type(*$C$DW$T$171)
     595                            .dwattr $C$DW$T$172, DW_AT_language(DW_LANG_C)
     596                            .dwattr $C$DW$T$172, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices
     597                            .dwattr $C$DW$T$172, DW_AT_decl_line(0xb0)
     598                            .dwattr $C$DW$T$172, DW_AT_decl_column(0x03)
     599                    
     600                    
     601                    $C$DW$T$173     .dwtag  DW_TAG_enumeration_type
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:28 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{AA9CD641-63C2-49DB-BD5C-18956368E504} PAGE   12

     602                            .dwattr $C$DW$T$173, DW_AT_byte_size(0x01)
     603                    $C$DW$39        .dwtag  DW_TAG_enumerator
     604                            .dwattr $C$DW$39, DW_AT_name("ICALL_RTI_APP_CMD_EVENT")
     605                            .dwattr $C$DW$39, DW_AT_const_value(0xe0)
     606                            .dwattr $C$DW$39, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stack
     607                            .dwattr $C$DW$39, DW_AT_decl_line(0x3de)
     608                            .dwattr $C$DW$39, DW_AT_decl_column(0x04)
     609                    
     610                    $C$DW$40        .dwtag  DW_TAG_enumerator
     611                            .dwattr $C$DW$40, DW_AT_name("ICALL_RTI_STACK_CMD_EVENT")
     612                            .dwattr $C$DW$40, DW_AT_const_value(0xe1)
     613                            .dwattr $C$DW$40, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stack
     614                            .dwattr $C$DW$40, DW_AT_decl_line(0x3e0)
     615                            .dwattr $C$DW$40, DW_AT_decl_column(0x04)
     616                    
     617                    $C$DW$41        .dwtag  DW_TAG_enumerator
     618                            .dwattr $C$DW$41, DW_AT_name("ICALL_RTI_APP_ASYNC_CMD_EVENT")
     619                            .dwattr $C$DW$41, DW_AT_const_value(0xe2)
     620                            .dwattr $C$DW$41, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stack
     621                            .dwattr $C$DW$41, DW_AT_decl_line(0x3e2)
     622                            .dwattr $C$DW$41, DW_AT_decl_column(0x04)
     623                    
     624                    $C$DW$42        .dwtag  DW_TAG_enumerator
     625                            .dwattr $C$DW$42, DW_AT_name("ICALL_RTI_APP_SYNC_CMD_EVENT")
     626                            .dwattr $C$DW$42, DW_AT_const_value(0xe3)
     627                            .dwattr $C$DW$42, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stack
     628                            .dwattr $C$DW$42, DW_AT_decl_line(0x3e4)
     629                            .dwattr $C$DW$42, DW_AT_decl_column(0x04)
     630                    
     631                    $C$DW$43        .dwtag  DW_TAG_enumerator
     632                            .dwattr $C$DW$43, DW_AT_name("ICALL_RCN_APP_ASYNC_CMD_EVENT")
     633                            .dwattr $C$DW$43, DW_AT_const_value(0xe4)
     634                            .dwattr $C$DW$43, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stack
     635                            .dwattr $C$DW$43, DW_AT_decl_line(0x3e6)
     636                            .dwattr $C$DW$43, DW_AT_decl_column(0x04)
     637                    
     638                    $C$DW$44        .dwtag  DW_TAG_enumerator
     639                            .dwattr $C$DW$44, DW_AT_name("ICALL_RCN_APP_SYNC_CMD_EVENT")
     640                            .dwattr $C$DW$44, DW_AT_const_value(0xe5)
     641                            .dwattr $C$DW$44, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stack
     642                            .dwattr $C$DW$44, DW_AT_decl_line(0x3e8)
     643                            .dwattr $C$DW$44, DW_AT_decl_column(0x04)
     644                    
     645                            .dwattr $C$DW$T$173, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154st
     646                            .dwattr $C$DW$T$173, DW_AT_decl_line(0x3dc)
     647                            .dwattr $C$DW$T$173, DW_AT_decl_column(0x01)
     648                            .dwendtag $C$DW$T$173
     649                    
     650                    $C$DW$T$174     .dwtag  DW_TAG_typedef
     651                            .dwattr $C$DW$T$174, DW_AT_name("ICall_RemotiCmdEvent_t")
     652                            .dwattr $C$DW$T$174, DW_AT_type(*$C$DW$T$173)
     653                            .dwattr $C$DW$T$174, DW_AT_language(DW_LANG_C)
     654                            .dwattr $C$DW$T$174, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154st
     655                            .dwattr $C$DW$T$174, DW_AT_decl_line(0x3e9)
     656                            .dwattr $C$DW$T$174, DW_AT_decl_column(0x02)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:28 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{AA9CD641-63C2-49DB-BD5C-18956368E504} PAGE   13

     657                    
     658                    
     659                    $C$DW$T$20      .dwtag  DW_TAG_structure_type
     660                            .dwattr $C$DW$T$20, DW_AT_byte_size(0x02)
     661                    $C$DW$45        .dwtag  DW_TAG_member
     662                            .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$19)
     663                            .dwattr $C$DW$45, DW_AT_name("pwrmgr_task_state")
     664                            .dwattr $C$DW$45, DW_AT_TI_symbol_name("pwrmgr_task_state")
     665                            .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     666                            .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     667                            .dwattr $C$DW$45, DW_AT_decl_file("..\Application\MAC\OSAL\osal_pwrmgr.h")
     668                            .dwattr $C$DW$45, DW_AT_decl_line(0x48)
     669                            .dwattr $C$DW$45, DW_AT_decl_column(0x0a)
     670                    
     671                            .dwattr $C$DW$T$20, DW_AT_decl_file("..\Application\MAC\OSAL\osal_pwrmgr.h")
     672                            .dwattr $C$DW$T$20, DW_AT_decl_line(0x47)
     673                            .dwattr $C$DW$T$20, DW_AT_decl_column(0x01)
     674                            .dwendtag $C$DW$T$20
     675                    
     676                    $C$DW$T$176     .dwtag  DW_TAG_typedef
     677                            .dwattr $C$DW$T$176, DW_AT_name("pwrmgr_attribute_t")
     678                            .dwattr $C$DW$T$176, DW_AT_type(*$C$DW$T$20)
     679                            .dwattr $C$DW$T$176, DW_AT_language(DW_LANG_C)
     680                            .dwattr $C$DW$T$176, DW_AT_decl_file("..\Application\MAC\OSAL\osal_pwrmgr.h")
     681                            .dwattr $C$DW$T$176, DW_AT_decl_line(0x4e)
     682                            .dwattr $C$DW$T$176, DW_AT_decl_column(0x03)
     683                    
     684                    
     685                    $C$DW$T$62      .dwtag  DW_TAG_structure_type
     686                            .dwattr $C$DW$T$62, DW_AT_byte_size(0x4c)
     687                    $C$DW$46        .dwtag  DW_TAG_member
     688                            .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$26)
     689                            .dwattr $C$DW$46, DW_AT_name("Crc32")
     690                            .dwattr $C$DW$46, DW_AT_TI_symbol_name("Crc32")
     691                            .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     692                            .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     693                            .dwattr $C$DW$46, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\cc
     694                            .dwattr $C$DW$46, DW_AT_decl_line(0x76)
     695                            .dwattr $C$DW$46, DW_AT_decl_column(0x25)
     696                    
     697                    $C$DW$47        .dwtag  DW_TAG_member
     698                            .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$29)
     699                            .dwattr $C$DW$47, DW_AT_name("FlashGetSize")
     700                            .dwattr $C$DW$47, DW_AT_TI_symbol_name("FlashGetSize")
     701                            .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     702                            .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     703                            .dwattr $C$DW$47, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\cc
     704                            .dwattr $C$DW$47, DW_AT_decl_line(0x77)
     705                            .dwattr $C$DW$47, DW_AT_decl_column(0x25)
     706                    
     707                    $C$DW$48        .dwtag  DW_TAG_member
     708                            .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$30)
     709                            .dwattr $C$DW$48, DW_AT_name("GetChipId")
     710                            .dwattr $C$DW$48, DW_AT_TI_symbol_name("GetChipId")
     711                            .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:28 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{AA9CD641-63C2-49DB-BD5C-18956368E504} PAGE   14

     712                            .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     713                            .dwattr $C$DW$48, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\cc
     714                            .dwattr $C$DW$48, DW_AT_decl_line(0x78)
     715                            .dwattr $C$DW$48, DW_AT_decl_column(0x25)
     716                    
     717                    $C$DW$49        .dwtag  DW_TAG_member
     718                            .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$33)
     719                            .dwattr $C$DW$49, DW_AT_name("ReservedLocation1")
     720                            .dwattr $C$DW$49, DW_AT_TI_symbol_name("ReservedLocation1")
     721                            .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     722                            .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     723                            .dwattr $C$DW$49, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\cc
     724                            .dwattr $C$DW$49, DW_AT_decl_line(0x79)
     725                            .dwattr $C$DW$49, DW_AT_decl_column(0x25)
     726                    
     727                    $C$DW$50        .dwtag  DW_TAG_member
     728                            .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$34)
     729                            .dwattr $C$DW$50, DW_AT_name("ReservedLocation2")
     730                            .dwattr $C$DW$50, DW_AT_TI_symbol_name("ReservedLocation2")
     731                            .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     732                            .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     733                            .dwattr $C$DW$50, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\cc
     734                            .dwattr $C$DW$50, DW_AT_decl_line(0x7a)
     735                            .dwattr $C$DW$50, DW_AT_decl_column(0x25)
     736                    
     737                    $C$DW$51        .dwtag  DW_TAG_member
     738                            .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$35)
     739                            .dwattr $C$DW$51, DW_AT_name("ReservedLocation3")
     740                            .dwattr $C$DW$51, DW_AT_TI_symbol_name("ReservedLocation3")
     741                            .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
     742                            .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     743                            .dwattr $C$DW$51, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\cc
     744                            .dwattr $C$DW$51, DW_AT_decl_line(0x7b)
     745                            .dwattr $C$DW$51, DW_AT_decl_column(0x25)
     746                    
     747                    $C$DW$52        .dwtag  DW_TAG_member
     748                            .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$38)
     749                            .dwattr $C$DW$52, DW_AT_name("ResetDevice")
     750                            .dwattr $C$DW$52, DW_AT_TI_symbol_name("ResetDevice")
     751                            .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
     752                            .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     753                            .dwattr $C$DW$52, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\cc
     754                            .dwattr $C$DW$52, DW_AT_decl_line(0x7c)
     755                            .dwattr $C$DW$52, DW_AT_decl_column(0x25)
     756                    
     757                    $C$DW$53        .dwtag  DW_TAG_member
     758                            .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$43)
     759                            .dwattr $C$DW$53, DW_AT_name("Fletcher32")
     760                            .dwattr $C$DW$53, DW_AT_TI_symbol_name("Fletcher32")
     761                            .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
     762                            .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     763                            .dwattr $C$DW$53, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\cc
     764                            .dwattr $C$DW$53, DW_AT_decl_line(0x7d)
     765                            .dwattr $C$DW$53, DW_AT_decl_column(0x25)
     766                    
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:28 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{AA9CD641-63C2-49DB-BD5C-18956368E504} PAGE   15

     767                    $C$DW$54        .dwtag  DW_TAG_member
     768                            .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$47)
     769                            .dwattr $C$DW$54, DW_AT_name("MinValue")
     770                            .dwattr $C$DW$54, DW_AT_TI_symbol_name("MinValue")
     771                            .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
     772                            .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     773                            .dwattr $C$DW$54, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\cc
     774                            .dwattr $C$DW$54, DW_AT_decl_line(0x7e)
     775                            .dwattr $C$DW$54, DW_AT_decl_column(0x25)
     776                    
     777                    $C$DW$55        .dwtag  DW_TAG_member
     778                            .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$48)
     779                            .dwattr $C$DW$55, DW_AT_name("MaxValue")
     780                            .dwattr $C$DW$55, DW_AT_TI_symbol_name("MaxValue")
     781                            .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
     782                            .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     783                            .dwattr $C$DW$55, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\cc
     784                            .dwattr $C$DW$55, DW_AT_decl_line(0x7f)
     785                            .dwattr $C$DW$55, DW_AT_decl_column(0x25)
     786                    
     787                    $C$DW$56        .dwtag  DW_TAG_member
     788                            .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$49)
     789                            .dwattr $C$DW$56, DW_AT_name("MeanValue")
     790                            .dwattr $C$DW$56, DW_AT_TI_symbol_name("MeanValue")
     791                            .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
     792                            .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     793                            .dwattr $C$DW$56, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\cc
     794                            .dwattr $C$DW$56, DW_AT_decl_line(0x80)
     795                            .dwattr $C$DW$56, DW_AT_decl_column(0x25)
     796                    
     797                    $C$DW$57        .dwtag  DW_TAG_member
     798                            .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$50)
     799                            .dwattr $C$DW$57, DW_AT_name("StandDeviationValue")
     800                            .dwattr $C$DW$57, DW_AT_TI_symbol_name("StandDeviationValue")
     801                            .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
     802                            .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     803                            .dwattr $C$DW$57, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\cc
     804                            .dwattr $C$DW$57, DW_AT_decl_line(0x81)
     805                            .dwattr $C$DW$57, DW_AT_decl_column(0x25)
     806                    
     807                    $C$DW$58        .dwtag  DW_TAG_member
     808                            .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$53)
     809                            .dwattr $C$DW$58, DW_AT_name("ReservedLocation4")
     810                            .dwattr $C$DW$58, DW_AT_TI_symbol_name("ReservedLocation4")
     811                            .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
     812                            .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     813                            .dwattr $C$DW$58, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\cc
     814                            .dwattr $C$DW$58, DW_AT_decl_line(0x82)
     815                            .dwattr $C$DW$58, DW_AT_decl_column(0x25)
     816                    
     817                    $C$DW$59        .dwtag  DW_TAG_member
     818                            .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$54)
     819                            .dwattr $C$DW$59, DW_AT_name("ReservedLocation5")
     820                            .dwattr $C$DW$59, DW_AT_TI_symbol_name("ReservedLocation5")
     821                            .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:28 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{AA9CD641-63C2-49DB-BD5C-18956368E504} PAGE   16

     822                            .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     823                            .dwattr $C$DW$59, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\cc
     824                            .dwattr $C$DW$59, DW_AT_decl_line(0x83)
     825                            .dwattr $C$DW$59, DW_AT_decl_column(0x25)
     826                    
     827                    $C$DW$60        .dwtag  DW_TAG_member
     828                            .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$55)
     829                            .dwattr $C$DW$60, DW_AT_name("HFSourceSafeSwitch")
     830                            .dwattr $C$DW$60, DW_AT_TI_symbol_name("HFSourceSafeSwitch")
     831                            .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
     832                            .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     833                            .dwattr $C$DW$60, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\cc
     834                            .dwattr $C$DW$60, DW_AT_decl_line(0x84)
     835                            .dwattr $C$DW$60, DW_AT_decl_column(0x25)
     836                    
     837                    $C$DW$61        .dwtag  DW_TAG_member
     838                            .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$58)
     839                            .dwattr $C$DW$61, DW_AT_name("SelectCompAInput")
     840                            .dwattr $C$DW$61, DW_AT_TI_symbol_name("SelectCompAInput")
     841                            .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
     842                            .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     843                            .dwattr $C$DW$61, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\cc
     844                            .dwattr $C$DW$61, DW_AT_decl_line(0x85)
     845                            .dwattr $C$DW$61, DW_AT_decl_column(0x25)
     846                    
     847                    $C$DW$62        .dwtag  DW_TAG_member
     848                            .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$59)
     849                            .dwattr $C$DW$62, DW_AT_name("SelectCompARef")
     850                            .dwattr $C$DW$62, DW_AT_TI_symbol_name("SelectCompARef")
     851                            .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
     852                            .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     853                            .dwattr $C$DW$62, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\cc
     854                            .dwattr $C$DW$62, DW_AT_decl_line(0x86)
     855                            .dwattr $C$DW$62, DW_AT_decl_column(0x25)
     856                    
     857                    $C$DW$63        .dwtag  DW_TAG_member
     858                            .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$60)
     859                            .dwattr $C$DW$63, DW_AT_name("SelectADCCompBInput")
     860                            .dwattr $C$DW$63, DW_AT_TI_symbol_name("SelectADCCompBInput")
     861                            .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
     862                            .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     863                            .dwattr $C$DW$63, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\cc
     864                            .dwattr $C$DW$63, DW_AT_decl_line(0x87)
     865                            .dwattr $C$DW$63, DW_AT_decl_column(0x25)
     866                    
     867                    $C$DW$64        .dwtag  DW_TAG_member
     868                            .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$61)
     869                            .dwattr $C$DW$64, DW_AT_name("SelectCompBRef")
     870                            .dwattr $C$DW$64, DW_AT_TI_symbol_name("SelectCompBRef")
     871                            .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
     872                            .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     873                            .dwattr $C$DW$64, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\cc
     874                            .dwattr $C$DW$64, DW_AT_decl_line(0x88)
     875                            .dwattr $C$DW$64, DW_AT_decl_column(0x25)
     876                    
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:28 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{AA9CD641-63C2-49DB-BD5C-18956368E504} PAGE   17

     877                            .dwattr $C$DW$T$62, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\
     878                            .dwattr $C$DW$T$62, DW_AT_decl_line(0x75)
     879                            .dwattr $C$DW$T$62, DW_AT_decl_column(0x01)
     880                            .dwendtag $C$DW$T$62
     881                    
     882                    $C$DW$T$177     .dwtag  DW_TAG_typedef
     883                            .dwattr $C$DW$T$177, DW_AT_name("HARD_API_T")
     884                            .dwattr $C$DW$T$177, DW_AT_type(*$C$DW$T$62)
     885                            .dwattr $C$DW$T$177, DW_AT_language(DW_LANG_C)
     886                            .dwattr $C$DW$T$177, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices
     887                            .dwattr $C$DW$T$177, DW_AT_decl_line(0x89)
     888                            .dwattr $C$DW$T$177, DW_AT_decl_column(0x03)
     889                    
     890                    
     891                    $C$DW$T$63      .dwtag  DW_TAG_structure_type
     892                            .dwattr $C$DW$T$63, DW_AT_byte_size(0x08)
     893                    $C$DW$65        .dwtag  DW_TAG_member
     894                            .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$10)
     895                            .dwattr $C$DW$65, DW_AT_name("quot")
     896                            .dwattr $C$DW$65, DW_AT_TI_symbol_name("quot")
     897                            .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     898                            .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     899                            .dwattr $C$DW$65, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/st
     900                            .dwattr $C$DW$65, DW_AT_decl_line(0x5c)
     901                            .dwattr $C$DW$65, DW_AT_decl_column(0x16)
     902                    
     903                    $C$DW$66        .dwtag  DW_TAG_member
     904                            .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$10)
     905                            .dwattr $C$DW$66, DW_AT_name("rem")
     906                            .dwattr $C$DW$66, DW_AT_TI_symbol_name("rem")
     907                            .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     908                            .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     909                            .dwattr $C$DW$66, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/st
     910                            .dwattr $C$DW$66, DW_AT_decl_line(0x5c)
     911                            .dwattr $C$DW$66, DW_AT_decl_column(0x1c)
     912                    
     913                            .dwattr $C$DW$T$63, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/
     914                            .dwattr $C$DW$T$63, DW_AT_decl_line(0x5c)
     915                            .dwattr $C$DW$T$63, DW_AT_decl_column(0x10)
     916                            .dwendtag $C$DW$T$63
     917                    
     918                    $C$DW$T$178     .dwtag  DW_TAG_typedef
     919                            .dwattr $C$DW$T$178, DW_AT_name("div_t")
     920                            .dwattr $C$DW$T$178, DW_AT_type(*$C$DW$T$63)
     921                            .dwattr $C$DW$T$178, DW_AT_language(DW_LANG_C)
     922                            .dwattr $C$DW$T$178, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include
     923                            .dwattr $C$DW$T$178, DW_AT_decl_line(0x5c)
     924                            .dwattr $C$DW$T$178, DW_AT_decl_column(0x23)
     925                    
     926                    
     927                    $C$DW$T$64      .dwtag  DW_TAG_structure_type
     928                            .dwattr $C$DW$T$64, DW_AT_byte_size(0x08)
     929                    $C$DW$67        .dwtag  DW_TAG_member
     930                            .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$10)
     931                            .dwattr $C$DW$67, DW_AT_name("quot")
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:28 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{AA9CD641-63C2-49DB-BD5C-18956368E504} PAGE   18

     932                            .dwattr $C$DW$67, DW_AT_TI_symbol_name("quot")
     933                            .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     934                            .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
     935                            .dwattr $C$DW$67, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/st
     936                            .dwattr $C$DW$67, DW_AT_decl_line(0x5e)
     937                            .dwattr $C$DW$67, DW_AT_decl_column(0x16)
     938                    
     939                    $C$DW$68        .dwtag  DW_TAG_member
     940                            .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$10)
     941                            .dwattr $C$DW$68, DW_AT_name("rem")
     942                            .dwattr $C$DW$68, DW_AT_TI_symbol_name("rem")
     943                            .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     944                            .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
     945                            .dwattr $C$DW$68, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/st
     946                            .dwattr $C$DW$68, DW_AT_decl_line(0x5e)
     947                            .dwattr $C$DW$68, DW_AT_decl_column(0x1c)
     948                    
     949                            .dwattr $C$DW$T$64, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/
     950                            .dwattr $C$DW$T$64, DW_AT_decl_line(0x5e)
     951                            .dwattr $C$DW$T$64, DW_AT_decl_column(0x10)
     952                            .dwendtag $C$DW$T$64
     953                    
     954                    $C$DW$T$179     .dwtag  DW_TAG_typedef
     955                            .dwattr $C$DW$T$179, DW_AT_name("ldiv_t")
     956                            .dwattr $C$DW$T$179, DW_AT_type(*$C$DW$T$64)
     957                            .dwattr $C$DW$T$179, DW_AT_language(DW_LANG_C)
     958                            .dwattr $C$DW$T$179, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include
     959                            .dwattr $C$DW$T$179, DW_AT_decl_line(0x5e)
     960                            .dwattr $C$DW$T$179, DW_AT_decl_column(0x23)
     961                    
     962                    
     963                    $C$DW$T$65      .dwtag  DW_TAG_structure_type
     964                            .dwattr $C$DW$T$65, DW_AT_byte_size(0x10)
     965                    $C$DW$69        .dwtag  DW_TAG_member
     966                            .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$14)
     967                            .dwattr $C$DW$69, DW_AT_name("quot")
     968                            .dwattr $C$DW$69, DW_AT_TI_symbol_name("quot")
     969                            .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     970                            .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
     971                            .dwattr $C$DW$69, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/st
     972                            .dwattr $C$DW$69, DW_AT_decl_line(0x61)
     973                            .dwattr $C$DW$69, DW_AT_decl_column(0x1c)
     974                    
     975                    $C$DW$70        .dwtag  DW_TAG_member
     976                            .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$14)
     977                            .dwattr $C$DW$70, DW_AT_name("rem")
     978                            .dwattr $C$DW$70, DW_AT_TI_symbol_name("rem")
     979                            .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     980                            .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
     981                            .dwattr $C$DW$70, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/st
     982                            .dwattr $C$DW$70, DW_AT_decl_line(0x61)
     983                            .dwattr $C$DW$70, DW_AT_decl_column(0x22)
     984                    
     985                            .dwattr $C$DW$T$65, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/
     986                            .dwattr $C$DW$T$65, DW_AT_decl_line(0x61)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:28 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{AA9CD641-63C2-49DB-BD5C-18956368E504} PAGE   19

     987                            .dwattr $C$DW$T$65, DW_AT_decl_column(0x10)
     988                            .dwendtag $C$DW$T$65
     989                    
     990                    $C$DW$T$180     .dwtag  DW_TAG_typedef
     991                            .dwattr $C$DW$T$180, DW_AT_name("lldiv_t")
     992                            .dwattr $C$DW$T$180, DW_AT_type(*$C$DW$T$65)
     993                            .dwattr $C$DW$T$180, DW_AT_language(DW_LANG_C)
     994                            .dwattr $C$DW$T$180, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include
     995                            .dwattr $C$DW$T$180, DW_AT_decl_line(0x61)
     996                            .dwattr $C$DW$T$180, DW_AT_decl_column(0x29)
     997                    
     998                    
     999                    $C$DW$T$69      .dwtag  DW_TAG_structure_type
    1000                            .dwattr $C$DW$T$69, DW_AT_byte_size(0x08)
    1001                    $C$DW$71        .dwtag  DW_TAG_member
    1002                            .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$67)
    1003                            .dwattr $C$DW$71, DW_AT_name("pointerStack")
    1004                            .dwattr $C$DW$71, DW_AT_TI_symbol_name("pointerStack")
    1005                            .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1006                            .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
    1007                            .dwattr $C$DW$71, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stack
    1008                            .dwattr $C$DW$71, DW_AT_decl_line(0x3f5)
    1009                            .dwattr $C$DW$71, DW_AT_decl_column(0x16)
    1010                    
    1011                    $C$DW$72        .dwtag  DW_TAG_member
    1012                            .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$68)
    1013                            .dwattr $C$DW$72, DW_AT_name("directAPI")
    1014                            .dwattr $C$DW$72, DW_AT_TI_symbol_name("directAPI")
    1015                            .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1016                            .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
    1017                            .dwattr $C$DW$72, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stack
    1018                            .dwattr $C$DW$72, DW_AT_decl_line(0x3f6)
    1019                            .dwattr $C$DW$72, DW_AT_decl_column(0x15)
    1020                    
    1021                            .dwattr $C$DW$T$69, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154sta
    1022                            .dwattr $C$DW$T$69, DW_AT_decl_line(0x3f4)
    1023                            .dwattr $C$DW$T$69, DW_AT_decl_column(0x01)
    1024                            .dwendtag $C$DW$T$69
    1025                    
    1026                    $C$DW$T$71      .dwtag  DW_TAG_typedef
    1027                            .dwattr $C$DW$T$71, DW_AT_name("icall_directAPIMsg_t")
    1028                            .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$69)
    1029                            .dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
    1030                            .dwattr $C$DW$T$71, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154sta
    1031                            .dwattr $C$DW$T$71, DW_AT_decl_line(0x3f7)
    1032                            .dwattr $C$DW$T$71, DW_AT_decl_column(0x03)
    1033                    
    1034                    
    1035                    $C$DW$T$72      .dwtag  DW_TAG_structure_type
    1036                            .dwattr $C$DW$T$72, DW_AT_byte_size(0x14)
    1037                    $C$DW$73        .dwtag  DW_TAG_member
    1038                            .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$70)
    1039                            .dwattr $C$DW$73, DW_AT_name("hdr")
    1040                            .dwattr $C$DW$73, DW_AT_TI_symbol_name("hdr")
    1041                            .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:28 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{AA9CD641-63C2-49DB-BD5C-18956368E504} PAGE   20

    1042                            .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
    1043                            .dwattr $C$DW$73, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stack
    1044                            .dwattr $C$DW$73, DW_AT_decl_line(0x3fb)
    1045                            .dwattr $C$DW$73, DW_AT_decl_column(0x10)
    1046                    
    1047                    $C$DW$74        .dwtag  DW_TAG_member
    1048                            .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$71)
    1049                            .dwattr $C$DW$74, DW_AT_name("msg")
    1050                            .dwattr $C$DW$74, DW_AT_TI_symbol_name("msg")
    1051                            .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1052                            .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
    1053                            .dwattr $C$DW$74, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stack
    1054                            .dwattr $C$DW$74, DW_AT_decl_line(0x3fc)
    1055                            .dwattr $C$DW$74, DW_AT_decl_column(0x1a)
    1056                    
    1057                            .dwattr $C$DW$T$72, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154sta
    1058                            .dwattr $C$DW$T$72, DW_AT_decl_line(0x3fa)
    1059                            .dwattr $C$DW$T$72, DW_AT_decl_column(0x01)
    1060                            .dwendtag $C$DW$T$72
    1061                    
    1062                    $C$DW$T$181     .dwtag  DW_TAG_typedef
    1063                            .dwattr $C$DW$T$181, DW_AT_name("icallLiteMsg_t")
    1064                            .dwattr $C$DW$T$181, DW_AT_type(*$C$DW$T$72)
    1065                            .dwattr $C$DW$T$181, DW_AT_language(DW_LANG_C)
    1066                            .dwattr $C$DW$T$181, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154st
    1067                            .dwattr $C$DW$T$181, DW_AT_decl_line(0x3fd)
    1068                            .dwattr $C$DW$T$181, DW_AT_decl_column(0x03)
    1069                    
    1070                    
    1071                    $C$DW$T$76      .dwtag  DW_TAG_structure_type
    1072                            .dwattr $C$DW$T$76, DW_AT_byte_size(0x0c)
    1073                    $C$DW$75        .dwtag  DW_TAG_member
    1074                            .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$73)
    1075                            .dwattr $C$DW$75, DW_AT_name("bufferHead")
    1076                            .dwattr $C$DW$75, DW_AT_TI_symbol_name("bufferHead")
    1077                            .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1078                            .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
    1079                            .dwattr $C$DW$75, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stack
    1080                            .dwattr $C$DW$75, DW_AT_decl_line(0x80)
    1081                            .dwattr $C$DW$75, DW_AT_decl_column(0x13)
    1082                    
    1083                    $C$DW$76        .dwtag  DW_TAG_member
    1084                            .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$73)
    1085                            .dwattr $C$DW$76, DW_AT_name("bufferTail")
    1086                            .dwattr $C$DW$76, DW_AT_TI_symbol_name("bufferTail")
    1087                            .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1088                            .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1089                            .dwattr $C$DW$76, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stack
    1090                            .dwattr $C$DW$76, DW_AT_decl_line(0x81)
    1091                            .dwattr $C$DW$76, DW_AT_decl_column(0x13)
    1092                    
    1093                    $C$DW$77        .dwtag  DW_TAG_member
    1094                            .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$19)
    1095                            .dwattr $C$DW$77, DW_AT_name("maxBufSize")
    1096                            .dwattr $C$DW$77, DW_AT_TI_symbol_name("maxBufSize")
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:28 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{AA9CD641-63C2-49DB-BD5C-18956368E504} PAGE   21

    1097                            .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1098                            .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1099                            .dwattr $C$DW$77, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stack
    1100                            .dwattr $C$DW$77, DW_AT_decl_line(0x82)
    1101                            .dwattr $C$DW$77, DW_AT_decl_column(0x0a)
    1102                    
    1103                    $C$DW$78        .dwtag  DW_TAG_member
    1104                            .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$75)
    1105                            .dwattr $C$DW$78, DW_AT_name("pBuffer")
    1106                            .dwattr $C$DW$78, DW_AT_TI_symbol_name("pBuffer")
    1107                            .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1108                            .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1109                            .dwattr $C$DW$78, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stack
    1110                            .dwattr $C$DW$78, DW_AT_decl_line(0x83)
    1111                            .dwattr $C$DW$78, DW_AT_decl_column(0x0a)
    1112                    
    1113                            .dwattr $C$DW$T$76, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154sta
    1114                            .dwattr $C$DW$T$76, DW_AT_decl_line(0x7e)
    1115                            .dwattr $C$DW$T$76, DW_AT_decl_column(0x01)
    1116                            .dwendtag $C$DW$T$76
    1117                    
    1118                    $C$DW$T$78      .dwtag  DW_TAG_typedef
    1119                            .dwattr $C$DW$T$78, DW_AT_name("halUARTBufControl_t")
    1120                            .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$76)
    1121                            .dwattr $C$DW$T$78, DW_AT_language(DW_LANG_C)
    1122                            .dwattr $C$DW$T$78, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154sta
    1123                            .dwattr $C$DW$T$78, DW_AT_decl_line(0x84)
    1124                            .dwattr $C$DW$T$78, DW_AT_decl_column(0x03)
    1125                    
    1126                    
    1127                    $C$DW$T$83      .dwtag  DW_TAG_structure_type
    1128                            .dwattr $C$DW$T$83, DW_AT_byte_size(0x2c)
    1129                    $C$DW$79        .dwtag  DW_TAG_member
    1130                            .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$77)
    1131                            .dwattr $C$DW$79, DW_AT_name("configured")
    1132                            .dwattr $C$DW$79, DW_AT_TI_symbol_name("configured")
    1133                            .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1134                            .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1135                            .dwattr $C$DW$79, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stack
    1136                            .dwattr $C$DW$79, DW_AT_decl_line(0x88)
    1137                            .dwattr $C$DW$79, DW_AT_decl_column(0x17)
    1138                    
    1139                    $C$DW$80        .dwtag  DW_TAG_member
    1140                            .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$74)
    1141                            .dwattr $C$DW$80, DW_AT_name("baudRate")
    1142                            .dwattr $C$DW$80, DW_AT_TI_symbol_name("baudRate")
    1143                            .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1144                            .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1145                            .dwattr $C$DW$80, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stack
    1146                            .dwattr $C$DW$80, DW_AT_decl_line(0x89)
    1147                            .dwattr $C$DW$80, DW_AT_decl_column(0x17)
    1148                    
    1149                    $C$DW$81        .dwtag  DW_TAG_member
    1150                            .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$77)
    1151                            .dwattr $C$DW$81, DW_AT_name("flowControl")
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:28 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{AA9CD641-63C2-49DB-BD5C-18956368E504} PAGE   22

    1152                            .dwattr $C$DW$81, DW_AT_TI_symbol_name("flowControl")
    1153                            .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1154                            .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1155                            .dwattr $C$DW$81, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stack
    1156                            .dwattr $C$DW$81, DW_AT_decl_line(0x8a)
    1157                            .dwattr $C$DW$81, DW_AT_decl_column(0x17)
    1158                    
    1159                    $C$DW$82        .dwtag  DW_TAG_member
    1160                            .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$19)
    1161                            .dwattr $C$DW$82, DW_AT_name("flowControlThreshold")
    1162                            .dwattr $C$DW$82, DW_AT_TI_symbol_name("flowControlThreshold")
    1163                            .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1164                            .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1165                            .dwattr $C$DW$82, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stack
    1166                            .dwattr $C$DW$82, DW_AT_decl_line(0x8b)
    1167                            .dwattr $C$DW$82, DW_AT_decl_column(0x17)
    1168                    
    1169                    $C$DW$83        .dwtag  DW_TAG_member
    1170                            .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$74)
    1171                            .dwattr $C$DW$83, DW_AT_name("idleTimeout")
    1172                            .dwattr $C$DW$83, DW_AT_TI_symbol_name("idleTimeout")
    1173                            .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1174                            .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1175                            .dwattr $C$DW$83, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stack
    1176                            .dwattr $C$DW$83, DW_AT_decl_line(0x8c)
    1177                            .dwattr $C$DW$83, DW_AT_decl_column(0x17)
    1178                    
    1179                    $C$DW$84        .dwtag  DW_TAG_member
    1180                            .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$78)
    1181                            .dwattr $C$DW$84, DW_AT_name("rx")
    1182                            .dwattr $C$DW$84, DW_AT_TI_symbol_name("rx")
    1183                            .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1184                            .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1185                            .dwattr $C$DW$84, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stack
    1186                            .dwattr $C$DW$84, DW_AT_decl_line(0x8d)
    1187                            .dwattr $C$DW$84, DW_AT_decl_column(0x17)
    1188                    
    1189                    $C$DW$85        .dwtag  DW_TAG_member
    1190                            .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$78)
    1191                            .dwattr $C$DW$85, DW_AT_name("tx")
    1192                            .dwattr $C$DW$85, DW_AT_TI_symbol_name("tx")
    1193                            .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1194                            .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1195                            .dwattr $C$DW$85, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stack
    1196                            .dwattr $C$DW$85, DW_AT_decl_line(0x8e)
    1197                            .dwattr $C$DW$85, DW_AT_decl_column(0x17)
    1198                    
    1199                    $C$DW$86        .dwtag  DW_TAG_member
    1200                            .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$77)
    1201                            .dwattr $C$DW$86, DW_AT_name("intEnable")
    1202                            .dwattr $C$DW$86, DW_AT_TI_symbol_name("intEnable")
    1203                            .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1204                            .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1205                            .dwattr $C$DW$86, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stack
    1206                            .dwattr $C$DW$86, DW_AT_decl_line(0x8f)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:28 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{AA9CD641-63C2-49DB-BD5C-18956368E504} PAGE   23

    1207                            .dwattr $C$DW$86, DW_AT_decl_column(0x17)
    1208                    
    1209                    $C$DW$87        .dwtag  DW_TAG_member
    1210                            .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$79)
    1211                            .dwattr $C$DW$87, DW_AT_name("rxChRvdTime")
    1212                            .dwattr $C$DW$87, DW_AT_TI_symbol_name("rxChRvdTime")
    1213                            .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1214                            .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1215                            .dwattr $C$DW$87, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stack
    1216                            .dwattr $C$DW$87, DW_AT_decl_line(0x90)
    1217                            .dwattr $C$DW$87, DW_AT_decl_column(0x17)
    1218                    
    1219                    $C$DW$88        .dwtag  DW_TAG_member
    1220                            .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$82)
    1221                            .dwattr $C$DW$88, DW_AT_name("callBackFunc")
    1222                            .dwattr $C$DW$88, DW_AT_TI_symbol_name("callBackFunc")
    1223                            .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    1224                            .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1225                            .dwattr $C$DW$88, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stack
    1226                            .dwattr $C$DW$88, DW_AT_decl_line(0x91)
    1227                            .dwattr $C$DW$88, DW_AT_decl_column(0x17)
    1228                    
    1229                            .dwattr $C$DW$T$83, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154sta
    1230                            .dwattr $C$DW$T$83, DW_AT_decl_line(0x87)
    1231                            .dwattr $C$DW$T$83, DW_AT_decl_column(0x01)
    1232                            .dwendtag $C$DW$T$83
    1233                    
    1234                    $C$DW$T$182     .dwtag  DW_TAG_typedef
    1235                            .dwattr $C$DW$T$182, DW_AT_name("halUARTCfg_t")
    1236                            .dwattr $C$DW$T$182, DW_AT_type(*$C$DW$T$83)
    1237                            .dwattr $C$DW$T$182, DW_AT_language(DW_LANG_C)
    1238                            .dwattr $C$DW$T$182, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154st
    1239                            .dwattr $C$DW$T$182, DW_AT_decl_line(0x92)
    1240                            .dwattr $C$DW$T$182, DW_AT_decl_column(0x02)
    1241                    
    1242                    
    1243                    $C$DW$T$84      .dwtag  DW_TAG_structure_type
    1244                            .dwattr $C$DW$T$84, DW_AT_byte_size(0x02)
    1245                    $C$DW$89        .dwtag  DW_TAG_member
    1246                            .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$74)
    1247                            .dwattr $C$DW$89, DW_AT_name("event")
    1248                            .dwattr $C$DW$89, DW_AT_TI_symbol_name("event")
    1249                            .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1250                            .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1251                            .dwattr $C$DW$89, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MAC
    1252                            .dwattr $C$DW$89, DW_AT_decl_line(0x79)
    1253                            .dwattr $C$DW$89, DW_AT_decl_column(0x0a)
    1254                    
    1255                    $C$DW$90        .dwtag  DW_TAG_member
    1256                            .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$74)
    1257                            .dwattr $C$DW$90, DW_AT_name("status")
    1258                            .dwattr $C$DW$90, DW_AT_TI_symbol_name("status")
    1259                            .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1260                            .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1261                            .dwattr $C$DW$90, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/MAC
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:28 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{AA9CD641-63C2-49DB-BD5C-18956368E504} PAGE   24

    1262                            .dwattr $C$DW$90, DW_AT_decl_line(0x7a)
    1263                            .dwattr $C$DW$90, DW_AT_decl_column(0x0a)
    1264                    
    1265                            .dwattr $C$DW$T$84, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/M
    1266                            .dwattr $C$DW$T$84, DW_AT_decl_line(0x78)
    1267                            .dwattr $C$DW$T$84, DW_AT_decl_column(0x01)
    1268                            .dwendtag $C$DW$T$84
    1269                    
    1270                    $C$DW$T$85      .dwtag  DW_TAG_typedef
    1271                            .dwattr $C$DW$T$85, DW_AT_name("osal_event_hdr_t")
    1272                            .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$84)
    1273                            .dwattr $C$DW$T$85, DW_AT_language(DW_LANG_C)
    1274                            .dwattr $C$DW$T$85, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/M
    1275                            .dwattr $C$DW$T$85, DW_AT_decl_line(0x7b)
    1276                            .dwattr $C$DW$T$85, DW_AT_decl_column(0x03)
    1277                    
    1278                    
    1279                    $C$DW$T$86      .dwtag  DW_TAG_structure_type
    1280                            .dwattr $C$DW$T$86, DW_AT_byte_size(0x04)
    1281                    $C$DW$91        .dwtag  DW_TAG_member
    1282                            .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$85)
    1283                            .dwattr $C$DW$91, DW_AT_name("hdr")
    1284                            .dwattr $C$DW$91, DW_AT_TI_symbol_name("hdr")
    1285                            .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1286                            .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1287                            .dwattr $C$DW$91, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/examples/rtos/CC1310
    1288                            .dwattr $C$DW$91, DW_AT_decl_line(0xbc)
    1289                            .dwattr $C$DW$91, DW_AT_decl_column(0x14)
    1290                    
    1291                    $C$DW$92        .dwtag  DW_TAG_member
    1292                            .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$74)
    1293                            .dwattr $C$DW$92, DW_AT_name("state")
    1294                            .dwattr $C$DW$92, DW_AT_TI_symbol_name("state")
    1295                            .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1296                            .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1297                            .dwattr $C$DW$92, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/examples/rtos/CC1310
    1298                            .dwattr $C$DW$92, DW_AT_decl_line(0xbd)
    1299                            .dwattr $C$DW$92, DW_AT_decl_column(0x09)
    1300                    
    1301                    $C$DW$93        .dwtag  DW_TAG_member
    1302                            .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$74)
    1303                            .dwattr $C$DW$93, DW_AT_name("keys")
    1304                            .dwattr $C$DW$93, DW_AT_TI_symbol_name("keys")
    1305                            .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1306                            .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1307                            .dwattr $C$DW$93, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/examples/rtos/CC1310
    1308                            .dwattr $C$DW$93, DW_AT_decl_line(0xbe)
    1309                            .dwattr $C$DW$93, DW_AT_decl_column(0x09)
    1310                    
    1311                            .dwattr $C$DW$T$86, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/examples/rtos/CC13
    1312                            .dwattr $C$DW$T$86, DW_AT_decl_line(0xbb)
    1313                            .dwattr $C$DW$T$86, DW_AT_decl_column(0x01)
    1314                            .dwendtag $C$DW$T$86
    1315                    
    1316                    $C$DW$T$183     .dwtag  DW_TAG_typedef
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:28 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{AA9CD641-63C2-49DB-BD5C-18956368E504} PAGE   25

    1317                            .dwattr $C$DW$T$183, DW_AT_name("keyChange_t")
    1318                            .dwattr $C$DW$T$183, DW_AT_type(*$C$DW$T$86)
    1319                            .dwattr $C$DW$T$183, DW_AT_language(DW_LANG_C)
    1320                            .dwattr $C$DW$T$183, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/examples/rtos/CC1
    1321                            .dwattr $C$DW$T$183, DW_AT_decl_line(0xbf)
    1322                            .dwattr $C$DW$T$183, DW_AT_decl_column(0x03)
    1323                    
    1324                    
    1325                    $C$DW$T$91      .dwtag  DW_TAG_union_type
    1326                            .dwattr $C$DW$T$91, DW_AT_byte_size(0x02)
    1327                    $C$DW$94        .dwtag  DW_TAG_member
    1328                            .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$88)
    1329                            .dwattr $C$DW$94, DW_AT_name("entityId")
    1330                            .dwattr $C$DW$94, DW_AT_TI_symbol_name("entityId")
    1331                            .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1332                            .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1333                            .dwattr $C$DW$94, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stack
    1334                            .dwattr $C$DW$94, DW_AT_decl_line(0x1fe)
    1335                            .dwattr $C$DW$94, DW_AT_decl_column(0x14)
    1336                    
    1337                    $C$DW$95        .dwtag  DW_TAG_member
    1338                            .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$90)
    1339                            .dwattr $C$DW$95, DW_AT_name("servId")
    1340                            .dwattr $C$DW$95, DW_AT_TI_symbol_name("servId")
    1341                            .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1342                            .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1343                            .dwattr $C$DW$95, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stack
    1344                            .dwattr $C$DW$95, DW_AT_decl_line(0x200)
    1345                            .dwattr $C$DW$95, DW_AT_decl_column(0x17)
    1346                    
    1347                            .dwattr $C$DW$T$91, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154sta
    1348                            .dwattr $C$DW$T$91, DW_AT_decl_line(0x1fc)
    1349                            .dwattr $C$DW$T$91, DW_AT_decl_column(0x03)
    1350                            .dwendtag $C$DW$T$91
    1351                    
    1352                    
    1353                    $C$DW$T$92      .dwtag  DW_TAG_union_type
    1354                            .dwattr $C$DW$T$92, DW_AT_byte_size(0x02)
    1355                    $C$DW$96        .dwtag  DW_TAG_member
    1356                            .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$90)
    1357                            .dwattr $C$DW$96, DW_AT_name("servId")
    1358                            .dwattr $C$DW$96, DW_AT_TI_symbol_name("servId")
    1359                            .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1360                            .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1361                            .dwattr $C$DW$96, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stack
    1362                            .dwattr $C$DW$96, DW_AT_decl_line(0x211)
    1363                            .dwattr $C$DW$96, DW_AT_decl_column(0x17)
    1364                    
    1365                    $C$DW$97        .dwtag  DW_TAG_member
    1366                            .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$88)
    1367                            .dwattr $C$DW$97, DW_AT_name("entityId")
    1368                            .dwattr $C$DW$97, DW_AT_TI_symbol_name("entityId")
    1369                            .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1370                            .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1371                            .dwattr $C$DW$97, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stack
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:28 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{AA9CD641-63C2-49DB-BD5C-18956368E504} PAGE   26

    1372                            .dwattr $C$DW$97, DW_AT_decl_line(0x213)
    1373                            .dwattr $C$DW$97, DW_AT_decl_column(0x14)
    1374                    
    1375                            .dwattr $C$DW$T$92, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154sta
    1376                            .dwattr $C$DW$T$92, DW_AT_decl_line(0x20f)
    1377                            .dwattr $C$DW$T$92, DW_AT_decl_column(0x03)
    1378                            .dwendtag $C$DW$T$92
    1379                    
    1380                    
    1381                    $C$DW$T$93      .dwtag  DW_TAG_union_type
    1382                            .dwattr $C$DW$T$93, DW_AT_byte_size(0x02)
    1383                    $C$DW$98        .dwtag  DW_TAG_member
    1384                            .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$77)
    1385                            .dwattr $C$DW$98, DW_AT_name("paramCTS")
    1386                            .dwattr $C$DW$98, DW_AT_TI_symbol_name("paramCTS")
    1387                            .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1388                            .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1389                            .dwattr $C$DW$98, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stack
    1390                            .dwattr $C$DW$98, DW_AT_decl_line(0x96)
    1391                            .dwattr $C$DW$98, DW_AT_decl_column(0x08)
    1392                    
    1393                    $C$DW$99        .dwtag  DW_TAG_member
    1394                            .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$77)
    1395                            .dwattr $C$DW$99, DW_AT_name("paramRTS")
    1396                            .dwattr $C$DW$99, DW_AT_TI_symbol_name("paramRTS")
    1397                            .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1398                            .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1399                            .dwattr $C$DW$99, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stack
    1400                            .dwattr $C$DW$99, DW_AT_decl_line(0x97)
    1401                            .dwattr $C$DW$99, DW_AT_decl_column(0x08)
    1402                    
    1403                    $C$DW$100       .dwtag  DW_TAG_member
    1404                            .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$77)
    1405                            .dwattr $C$DW$100, DW_AT_name("paramDSR")
    1406                            .dwattr $C$DW$100, DW_AT_TI_symbol_name("paramDSR")
    1407                            .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1408                            .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1409                            .dwattr $C$DW$100, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    1410                            .dwattr $C$DW$100, DW_AT_decl_line(0x98)
    1411                            .dwattr $C$DW$100, DW_AT_decl_column(0x08)
    1412                    
    1413                    $C$DW$101       .dwtag  DW_TAG_member
    1414                            .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$77)
    1415                            .dwattr $C$DW$101, DW_AT_name("paramDTR")
    1416                            .dwattr $C$DW$101, DW_AT_TI_symbol_name("paramDTR")
    1417                            .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1418                            .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1419                            .dwattr $C$DW$101, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    1420                            .dwattr $C$DW$101, DW_AT_decl_line(0x99)
    1421                            .dwattr $C$DW$101, DW_AT_decl_column(0x08)
    1422                    
    1423                    $C$DW$102       .dwtag  DW_TAG_member
    1424                            .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$77)
    1425                            .dwattr $C$DW$102, DW_AT_name("paramCD")
    1426                            .dwattr $C$DW$102, DW_AT_TI_symbol_name("paramCD")
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:28 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{AA9CD641-63C2-49DB-BD5C-18956368E504} PAGE   27

    1427                            .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1428                            .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1429                            .dwattr $C$DW$102, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    1430                            .dwattr $C$DW$102, DW_AT_decl_line(0x9a)
    1431                            .dwattr $C$DW$102, DW_AT_decl_column(0x08)
    1432                    
    1433                    $C$DW$103       .dwtag  DW_TAG_member
    1434                            .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$77)
    1435                            .dwattr $C$DW$103, DW_AT_name("paramRI")
    1436                            .dwattr $C$DW$103, DW_AT_TI_symbol_name("paramRI")
    1437                            .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1438                            .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1439                            .dwattr $C$DW$103, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    1440                            .dwattr $C$DW$103, DW_AT_decl_line(0x9b)
    1441                            .dwattr $C$DW$103, DW_AT_decl_column(0x08)
    1442                    
    1443                    $C$DW$104       .dwtag  DW_TAG_member
    1444                            .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$19)
    1445                            .dwattr $C$DW$104, DW_AT_name("baudRate")
    1446                            .dwattr $C$DW$104, DW_AT_TI_symbol_name("baudRate")
    1447                            .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1448                            .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1449                            .dwattr $C$DW$104, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    1450                            .dwattr $C$DW$104, DW_AT_decl_line(0x9c)
    1451                            .dwattr $C$DW$104, DW_AT_decl_column(0x0a)
    1452                    
    1453                    $C$DW$105       .dwtag  DW_TAG_member
    1454                            .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$77)
    1455                            .dwattr $C$DW$105, DW_AT_name("flowControl")
    1456                            .dwattr $C$DW$105, DW_AT_TI_symbol_name("flowControl")
    1457                            .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1458                            .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1459                            .dwattr $C$DW$105, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    1460                            .dwattr $C$DW$105, DW_AT_decl_line(0x9d)
    1461                            .dwattr $C$DW$105, DW_AT_decl_column(0x08)
    1462                    
    1463                    $C$DW$106       .dwtag  DW_TAG_member
    1464                            .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$77)
    1465                            .dwattr $C$DW$106, DW_AT_name("flushControl")
    1466                            .dwattr $C$DW$106, DW_AT_TI_symbol_name("flushControl")
    1467                            .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1468                            .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1469                            .dwattr $C$DW$106, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    1470                            .dwattr $C$DW$106, DW_AT_decl_line(0x9e)
    1471                            .dwattr $C$DW$106, DW_AT_decl_column(0x08)
    1472                    
    1473                            .dwattr $C$DW$T$93, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154sta
    1474                            .dwattr $C$DW$T$93, DW_AT_decl_line(0x95)
    1475                            .dwattr $C$DW$T$93, DW_AT_decl_column(0x01)
    1476                            .dwendtag $C$DW$T$93
    1477                    
    1478                    $C$DW$T$184     .dwtag  DW_TAG_typedef
    1479                            .dwattr $C$DW$T$184, DW_AT_name("halUARTIoctl_t")
    1480                            .dwattr $C$DW$T$184, DW_AT_type(*$C$DW$T$93)
    1481                            .dwattr $C$DW$T$184, DW_AT_language(DW_LANG_C)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:28 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{AA9CD641-63C2-49DB-BD5C-18956368E504} PAGE   28

    1482                            .dwattr $C$DW$T$184, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154st
    1483                            .dwattr $C$DW$T$184, DW_AT_decl_line(0x9f)
    1484                            .dwattr $C$DW$T$184, DW_AT_decl_column(0x02)
    1485                    
    1486                    
    1487                    $C$DW$T$94      .dwtag  DW_TAG_structure_type
    1488                            .dwattr $C$DW$T$94, DW_AT_name(".ggroup1")
    1489                            .dwattr $C$DW$T$94, DW_AT_byte_size(0x04)
    1490                    $C$DW$107       .dwtag  DW_TAG_member
    1491                            .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$6)
    1492                            .dwattr $C$DW$107, DW_AT_name("pwrmgr_initialized")
    1493                            .dwattr $C$DW$107, DW_AT_TI_symbol_name("pwrmgr_initialized")
    1494                            .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1495                            .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1496                    
    1497                    $C$DW$108       .dwtag  DW_TAG_member
    1498                            .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$20)
    1499                            .dwattr $C$DW$108, DW_AT_name("pwrmgr_attribute")
    1500                            .dwattr $C$DW$108, DW_AT_TI_symbol_name("pwrmgr_attribute")
    1501                            .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1502                            .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1503                    
    1504                            .dwendtag $C$DW$T$94
    1505                    
    1506                    
    1507                    $C$DW$T$95      .dwtag  DW_TAG_structure_type
    1508                            .dwattr $C$DW$T$95, DW_AT_name("_ICall_LiteCmdStatus_")
    1509                            .dwattr $C$DW$T$95, DW_AT_byte_size(0x01)
    1510                    $C$DW$109       .dwtag  DW_TAG_member
    1511                            .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$87)
    1512                            .dwattr $C$DW$109, DW_AT_name("cmdId")
    1513                            .dwattr $C$DW$109, DW_AT_TI_symbol_name("cmdId")
    1514                            .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1515                            .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1516                            .dwattr $C$DW$109, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    1517                            .dwattr $C$DW$109, DW_AT_decl_line(0x3f0)
    1518                            .dwattr $C$DW$109, DW_AT_decl_column(0x11)
    1519                    
    1520                            .dwattr $C$DW$T$95, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154sta
    1521                            .dwattr $C$DW$T$95, DW_AT_decl_line(0x3ee)
    1522                            .dwattr $C$DW$T$95, DW_AT_decl_column(0x10)
    1523                            .dwendtag $C$DW$T$95
    1524                    
    1525                    $C$DW$T$186     .dwtag  DW_TAG_typedef
    1526                            .dwattr $C$DW$T$186, DW_AT_name("ICall_LiteCmdStatus")
    1527                            .dwattr $C$DW$T$186, DW_AT_type(*$C$DW$T$95)
    1528                            .dwattr $C$DW$T$186, DW_AT_language(DW_LANG_C)
    1529                            .dwattr $C$DW$T$186, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154st
    1530                            .dwattr $C$DW$T$186, DW_AT_decl_line(0x3f1)
    1531                            .dwattr $C$DW$T$186, DW_AT_decl_column(0x03)
    1532                    
    1533                    $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    1534                            .dwattr $C$DW$T$2, DW_AT_name("void")
    1535                    
    1536                    $C$DW$T$3       .dwtag  DW_TAG_pointer_type
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:28 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{AA9CD641-63C2-49DB-BD5C-18956368E504} PAGE   29

    1537                            .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
    1538                            .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
    1539                    
    1540                    $C$DW$T$187     .dwtag  DW_TAG_typedef
    1541                            .dwattr $C$DW$T$187, DW_AT_name("ICall_Semaphore")
    1542                            .dwattr $C$DW$T$187, DW_AT_type(*$C$DW$T$3)
    1543                            .dwattr $C$DW$T$187, DW_AT_language(DW_LANG_C)
    1544                            .dwattr $C$DW$T$187, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154st
    1545                            .dwattr $C$DW$T$187, DW_AT_decl_line(0x1ac)
    1546                            .dwattr $C$DW$T$187, DW_AT_decl_column(0x0f)
    1547                    
    1548                    $C$DW$T$109     .dwtag  DW_TAG_typedef
    1549                            .dwattr $C$DW$T$109, DW_AT_name("ICall_SyncHandle")
    1550                            .dwattr $C$DW$T$109, DW_AT_type(*$C$DW$T$3)
    1551                            .dwattr $C$DW$T$109, DW_AT_language(DW_LANG_C)
    1552                            .dwattr $C$DW$T$109, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154st
    1553                            .dwattr $C$DW$T$109, DW_AT_decl_line(0x1aa)
    1554                            .dwattr $C$DW$T$109, DW_AT_decl_column(0x0f)
    1555                    
    1556                    $C$DW$T$153     .dwtag  DW_TAG_typedef
    1557                            .dwattr $C$DW$T$153, DW_AT_name("ICall_TimerID")
    1558                            .dwattr $C$DW$T$153, DW_AT_type(*$C$DW$T$3)
    1559                            .dwattr $C$DW$T$153, DW_AT_language(DW_LANG_C)
    1560                            .dwattr $C$DW$T$153, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154st
    1561                            .dwattr $C$DW$T$153, DW_AT_decl_line(0x1b7)
    1562                            .dwattr $C$DW$T$153, DW_AT_decl_column(0x0f)
    1563                    
    1564                    $C$DW$T$188     .dwtag  DW_TAG_typedef
    1565                            .dwattr $C$DW$T$188, DW_AT_name("osal_msg_q_t")
    1566                            .dwattr $C$DW$T$188, DW_AT_type(*$C$DW$T$3)
    1567                            .dwattr $C$DW$T$188, DW_AT_language(DW_LANG_C)
    1568                            .dwattr $C$DW$T$188, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/sensor_cc1310lp/Application/
    1569                            .dwattr $C$DW$T$188, DW_AT_decl_line(0x7d)
    1570                            .dwattr $C$DW$T$188, DW_AT_decl_column(0x10)
    1571                    
    1572                    
    1573                    $C$DW$T$36      .dwtag  DW_TAG_subroutine_type
    1574                            .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
    1575                            .dwendtag $C$DW$T$36
    1576                    
    1577                    $C$DW$T$37      .dwtag  DW_TAG_pointer_type
    1578                            .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$36)
    1579                            .dwattr $C$DW$T$37, DW_AT_address_class(0x20)
    1580                    
    1581                    $C$DW$T$169     .dwtag  DW_TAG_typedef
    1582                            .dwattr $C$DW$T$169, DW_AT_name("APPASRTINTF_callAssrtHndler")
    1583                            .dwattr $C$DW$T$169, DW_AT_type(*$C$DW$T$37)
    1584                            .dwattr $C$DW$T$169, DW_AT_language(DW_LANG_C)
    1585                            .dwattr $C$DW$T$169, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154st
    1586                            .dwattr $C$DW$T$169, DW_AT_decl_line(0x43)
    1587                            .dwattr $C$DW$T$169, DW_AT_decl_column(0x10)
    1588                    
    1589                    $C$DW$T$55      .dwtag  DW_TAG_typedef
    1590                            .dwattr $C$DW$T$55, DW_AT_name("FPTR_HFSOURCESAFESWITCH_T")
    1591                            .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$37)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:28 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{AA9CD641-63C2-49DB-BD5C-18956368E504} PAGE   30

    1592                            .dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C)
    1593                            .dwattr $C$DW$T$55, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\
    1594                            .dwattr $C$DW$T$55, DW_AT_decl_line(0x5f)
    1595                            .dwattr $C$DW$T$55, DW_AT_decl_column(0x19)
    1596                    
    1597                    $C$DW$T$38      .dwtag  DW_TAG_typedef
    1598                            .dwattr $C$DW$T$38, DW_AT_name("FPTR_RESETDEV_T")
    1599                            .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$37)
    1600                            .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    1601                            .dwattr $C$DW$T$38, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\
    1602                            .dwattr $C$DW$T$38, DW_AT_decl_line(0x4d)
    1603                            .dwattr $C$DW$T$38, DW_AT_decl_column(0x19)
    1604                    
    1605                    $C$DW$T$189     .dwtag  DW_TAG_typedef
    1606                            .dwattr $C$DW$T$189, DW_AT_name("FPTR_VOID_VOID_T")
    1607                            .dwattr $C$DW$T$189, DW_AT_type(*$C$DW$T$37)
    1608                            .dwattr $C$DW$T$189, DW_AT_language(DW_LANG_C)
    1609                            .dwattr $C$DW$T$189, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices
    1610                            .dwattr $C$DW$T$189, DW_AT_decl_line(0x33)
    1611                            .dwattr $C$DW$T$189, DW_AT_decl_column(0x11)
    1612                    
    1613                    $C$DW$T$190     .dwtag  DW_TAG_typedef
    1614                            .dwattr $C$DW$T$190, DW_AT_name("__TI_atexit_fn")
    1615                            .dwattr $C$DW$T$190, DW_AT_type(*$C$DW$T$37)
    1616                            .dwattr $C$DW$T$190, DW_AT_language(DW_LANG_C)
    1617                            .dwattr $C$DW$T$190, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include
    1618                            .dwattr $C$DW$T$190, DW_AT_decl_line(0xb9)
    1619                            .dwattr $C$DW$T$190, DW_AT_decl_column(0x14)
    1620                    
    1621                    
    1622                    $C$DW$T$51      .dwtag  DW_TAG_subroutine_type
    1623                            .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
    1624                    $C$DW$110       .dwtag  DW_TAG_formal_parameter
    1625                            .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$21)
    1626                    
    1627                            .dwendtag $C$DW$T$51
    1628                    
    1629                    $C$DW$T$52      .dwtag  DW_TAG_pointer_type
    1630                            .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$51)
    1631                            .dwattr $C$DW$T$52, DW_AT_address_class(0x20)
    1632                    
    1633                    $C$DW$T$53      .dwtag  DW_TAG_typedef
    1634                            .dwattr $C$DW$T$53, DW_AT_name("FPTR_RESERVED4_T")
    1635                            .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$52)
    1636                            .dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
    1637                            .dwattr $C$DW$T$53, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\
    1638                            .dwattr $C$DW$T$53, DW_AT_decl_line(0x61)
    1639                            .dwattr $C$DW$T$53, DW_AT_decl_column(0x19)
    1640                    
    1641                    $C$DW$T$54      .dwtag  DW_TAG_typedef
    1642                            .dwattr $C$DW$T$54, DW_AT_name("FPTR_RESERVED5_T")
    1643                            .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$52)
    1644                            .dwattr $C$DW$T$54, DW_AT_language(DW_LANG_C)
    1645                            .dwattr $C$DW$T$54, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\
    1646                            .dwattr $C$DW$T$54, DW_AT_decl_line(0x63)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:28 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{AA9CD641-63C2-49DB-BD5C-18956368E504} PAGE   31

    1647                            .dwattr $C$DW$T$54, DW_AT_decl_column(0x19)
    1648                    
    1649                    
    1650                    $C$DW$T$56      .dwtag  DW_TAG_subroutine_type
    1651                            .dwattr $C$DW$T$56, DW_AT_language(DW_LANG_C)
    1652                    $C$DW$111       .dwtag  DW_TAG_formal_parameter
    1653                            .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$22)
    1654                    
    1655                            .dwendtag $C$DW$T$56
    1656                    
    1657                    $C$DW$T$57      .dwtag  DW_TAG_pointer_type
    1658                            .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$56)
    1659                            .dwattr $C$DW$T$57, DW_AT_address_class(0x20)
    1660                    
    1661                    $C$DW$T$60      .dwtag  DW_TAG_typedef
    1662                            .dwattr $C$DW$T$60, DW_AT_name("FPTR_ADCCOMPBIN_T")
    1663                            .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$57)
    1664                            .dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
    1665                            .dwattr $C$DW$T$60, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\
    1666                            .dwattr $C$DW$T$60, DW_AT_decl_line(0x69)
    1667                            .dwattr $C$DW$T$60, DW_AT_decl_column(0x19)
    1668                    
    1669                    $C$DW$T$58      .dwtag  DW_TAG_typedef
    1670                            .dwattr $C$DW$T$58, DW_AT_name("FPTR_COMPAIN_T")
    1671                            .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$57)
    1672                            .dwattr $C$DW$T$58, DW_AT_language(DW_LANG_C)
    1673                            .dwattr $C$DW$T$58, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\
    1674                            .dwattr $C$DW$T$58, DW_AT_decl_line(0x65)
    1675                            .dwattr $C$DW$T$58, DW_AT_decl_column(0x19)
    1676                    
    1677                    $C$DW$T$59      .dwtag  DW_TAG_typedef
    1678                            .dwattr $C$DW$T$59, DW_AT_name("FPTR_COMPAREF_T")
    1679                            .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$57)
    1680                            .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
    1681                            .dwattr $C$DW$T$59, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\
    1682                            .dwattr $C$DW$T$59, DW_AT_decl_line(0x67)
    1683                            .dwattr $C$DW$T$59, DW_AT_decl_column(0x19)
    1684                    
    1685                    $C$DW$T$61      .dwtag  DW_TAG_typedef
    1686                            .dwattr $C$DW$T$61, DW_AT_name("FPTR_COMPBREF_T")
    1687                            .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$57)
    1688                            .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
    1689                            .dwattr $C$DW$T$61, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\
    1690                            .dwattr $C$DW$T$61, DW_AT_decl_line(0x6b)
    1691                            .dwattr $C$DW$T$61, DW_AT_decl_column(0x19)
    1692                    
    1693                    $C$DW$T$191     .dwtag  DW_TAG_typedef
    1694                            .dwattr $C$DW$T$191, DW_AT_name("FPTR_VOID_UINT8_T")
    1695                            .dwattr $C$DW$T$191, DW_AT_type(*$C$DW$T$57)
    1696                            .dwattr $C$DW$T$191, DW_AT_language(DW_LANG_C)
    1697                            .dwattr $C$DW$T$191, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices
    1698                            .dwattr $C$DW$T$191, DW_AT_decl_line(0x34)
    1699                            .dwattr $C$DW$T$191, DW_AT_decl_column(0x11)
    1700                    
    1701                    
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:28 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{AA9CD641-63C2-49DB-BD5C-18956368E504} PAGE   32

    1702                    $C$DW$T$80      .dwtag  DW_TAG_subroutine_type
    1703                            .dwattr $C$DW$T$80, DW_AT_language(DW_LANG_C)
    1704                    $C$DW$112       .dwtag  DW_TAG_formal_parameter
    1705                            .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$74)
    1706                    
    1707                    $C$DW$113       .dwtag  DW_TAG_formal_parameter
    1708                            .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$74)
    1709                    
    1710                            .dwendtag $C$DW$T$80
    1711                    
    1712                    $C$DW$T$81      .dwtag  DW_TAG_pointer_type
    1713                            .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$80)
    1714                            .dwattr $C$DW$T$81, DW_AT_address_class(0x20)
    1715                    
    1716                    $C$DW$T$192     .dwtag  DW_TAG_typedef
    1717                            .dwattr $C$DW$T$192, DW_AT_name("assertCback_t")
    1718                            .dwattr $C$DW$T$192, DW_AT_type(*$C$DW$T$81)
    1719                            .dwattr $C$DW$T$192, DW_AT_language(DW_LANG_C)
    1720                            .dwattr $C$DW$T$192, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154st
    1721                            .dwattr $C$DW$T$192, DW_AT_decl_line(0xd3)
    1722                            .dwattr $C$DW$T$192, DW_AT_decl_column(0x10)
    1723                    
    1724                    $C$DW$T$82      .dwtag  DW_TAG_typedef
    1725                            .dwattr $C$DW$T$82, DW_AT_name("halUARTCBack_t")
    1726                            .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$81)
    1727                            .dwattr $C$DW$T$82, DW_AT_language(DW_LANG_C)
    1728                            .dwattr $C$DW$T$82, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154sta
    1729                            .dwattr $C$DW$T$82, DW_AT_decl_line(0x7b)
    1730                            .dwattr $C$DW$T$82, DW_AT_decl_column(0x10)
    1731                    
    1732                    
    1733                    $C$DW$T$99      .dwtag  DW_TAG_subroutine_type
    1734                            .dwattr $C$DW$T$99, DW_AT_language(DW_LANG_C)
    1735                    $C$DW$114       .dwtag  DW_TAG_formal_parameter
    1736                            .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$97)
    1737                    
    1738                            .dwendtag $C$DW$T$99
    1739                    
    1740                    $C$DW$T$100     .dwtag  DW_TAG_pointer_type
    1741                            .dwattr $C$DW$T$100, DW_AT_type(*$C$DW$T$99)
    1742                            .dwattr $C$DW$T$100, DW_AT_address_class(0x20)
    1743                    
    1744                    
    1745                    $C$DW$T$131     .dwtag  DW_TAG_subroutine_type
    1746                            .dwattr $C$DW$T$131, DW_AT_language(DW_LANG_C)
    1747                    $C$DW$115       .dwtag  DW_TAG_formal_parameter
    1748                            .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$129)
    1749                    
    1750                    $C$DW$116       .dwtag  DW_TAG_formal_parameter
    1751                            .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$130)
    1752                    
    1753                            .dwendtag $C$DW$T$131
    1754                    
    1755                    $C$DW$T$132     .dwtag  DW_TAG_pointer_type
    1756                            .dwattr $C$DW$T$132, DW_AT_type(*$C$DW$T$131)
TI ARM Assembler PC v16.9.4 Sat Nov 18 18:46:28 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{AA9CD641-63C2-49DB-BD5C-18956368E504} PAGE   33

    1757                            .dwattr $C$DW$T$132, DW_AT_address_class(0x20)
    1758                    
    1759                    $C$DW$T$133     .dwtag  DW_TAG_typedef
    1760                            .dwattr $C$DW$T$133, DW_AT_name("ICall_PwrNotifyFn")
    1761                            .dwattr $C$DW$T$133, DW_AT_type(*$C$DW$T$132)
    1762                            .dwattr $C$DW$T$133, DW_AT_language(DW_LANG_C)
    1763                            .dwattr $C$DW$T$133, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154st
    1764                            .dwattr $C$DW$T$133, DW_AT_decl_line(0x333)
    1765                            .dwattr $C$DW$T$133, DW_AT_decl_column(0x10)
    1766                    
    1767                    
    1768                    $C$DW$T$147     .dwtag  DW_TAG_subroutine_type
    1769                            .dwattr $C$DW$T$147, DW_AT_language(DW_LANG_C)
    1770                    $C$DW$117       .dwtag  DW_TAG_formal_parameter
    1771                            .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$143)
    1772                    
    1773                            .dwendtag $C$DW$T$147
    1774                    
    1775                    $C$DW$T$148     .dwtag  DW_TAG_pointer_type
    1776                            .dwattr $C$DW$T$148, DW_AT_type(*$C$DW$T$147)
    1777                            .dwattr $C$DW$T$148, DW_AT_address_class(0x20)
    1778                    
    1779                    $C$DW$T$149     .dwtag  DW_TAG_typedef
    1780                            .dwattr $C$DW$T$149, DW_AT_name("ICall_LeaveCS")
    1781                            .dwattr $C$DW$T$149, DW_AT_type(*$C$DW$T$148)
    1782                            .dwattr $C$DW$T$149, DW_AT_language(DW_LANG_C)
    1783                            .dwattr $C$DW$T$149, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154st
    1784                            .dwattr $C$DW$T$149, DW_AT_decl_line(0x37e)
    1785                            .dwattr $C$DW$T$149, DW_AT_decl_column(0x10)
    1786                    
    1787                    
    1788                    $C$DW$T$154     .dwtag  DW_TAG_subroutine_type
    1789                            .dwattr $C$DW$T$154, DW_AT_language(DW_LANG_C)
    1790                    $C$DW$118       .dwtag  DW_TAG_formal_parameter
    1791                            .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$3)
    1792                    
    1793                            .dwendtag $C$DW$T$154
    1794                    
    1795                    $C$DW$T$155     .dwtag  DW_TAG_pointer_type
    1796                            .dwattr $C$DW$T$155, DW_AT_type(*$C$DW$T$154)
    1797                            .dwattr $C$DW$T$155, DW_AT_address_class(0x20)
    1798                    
